[{"movie_id": 667538, "review_id": "647ef55f93828e01337941c7", "rating": null, "review_text": "Transformers is the best movie of the franchise ! \r\n\r\nTransformers took everything that worked with Bumblebee . Anthony Ramos and Dominique fishback did a great performance and pete Davinson as mirage stole the show , but the true star is the adsolute best soundtrack of the 90' . I am happy to say that transformers is a lot of fun , the cgi looks pretty good . When I first watched this movie a lot of people were clapping and they laughed a lot . In conclusion , this new transformers movie is the beginning of something much bigger ! Cant wait to see what paramount has in store for us . 9.5/10", "created_at": "2023-06-06T08:59:11.390Z"}, {"movie_id": 667538, "review_id": "647f42bacf4b8b014190d724", "rating": null, "review_text": "The latest in the long-running and popular Transformer series has arrived with “Transformers: Rise of the Beasts”.  Taking a cue from the recent “Bumblebee” movie,  the movie cleverly serves not only as a prequel but as a platform to introduce a series of stories leading up to the original films.\r\n\r\nIt is learned that a planet-destroying evil is fixated on obtaining a key that will allow it to travel to any point in the universe to continue its reign of destruction. The animal-based Maximals are able to escape with the key and hide it on Earth where they will also remain in secret as guardians.\r\n\r\nFlash forward to 1994 when Noah Diaz (Anthony Ramos), following his stint in the Army is looking to find gainful employment to help his mother as well as his ailing brother.  Despite being a wizard with electronics Noah is not considered to be a team player which has hampered his job prospects and leads him to consider criminal activities in an effort to obtain much-needed funds for his brother's medical bills.\r\n\r\nIn a moment of desperation, Noah attempts to steal a loaded Porsche but finds he is unable to follow through on the act as it is against his moral compass.  Unknown to Noah the car is actually an Autobot named Mirage (Pete Davidson), who soon enlists Noah to help them find the key which they have recently detected.\r\n\r\nThis does not sit well with Optimus Prime (Peter Cullen), who believes that humanity will only act in your best interests and that his crew needs to find the key so that they can return to their war-ravaged, Cybertron.\r\n\r\nIt is learned that a crafty but perpetually overlooked museum intern named Elena (Dominique Fishback), has accidentally activated the key and in doing so has allowed the evil Scourge (Peter Dinklage), and his minions to zero in on its location as he attempts to obtain the key for his master and is willing to destroy all were in his way.\r\n\r\nNoah and Elena soon find themselves paired with their unexpected allies as they race to stop the evil from obtaining both parts of the key and find themselves with some unexpected allies in the form of the Maximals.\r\n\r\nWhat follows is a frantic action-adventure film that cleverly combines humor, action, dazzling visual effects, and a tail that is part Indiana Jones, and Transformers with a surprising amount of humanity.\r\n\r\nIt would be easy for the human cast the overshadowed by the massive and visually spectacular creations that frequently transform and battle it out across numerous action sequences.  However, director Steven Caple Jr. takes advantage of his young talent both of whom are clearly potential stars in the making as they provide a grounding humanity to the film which makes it more than a lavish FX showcase.\r\n\r\nThe film also has an impressive era-specific soundtrack and a scene near the end that offers up some intriguing and exciting possibilities for the future. \"Transformers: Rise of the Beasts\" is a highly enjoyable summer action adventure as well as one the more enjoyable films in the franchise and should delight fans of the franchise and has me for the first time in a long time eagerly awaiting what comes next.\r\n\r\n4 stars out of 5", "created_at": "2023-06-06T14:29:14.555Z"}, {"movie_id": 667538, "review_id": "64832fbde375c000c526e9ad", "rating": 2.0, "review_text": "_Transformers: Rise of the Beasts_ is a pointless entry in the live-action _Transformers_ film franchise. The Beasts Wars characters are forgettable, the attempts at humor are excruciatingly lame, Optimus Prime is a huge jerk, and the action is trash. If you were exhausted with the _Transformers_ franchise before, then _Rise of the Beasts_ will have you flatlining and succumbing to sheer and utter boredom.\r\n\r\n**Full review:** https://bit.ly/robotjerks", "created_at": "2023-06-09T13:57:17.518Z"}, {"movie_id": 667538, "review_id": "6483ffebe375c000e24f07ae", "rating": 6.0, "review_text": "You know what - this is my favourite \"Transformers\" movie. Now that's not really saying much, most of them are pretty poor, but somehow the shamelessly derivative nature of this just made it more entertaining. It all starts with \"Optimus Primal\" (aka. \"Kingus Kongus\") having a fight with the all-consuming \"Unicron\" (narked because a typo robbed him of his chance to just be an horse with an horn) for a key that can open portals between worlds enabling the baddie to quite literally eat them and move on. The solution to that battle is a bit of a compromise and scoot forward hundreds of year and New Yorker \"Noah\" (Anthony Ramos) has a problem. His younger brother \"Kris\" (Dean Scott Vasquez) is very poorly and they cannot afford his medical bills. \"Noah\" turns to crime and that's where he encounters the newly invigorated \"Autobots\" who have realised that \"Elena\" (Dominique Fishback) - a researcher in a museum - has rediscovered the hidden key. They have to retrieve it before it falls into more malevolent hands. Soon the two hapless humans and their robots are engaged in a battle royal that sees the museum pretty much trashed before they head to Peru where they encounter the \"Maximals\" and the beautiful Inca terraces are soon for the chop too. So far I reckon we've been through loads of episodes of \"Stargate\" as well \"King Kong\" (probably the Peter Jackson one), \"The Goblet of Fire\"; \"Independence Day\", \"Star Trek\" (JJ Abrams version), all four \"Indiana Jones\" films - which, to be fair are even acknowledged in the script, and the armoured eagle \"Airazor\" reminded me of a hairier version of \"Bubo\" from \"Clash of the Titans\". The visuals are excellent and for the most part it's got plenty of action but as we near the ever-so-predictable denouement the pace slackens off and cheesy sentiment brings the thing to a grinding halt a couple of times! There's no jeopardy at all, really, and given that \"Optimus Prime\" - maybe he ought to be called \"Hopeless Prime\" because he is pretty useless in a fight - gets to make his grand speech at the end, I'm sure there will be more for our intrepid young \"Noah\" to come. Big screen essential - this will look bland and repetitive on the telly. Maybe it'll help sell some toys?", "created_at": "2023-06-10T04:45:32.012Z"}, {"movie_id": 667538, "review_id": "6484c1c6c9dbf9011dfc0884", "rating": 10.0, "review_text": "**Just incredible**, Tstrong texthe Autobots are amazing **full of action.**", "created_at": "2023-06-10T18:32:38.699Z"}, {"movie_id": 667538, "review_id": "64b47c4623d278010731160d", "rating": 7.0, "review_text": "**Transformers: Rise of the Beasts rescues the franchise from the all-out goofy mess it had become and gives it a fun and promising new beginning.**\r\n\r\nTransformers: Rise of the Beasts recaptures some of the fun and charm of Bumblebee and the early Transformers films and blends it with the aesthetics and nostalgia of the old 80s cartoon. Rise of the Beasts establishes some decent human leads that aren’t annoying while keeping the focus on the robot conflict. The voice cast was fantastic! Peter Cullen as Optimus Prime will always be the greatest of all time. Peter Dinklage’s Scourge sounds and looks vicious. Ron Perlman, Michelle Yeoh, Pete Davidson, and Cristo Fernández provide solid performances, giving their characters a little fun and even some heart. Rise of the Beasts reels the franchise back in from the outrageous goofiness of the Wahlberg entries but still has a good time recognizing its primary audience is kids and parents who grew up on the cartoon. The intensity and pacing of the first 2 acts are superb! The final act gets a little cheesy and starts to feel generic, but it is no worse than the climax of recent Marvel films. Rise of the Beasts isn’t perfect but it sets the Transformers back on the right path.", "created_at": "2023-07-16T23:24:54.990Z"}, {"movie_id": 667538, "review_id": "65633c857dfda6593174f838", "rating": 6.0, "review_text": "Quite a while since I watched the last Transformers movie. About five years. I cannot say that I had really high expectations for this one. A Transformers movie is a movie you watch almost entirely for the special effects after all.\r\n\r\nIt is an okayish movie but I have to say that I was less impressed with this one than with the previous ones.\r\n\r\nIt is clearly a movie directed to a somewhat younger audience. Still at times it was a bit cringeworthy. Especially the small “speeches” from Optimus Prime. I know it is a PG-13 movie but I think Hollywood underestimates the intelligence of young adults. But then, given the political bias Hollywood has these days maybe it is not surprising that they expect below average intelligence.\r\n\r\nStill, there were some cool special effects, a lot of Transformer fights and such like stuff making the movie not feel like a complete waste of time.\r\n\r\nThe story is of course on the thin side and the title of the movie is misleading hyperbole. Yes, the beast Transformers are introduced but I would hardly call it “rise” . Just a few more Transformers stranded on Earth.\r\n\r\nOne thing I didn’t much like was the appearance of Optimus Prime. He looked like a has-been bum with his shabby truck and shabby appearance when not in his truck mode. Optimus Primal was much more cool.\r\n\r\nAs I wrote, overall a watchable movie but nothing really to write home about.\r\n\r\nOh, by they way. Remember that useless woke far left tomato site? On the page for the movie the “critical consensus” says “Thanks to some genuine human drama between the set pieces and palpable affection for the title characters, Transformers: Rise of the Beasts is one of the franchise’s more enjoyable outings.” and then they put a rotten tomato side by side and claims the movie is rotten. They cannot even get their own bullshit straight .", "created_at": "2023-11-26T12:39:33.806Z"}]