[{"movie_id": 823452, "review_id": "65a6565c97a4e601254f6f65", "rating": 7.0, "review_text": "Living out of a dilapidated old car on a piece of waste ground in a suburb of Seattle, Joe Rantz (Callum Turner) travels each day to the University of Washington where he studies engineering. Using newspapers to stop-up the holes in his boots, we learn quickly that he's pretty poverty stricken and when told he has to fund the second half of his semester, is facing quite a challenge. Luckily, his pal Roger Morris (Sam Strike) discovers that getting a spot on the rowing team would get them both a job and a bed. To the try-outs they go, but they don't expect virtually everyone else to be there too! A tough series of rigorous training exercises ensue and thanks to a developing relationship with boat-builder George Pocock (Peter Guinness) he actually begins to want this. It's not just about the job anymore - it's about pride in achievement. The fact that it also impresses Joyce Simdars (Hadley Robinson) as well is no bad thing, so under the guidance of head coach Al Ulbrickson (Joel Edgerton) the team is selected and must attempt to break some recent ducks to ensure it's continued funding and to, maybe, get a place at the forthcoming Berlin Olympiad. I first saw Turner in \"Glue\" (2014) and thought he had potential as a decent looking and quite proficient actor who seems to play the more reticent and shy character effectively. Here he works well as a man with a mission. Edgerton is also on good-form as the inspirational teacher but the star of the show for me, though, is their feisty and shrewd little cox Bobby Moch (Luke Slattery) who rather summed up the whole ethos of the all-for-one team spirit. The photography and general look of the film is engaging, as is the Alexandre Desplat score and George Clooney allows Turner et al to deliver a story of strong characters in the face of tough circumstances naturally and sympathetically. Not too sure Adolf was too impressed at the end!", "created_at": "2024-01-16T10:11:40.618Z"}]