[{"movie_id": 300983, "review_id": "5502fdb3c3a3685b9e004341", "rating": 7.0, "review_text": "Rounding out his cop trilogy that began with Kaakha Kaakha and Vettaiyaadu Vilayaadu, Gautham Vasudev Menon gives us yet another chapter from yet another cop's life, although this is more a character study of a cop than just one episode from his life. When his father is shot dead by a gangster, a teenaged Sathyadev (Ajith) yearns for revenge. But, should he cross the line between good and bad? Sathyadev chooses the good side and becomes a cop. He eliminates a most wanted gangster, Matthew ( Stunt Silva), by befriending one of his henchmen, Victor (Arun Vijay). A few years later, Sathyadev is attracted to Hemanika ( Trisha), a single mother and a dancer. But when Hemanika is murdered on the eve of their wedding, Sathyadev goes on a cross-country sojourn with her six-year-old daughter Esha ( Anikha). But, five years later, situations force him to put on his cop shoes after he stumbles upon an illegal organ harvesting group that is being led by a ghost from his past — Victor. The gang's next target is Thenmozhi ( Anushka), an intrepid young woman, and Sathyadev decides to protect her at all cost. \r\n\r\nEveryone has a moment in their lives when they have to choose what they want to become and in Yennai Arindhaal, both the protagonist and antagonist get such a moment. While Sathyadev chooses to be on the right side, loses people close to him of his choice and still manages to vanquish evil, Victor refuses to cross the line that separates the bad from the good. The director underscores this element in a crucial scene where Sathyadev and Victor speak to each other over a phone. Gautham splits the screen so that we see Sathyadev on one side and Victor on the other with a fine line separating these two characters. And, suddenly, an earlier scene where Sathyadev is deciding on what to become — a cop or a gangster — feels all the more important. He would have turned into another Victor if he had chosen the latter! Not surprisingly, Moondru Mugam, a film about a fearless cop and his two sons who grow up into contrasting characters, is playing on a TV screen during this scene. \r\n\r\nThe romance segments of the film seem to be other versions of the romantic tracks we saw in Kaakha Kaakha (a bold young woman attracted to an enigmatic cop) and Vettaiyaadu Vilayaadu (middle-aged cop falling in love with a single mom). That is not to say they aren't interesting. Gautham is one filmmaker who knows how to write female characters and here, Thenmozhi and Hemanika are well-rounded characters. He, in fact, begins the film with Thenmozhi's life, just to tell us what kind of woman she is, rather than begin it with her first encounter with Sathyadev. And with Hemanika, he brings out the doubts that a divorced young woman with a child would have when she is courted by a decent man. \r\n\r\nBut the film does seem less punchy than Kaakha Kaakha and Vettaiyaadu Vilayaadu; it falls a bit short when it comes to matching the emotional undercurrent in the former and the detective thriller beats in the latter. The thriller elements, especially, are subdued, mainly because the director is focused more on the character study aspect and so, the first half feels less exciting. A sub-plot involving another gangster only increases the running time without adding much to the plot. But once Victor enters Sathyadev's life, Gautham changes gears and we get the cop thriller that we were expecting. Arun Vijay, despite sharing certain resemblances with Gautham's villains from the other films, manages to be effective in this role. Though, the role of Victor's wife ( Parvathy Nair) is underwritten and we are baffled when he puts himself at risk for him in the climax. \r\n\r\nUltimately, the film belongs to Ajith and the star is in such fine form here. Playing a character that gives him the chance to be someone his age, here, he turns on the charms when he is with the heroines and taps into the coolly aggressive and self-possessed persona that we saw in Mankatha and Billa. And, Gautham and cinematographer Dan Macarthur superbly capture the star's charisma and swagger (the actor sports four to five distinct looks throughout the film) that we cannot look at anyone else when he is on screen.", "created_at": "2015-03-13T15:09:39.685Z"}]