[{"movie_id": 44009, "review_id": "62d62e5c435abd0050cdd473", "rating": 7.0, "review_text": "**It's not an easy film, it won't please everyone, but it presents a good story and excellent actors in another very well executed dramatic exercise.**\r\n\r\nThis movie is about an elderly couple, who live a peaceful and happy life. They don't have anything that makes them special, they could be our parents or grandparents. They simply have a stable and quiet life, without any fuss and solidly founded on a past of companionship built on a happy marriage. Perhaps for this reason, they end up being a kind of “shelter” for friends and family in a more distressing situation.\r\n\r\nAfter seeing the film, I got the feeling that addiction is a theme very present in the narrative: if we look closely, the characters who approach this peaceful couple are, quite evidently, consumed by their own addictions, building over them several fears and paranoia. Alcohol abuse, sedentary lifestyle, vanity, are bad habits that they carry and that dominate them, despite the efforts of the friendly couple to support them, and the way the anguished characters manage to capture our sympathy. The script works well with all of this, and although the film takes a while to get there, it really grabs our attention and manages to hold us intelligently, with high doses of realism giving it all a bonus of welcome credibility.\r\n\r\nJim Broadbent and Ruth Sheen deserve praise for the way they gave themselves to their characters and gave them body, shape, voice and personality. The two actors are veterans and have already given solid proof of their quality, but the way they presented themselves here is impeccable and really pleasant. I also liked the performance of Oliver Maltman and Lesley Manville, who give life to two other characters of great importance in the story.\r\n\r\nAs with a series of other dramas that focus on the relationship between characters, the film is strongly committed to the creation of a solid script, good dialogues and a strong, quality cast. Technical issues were left in the background, but they are guided by discretion and functionality that borders on pragmatism. The movie is a little slow, but I have an idea that this was intentional.", "created_at": "2022-07-19T04:09:00.177Z"}]