[{"movie_id": 82675, "review_id": "5142a0de19c29552e10f7994", "rating": 7.5, "review_text": "Taken 2 was... Not as good as the first one. Yes, I am sad to say it is not as good but on the other hand the story is still sound and the action is better and faster then before. Liam Neeson plays his role excellently while some on the other cast members didn't preform as well. All in all a good movie but there are some little problems, but worth seeing any way.", "created_at": "2013-03-15T04:17:34.219Z"}, {"movie_id": 82675, "review_id": "5161178919c2956a0e0780de", "rating": 6.0, "review_text": "I enjoyed this movie as a no-brainer action/thriller flick. Sure, it has a bunch of illogical and idiotic elements in but I have seen a lot worse. The movie certainly do not deserve the ridiculously low ratings that some people have given it.\r\n\r\nIt is perhaps not as good as the first movie, mostly due to the silly bits and pieces, but as a plain vanilla action/thriller it is certainly passable. I generally do like Liam Neeson. I did like him in the first Taken movie and I do like him in this one. The other actors with the possible exception of his wife and daughter are mostly there to fill up the scenes.\r\n\r\nAfter a semi-dull beginning which is pretty much just setting up a reason for them all being in Istanbul, Bryan and his wife is, surprise, surprise, taken and that is pretty much when the action starts and from there on it is pretty much action all the way.\r\n\r\nAs have been mentioned, there are a lot of stupid things happening in the movie. Dropping grenades in the middle of Istanbul seemingly without anyone really reacting for instance. Bryan’s daughter have failed to take a drivers licence in the states several times but still, when thrown into a car with a manual gear stick, she handles the car like a stunt driver. Then we have a violin player that sits in the same spot all the time? Not to mention crashing into the embassy while being fired upon by the embassy marine guards and then they can just sit there in the wrecked car, in front of the embassy, while Bryan calls for help from some guy playing golf in the states.\r\n\r\nIt is clear that the Luc Besson didn’t really put realism very high on his agenda for this movie. But then this wouldn’t be the first time for him. Overlook the silliness and you have a decent enough action/thriller flick. At least I enjoyed it and I am normally not too forgiving when it comes to stupid and unrealistic stuff in movies.", "created_at": "2013-04-07T06:51:53.259Z"}, {"movie_id": 82675, "review_id": "5c8cd9ce92514144a79e3ae6", "rating": 5.0, "review_text": "The _Die Hard 3_ of the _Taken_ franchise, except like... Nowhere near as good. Serviceable, but a step down from the first film, and even that one was pretty overrated.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-03-16T11:11:10.364Z"}]