[{"movie_id": 28355, "review_id": "53b49d850e0a2676c40002ef", "rating": 6.0, "review_text": "Keep Away From Children.\r\n\r\nCase 39 is directed by Christian Alvart and written by Ray Wright. It stars Renee Zellwegger, Jodelle Ferland, Ian McShane and Bradley Cooper. Music is by Michl Britsch and cinematography by Hagen Bodanski.\r\n\r\nAnother in the long line of demonic/psycho children films, Case 39 sat on the shelf for a few years before finally seeing the light of day around 2009. Met with a whole bunch of negative reviews it is somewhat pleasing to find that while it’s not a misunderstood classic or anything, it actually works well within this sub-genre of horror.\r\n\r\nStory in short order form has Zellwegger as Emily Jenkins, a social worker who after rescuing young Lilly Sullivan from crazed parents, takes her in on a temporary foster basis and soon comes to regret it.\r\n\r\nOffering up a more supernatural slant than many other films of a similar ilk, German director Alvart does still follow the familiar formula for crazed child movies. Lillith (unsubtle name or what?!) serenely ingratiates herself into Emily’s world and that of the people around her, then of course things start happening, bad things. Having taken his time to build it up during the first half, Alvart then revels in unleashing demonic chaos, with young Ferland giving an unnervingly superb performance as Lilly. The shocks and psychological torments are tidily crafted, and it all builds to a suitably daft and frenetic finale.\r\n\r\nIt’s too long at nearly two hours in length, it’s sometimes silly and it’s cliché heavy. However, some striking scenes, a mightily strong child performance and the decent chiller thriller fun factor, lifts this just above average status. 6/10", "created_at": "2014-07-03T00:02:13.430Z"}, {"movie_id": 28355, "review_id": "581cfae9c3a36859230001e0", "rating": 7.0, "review_text": "**Just do your job! Don't think above that like you can be a saviour!**\r\n\r\nIt looked like some kind of thriller, that's what anybody would say if they read the title correctly. The story was suspense, well developed to keep that for a very long time. Though it had no major twist, just a revelation like clarifying our doubts. Because most of the storyline seems alike 'Orphan', the film that came just months before this one. But this is a horror theme, I mean real horror, not a terror-horror like 'Orphan'. The overall story relied on one big secret that revealed at some time in the final act.\r\n\r\nI have seen many films about the child abuse, and this one set in as a same kind of theme, but takes a turn during the end of the first act. So when a social worker, Emily, finds a ten year old Lilith was abused by her own parents, she takes her away from them, followed by theirs arrest. Later, Emily adopts Lilith, but soon finds some strange events around her circle. That leads to suspect Lilith, but could not prove anything. Finding the truth becomes her first priority, but how she's going to solve it is what leads us to the conclusion part.\r\n\r\nI haven't seen Renee Zellweger in any recent films, she looked so good in this. Jodelle Ferland too was good as a little girl, the most important role in the film. But Bradley Cooper was in a small part. I think it was a decent film, but not a fresh theme, except developed differently with a new cast. If you are a big horror film fan, you might disappoint with it. Because those parts were minimised and the suspense was maximised. Yet surely most of us can easily predict many scenes, event the ending. So I conclude my review saying it is a decent watch.\r\n\r\n_6.5/10_", "created_at": "2016-11-04T21:17:29.937Z"}]