[{"movie_id": 576845, "review_id": "617f0f22e74146002b68c937", "rating": 7.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/last-night-in-soho-spoiler-free-review\r\n\r\n\"Last Night in Soho is incredibly captivating throughout the entire runtime, but Edgar Wright's all-in in the insane third act is definitely going to generate a divisive response.\r\n\r\nStory-wise, the compelling protagonists - brilliantly interpreted by Thomasin McKenzie and Anya Taylor-Joy - follow intriguing arcs holding unexpected revelations that ultimately make sense with the overall narrative. Stunning cinematography and production design come together to create a visually jaw-dropping 1960s London, which becomes an even more entertaining place to visit due to Steve Price's addictive music.\r\n\r\nHowever, the last act feels a sudden hurry to tie every knot through overwhelming editing, hasty pacing, and careless transitions, which work against what the film had been until that point.\r\n\r\nI commend Wright's commitment and extreme dedication to his vision, but the restraint shown previously should have also been part of the conclusion.\"\r\n\r\nRating: B+", "created_at": "2021-10-31T21:48:18.287Z"}, {"movie_id": 576845, "review_id": "61eb0f15a0b6b5001cfb705a", "rating": 7.0, "review_text": "Not a big fan of Edgar Wright compared to some (fine filmmaker but don't get excited when a project of his is announced; and to be fair, same really goes for Christopher Nolan as well lately), but this one does feature some good 1960s-era music and the performances from both Thomasin McKenzie and Anya Taylor-Joy (whom I am a big fan of) were great and some fun mind-twisting scenery and visuals, though in the end felt it was fine as whole. Worthy of a watch, though. **3.5/5**", "created_at": "2022-01-21T19:52:53.298Z"}, {"movie_id": 576845, "review_id": "62b0bb126beaea0061b54f77", "rating": 2.0, "review_text": "Full review: <a>https://www.tinakakadelis.com/beyond-the-cinerama-dome/2021/12/28/for-a-dollar-name-a-woman-last-night-in-soho-review<a>\r\n\r\nThe plot follows shy, ‘60s-aesthetic-loving Eloise (Thomasin McKenzie) as she leaves her small country home and heads to the big city of London to attend fashion school. After one bad night in the dorm, she decides to move into a room offered for rent by an older woman, Miss Collins (the late, great Diana Rigg). On her first night in the new room, Eloise dreams of Soho in the fabulous ’60s through the eyes of aspiring lounge singer Sandie (Anya Taylor-Joy). That first dream, in which a wide-eyed Eloise watches the confident Sandie secure an audition from Jack (Matt Smith), is a true marvel. The swapping between Eloise in her pajamas and Sandie in her flowy go-go dress as they twirl with Jack is a beautiful technical and choreographic achievement. The flawless re-creation of the flashy lights and neon signs of Soho in the ’60s deserves immense praise. Presented on its own, that first dream sequence is a delight.", "created_at": "2022-06-20T18:23:14.499Z"}, {"movie_id": 576845, "review_id": "62c4f0f5f5f1c5005a1a70e0", "rating": 9.0, "review_text": "I found that Last Night in Soho took its sweet time getting me hooked, but as the first act was coming to a close, I was locked in. The movie constantly had me thinking what was to come next, trying to decipher what was the connection between the main characters were and why this was happening. There were scenes in this film that really had me on the edge of my seat, and I have not had that experience in a long time. I did not know much coming into the film, so I expected Anya Taylor-Joy to be the lead, but I was pleasantly surprised at the power performance that Thomasin McKenzie delivered. She really displayed the full range of emotion, showing shades of a shy timid and unsure girl to being a powerful and confident mistress of the night. But not only did these dueling personalities take center stage, but her ability to capture the horror and terror her visions continued to bring on. It was an amazing and I will definitely be tuning in to more of her films. I found the plot to be very good, on the surface it is somewhat simplistic, but it is delivered very well with each piece of the puzzle slowly being hand delivered by Edgar Wright. But by the third act, the twists are predictable, and the ending does not deliver as much as I would have liked. \r\n\r\n**Verdict:** _Excellent_", "created_at": "2022-07-06T02:18:29.022Z"}, {"movie_id": 576845, "review_id": "63097b2bdcb6a30083593463", "rating": 5.0, "review_text": "**Last Night in Soho seemed like a terrifying innovative horror flick but didn’t deliver.**\r\n\r\nLast Night in Soho promised a completely original fresh new horror film from the brilliant mind of Edgar Wright. The trailers were unnerving, tense, and scary, but unfortunately, that was where the horror stayed. The sequences set in the past were interesting and well done but as the murder mystery began to unfurl, so did the movie. The twists weren’t satisfying, and the terror didn’t measure up to its promise. The creativity of Last Night in Soho had so much potential but fell short.", "created_at": "2022-08-27T02:02:19.649Z"}, {"movie_id": 576845, "review_id": "630eaa18ed2ac200827e6685", "rating": 8.0, "review_text": "Edgar Wright's most recent film is... very good!\r\n\r\nI don't love (but still like) the ending as much as the rest of it, though <em>'Last Night in Soho'</em> is an extremely enjoyable psychological horror flick. The film's aesthetic is top notch, while the performances of Thomasin McKenzie and Anya Taylor-Joy are brilliant; the way their story is portrayed is real nice. Diana Rigg, Matt Smith and Terence Stamp are involved too.\r\n\r\nI do have a few lesser things to mention. The fashion college classmates being hella cartoony is one, though the only main one is the end reveal... it kinda underwhelmed me, even if there's nothing inherently wrong with it. As it happened I was just like  \"well, OK...\". I think I expected greater based on what precedes. It's a 'good' conclusion, still.\r\n\r\nAll in all, it just falls short of being something I'd consider as 'great' but I still had a positive time with it and would happily revisit it. As for its standing in my Edgar Wright ranking, it's top three... though, to be honest, all of his movies - <em>'A Fistful of Fingers'</em> aside - are good.", "created_at": "2022-08-31T00:23:52.385Z"}, {"movie_id": 576845, "review_id": "64138a65b4224200f79226a9", "rating": 8.0, "review_text": "Edgar Wright takes the audience on a journey back and forth from present day to the swinging sixties in this wonderful psychological thriller. Due to Eloise’s ( Thomasin McKenzie )  upbringing by her grandmother ( Rita Tushingham ) she is obsessed with the 1960’s fashion and music. After being accepted onto a fashion course at a leading London college, Eloise moves into student accommodation and shares a room with another girl on the same course. Unfortunately the two girls are polar opposites and Eloise quickly relocates to a bedsit on Goodge Street in the heart of London. The landlady Miss Collins ( Diana Rigg ) welcomes her to the property with the house rules that include no male visitors. From this position in the heart of London Eloise manages to secure a part time job and has easy access to vintage dress shops and local landmarks. \r\n\r\nHowever from early on we are shown that Eloise has a form of psychic gift or illness that allows her to see and communicate with her dead mother. This affliction becomes even more stronger once Eloise has settled into the bedsit. After she retires to bed Eloise is almost immediately transported back in time to sixties London and becomes a character called Alex who changes her name to Sandy. Sandy ( Anna Taylor-Joy ) has also just arrived in London looking for fame. A talented singer, blonde,  beautiful and full of confidence, Sandy transports Eloise to the nightclub scene of Swinging London where she encounters sixties star Cilla Black performing in front of an audience. Jack ( Matt Smith ) a handsome, playboy talent manager spots Sandy and the two quickly form a relationship. However as the evening draws to a close and Sandy and Jack passionately embrace, Eloise is abruptly awoken by her alarm and is back in her own bed. Initially what was perceived as just a dream becomes more unnerving when it is pointed out to Eloise at college that she has a love bite on her neck. Each evening Eloise is transported back in time as both observer of Sandy and Sandy herself. As Eloise becomes more obsessed with sixties London  and the fun loving Sandy, Eloise in the present day, begins to change her look and style to copy that of Sandy. The toxic relationship of Sandy and Jack intensifies as Eloise discovers Jack wasn't a talent agent but only looking to recruit another girl into prostitution. As the seedier and more dark side of Soho London in the 1960’s begins to emerge, Eloise finds herself embroiled in a nightmare that threatens both her sanity and life.\r\n\r\nAnna Taylor-Joy is outstanding especially during the audition and earlier nightclub scenes. The soundtrack is littered with 1960’s classic hits and as Eloise’s mental state deteriorates and her actions become more erratic the music perfectly reflects action on screen. There is a very satisfying conclusion that allows the late Diana Rigg to shine and she gives a strong and extremely memorable performance as the sinister landlady.\r\n\r\nIn conclusion “Last Night In Soho” is a very satisfying and enjoyable horror, thriller that until the final chapter has the audience guessing what is real and was is not and who is the actual antagonist.", "created_at": "2023-03-16T21:30:13.857Z"}, {"movie_id": 576845, "review_id": "6484d962d2b209012dfcafcb", "rating": 10.0, "review_text": "If you like the 1960s Mod culture and music, and maybe Soho in particular, as well as morality tale horror elements, great dialogue, unique and interesting characters, ghosts, seamless editing, and beautiful inner city photography--or maybe just one of these elements--then you'll love this foray into the mind of a 21st century girl who idolizes everything 1960s, even to the point of designing clothes that harp back to the era of Petula Clark, Sean Connery, the Kray Twins and their ilk, and everything else that made up that portion of the Post-War Dream. Great effort by all and fantastic payoff. More from this director, please.", "created_at": "2023-06-10T20:13:22.499Z"}]