[{"movie_id": 3021, "review_id": "58c21af2c3a36842de002d50", "rating": 6.0, "review_text": "Dolphin Sandwich.\r\n\r\n1408 is based on one of horror writer Stephen King's short stories. It stars John Cusack as a supernatural investigator who rents room 1408 at The Hotel Dolphin in New York. It is said to be a most haunted room and the scene of many deaths. He soon finds his scepticism tested to the max.\r\n\r\nAlthough it has deep themes of grief et al, this essentially boils down to one man in a room being plagued by psychological and physical attacks, with the intended chills and shocks surreal in presentation. It's all very twisty and big on conundrums, which makes a second viewing something of a necessity, whilst Cusack's performance is also reason to check in for another viewing. However, it's not the scary movie some have lauded it as, in fact it's more fun-house palaver than anything terrifying, but there's no doubting the intelligence and skill of the writing. The mind is a curious, wonderful and troubling thing, and 1408 wants us to know it. 6/10", "created_at": "2017-03-10T03:18:10.471Z"}, {"movie_id": 3021, "review_id": "5f349d0b111da10034643f02", "rating": 8.0, "review_text": "Great watch, would watch again, and can recommend.\r\n\r\nWhile the setup is a little bleh, it serves a point, but I could literal start the movie at Samuel L. Jackson's office and be fine.\r\n\r\nOnce in 1408, the intensity creeps perfectly.  It really gives you the atmosphere of a cat playing with its food.\r\n\r\nIt'll mess your head a little, but that's just from a great John Cusack delivery and wonderful cinematic display.\r\n\r\nAnd the ending is almost perfect: the are two minors points that could be bad, but they're unclear.\r\n\r\nAs the manager said, \"It's and evil room.", "created_at": "2020-08-13T01:53:15.564Z"}, {"movie_id": 3021, "review_id": "64e3810ed7cd0600af8460c5", "rating": 6.0, "review_text": "The storyline and basis of the movie is kind of dumb. It is entertaining though with a lot of weird and crazy stuff happening in room 1408.", "created_at": "2023-08-21T15:21:50.290Z"}]