[{"movie_id": 752, "review_id": "59fe19afc3a36868930253da", "rating": 9.0, "review_text": "With the litany of comic book films being made in 2017, it's hard to understand the role V for Vendetta has played in 'Comic Book Movie' culture. This was one of the early successes of the genre and it continues to shine today in ways other movies (I'm looking at you, Marvel) have not. \r\n\r\nThe grittiness of the story cannot be understated, this story is DARK. However, the message of the story is one of hope, and hope is a difficult thing to capture. This film captures both, with the help of excellent cinematography and slow-motion action cuts.\r\n\r\n I get the sense when I watch this film that something bigger is happening around me, and honestly in 2017, this movie feels more relevant than ever. Themes of state-run media empires, government corruption of the highest order, and the suffocation of all that is 'other' permeates the fabric of this film, and everything is captured beautifully in a noir-esque nightmarescape of future, facist London.\r\n\r\nI can honestly say that more than a decade later, this film still shines as one of the great comic book movies and its themes will continue to ring true as long as we have people in the world who exist to limit others. Let's just hope that someday this world does not feel any more real than it does now.", "created_at": "2017-11-04T19:49:03.711Z"}, {"movie_id": 752, "review_id": "5f9b323f4c1d9a003865db19", "rating": 7.0, "review_text": "V for Vendetta movie isn't a movie I really ever loved when I first saw it back in 2006 and again I think when it came out on DVD or Blu-ray some years ago, and after re-viewing this time... I pretty much feel the same way. It features some good performances from Hugo Weaving (commendable since it was almost completely behind a mask) and Natalie Portman. However, it is a bit heavy handed and too on the nose (perhaps that is in keeping with the graphic novel), and I didn't really have an emotional connection with the characters or story. There's also nothing that really stands out from scene to scene. **3.5/5**", "created_at": "2020-10-29T21:21:03.593Z"}]