[{"movie_id": 4771, "review_id": "5c220ad992514167fdc2f08d", "rating": 8.0, "review_text": "Do you know people in the neighborhood who don't talk to the police?\r\n\r\nGone Baby Gone is directed by Ben Affleck and Affleck co-adapts the screenplay with Aaron Stockard from the novel of the same name written by Dennis Lehane. It stars Casey Affleck, Michelle Monaghan, Ed Harris, Morgan Freeman, John Ashton and Amy Ryan. Music is by Harry Gregson Williams and cinematography by John Toll.\r\n\r\nPrivate Investigators Patrick Kenzie (Affleck) and Angie Gennaro (Monaghan) are hired to find missing child Amanda McCready (Madeline O'Brien). It appears to be a simple case of a kidnapping, but the deeper the investigators go the darker the truths become.\r\n\r\nA potent drama, Gone Baby Gone offers up a mystery that is propelled by moral murkiness. Unsurprisingly given it's from a Lehane novel, the twists and deep characterisations dovetail seamlessly with the very real feel of a Boston neighbourhood, the sense of place and community superbly marshalled by Ben Affleck (in what was his debut as a director). The story is so strong it makes us the viewers part of the search for missing Amanda, which in turn forces us to answer the ethical quandaries thrust upon Patrick Kenzie.\r\n\r\nWith tech credits firmly in the plus column and the director un-showy and assured enough to keep the key third act from dragging the picture down, this proves to be very good film making. Pic only has minor faults to be bothered by. Monaghan is a fine actress but she is hard to take here in a street wise role, though with a nicely cast Casey Affleck dominating their scenes she gets away with it. The sharp of mind should pick up on what is driving the mystery forward, whilst the ambiguity at resolution point can go either way for respective viewers appreciation or otherwise. But this is all told a rewarding piece of adult cinema and recommended for sure. 8/10", "created_at": "2018-12-25T10:47:53.260Z"}, {"movie_id": 4771, "review_id": "6300189f1c6aa700825f82e0", "rating": 7.0, "review_text": "**Overall : A well-done mystery thriller with a melancholy tone that never lets up and ultimately leaves the viewer a little more sad than satisfied.**\r\n\r\nBen Affleck's debut as a director was a decent start. Gone Baby Gone is a crime thriller with significant surprises and twists. The excellent cast and performances accentuated the emotional toll of working on a kidnapping case, and that emotional weight saturates every aspect of the film. Unfortunately, that heavy tone makes the movie a little challenging to enjoy. The dismal and somber mood throughout left me just feeling sad at the end. That poignant hopeless nature was clearly the goal and was well executed but keeps it from being a traditionally \"enjoyable\" film.", "created_at": "2022-08-19T23:11:27.430Z"}, {"movie_id": 4771, "review_id": "646e1cd59661fc011d95991f", "rating": 7.0, "review_text": "Private detectives \"Patrick\" (Casey Affleck) and \"Angie\" (Michelle Monaghan) are drafted in by the mother of a missing girl to try to find out what's happened. This is pretty much virgin territory for the pair, but they are local and so might be able to unearth sources unwilling to discuss with the police efforts being led by \"Doyle\" (Morgan Freeman). Now it's fair to say that the child's mother \"Helene\" (Amy Ryan) is probably not the most attentive of parents, but she is determined to be reunited with her daughter. What now ensues follows this investigation into their Boston suburb - one that takes them into contact with crooks, drug dealers and an whole fraternity of dangerous hoodlums. Their searching does, however, start to bear fruit - and not a kind of fruit that they really want to discover. The plot thickens and twists and evidence of just who did what and, as importantly, why emerges that causes quite a moral dilemma for the pair. There is a strong dynamic here between the very much on-form partnership of Affleck and Monaghan and the former's brother (Ben) directs this film with consistent pace and a plausible degree of menace. Serendipity takes just too much of an hand in the ending for my liking, but it's still a compelling and thought provoking story that ends up by asking us all a question - the answer to which is not necessarily straightforward. Freeman really only features sparingly, but there are solid supporting contributions from Ed Harris and, to a lesser extent, from Titus Welliver that all help deliver a taut and intriguing drama that is well worth a watch.", "created_at": "2023-05-24T14:19:01.275Z"}]