[{"movie_id": 2239, "review_id": "55de80ecc3a3686e82000bf6", "rating": 8.0, "review_text": "After momentarily veering off course with a misguide adaptation of Patrick McGrath's eerie neo-gothic novel Asylum, Scottish director David Mackenzie is back on track, making good on the promise he initially showed with such dark, acclaimed features as THE LAST GREAT WILDERNESS and the award-winning YOUNG ADAM.\r\nExpert at lock picking and proficient at peering into other people's windows, 17-year-old Hallam Foe (Jamie Bell) is a young Scot who can't get past the drowning death of his suicidal mother in the loch on the sprawling family estate. Dad (Ciaran Hinds) has since married his former secretary, Verity (Claire Forlani), whom Hallam hates and he takes no pains to hide his feelings. After his sister, Lucy (Lucy Holt), relocates to Australia, Hallam holes himself up in his tree house where he spends hours under a blow-up portrait of his late mother, contemplating whether or not Verity might have actually been responsible for his mother's death. When Verity confronts him with the private notes books in which he records not only his voyeuristic escapades around the village but his own self-digusted lust for Verity herself, Hallam explodes. Hallam accuses her of murdering his mother, then attempts to strangle her. They then have sex on the tree-house floor. Figuring now is as good a time as any to finally leave home, Hallam runs off to Edinburgh where he spots Kate (Sophia Myles), a young woman who bears a striking resemblance to his mother. Bewitched, he follows her to the landmark Balmoral Hotel where she works, then begs his way into a job as a kitchen porter just to be near to her. When he follows her home after work, he realizes he can see into her bedroom window from the Balmoral's famous clock tower. There he sets up post, watching Kate during her most private moments as he falls in love..\r\nBased on the cult novel Hallam Foe by Peter Jinks, Mackenzie's film walks a very fine line between charming and downright creepy: There's no getting around the fact that Hallam has a few serious problems, compulsive voyeurism being the most troubling. But rather than underplay what makes this unusual character so compelling, Mackenzie leaves Hallam Foe has he found him, and Giles Nuttgens (ASYLUM, YOUNG ADAM and Deepa Mehta's gorgeous WATER) films it all in high style. Bell is excellent, the settings are spectacular and the right Scottish soundtrack features songs by Franz Ferdinand, Orange Juice and The Pastels.", "created_at": "2015-08-27T03:15:56.161Z"}]