[{"movie_id": 375588, "review_id": "5d2f1cc5caab6d5d9897d93a", "rating": 4.0, "review_text": "I just feel kinda bad for everyone involved. It was clear that whatever was supposed to happen, was **tried** at. Very hard. But it did not work.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2019-07-17T13:04:05.219Z"}, {"movie_id": 375588, "review_id": "6131d8aacede69002a101870", "rating": 3.0, "review_text": "Meh. This is a big budget film that fails big at retelling a tale that's been told so many times before.\r\n\r\nAfter many aborted starts, I have watched this movie twice within the past year. I didn't watch it multiple times because it was enjoyable and I wanted to experience it again. I watched it twice because it was so unmemorable that I didn't remember that I'd already seen it. Or maybe it was such an awful experience that my mind blocked it from my memories.\r\n\r\nThe most memorable line in the film comes as Marian discovers that Robin is the Hood.\r\n\r\n\"You call that a disguise!?\", asks Miriam, referring to his hood which has become the public symbol of his thieving.\r\n\r\nTo which Robin replies: \"Well, it fooled everybody else!\"\r\n\r\nI ask \"You call this entertainment!?\", but I won't wait for a reply.\r\n\r\nI'd write more details about this film, but I can't bear to think about it. I mostly write this review as a reminder to my future self to not waste further time my watching this movie a third time.", "created_at": "2021-09-03T08:11:22.921Z"}, {"movie_id": 375588, "review_id": "63c1e147a5743d00c3bf88bf", "rating": 1.0, "review_text": "What is the name of that video game all the kids are playing? Assassins Creed is it? Something like that? Yeah, that's kind of what's going on here. Robin Hood is coming at you straight out of a video game.\r\n\r\nAnd, it looks like a video game, which kind of makes it so much worse, because it's like watching an immature kid play a video game without the emotional investment of playing yourself.\r\n\r\nAnd then they raise the stakes by making it so Ultra-Woke that they almost forget that the point of Robin Hood was that he stole from the rich to give to the poor in their effort to modernize the politics.\r\n\r\nIt's just a mess of video game inspired dialogue and action. Stay away.", "created_at": "2023-01-13T22:55:03.033Z"}]