[{"movie_id": 464052, "review_id": "5fdcb7c82efe4e0040d7237c", "rating": 7.0, "review_text": "It isn't as easy as saying 'Wonder Woman 1984' is a good or bad movie. The pieces are there, and there are moments I adore, but it does come across as a bit of a mess, even though the action sequences are breathtaking. If you're a fan of the original film, you'll be more willing to take the ride, but for those more indifferent, it may be a bit of a blander sit. If you can and are planning to watch it, the theatrical experience is the way to go - there is nothing like seeing these stunning sets, fun action scenes and hearing Zimmer's jaw-dropping score like on the big screen.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-wonder-woman-1984-a-new-era-of-wonder-occasionally", "created_at": "2020-12-18T14:08:08.440Z"}, {"movie_id": 464052, "review_id": "5fdfb6d20e4419003feab513", "rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nThe superhero genre has been growing exponentially during the last decade, so it's bizarre to go through an entire year with only Birds of Prey and The New Mutants instead of literally dozens of films from both Marvel and DC. Thankfully, Warner Bros. decided to release Wonder Woman 1984 before the year's end, but not without a catch. Most people will only have the possibility of watching one of the few blockbusters of 2020 through HBO Max, a streaming service only available in a couple of countries, while some incredibly lucky moviegoers might have the chance of seeing this visually epic film in theaters, depending on the country's pandemic rules.\r\n\r\nFortunately, I'm one of those lucky people who got the opportunity to end 2020 on a positively immersive note by watching Patty Jenkins' latest flick in an almost empty IMAX theater (paradise). If you've been following me for some time, you know I'm a firm believer and defender of the so-called \"theater experience\", and I can't hide the fact that I felt extremely emotional going into one of the best, biggest theaters in Portugal to witness one of my Most Anticipated Movies of 2020. Until 2017, DCEU struggled to deliver a massively loved installment, and Wonder Woman came to the rescue. It was one of my favorite films of the respective year, so I was obviously excited for its sequel, even more having in mind the circumstances we're all living in.\r\n\r\nIn my opinion, this sequel stands close to its predecessor. With a lengthy runtime known for being associated with absolutely epic movies, I was confident that WW84 could deliver a solid film with great villains for a change. Well, Kristen Wigg and Pedro Pascal are definitely two of the indisputable standouts. Patty Jenkins, Geoff Johns, and David Callaham made the right decision in dedicating a significant portion of the screenplay to Barbara Minerva and Max Lord. Their arcs are far from being groundbreaking, but they're a thousand times more effective than the \"CG punch bag\" narrative.\r\n\r\nBarbara follows the \"lonely, insignificant, no one cares about me\" archetype, and Wiig does a surprisingly remarkable job in portraying this character, but the script is what really makes her shine. At first, her comedic mannerisms left me a bit dubious about the eventual character's likeness. However, as time flies by, it's almost inevitable to feel sorry for Barbara, making her future motivations understandable and perfectly natural. On the other hand, Max Lord is apparently exploding with conviction, but his life is not as amazing as everyone might think. This time, it's Pedro Pascal who ends up elevating the character, delivering a brilliant performance with just the right amount of over-the-top expressions.\r\n\r\nEven though these two are magnificent, Gal Gadot continues to prove that she's one of the best casting choices of the millennium, interpreting Diana Prince aka Wonder Woman. I seriously cannot imagine another actress wearing that costume, throwing that Lasso of Truth, incorporating the character's essence as seamless as Gadot. In this movie, she was able to perform highly emotional scenes, nailing every single one. Her chemistry with Chris Pine (Steve Trevor) is palpable on the other side of the world, and their interactions go through every zone of the emotion spectrum. Regarding Steve, I'm not going to spoil how he comes back or anything concerning his arc, but I can safely write that his presence in the film is both necessary and logical.\r\n\r\nThe biggest compliment I'll offer this sequel concerns its screenplay and direction. Finally, I can confidently write that the DCEU is capable of producing a well-structured, well-developed story with well-written characters. It doesn't have as much action as the original, but I still didn't feel the 151 minutes. WW84 flows incredibly well due to Jenkins' ability to fill up the runtime (almost) only with important scenes. There's a slight \"over-persistence\" in the attempt at sending a certain message (I'll get there), but story-wise, I sincerely wouldn't take a second out. Even the comic relief moments, particularly with Pine (who plays some sort of parallelism with the first movie's Diana), are welcome and timely.\r\n\r\nThe action scenes might be low on quantity, but the few that the audience gets are long, complex, and technically challenging to pull off. The opening sequence alone almost made me tear up due to its epicness. Hans Zimmer's powerful score, Richard Pearson's clean editing, and Matthew Jensen's camera work all work together to present a lengthy, grand, wide view of an Olympics-style obstacle course with young Diana. Throughout the entire film, the action is colorful, vibrant, fun, and entertaining… except for the (supposedly) climactic clash.\r\n\r\nWell, to be fair, there are two climaxes during the last thirty minutes since WW84 owns two antagonists to play with. One of them is closed in perfect fashion, with the emotional stakes at their highest. Great job there, no complaints whatsoever. However, the main fight sequence inexplicably contrasts with the rest of the movie's action. The vibrant colors disappear and are replaced by a dull grey, which makes one of the characters involved (who shares the same color tone) hard to notice, transforming an epic final battle into an underwhelming, barely comprehensible collection of awkward cuts, punches, and screams. Gadot's golden suit is way less exciting (and poorly lit) than her original costume, and Barbara's arc ends without real closure.\r\n\r\nIn addition to this, Jenkins insists too much on passing to the audience that greed brings horrible consequences. \"Be careful what you wish for\", \"money and power can't buy happiness\", \"be thankful for what you have\", and messages along these lines are repeated continuously (implicitly and explicitly). I admit that it might be a nitpick of mine and that not many people will feel like I did, but I couldn't help but feel that some moments sounded and/or seemed a bit preachy and way too repetitive. Also, it's a bit weird how the official premise mentions Wiig as Cheetah, but this word is not mentioned once in the entire film… Nevertheless, don't be mistaken: I'm thrilled that WW84 is the last flick I watch at a theater this year!\r\n\r\nAll in all, Wonder Woman 1984 proves that DC continues on the track of success by delivering a well-structured, well-developed DCEU installment without an absurd amount of overwhelming CGI and/or forgettable villains. Patty Jenkins, Geoff Johns, and David Callaham's impressively layered screenplay makes the lengthy runtime feel adequate not only by offering epic, exciting, technically superb action set pieces, but also due to the remarkably well-written heroes and antagonists. Gal Gadot and Chris Pine are outstanding together, but Kristen Wiig and Pedro Pascal steal the show as the newcomers. With two wonderful \"villains\", WW84 boasts a solid, elaborate narrative that I was lucky to witness on the big screen. Unfortunately, the climactic battle is disappointingly underwhelming and colorless, Barbara's arc ends abruptly without true closure, and Jenkins insists too much on the thematic message of the story. These issues may affect more viewers or not, but one thing's for sure: it's one of the most entertaining movies I've seen all year, worthy of being seen on a massive theater.\r\n\r\nRating: A-", "created_at": "2020-12-20T20:40:50.737Z"}, {"movie_id": 464052, "review_id": "5fe364055be00e003d9e536c", "rating": null, "review_text": "Gal Gadot returns as Diana Prince in “Wonder Woman 1984” which has seen its release date shift a few times due to the Covid-19 pandemic. The film has started to open overseas and will arrive in the U.S. on Christmas day with a limited debut on HBO Max as well.\r\n\r\nThe story sees Diana now living in Washington D.C. in 1984. Diana is popular but has refused male companionship as she still longs for her late love Steve Trevor (Chris Pine).\r\n\r\nDiana works in the Smithsonian Institute in antiquities and keeps her secret identity under wraps even when a daring mall heist forces her to leap into action.\r\n\r\nA shy and passive employee named Barbara (Kirsten Wiig); who is afraid of her own shadow and largely ignored by her peers is befriended by Diana and they discover one item from the heist is inscribed with the ability to grant a wish. Unknowingly Diana wishes for Steve to return and Barbara wishes to be more like Diana which sets a chain of events into motion.\r\n\r\nA shady business man named Maxwell Lord (Perdro Pascal) has his site on obtaining the relic as he believes having the ability to grant wishes will allow him to save his failing business and give him the power he craves.\r\n\r\nWith such a promising setup; the film ultimately does not deliver on its premise and becomes bogged down in drawn out sequences with surprisingly little action and gaps in logic that defy even standards for a comic book film.\r\n\r\nThe first 90 minutes of the film has roughly 10-15 minutes of action tops and we are instead given lengthy scenes of Steve trying to find an 80s fashion look; flying over fireworks, and Maxwell trashing from one locale to another without much needed continuity.\r\n\r\nAn action scene involving a convoy chase through the desert seems very inspired by “Raiders of the Lost Ark” and ultimately does not deliver especially with such a long gape between the action sequences.\r\n\r\nThe final act does attempt to redeem the film as seeing Barbara transform into her new persona is interesting and Wiig does a very solid job with the role. This sadly is undermined with a single line of dialogue which takes away a big part of the transformation that audiences deserved to see.\r\n\r\nThere was also a sequence where Diana races down the streets and takes to flight with her Lasso and then discovers she can fly like Superman. Not only is this not in keeping with the character; but we see this extended fast moving sequence where she is clearly heading away from D.C. at great speed only to arrive at a destination with an item which had been established to be back at her home in D.C.  It is this sort of sloppiness that really detracts from the film. There is also the fact that Steve has to fly her around on a jet that even as a pilot he should not know how to fly as he has never flown a jet aircraft in his life.\r\n\r\nWhen the big confrontation comes it is a letdown as it is not overly epic and the CGI really does not seem to mesh. What is an even bigger disappointment is that a certain character stands emoting for several minutes while Diana gives such a bland and extended speech that even my wife had to ask “who wrote these lines”.\r\n\r\nThe film was not a total disaster as the characters were interesting and worked well with one another making the film entertaining in parts despite being really disappointed with it.\r\n\r\nThe film strikes me as a product of the talented Patty Jenkins being able to do whatever she wanted after the success of the first film. Jenkins not only Directed but did the screenplay for it. Considering the amazing job she did writing “Monster” I had high expectations for the film but to me it seemed like it could have used a bit more attention to several aspects.\r\n\r\nMy summary would be the following… good cast, entertaining in parts, not much action over two hours, takes huge liberties with Diana and her abilities, massive gaps in logic even for a comic movie. It aims to be epic and comes up lacking. At least the mid. credit scene was worth it.\r\n\r\n3 stars out of 5", "created_at": "2020-12-23T15:36:37.849Z"}, {"movie_id": 464052, "review_id": "5fe7fe505b1240003c695c82", "rating": 6.0, "review_text": "Heroes are only as good as their villains.  Nothing sums up the disappointment of WW84 more than this.\r\n\r\nMaxwell Lord & Barbara Minerva are two of the most dangerously dark psyches in DC lore, both fond of extremely nasty, deliberately sociopathic behavior.\r\n\r\nWhoever it was pretending to be them in WW84, it wasn't those two from the comics.\r\n\r\nWe had some namby-pamby twerp called \"Max Lord\" who was just a misguided fool trying to fill that emptiness in his pathetic life with a magic dream.  Yawn.\r\n\r\nAlso, some good-hearted ditz called \"Barbara Minerva\" basically became inadvertent collateral damage whilst Lord's dopey plan panned out.  Admittedly, that's vaguely similar to one of Cheetah's later origin stories, but it completely discounts her propensity for choosing the pure evil path.\r\n\r\nIt could have been fun watching a proper mind-controlling Lord and a proper soul-possessing Cheetah fight over the \"ownership\" of some red shirt.  Alas, no.\r\n\r\nWhat an absolute WASTE of two A-grade narrative heavyweights!  But then, that's the problem.\r\n\r\nYou simply could NOT use characters like Lord & Cheetah appropriately in a movie targeted towards a family audience, and it's obvious that \"make this family friendly\" was plastered all over the script in red sharpie.\r\n\r\nNothing's likely to change for the third WW installment, where, in keeping with the cinematic PG-downgrade of supervillains, Circe is portrayed as a lonely kid's party magician who gets angry when her balloons get popped, so she turns everyone into pet unicorns.", "created_at": "2020-12-27T03:24:01.005Z"}, {"movie_id": 464052, "review_id": "5fea347ca14bef003f2f5f6f", "rating": 5.0, "review_text": "This movie is dumber than it should be. In short: it looks fantastic and the action is in perfect WONDER WOMAN style. The problems are with the plot, the attention to detail and coherence. I'm not saying this movie should be more realistic, but a lot of the decisions just don't make any sense and it is loaded to the brim with cliches (eg. ugly duckling that is not ugly at all). If you expect something to happen, it will 100%, there is no try to dig deeper - it is always the most obvious and easiest solution.  Especially the all solving \"action\" of Diana, is more than questionable and leaves so many plot-holes. \r\n\r\nIf you don't care about logic (not realism) or a challenging story this movie is perfect for you...", "created_at": "2020-12-28T19:39:40.194Z"}, {"movie_id": 464052, "review_id": "5ff481377ef3810040d8a22e", "rating": 3.0, "review_text": "Do not trust the reviews before Dec 25th 2020 they are bought and paid for early release reviews, this movie is bad real bad, bad CGI and horrible story shame really the first one was amazing but Patty Jenkins should just stick with directing she is just not a good writer.", "created_at": "2021-01-05T15:09:43.598Z"}, {"movie_id": 464052, "review_id": "5ff710450cd32a0045471e8c", "rating": null, "review_text": "1984, a sequel to the fantastic \"Wonder Woman\", which showed a cool breeze in the middle of a saturated superhero cinematic market, is a fantastic continuation of the story of our favourite super heroine. Lighter in action, but thematically profound, this may not be a film that pleases everyone.\r\n\r\nLet's start with the positives: Gal Gadot, as a wonder woman, continues to prove to be the perfect choice to play the part. The actress maintains a strong bond with the audience , really showing all the strong emotions that the character feels during the course of the story. Without her, the film would lose something really essential: her soul.\r\n\r\nThe story, thematically linked to greed, our deepest desires and selfishness, provides a journey of development for the characters that makes us reassess certain attitudes taken throughout our lives.  The story seeks to develop each of the characters, and this is what gives it so much strength.\r\n\r\nChris Pine, as Steve Trevor, is also one of the film's high points, and his chemistry with Gadot remains explosive, providing the film with an engaging romance that will make anyone feel warm inside.\r\n\r\nThe film is completely different from the first, its style is radically changed, becoming lighter, like a cartoon we watched on Saturday morning as children. For some, dramatic stylistic change may be a negative factor, but in a year of so much suffering, lightness and hope are exactly what we need to abstract ourselves from real life for two hours.\r\n\r\nWhen it comes to action, the film is not as explosive as first, it is contained and the action sequences, though incredible, are scarce. In a two and a half hour film, this may entice some to feel bored. But in my opinion, the film never slows down because of the incredible characters and their interactions. \r\n\r\nAs far as the most negative points of the film are concerned, I would say that the rope of suspension of credibility is really stretched during the duration of the film and we are asked to accept really ridiculous things that come out of nowhere. The film is also very cheesy, with sequences that can be considered lame and dull.\r\n\r\nAll in all, however, this film is a glimmer of hope and joy in a dark and desperate year. I strongly advise you to watch it, it's two hours of fun, with no problems and smiles in the mix. Although not perfect, and inferior to the first, this sequel is worthy of the adjective \"Wonder\".", "created_at": "2021-01-07T13:44:37.447Z"}, {"movie_id": 464052, "review_id": "6005f154e942ee003fe66ef0", "rating": null, "review_text": "Wonder Woman 1984 is solid where it counts, maudlin in the way its fans need it to be, and, similarly, just funny enough to be charming. For all that goes unsaid, the writing is even occasionally clever.", "created_at": "2021-01-18T20:36:36.046Z"}, {"movie_id": 464052, "review_id": "60078c12fb3f61004a4133a8", "rating": 1.0, "review_text": "**This movie was horrible... and I realize this isnt my genre..but I sat at Christmas and watched it with my 2 grand daughters as they were sooo excited to see it..and we literally ALL hated it...  The movie itself is pointless with alot of dialogue that means nothing... no real build up to anything.. If you have to use an entire 2 hours to \"explain\" a character your probably doing something wrong.. \r\n\r\nWas SERIOUSLY disappointed in ALL the actors in it..Particularly the guy from the Chapo Netflix series.. his character was HORRIBLE... and if I am being honest..I am not impressed with this woman they have chosen as WW... not in slightest.. extremely odd looking and well... I didnt even find her acting chops good for a film like this...\r\n\r\nIt was so bad we lasted about %80 of the film befoe we stopped it and started the older one.. I'm not a fan of this actess nor this take on WW at all... **", "created_at": "2021-01-20T01:49:06.495Z"}, {"movie_id": 464052, "review_id": "600c7d8dcb8028003f01e76e", "rating": null, "review_text": "I have read the book \"1984\" and saw some aspects of the book in this movie- Big Brother, Group Think etc.  The moral dilemma that Wonder Woman faces is truly heart wrenching.  But as for the rest of the movie, there were some good action scenes and great CGI.I did notice that of all the great nations affected negatively, there was one significant one missing, China.  Why would China have been left out of the turmoil affecting the rest of the world?  Were the makers of the film afraid to show anything negative about China, but were willing to show other nations in a type of stereotypical light?  The depiction of the President of the US, who in 1984 was actually Ronald Reagan, was shown to be an insecure and to be overly ready to shoot off the nuclear warheads.  They never called him by name, but the dark hair and the jar of jelly beans were obvious who they were portraying.  The hair of the villain of the movie and his ever growing quest for power were subtle clues for another person that Hollywood has deemed a power hungry demonic person.  Ironically, the villain uses the same medium to spread his mental suggestions as the media uses to influence us to theirs.  The definite political agenda ruined some of my interest in the movie but as eye candy and brain numbing entertainment it fits the bill,    They leave the possibility of a prequel or sequel open in scenes at the end - after the credits", "created_at": "2021-01-23T19:48:29.158Z"}, {"movie_id": 464052, "review_id": "6070549512b10e0040a1cd2f", "rating": null, "review_text": "I am not sure this is not the worst sequel of all time.  The hype surrounding the movie touted as the best movie of the year.  But, in retrospect, it fits in with the rest of the year of 2020.  Lots of hype but miserable on delivery.  The storyline was abysmal and the plotlines were weak from the start.  Just when you thought it might actually deliver a promising plot twist, it puttered out of the gate.  Really disappointed if you couldn't already tell by reading this.", "created_at": "2021-04-09T13:20:21.304Z"}, {"movie_id": 464052, "review_id": "6073e79a2f7915005756f9a0", "rating": 1.0, "review_text": "Wow, this movie was really bad. I quite liked the first movie and I am amazed how the writer(s), apparently with Patty Jenkins, in the lead managed to turn this into a boring piece of crud.\r\n\r\nThe movie is just so boooooring and nonsensical.\r\n\r\nBelow are my notes when watching this movie (I had to do something while watching it to not get bored out of my mind) which pretty much speaks for itself.\r\n\r\nWhat is it with the stupid beginning? It was just silly lecturing and did not really bring anything to the story.\r\n\r\nThose clowns pretending to be robbers. Was it supposed to be funny? Well it was not. Bad start indeed.\r\n\r\n25% and this is boring.\r\n\r\n40% and this is still f... boring.\r\n\r\nA guy used to fly ancient propeller planes can suddenly fly jet fighter planes. And she \"forgot\" about radar? Seriously?\r\n\r\nFlying straight through exploding fireworks and no one saw them nor did the engines get clogged up? And did they not have a world to save instead of sightseeing by the way?\r\n\r\nA fighter jet flying from the US to Cairo in one go? Yeah, right!\r\n\r\nFinally at 60% there is some action which is of course dragged down by this silly wish stone's impact on Wonder Woman.\r\n\r\nAnd here we go with the illogical emotional bullshit refusing to accept reality.\r\n\r\nMy God, the bad guy is such an unintelligent and stupid jerk. No charisma whatsoever. The script is really such a juvenile piece of crud that it is unbelievable.\r\n\r\n85% and finally some superhero action. Pretty lousy action but at least some action.\r\n\r\nHoly crap! Even the finale is boring and dragged out.\r\nThis entire movie could have been condensed into a 45 minutes TV show episode, and not a very good one at that.\r\n\r\nPatty Jenkins is going on my watch list… for movies that I will avoid!", "created_at": "2021-04-12T06:24:26.695Z"}, {"movie_id": 464052, "review_id": "622f53470e44190079a787dd", "rating": 3.0, "review_text": "Awful. I cannot believe how bad this movie was to watch. Leaves you with a bitter, cheated, bored feeling guaranteed. What a total waste of time.\r\n\r\nI feel complelled to write this review just so I know I've got it off my chest and can move on.\r\n\r\nWhen it finished my mam said.\"At least we don't have to ever watch that again..\" and that was exactly how everyone felt. \r\nAlso half way throuh we were saying when is it going to finish.\r\n\r\nException - The yound Diana bit was the only bit that had any relivance to the previous movie. The previous movie was quite good. \r\n\r\nI'm trying to think what else was good .. Oh and the sparkly poster is quite good, and thats always a red flag that the movie could be bad.", "created_at": "2022-03-14T14:37:59.413Z"}, {"movie_id": 464052, "review_id": "62dfa7fdd2b209005057c4e1", "rating": 7.0, "review_text": "Wonder Woman 84 was a love letter to the original series starring Lynda Carter. Visually appealing and just FUN... Pedro Pascal steals the show hands down. It is NOT like its predecessor or any other DC movie with Wonder Woman in it, still, it is a great ride from start to finish and a worthy sequel to the Queen of Amazons.", "created_at": "2022-07-26T08:38:21.061Z"}, {"movie_id": 464052, "review_id": "63c24a6ea5743d007d122e29", "rating": 5.0, "review_text": "**A disaster of a comic book movie with Batman + Robin level acting and writing and a far cry from its outstanding predecessor.**\r\n\r\nWhat happened?! How did the same director and same cast return from the first movie and make a wildly different quality film? The first Wonder Woman was so powerful, inspiring, and strong. But this sequel was a mess of Batman & Robin-level cheesiness and awful writing. The Wonder Woman and Steve Trevor romance while Steve highjacked a random guy’s body was icky and awkward. Max Lord was way too over the top, and while Kristen Wiig had some good moments, her character was poorly written, and the CGI was atrocious. The effects for the entire film were subpar. How could Warner Bros see this and think it was ready to release? Even the writing for Wonder Woman herself left the character mopey and selfish, which was a significant fall from the incredible writing and performance Gal Gadot gave us in the first one. Wonder Woman 1984 was a massive disappointment that probably killed the franchise and forced a reboot.", "created_at": "2023-01-14T06:23:42.954Z"}]