[{"movie_id": 385128, "review_id": "60c5f23c944a57006eb2a086", "rating": 8.0, "review_text": "**CAN YOU SAY, ER ...\r\n\" BADASS-EST \" 😅 💥❓ ... { THIS IS A SEMI PARODICAL TITLE } .**\r\n\r\nA \"Good, Old Fashioned\" **-{ _B I G_ }-** Screen Review . \r\n\r\n______________________________________________________ \r\n\r\nLetty Ortiz: \"Hi, little Brian. I have a gift for you. Your Daddy gave me this, & now I'm going to give it to you. It's very Special { Letty takes off her necklace & puts it around Brian's neck } ...it's for protection... from what's coming\" .\r\n\r\n______________________________________________________ \r\n\r\nFirst & foremost, -{ Not Only }- is this undeniable \"behemoth\" of a movie, with its USD 200 Million -plus- production budget, broadly speaking, **-{ GENUINELY ✅ }-** enjoyable; but it is -Also- \"rather surprisingly\", and very reassuringly so . . . \" relatively \" . . . -very- Family Friendly, indeed. As a doting -{ _P a r e n t_ }- , I had, to be very honest, expected -Considerably- worse; given what the 'seemingly standard trend' with Blockbuster-fare ( on -this- magnitude, atleast ) is, in this... 'our pretty, darn reckless' ..day and age .\r\n\r\nMoreover, I just **-{ LOVE 👏 }-** how the movie ...unreservedly... -not only- \"laughs out loud\" -{ at itself }- of course , but often -Also- seems like it's having a 'rollicking good time' doing it. For -all- the 'Contrarian'-reviewers on a very similar platform to this known as 'IMDb' { that appear absolutely -Bent- on picking this fairly \"lighthearted\" & essentially **\" PLAYFUL \"** picture apart for just about 'every conceivable reason under the sun' }: I have -just- 3 'Profound' words to say to you: \"Watch It Again\". Because that is -just- what I did, & I ended up enjoying it -{ way }- more the second time around ; managing to, on the one hand, clear up -Several- of my initial doubts... & on the other ; to -{ truly }- appreciate how ( actually ) \"Un\"-seriously ...\"F9\" really takes itself. Keep your eye out for the tiny but absolutely -{ hilarious❗}- little \"Who's Dominic Toretto?\" scene ; you'll get a better feel for what I mean. But let me be ..\"Starkly\".. clear. -{ In no way }- is my review title meant to suggest to you, -even remotely- , that this is somehow 'the best cinematic offering on earth' right now, or -any- such manner of preposterous thing. The pointed -{ reason }- , as it were, for my use of the -decidedly- \" Lively \" , Benignly Parodical, & even \"mildly histrionic\" , film review -Title- that you see above, is, quite simply , 'as follows' .\r\n\r\n----- \" It's a well known fact by now that the -{ Ever }- grandiose pictures of the 'Fast And Furious' franchise seem to -forever- be looking to \" One Up Themselves \" , in terms of making their vehicular ( in particular ) action sequences -{ well and truly }- \" One-Of-A-Kind \" . In keeping with this 'practically-Sacrosanct ( 🙏 😅 )' , time honoured tradition . . . . F9's very accomplished 'In-house' writer-Director Justin Lin has ( -Yet- ) again proven that he most certainly is the very 'living embodiment' of this rule, by taking those wild & wacky ( bespoke ) 'Gas-Guzzler Gymnastics' of his all the way , you guessed it , to -{ Outer Space }- . . . . not to mention all the -many, many- other ( almost ) as utterly, utterly, utterly '_Ludacris_' stunts performed ...seemingly as if... 'by all those Mega-fancy automobiles themselves'. ( Watch the final -official- trailer for F9 , if it's still going to be a while before said movie hits your part of the world ). So there you have it. Hence that 'affectionate little touch' of, well , \" Classic-hyperbole \" , in my review-Title . \" ----- \r\n\r\nAnd so, in closing, here are the things I consider to be the -{ Most }- likeable, about the picture. 1 : The ever-fresh, ever-sweet rapport that 'Dominic Toretto' ( Vin Diesel ) has with 'Letty Ortiz' ( Michelle Rodriguez ). 2 : The { Un }-deniable \" Brilliance 🌠 \" , really , with which -Several- mind bogglingly complex, & indeed, 'super-Protracted' multiple vehicle chase & combat scenes were put together. 3 : -All- those \"giant-Magnet special effects\", ( this is -Also- teased in the trailers, which are freely available to watch on youtube ), meticulously crafted to, frankly, \".nothing less than sheer -{ Perfection }- \" . 4 : The film's -{ Delectable }- smattering of short, nonetheless utterly -Classic- \" Movie-Reincarnation sequences \" . Meaning . . . { action or comedy ( or both ) 'Re-works' of -Well- established , ( & often beloved, even ) , \" Universally Iconic Cinematic-moments \" } . . . which in the case of F9 ...{ Un }-mistakably... were sequences that hearkened -Right- back to a few ( very ) specific, timeless, & -Massively- popular scenes from A : 'Jurrasic Park-Part One', B : 'Terminator Three-Rise Of The Machines' ( **-OR-** 'The Dark Knight' : your prefererence, really ), & C : 'Austin Powers-Part One', -even- , just to name the ( Most 💙 ) notable ones. 5 : And last but by no means the least : there really -{ Was }- a whole lot of -actually- funny stuff in F9. And I am, -of course- referring here to -Very- many moments of \"Unabashedly-Dumb Frivolity\" involving , ( but not limited to ) ; none other than the \" Uber-talented \" Tyrese Gibson, ( 'Roman' ), & his -equally- Fun partner-in-comedy, Ludacris ( 'Tej' ) ; with the ever charming Nathalie Emmanuel ( 'Ramsey' ) chiming in 'most pleasantly' from time to time, for good measure . \r\n\r\nSummary : If you -{ Didn't }- come to F9 to see cars flying in, well, -outer space- , ( and other such \" _Colossally_ \" Zany-things ) , then you -most certainly- came to the wrong place. { Translation } : if you're ( one of those ) the -'Many, Many'- ( aforementioned ) negative-reviewers, and feel like you were ( -better- ) suited to simply watching 'Normal' cars just driving around, well... 'Normally' ...& -{ Not }- doing a multitude of \"crazy & extraordinary\" things ; then can I -very humbly- recommend, say, ....going & sitting down at a nearby bus-stop, & watching 'The Street'.... -{ Instead }- . Because, 'for better or worse', -this- movie does -{ Exactly }- what it says on the tin , \" & Then Some \" . Furthermore, the two -Main- Male \"Lead-pairs\", namely, A : Vin Diesel and John Cena ; and B : Vinnie Bennett and Finn Cole, ( a.k.a 'Young Dom', and 'Young Jakob' ), play -{ remarkably }- well off one another ; whilst -All- the \"Leading Ladies\" plunge headfirst into this veritable, **-{ MINDLESS }-** Fun-Fest , \" With A Vengeance \" . So it's going to be a generous, -{ \"Very Grateful\" }- , and decidedly \" pandemic-Considerate \" 7.75 Marks Out Of 10.00 from me. Well, only one thing left to say, then. **\" _I G N I T I O N_ 😅❗ \" .**", "created_at": "2021-06-13T11:55:41.001Z"}, {"movie_id": 385128, "review_id": "60d102bac9dbf900270a3e89", "rating": null, "review_text": "After being delayed from a summer 2020 release by the Pandemic; Universal has released the latest film in the Fast and The Furious franchise to fans eager for some adrenaline-fueled summer action.\r\n\r\n“F9 The Fast Saga”  has done well in the few countries it has already been released, and has raced to a nearly $300 million total which the industry hopes is a signal that people are ready to return to cinemas in numbers again and that the film will take off when it opens in the U.S. and other markets.\r\n\r\nThe film opens with a flashback to the 1980s where young Dominic and his brother experience an event that changes their lives and drives a wedge between them. Moving forward to the present day, Dom (Vin Diesel) and Letty (Michelle Rodriguez), are living in seclusion with Dom’s son.\r\n\r\nWhen the crew shows up unexpectedly with a mission from Mr. Nobody (Kurt Russell); who has gone missing, the crew venture out to retrieve a missing device which in turn puts them directly in the path with nefarious individuals and a ghost from Dom’s past.\r\n\r\nAs anyone who has watched any films in the series knows; the plots are often thin and a bit absurd as they serve simply as a device for the cast to assemble and chase a McGuffin to save the day. In doing so; the audience knows there will be an abundance of fists, bullets, cars, crashes, and outrageous stunts along the way.\r\n\r\nWhile reality and credibility are not words associated with the franchise, the cast eagerly plays along with the absurdity, action, and mayhem and gives fans what they want. While the middle portion dragged while the audience was given more of the setup and introduced to cast members old and new; the action sequences are the over-the-top show stoppers which have become a staple of the franchise.\r\n\r\nDirector Justin Lin knows this and his return to the franchise does not attempt to invoke any new wrinkles and gives fans what they expect. The large ensemble works well with one another and John Cena is a very interesting addition to the cast.\r\n\r\nAudiences will want to make sure to stay seated for a bonus scene that sets up the next film or spin-off very well and opens up some very interesting possibilities.\r\n\r\nIn the end “F9 The Fast Saga” gives audiences a dose of high-octane adrenaline and a return to no-brainer over the top action when it is needed the most. Check your brain at the door, strap in, and enjoy the ride.\r\n3.5/5", "created_at": "2021-06-21T21:20:58.346Z"}, {"movie_id": 385128, "review_id": "60d73bb6109cd0004709b24e", "rating": 10.0, "review_text": "This delay was worth waiting for...\r\n\r\nFirst of, it was really cool how they did the flashback; looked like it was filmed in a retro camera, which made it look like it was filmed in the 1989/90s!. Clearly a nod to the first Fast & Furious film.\r\nI mean, I was confused at first by what the flashback was telling me, but halfway through the film, it started to all make sense!\r\n\r\nI give it 5 stars, for basically going overboard with the rocket launcher mounted on a car, the editing for the flashbacks, bringing back two of the characters from Tokyo Drift, combining cheesy humor with outstanding action, the redemption, the post credit scene featuring Jason Statham! And of course the surprising return of Han, and how he survived (the latter definitely had questions that needed answering).\r\nNot to mention the storyline itself was brilliantly done.", "created_at": "2021-06-26T14:37:42.706Z"}, {"movie_id": 385128, "review_id": "60d8bfcbaa7898005d562dff", "rating": 3.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/f9-spoiler-free-review\r\n\r\n\"F9 takes its ridiculously absurd action sequences to intolerably nonsensical levels, all while trying to tell an overlong, messy, unimaginative story surrounding one of the most generic cliches. Justin Lin ignores the little balance that the saga still possesses in previous installments, delivering insanely dumb moments throughout entire set pieces, contrary to having a somewhat acceptable action scene with the occasional suspension of disbelief in a specific situation. Daniel Casey and Lin are also unable to create a compelling narrative around Dom's lost brother, ultimately damaging years of character development for Vin Diesel's role. Bringing back Han was as unnecessary as the unconvincing explanation for his return, hurting not only this movie's pacing and extended runtime but also the emotional weight of previous films. The original cast members and the exceptional production value are enough to save this installment from being a massive disaster. If you're able to (really) shut down your brain for over two hours, this might still be an entertaining time at the theater. However, even for fans of the Fast & Furious saga, I doubt this movie will end up as one of your favorites.\"\r\n\r\nRating: D+", "created_at": "2021-06-27T18:13:31.965Z"}, {"movie_id": 385128, "review_id": "61041cce17c44300468a962a", "rating": 2.0, "review_text": "I didn't heed everyone's advice and decided I would view this for myself.\r\n\r\nYikes!! Definitely not good.\r\n\r\nPlot holes galore, continuation errors, scene mistakes, factual errors, you name it they exist. Some things just make you scratch your head and say WTF, or smack yourself in the head because you wonder how they could be so stupid when they made this. No, I don't make movies for a living, no I am not a paid critic, I just watch movies for fun and this was not \"FUN\".\r\n\r\nIf you like action movies with bad acting then this is for you. If you have watched all the other F&F movies and think this is going to be good, then this is for you. \r\n\r\nIf you are looking a way to kill a few hours having numbed yourself then this IS for you.\r\n\r\nYou have been warned.", "created_at": "2021-07-30T15:37:50.941Z"}, {"movie_id": 385128, "review_id": "610a5a305c5634007fe3b5b5", "rating": 4.0, "review_text": "I watched the film, but it didn't appeal to me as much as the prior films.\r\nThe change in theme and concept was one of the things that bothered me the most in this film.\r\n\r\nFrom street racing and minor crimes, the movies evolved into an idea of saving the planet. Okay, that's wonderful; you can save the world; however, how can someone reach space in his car and survive?\r\nSeriously? \r\n\r\nI don't recall this being fast and furious. The plot was similar to earlier films and revolved around Hobbs and Shaw. The story was not exceptional in any way.\r\n\r\nAnd, when it comes to action, it was unrealistic and unbelievable.\r\nThousands of cars followed Dom's crew, and thousands of guys with bullets and automatic weapons fired at them, but nothing happened to them. No one was hurt in any way. Are they immortals? \r\n\r\nI felt the absence of screenwriter Chris Morgan as the structure and storytelling were sloppier to the overall detriment of the film.", "created_at": "2021-08-04T09:13:20.328Z"}, {"movie_id": 385128, "review_id": "612b8401a4af8f008a2abe3e", "rating": 4.0, "review_text": "Sure no one watches FF series expecting amazing plot, but surely it is now pushing the boundaries of ridiculous. I did enjoy the previous films just as silly action flicks but this one had me sighing in disbelief midway through.", "created_at": "2021-08-29T12:56:33.568Z"}, {"movie_id": 385128, "review_id": "6143ad399450fe00431410ab", "rating": 5.0, "review_text": "To some degree, with maybe the exception of Tokyo Drift and Fate of the Furious, I've enjoyed these Fast and Furious movies. Yes, they are dumb and have over-the-top action, CGI-generated, scenes yet despite that found them to be mindless entertainment with the only merit being the chemistry with the cast. However, with Fate of the Furious and the absence of Paul Walker, the series lost that aspect. Walker wasn't a great actor but he and Diesel were great together, along with the others in the ensemble where I could overlook the stupid moments.\r\n\r\nThis ninth entry, as most sequels do, takes it to the next level of absurdity but this time I really could not care less about anything going on. The action scenes were pretty lame and even though it was a joke taking the movie into space, I didn't think they'd actually do it... I could only shake my head at that sequence.\r\n\r\nThen there's the whole bringing Han back to life. They have now retconned his scene for a second time and somehow, despite this being an outlandish franchise, cheapens any character development for Deckard Shaw (his entire reason for \"killing\" Han was out of revenge for putting his brother in a coma, although IIRC initially Owen Shaw was thought to have been killing in Fast Five).\r\n\r\nThey try to add some BS depth with faith and, of course, FAMILY, that doesn't land. Hell, there's even discussion from Roman (Tyrese) about being invincible played as a joke only to come true once he and Tej go into space to stop a satellite and actually f'ing survive.\r\n\r\nThe film also is a greatest hits with the return of characters from previous entries including Helen Mirren, Lucas Black, Kurt Russell, Charlize Theron, Shea Whigham (had to look him up, he was in Furious 6), Sung Kang, Shad Moss (aka Bow Wow), etc. Plus Jason Statham makes an uncredited cameo.\r\n\r\nBoy, yeah the Fast franchise jumped the shark a while back but this one is on the bottom of the list. I don't know how they will right the ship with #10 (and supposedly the last) but the issue with these sequels is they have to top the previous no matter what.\r\n\r\nDumb is fine. Lazy not so much. **2.25/5**", "created_at": "2021-09-16T20:46:49.409Z"}, {"movie_id": 385128, "review_id": "61c0b0c14da3d40063bdf1bb", "rating": 8.0, "review_text": "The Fast and Furious franchise has, since quite a few movies back, abandoned all pretense of being anything but silly, unrealistic, action extravaganzas. That means that these movies are not to everyone’s taste (which no movies really are for that matter) but it seems a lot of those people have watched this movie anyway and then pretends to be surprised.\r\n\r\nThose who give this movie one star ratings have obviously never seen a real one star movie and those asshats that start their review with “I left after xx minutes” are just trolls. If you have not watched the movie, all of it, don’t write a bloody “review”.\r\n\r\nTo me this movie was pretty much what I expected. Perhaps even a bit more silly and over the top than the previous ones, not that this was much of a surprise, but still more or less what I expected.\r\n\r\nIt has a half decent, quite predictable, story that’s just good enough to tie the action sequences together. I do whish stupid Hollywood writers that probably never finished basic school would stop write stories with their favorite “device yyy which can take over all electronics” bullshit in them. Apart from being total scientific nonsense it is really, really overused.\r\n\r\nVin Diesel is Vin Diesel. I cannot remember many, if any, movies where I have not liked his character. His team is pretty likable as well although some of their silly shenanigans and ramblings was indeed a bit tiresome from time to time.\r\n\r\nThe core of the movie is of course the action and special effects. Sure, they are incredibly over the top and for the most of the time you have to put your brain in idle when watching them but if you, like me, like special effects this is a movie for you. The silly scene where the bad guys “tank train” flipped over was a bit too much for me as well but on the whole I enjoyed the action.\r\n\r\nI was not too thrilled with all the flashbacks but then I almost never like flashbacks and there was plenty of them in this movie.\r\n\r\nI would have liked Chipher to have a bigger role in the movie. She is cool as well as intelligent which is not something that really could be said about Dom’s brother. The main bad guy was just a jerk and not very charismatic. Hollywood really seems to have a problem writing good bad guys lately.\r\n\r\nOverall, this was some well spent almost two and a half hours (I watched the directors cut). I quite enjoyed this movie.", "created_at": "2021-12-20T16:35:13.445Z"}, {"movie_id": 385128, "review_id": "6240b2a0dd83fa008a51a10d", "rating": 6.0, "review_text": "Well they did sub-title this a \"saga\", but I wasn't quite expecting something this poor. Things didn't auger well when the cinema screen broke down and we were turfed out after thirty minutes. Next week, back for part two - complete with \"an opportunity to refresh our memories\" as the cinema lad put it... Sadly, though, the first half hour provides us with easily the most entertaining elements of this otherwise weak story bereft of just about everything bar some super stunts/visual effects and Charlize Theron locked up in a plastic cage. There is some effort made to create some characters, and Vin Diesel does bring a certain degree of charisma to the screen, but after an initial flurry of decent motor sport action, we drop from a great height into a family revenge/melodrama that has only one, entirely predictable, conclusion. It is a piece of harmless escapism that serves to divert us from reality for an extremely overlong 2 hrs and 20 minutes but this franchise really misses Paul Walker and although I'm sure nobody will listen, this is not much of a testament to his memory and ought to be the last unless someone is going to revamp the concept thoroughly and invest in solid stories and characters to compliment the endless, and increasingly sterile, visuals. I want one of those planes, though....", "created_at": "2022-03-27T18:53:20.676Z"}, {"movie_id": 385128, "review_id": "631385e3564ec700915d162a", "rating": 1.0, "review_text": "You know a franchise has run out of ideas when it sends its characters to space. \"As long as we obey the laws of physics, then we'll be fine,\" Tej Parker (Ludacris) tells Roman Pearce (Tyrese Gibson) as the two prepare to literally drive a car offworld — an odd statement, considering it might be the first time in nine movies that they even acknowledge physics and the laws that govern it.\r\n\r\nF9 is no exception. Right off the bat, Roman finds himself in a predicament that even Wile E. would find preposterous. Following a miraculous escape, Roman begins to suspect what Cipher (Charlize Theron) seems to already know; that they are all characters in an action movie. Sadly, the film doesn't pursue this direction which would be far more interesting than the Long Lost Brother tale it settles for.\r\n\r\nIt turns out that Dom Toretto (Vin Diesel) has a brother, Jakob (John Cena). Like the laws of physics, Dom had never let on that this brother ever even existed. Thus, we get a series of expository flashbacks to provide some background for this new character; you know, so that it doesn’t appear as if they just pulled him out of fucking nowehere.\r\n\r\nThese trips down amnesia lane are what truly sinks the movie. F9 uses the format popularized by The Godfather Part II, in which Al Pacino plays Michael Corleone in the 'present' and Robert De Niro plays Vito Corleone in extended flashbacks.\r\n\r\nNow, Diesel and Cena are no Pacino or De Niro, but they are two unique individuals endowed with clearly defined personalities and who happen to ooze charisma and self-confidence. In comparison, the actors who play their younger versions are such non-entities that they almost make a good case for digital de-aging (almost). As a result of this, F9 loses all the momentum it has gathered in the contemporary scenes every time it looks back.\r\n\r\nMoreover, Cena is too obviously a Red Herring; there's a reason he played a 'heroic' character in WWE for roughly 15 years, and it's because he couldn't be a convincing villain even if his life depended on it.\r\n\r\nMeanwhile, skilled performers like Kurt Russell, Shea Whigham, Michael Rooker, and Helen Mirror are wasted in peripheral roles (not to mention Theron, who spends most of her screen time literally locked inside a transparent box, leaving us to wonder what she does when she has to go to the bathroom), the filmmakers seemingly operating under the impression that they must perforce make room for each and every character who has ever made an appearance at some point in the series.\r\n\r\nApart from those already mentioned, we briefly see Lucas Black, Don Omar, Bow Wow, Jason Tobin, Gal Gadot, and Jason Statham in a cameo during the closing credits (unseen by me because once the credits roll, I’m outta there). About the only exception is of course Paul Walker (but not, as one might have reasonably expected, the one who had supposedly died in an explosion in a previous installment), whose character, from what we hear, has been reduced to babysitting Dom's son and his own. Is that the true Fate of the Furious?", "created_at": "2022-09-03T16:50:43.343Z"}]