[{"movie_id": 602269, "review_id": "601070f70816c700417eac18", "rating": null, "review_text": "Academy Award Winners Denzel Washington, Jared Leto, and Remi Malik star in the new thriller “The Little Things” and combine to make very gripping and memorable performances.\r\n\r\nThe script was reportedly written over thirty years ago by John Lee Hancock who has gone on to write, direct, and produce multiple films of note in the decades since he first created the screenplay.\r\nThe film is set in 1990 and involves a cop named Joe Deacon (Denzel Washington), who travels from his small California town to Los Angeles to get information on a suspect.\r\n\r\nJoe has a history in L.A as he used to be a homicide detective for the department which combined with his meltdown while obsessing over a murder case has caused him more than a bit of notoriety.\r\n\r\nJim Baxter (Remi Malik) is the hotshot new Detective who has been leading the investigation into a string of unsolved murders. Joe accompanies Jim to a new crime scene and notes some similarities with his unsolved case.  Joe takes some personal days and begins to do some legwork on the case and reports his findings to Jim which causes Joe to remember aspects of what drove him to his marital, health, and career issues as he is unable and unwilling to let the case drop.\r\n\r\nWhen a prime suspect no longer fits into the picture; suspicions fall on a crime enthusiast named Albert (Jared Leto) who seems to check all the boxes but is also taking delight in winding up Joe which causes Jim to question if he is a viable suspect or just an oddball who gets off on crimes and winding up the cops but does not actually commit any offenses.\r\n\r\nAs the delicate dance unfolds between the characters the fact that this is an era before Cell Phones, DNA tests, GPS, and elaborate computer networks helps underscore the plight of the officers. If the film was set in a modern setting much of the suspense and uncertainty of the story and characters would be moot thanks to technology. \r\n\r\nAs the game of cat and mouse unfolds between the characters Jim learns how a person can become obsessed with a case and Joe attempts to mentor him from the success and failures of his life which includes some gray areas.\r\nAside from the strong performances and engaging story what makes “The Little Things” work is that it is a film that does not take the Hollywood fallbacks of extended gunfights, car chases, and over the top action scenes. What it does show is real and flawed characters that are doing what they think are right and does not attempt to wrap things up nice and tidy.\r\n\r\nThe film uses the element of doubt to not only drive the story but the actions of the characters which underscores that an element of uncertainty exists in some investigations and in with the resources available to police at the time; things are not always certain.\r\n\r\nThe film will appear in cinemas and HBO Max and is a compelling and well-crafted thriller that is not to be missed.\r\n\r\n4.5 stars out of 5", "created_at": "2021-01-26T19:43:51.708Z"}, {"movie_id": 602269, "review_id": "6015d7951511aa0041540b4c", "rating": null, "review_text": "Okay movie made watchable thanks to Washington, Malek and to some extent Leto. Is a bit slow so does take a bit of patience to get to the end, but it's worth checking out. In addition, this is a movie that deserves the straight-to-streaming treatment and not pay to see in theaters. **3.0/5**", "created_at": "2021-01-30T22:03:01.665Z"}, {"movie_id": 602269, "review_id": "601f80080e597b003ea1b4cb", "rating": 4.0, "review_text": "'The Little Things' is a diversion - not the worst way to kill two hours, and definitely a movie with some people in it. It's a shame there isn't more to recommend about it.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-little-things-three-oscar-winners-one-so-so-mystery", "created_at": "2021-02-07T05:52:08.588Z"}, {"movie_id": 602269, "review_id": "6046f8d370b44400459c4d41", "rating": null, "review_text": "“The Little Things” is such a by-the-book police procedural drama that the film doesn’t stand out much. It could be just another season of “True Detective,” or could run together in your memory with dozens of similar crime movies from the last 30 years. The story is familiar, but the ridiculous amount of talent from the Oscar winning cast helps to slightly elevate this routine material.\r\n\r\nVeteran sheriff Joe Deacon (Denzel Washington) teams up with police Sergeant Jim Baxter (Rami Malek) to search for a serial killer who’s murdering women in the Los Angeles area. With the body count rising, the men begin to focus on a suspect named Albert (Jared Leto), a disturbing and unbalanced man who enjoys toying with the cops. The men go to great lengths to uncover the guilty party, but the investigation brings up a dark history that uncovers some of Deacon’s long-buried secrets.\r\n\r\nIn terms of psychological crime thrillers, there’s nothing new here. The plot is uncomplicated and direct, and even the surprise reveal isn’t unexpected. Washington is the ideal casting choice as Deacon. He’s a reliable old timer, and there aren’t many actors like him who are working today. He plays well against Malik’s understated brooding, and both are no match for Leto. He’s great at creating crazed psychopath characters, selling the role as an unhinged killer right down to the most intimidating physical mannerisms. The cast is the film’s strongest point.\r\n\r\nDirector John Lee Hancock makes the awful choice to score scenes with 60’s rock and roll, which is almost as off-putting as the distracting, choppy editing. There are depictions of crime scenes that are gruesome and distressing, giving the film an unsettling vibe. The overall atmosphere is unpleasant, and the film ultimately feels pointless.\r\n\r\n“The Little Things” isn’t a total dud by any means, but it’s not one of the best examples of the genre. The screenplay (by Hancock) is written for those who enjoy disciplined crime dramas, and it should satisfy fans who aren’t expecting too much.\r\n\r\nBy: Louisa Moore", "created_at": "2021-03-09T04:25:55.309Z"}, {"movie_id": 602269, "review_id": "6069cf7ed3d3870059c7180e", "rating": 4.0, "review_text": "Good actors. Ok pacing. Storyline somewhat disjointed and unbelieveable at times. Poor ending.", "created_at": "2021-04-04T14:38:54.552Z"}, {"movie_id": 602269, "review_id": "6165b4343a99370043eb094e", "rating": 3.0, "review_text": "Boasting some of the worst editing of the last couple of years, John Lee Hancock (The Highwaymen) delivers a Se7en's copycat narrative that lacks the overall interest and impact of the classic film. Despite good performances from the (type)cast, the supposedly mysterious, suspenseful story surrounding a serial killer is just another variation of the same formula people have seen hundreds of times.\r\n\r\nCharacters, relationships, and plot points are far from compelling, making the whole movie feel extremely forced and somewhat predictable. With no surprise factor and zero innovative developments, the overextended runtime simply becomes heavier and heavier...\r\n\r\nAn utter waste of remarkable actors.\r\n\r\nRating: D", "created_at": "2021-10-12T16:13:40.179Z"}, {"movie_id": 602269, "review_id": "62418e9e3e09f30047f9f69a", "rating": 6.0, "review_text": "I was quite intrigued by the trailer for this. Somehow, though, they seem to have managed to squash all that's interesting about the film into it... It reminded me a great deal of \"Se7en\" (1995) with Denzel Washington \"Deke\" a former detective with a history that resulted in him being relegated to a rural uniformed role. He is despatched to the big city to collect some evidence whereupon he becomes embroiled in an investigation led by the cocky \"Baxter\" (a rather wooden Rami Malek) into a series of brutal killings. The title of the film is the gist of Washington's character - he is methodical and detailed in his methods, and together this unlikely alliance starts to bear fruit - they get their suspect, but he (Jared Leto) is no fool, and soon the game of cat and mouse leaves us uncertain as to whom is pulling who's strings. The first half-hour is quite well structured and effective, we get a sense of the mystery and the two stars gel quite well together. The second hour of the film, though, is really pretty poor with an ending that I felt really let the whole thing down. Any semblance of plausibility is sacrificed, almost as if director John Lee Hancock felt he was running out of time so had to cram too much into the closing stages - and so we are left with a hastily cobbled together conclusion that really underwhelms. Not a film you need bother seeing in the cinema - it is bound to be on a streaming service shortly to help you kill 2 hours.", "created_at": "2022-03-28T10:31:58.908Z"}, {"movie_id": 602269, "review_id": "640fb9202a09bc00c52e5d7b", "rating": 6.0, "review_text": "It is a movie full of Oscar stars. The story of the movie is the presence of a serial killer and the investigators' attempt to find this killer. If you are interested in investigation films in the 1990s, especially Seven, you will find that the events of the movie are similar to these steps that were in this movie.\r\nThis movie was written in the 90's and was to be directed by Steven Spielber. I liked the movie, although some might think that there were clips that were long and boring to the extreme, and this proved to attract viewers until the end.\r\nWhat I liked the most about the movie is Jared Leto, although his scenes were few compared to Denzel Washington and Rami Malek. It is what prompted me to admire this movie and continue watching the movie until the end. The performance of Denzel Washington and Rami Malek was frustrating. They were not investigative. The way they monitored Jared Leto makes you think that they are not highly experienced investigators. The surveillance was primitive and superficial.\r\nThere was no reason for Jim (Rami Malek) to get into the car with Albert Sparma. Also, the compatibility and chemistry between Denzel Washington and Rami Malek was completely non-existent.\r\nThe cinematography was great and brought back the 90's, while the editing was bad", "created_at": "2023-03-14T00:00:32.530Z"}, {"movie_id": 602269, "review_id": "65475a9e2866fa0138a75083", "rating": null, "review_text": "_The Little Things_ is a suspenseful crime thriller with great performances by Denzel Washington and Jared Leto. The film keeps viewers engaged with its tense atmosphere and well-executed twists and turns. However, the plot can be somewhat unrealistic at times, with certain aspects feeling contrived or far-fetched. Despite this, the movie's strong performances and gripping story make it a worthwhile watch for fans of the genre.", "created_at": "2023-11-05T09:04:30.290Z"}]