[{"movie_id": 340676, "review_id": "5760b5b09251410d11000a69", "rating": null, "review_text": "\"A lonely existence tormented by distant voices is examined in Olivier Assayas’ Personal Shopper, a moody, occasionally frustrating, often brilliant study in isolation, grief and disenfranchisement...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2016/6/15/personal-shopper.html", "created_at": "2016-06-15T01:56:00.427Z"}, {"movie_id": 340676, "review_id": "598ca58a9251411078000815", "rating": 4.0, "review_text": "**Texting, shopping and Ghosting!**\r\n\r\nThis film was different. My bad, I did not quite get the title at first. I misunderstood it. I thought it was like a Shopaholic theme, a person with a shopping addiction. Then what I saw was different, and somewhere in the narration it explains what the title meant.\r\n\r\nThe real challenge watching it is the slow moving storyline. Dull and silent on most of the parts. But the mix of fantasy, like supernatural and regular drama brings interesting fact us to stay with it. Though the most of the film was about texting and shopping. I even thought does it any way connected to Stewart's previous film 'Clouds of Sils Maria'. Because there's something where both the films syncs with.\r\n\r\nDespite being a bit boring film, Kristen Stewart is the reason it is watchable. Her performance was good, but again the mystery about the unexplainable things holds us as well. Definitely a watchable film, but not an entertaining film that you are looking for on a weekend. I'm not sure who is the target audience, but surely less people will think it is a fine film. So I hope you choose it carefully.\r\n\r\n_4/10_", "created_at": "2017-08-10T18:27:22.724Z"}, {"movie_id": 340676, "review_id": "5ec92ec7d2147c0022bbfa2b", "rating": 7.0, "review_text": "Well ... How's within that, that the soul ... continues to exist ... after death? \r\n\r\nPersonal Shopper is written and directed by Olivier Assayas. It stars Kristen Stewart, Lars Eidinger, Sigrid Bouaziz, Anders Danielsen Lie, Ty Olwin and Hammou Graïa. Cinematography is by Yorick Le Saux.\r\n\r\nA personal shopper in Paris refuses to leave the city until she makes contact with her twin brother who previously died there. Her life becomes more complicated when a mysterious person starts to contact her via text messages.\r\n\r\nPersonal Shopper is a film that's impossible to recommend with any confidence, even if I personally liked it well enough. It was booed on first showing at Cannes, yet upon the second main screen viewing of it, it got a five minute standing ovation. If you look at the reviews on sites such as IMDb you will see plenty of 1/10 reviews mixed with high scoring ones, evidence of the divisive nature of Assayas' picture. A lot of people went into it expecting a \"Paranormal Activity\" type of film, but it's far from that. \r\n\r\nIt's a meditation on grief and the complexities of the mind and the human condition under duress. Stewart gives her all for the director, a real bravura performance. Yes, the ending is either going to make or break your faith in what you have just witnessed, but if you buy into, and think about the narrative's trajectory, this has haunting and ethereal rewards. 7/10", "created_at": "2020-05-23T14:10:15.105Z"}]