[{"movie_id": 1016084, "review_id": "653160f26f8d9500ea58b05a", "rating": 7.0, "review_text": "Matt Johnson's rather John McEnroe-esque \"Doug\" rather stole this tale of what was literally a tech-tonic shift in how we used our mobile phones. He, together with his boss Mike (Jay Baruchel), has been working with a small team of geeks to develop a mobile word processor that can send messages by text and email. It's funding they lack and it's during a fairly flawed presentation that they encounter \"Jim\" (Glenn Howerton), a savvy operator who knows just enough about the business to get them that elusive big deal. Thing is, they don't think they have the processing capacity to service this ever increasing share of the market even if their new pal is generating eye-watering business opportunities. A 46% market share of what became the exponentially burgeoning smartphone market offered them real potential to dominate for years - but history tells us just what did happen. This film benefits from not really having a big star at the helm. The three men juggle the pressures, successes and failures delivering a solid and at times quite funny story of the rise and falls of a company that, when faced with difficulties, resorted to an emergency movie night! It doesn't shy away from depicting some of the sharper practices at play in this supremely competitive business, but it delivers in a far less aggressive fashion. Maybe it's a Canadian thing, but I found myself actually wanting them to succeed (even if I actually ended up loathing my own \"Crackberry\"). So many of these true stories are based on characters seeking easy money - this is based on a pair of guys who actually made something; and something that set a benchmark for kit we all use across the world without a second thought nowadays. Enjoyable to watch and worth two hours of your time.", "created_at": "2023-10-19T17:01:38.115Z"}, {"movie_id": 1016084, "review_id": "6544de251ac29200e1198827", "rating": null, "review_text": "“Blackberry” is a film about the failure and spectacular collapse of the world’s first smart phone. Adapting Jacquie McNish and Sean Silcoff’s book “Losing the Signal: The Untold Story Behind the Extraordinary Rise and Spectacular Fall of BlackBerry” for the screen, director Matt Johnson creates an entertaining look at contemporary history with his tale of the rise and fall of a revolutionary gadget that changed the world forever.\r\n\r\nIn this unconventional story of modern business failure at the hands of fraud and greed, the film tells the history of Mike Lazaridis (Jay Baruchel) and Jim Balsillie (Glenn Howerton), the two men responsible for the creation and marketing of the BlackBerry smart phone. It was one of the first of its kind, featuring a pocket device (with a keyboard) that could be used for calls, texts and e-mail messaging. It was a revolutionary idea that was dismissed by many of the major players, until Balsillie saw a massive opportunity in the product and the nerdy co-founders of the company. Lazaridis and his partner Doug (Johnson) lacked business savvy and the know-how to deal with the sharks who dominated the world of corporate technology, and Balsillie became the pitbull they needed to whip the business into shape and bring in the discipline needed to run a tight, successful company.\r\n\r\nThe film takes viewers through the BlackBerry timeline from concept to eventual defeat, starting in 1996 up until 2016. The mid-nineties seems like a time that was so far away, but it wasn’t that long ago. (Being transported back to a world without a smart phone in every pocket is nearly unimaginable nowadays). The film has a retro look and feel that’s very corporate and drab, which is a great fit for the material, and Johnson’s storytelling is comprehensive but always entertaining, with a good mix of business-oriented drama and light comedy.\r\n\r\nThe most interesting parts of the story are when PalmPilot CEO Carl Yankowski (Cary Elwes) hints at a hostile takeover, but Balsillie outthinks him by launching a grassroots marketing campaign that made the Blackberry a highly sought after status symbol. He saved the company, which makes for an eventual bittersweet demise. On the other hand, he also directly led to its end with some shady stock manipulation that got him in trouble with the SEC.\r\n\r\nThe film is well cast with standout work from Baruchel, especially when he begins to crack with the realization that Apple is getting ready to kill his invention and his company with their upcoming iPhone, a product with the highest consumer interest of any item in history. The characters are flawed human beings (and in the case of Balsillie, a total jerk), but they aren’t impossible to root for.\r\n\r\nUltimately a reflection on failure, “BlackBerry” is an interesting and fun film about the competitiveness of Silicon Valley and the men who made some massive mistakes on their journey to the top. Their position at the highest rung of the tech world was brief, crippled by the innovators at Apple.\r\n\r\nBy: Louisa Moore", "created_at": "2023-11-03T11:48:53.613Z"}, {"movie_id": 1016084, "review_id": "6592514fa58902732d95f2c2", "rating": 4.0, "review_text": "The script seems to be written mostly from the perspective of Jim Balsillie, a businessman that was co-CEO of Blackberry, while engineers take a backseat. This follows the general tendency in film to glorify businessmen, treating the people who actually conceptualize, design and implement the products (i.e., do the core work that is societally useful) as mere sidekicks.\r\n\r\nThe general timeline is right and many of the major events in the history of Blackberry are there, but none are described in enough detail for viewers to appreciate the engineering successes that led to Blackberry rising to global prominence, nor the business mismanagement that tanked it.\r\n\r\nThe engineering details that made it in are often confused or misleading (e.g., Blackberry did not invent push messaging, and their prototype wasn't pulled from thin air overnight). It gives the impression most of the source material came from interviews with non-technical people, or else \"Great Man\" personality drama was the only material the filmmakers understood well enough to put in a script.\r\n\r\nThe film has confusingly mixed messaging. It perpetuates the notion that engineers are tinkering children that get nothing done without big daddy managers pushing them to work long hours and \"just make it work\", damn the technical details! Yet it repeatedly also tries to show the businessmen as hustlers that use bluster and hand waving to cover up their general uselessness and technical incompetence, as well as the resulting harmful decisions they make that ultimately resulted in the downfall of Blackberry. Perhaps the writers wanted to portray Balsillie as a clever shark, but based on his actions in the film alone you would think he was largely a egomaniacal leech that the meek engineers could not figure out how to get rid of. Indeed it is unclear why the engineers brought him on to begin with - they probably would have been better off without him and the other businessmen he brought on.", "created_at": "2024-01-01T05:44:47.298Z"}, {"movie_id": 1016084, "review_id": "6597611fed96bc65abf77134", "rating": 6.0, "review_text": "I kept hearing people say this movie was actually not bad for a movie about BalckBerry, and you know what, they were right! Glenn Howerton plays an incredibly entertaining psycho as always. Jay Baruchel does the befuddled muppet thing with aplomb. And then the doofus sidekick guy who's actually more insightful than others give him credit for also does a good job. It's an easy mindless entertainment watch. Spoiler alert, the company does really well then it doesn't.", "created_at": "2024-01-05T01:53:35.202Z"}]