[{"movie_id": 2770, "review_id": "5e21da5d8f26bc001174572c", "rating": 5.0, "review_text": "American Pie 2 doubles the amount of crude toppings but lessens the characterised filling. A sex comedy can only be pushed so far before it miraculously transfers to soft-core pornographic territory. The original American Pie, whilst an influential milestone in the sub-genre, was a satirical take on high-school life by hyperbolising the quest for losing one’s virginity. How would Rogers and Herz continue the saga? Well, shoving a trumpet up one’s filthy anus, using super-glue instead of lubricant during an awkward masturbation sequence and the longest “lesbian” endeavour ever. Suffice to say, the misadventures of these four friends do not retain the freshness of the original. After their freshmen year at college, the boys regroup for a party held by Stifler at a rented beach home, where they intend to spend the summer getting laid and participating in cringe-inducing phone sex (twice!).\r\n\r\nThe cast are back, ready to precariously thrust beds, the tainted air and Stifler’s mother in a luxurious car (no pie though...). Yes, the aroma of crusty semen and raging hormones plague the summer season. Whilst that may be sufficient comedy for fans of the original, there’s no saucy masquerading of the narrative structure. It’s a complete retread of its predecessor. Almost identical! The characters go through the exact same scenarios, only heightened by a writer who clearly couldn’t produce any enticing material. The equivalent of an adult magazine. Used once, thrown away shortly afterwards.\r\n\r\nThe elongated and repetitive scenes of comedy, while slightly funny initially, tire themselves by never ending. The “lesbians” persuading the guys to play with each other? That was essentially thirty minutes of the runtime, and as a homosexual, horrible to endure. God bless Hannigan though for stepping up her game, she was an absolute delight with an equal balance of comedic timing and heartfelt peculiarity. The remaining cast members, aside from Reid who was predicting her ‘Sharknado’ future, all performed consistently as expected. And by that, I mean with the overwhelming smell of mediocrity. I do not want to see Klein touch himself again whilst talking provocatively on a phone! The padding in the pants was too much *starts to heave*.\r\n\r\nOh, and the lack of basic mathematic knowledge. Right, simple arithmetics here, the whole “Rule of 3” scenario. Pens and paper and the ready, please. If Kevin stated he slept with three girls, and this “Rule of 3” means you divide the number by three, how many did he actually sleep with? Take your time now...! Got it? Well, the result is not zero. It’s one. Why the hell are these college students objectively stating the answer to be zero? Are they mad? Fine, Vicky isn’t the sharpest tool in the shed, but Kevin? C’mon man. Arithmetics! Of course, it isn’t an American Pie film without the alternative rock soundtrack. Blink-182, Sum 41, Green Day and Alien Ant Farm all make an appearance and give life to the teen angst shown on screen.\r\n\r\nJust a shame this sequel gave me unnecessary angst for never surpassing the original’s hilarity. If you adored its predecessor and appreciated its exaggerated satire, then this sequel will only be viewed as watchable. If you just want crude comedy and are content with elongated phone sex sequences, by all means give this second pie a taste. It’s not piping hot, but lukewarm at best.", "created_at": "2020-01-17T16:01:33.530Z"}, {"movie_id": 2770, "review_id": "643c332cda10f01bd764e74f", "rating": 7.0, "review_text": "Everything and everybody are all apart in part 2. It's funny as hell but not the same chemistry as the 1st.", "created_at": "2023-04-16T17:41:00.103Z"}]