[{"movie_id": 122917, "review_id": "54d554eec3a3683b950001dd", "rating": 5.0, "review_text": "As there was not much more to be told from the end of the previous movie, just assist to more than 2h of continuous battle.\r\n\r\nQuite pointless, but you may enjoy the action if that is what you were looking for ...", "created_at": "2015-02-06T23:57:34.571Z"}, {"movie_id": 122917, "review_id": "5a50f6ef0e0a26026f00c1bc", "rating": 9.0, "review_text": "The Lord of The Rings are still occupying the three top places of my top ten movies list. Needless to say I am a fan of Tolkien and his Middle Earth fantasy story. I never felt that The Hobbit series could match the original trilogy but then much of the story in The Hobbit is not really Tolkien’s but produced by Hollywood scriptwriters to embellish the story enough to fill three movies. It is not a bad attempt by any means (for being a Hollywood one) but it does not really reach the heights of The Lord of The Rings.\n\nStill, I quite liked these movies. They are good adventure, fantasy, special effects movies. Thus it saddened me when I went to IMDb and the first things I saw was a bunch of people shouting crap and giving it one star reviews. That is just so much rubbish. This is the third movie and it is not vastly different from the others. If you disliked the first ones so much why go and see this one? Also, the harping about not following the book. At this point that is a nonsense argument. It was fairly obvious that it was not going to follow the book in detail when it was announced that there were going to be three movies and if you did not get it then then you should have gotten it from the other two movies. One star ratings looks more like trolling to me.\n\nAnyway, back to the movie itself. I definitely liked this movie better than the second one. It was on par with the first one for me. There was less silly stuff, less stuff that just felt like fillers and the special effects were generally good.\n\nThe story and the implementation is, as I wrote, less filled with fillers as the last movie. At least from my point of view. Still though, the story is not at all up to the standard of the original Tolkien works. It shows that it is a Hollywood product that favors effects and quantity before depth and quality. The battle at the end was epic but at the same time somewhat nonsensical in how people ran back and forth clobbering people and beasts right left and center. I did quite like the ramming troll though.\n\nI have to say that I did not like that weasel Alfrid. Sure he was meant to be disliked but he got tiresome rather quickly. He could have been left out after being pushed into the water as far as I am concerned. After that I just got annoyed every time he appeared and I got especially annoyed by the fact that everyone, even Gandalf, seemed to trust him to actually do what he was told. I was hoping all the way to the finishing scenes that he would meet a gruesome end.\n\nOn the whole I definitely liked this movie. It had a “Tolkienesque” athmosphere, decent acting, decent story and loads and loads of special effects. Even though it does not reach the heights of The Lord of The Rings it is definitely great entertainment for the fantasy, not to mention special effects, lovers.", "created_at": "2018-01-06T16:18:55.469Z"}, {"movie_id": 122917, "review_id": "5c448042c3a3681a1124e058", "rating": 5.0, "review_text": "Comparing the _Lord of the Rings_ trilogy and the _Hobbit_ trilogy was already like comparing apples and mediocre oranges, but none so mediocre as _Battle of the Five Armies_. Don't get me wrong, I love a \"battle\" as much as the next guy, more maybe, I don't even mind a movie that's 95% battle, but in this? It does. Not. Work.\r\n\r\n_Five Armies_ is a movie that never made it out of pre-viz, let alone to a polished, well-rounded, final cut. I enjoy it to some degree when running through a Middle-Earth marathon as a whole, but only when the group I'm with will let me roll my eyes and complain about it.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-01-20T14:05:54.128Z"}, {"movie_id": 122917, "review_id": "6033294620ecaf003d17ff8e", "rating": 7.0, "review_text": "Exactly what it says on the tin - to a fault.\r\n\r\nDon't get me wrong, I like it. However, towards the end <em>'The Hobbit: The Battle of the Five Armies'</em> definitely begins to drag quite heavily - the impact of what eventually happens did not, to be honest, hit as strongly as it could've/should've. The pure action is good, but there's not much to remember about everything else.\r\n\r\nNone of the characters, with the exception of Richard Armitage (Thorin) and Luke Evans (Bard) I guess, stand out amidst the wall-to-wall battle. Martin Freeman (Bilb), Ian McKellen (Gandalf) & Co. are are of little importance really, which is a shame.\r\n\r\n<em>'The Hobbit'</em> series, unfortunately, gets inferior as it goes by. Loved the first film, enjoyed the second but this third installment - while passable - leaves me with a feeling of wanting something else from it. Happy to have watched them though, I'd still recommend them for sure.", "created_at": "2021-02-22T03:47:18.637Z"}]