[{"movie_id": 68721, "review_id": "58ac47a1c3a36849e0012c9a", "rating": 5.0, "review_text": "There can be many reasons why the original director of a franchise may decide not to return for a sequel, though they all usually have in common that they're very Hollywood-politically-correct. So exactly why Jon Favreau decided not to helm the third instalment of what is, for all intents and purposes, 'his baby' Iron Man, I can't be sure. But I can tell you one thing: something definitely changed.\r\n\r\nEverything about IM3 feels different from its predecessors. The atmosphere is darker, which is not to say it's really just a lot less humorous (which is – let's be honest – precisely what we love about Iron Man). The new characters are terribly underdeveloped and overall it's just a great deal less interesting. The storyline was completely vague to me; I'm still not really sure what the whole point of it was. And probably the biggest flaw of all – the first two films had really cool, interesting villains. This one's just really quite weird and not charismatic at all. Possibly at the core of the problem is the fact that it wasn't just one bad guy, it was many. The leading roles are shared by Guy Pearce and Sir Ben Kingsley, and – big shock – it was the latter who disappointed me the most. Not only was his role quite small, I thought it was also incredibly lame. I'd love to explain to you why, but that would be a major spoiler. I noticed some people in the audience laughing at the plot twist of Kingsley's character, but I thought it was just completely stupid and weak, and a total waste of such a great actor. Pearce is not bad, but never really manages to elevate his villain to a higher level, largely because he had zero character development to work with. Same thing with Rebecca Hall. Or the rest of Pearce's cronies for that matter... Too many to count. Sigh.\r\n\r\nWell, at least we still have Robert Downey Jr. He's as reliable as ever when it comes to carrying a film, but even he can't help it that his character is almost boring in this one. Where's the humour!? Where's the cynicism we all know and love?! Where's Tony bloody Stark! This is not the familiar overconfident, pompous macho we adore. All of a sudden, and for NO apparent reason whatsoever, this guy is insecure and suffering from anxiety attacks! What the F! Not to mention the fact that his superhero alter ego is almost completely absent for half of the film, because he's off somewhere in the middle of Tennessee finding himself or whatever... I mean, geez... I know the director left, but didn't any of the screenwriters return either? The fact that Pepper Potts had only about two minutes of relevant screen time also certainly didn't help. And when she was there, she was humourless and annoying. Big sigh.\r\n\r\nThe more I think about it, the more I'm having a hard time trying to think of good things to say about this film. At least the visual effects were solid, and the sound effects were awesome.\r\n\r\nThis was actually the first time I've seen a film in 3D. I've always avoided it because I was sure that it would be a complete distraction from the story. Turns out I was right in my assumption. I found it hard to focus on what was really going on, and this might have definitely been an influence in trying to follow the plot, so there's a big chance I missed a few things. Nevertheless, I can't help being very disappointed with Iron Man 3, especially since I love the first two so much.\r\n\r\nThis is definitely a filmmakers' case of \"could've, would've, should've\". They obviously tried very hard, but never quite manage to get there.\r\n\r\nNo story, no interesting characters, no filler. Nothing. Too bad.\r\n_(June 2013)_", "created_at": "2017-02-21T13:58:57.314Z"}, {"movie_id": 68721, "review_id": "596199589251410b860cc5ef", "rating": 2.0, "review_text": "This was probably the first time a movie has made me this angry in the theater.  It pissed me off then and it still pisses me off when it's on television.  If I could summarize this film in one word, it would be: obnoxious.  I wasn't really hyped for this film but I was expecting to have some fun since I did enjoy the previous Iron Man films.  This was the movie that made me start to dislike the character of Tony Stark/Iron Man (RDJ is still the man though).  Stark's narcissism had charm in the previous films but here, it made him into a complete idiot, dick, and coward. The Mandarin had potential to be an effective villain but the movie scraps him for a more lame villain than Justin Hammer from Iron Man 2.  The comedy was forced and annoying and the story has plot holes that were distracting.  I watched Thor 2 a while after this released but the taste from this movie was so bitter that even though I thought Thor 2 was alright, I just didn't want to see anymore films from this cinematic universe.  This movie is what killed the MCU for me.", "created_at": "2017-07-09T02:47:52.522Z"}, {"movie_id": 68721, "review_id": "5a6a3c789251412255003272", "rating": 5.0, "review_text": "I have to say that I was somewhat disappointed by this third instalment of the Iron Man series of movies. Sure Robert Downey Jr. as Tony Stark is quite funny (not always but a lot of the time) and there are plenty of nice special effects and things being blown up.\r\n\r\nHowever, the story is just crap. The premise of Killian using the Mandarin for terrorism to cover up the fact that his experiments occasionally fails is just ludicrous. The Mandarin himself is a joke and another good example of how ignorant script writers just pick names out of existing material and uses them not caring how much they screw up established characters and world building already done. Whoever wrote this script should be ashamed of himself.\r\n\r\nWhat is worse, the entire movie is very anti-Iron-Man. It starts right of with Stark being obsessed by his Iron Man suits and a lot of harping about him stopping being Iron Man. Most of the time Stark is running around without his suit and the few times he is in it then the suit does not work properly or is shot off him almost immediately. Actually, most of Stark’s cool stuff is just shot to hell most of the time. \r\n\r\nThe end is full of fireworks but again, it is mostly a display in how you can destroy Iron Man suits and some more anti-Iron-Man crap.\r\n\r\nI cannot say that I did not enjoy watching the fireworks and special effects but as a whole I am disappointed with this movie.", "created_at": "2018-01-25T20:22:16.303Z"}, {"movie_id": 68721, "review_id": "5b166e99925141782b0121ec", "rating": 7.0, "review_text": "**A long form review originally posted in 2013**\r\n\r\n_Iron Man 3_ brings us into the so called “Phase 2” of the Marvel Cinematic Universe. But it does so in a flawed way. I’ve said it before and reiterate it here, there is no such thing as a perfect film. But since _The Avengers_ set the bar so very high, following that up proved to simply be too much for Black’s entry to handle.\r\n\r\nThere are a great deal of inconstancies, plot holes, stupid moves, illogical choices, and weak moments (though less than much of the internet would have you believe). These issues are not enough to lead to _Iron Man 3’s_ complete and utter downfall, but they do force a sour taste into the piece overall.\r\n\r\nThis isn’t to say it’s a bad movie though. In fact it’s actually quite good. It surpasses the quality of _Iron Man 2_ and plants itself firmly in the MCU rather successfully. A move which only _The Incredible Hulk_ failed to make, but still. Yes it has its problems, yes we’d hoped for better, and yes I’ve got complaints, but the movie is not at all a failure. Manages to come full circle in a way that still leaves Tony Stark & Iron Man a future in the Marvel Universe.\r\n\r\nShane Black and Drew Pearce manage to bring in a sense of vulnerability that was barely touched on in the past MCU works. Even the minuscule Steve Rogers of _Captain America_ seemed in control of every situation. But here we see Tony Stark as not only a breakable man, but a man in general. The most human of any Super Hero appearance in the MCU to date. Yes the Robert Downey Jr. wit that all have come to expect from the piece is still on the table, but in between and beneath that there’s an insomniac with extreme anxiety disorders living separated from the real world, too invested in his work and shattered identity to live as the Stark everyone expects him to still be.\r\n\r\nPepper and Rhodey are even given a chance to pick up the slack. The three form this sort of protagonist trinity, Saving one another in a round-robin Super Hero-y way with a little more depth than I’d expected.\r\n\r\nThe _Iron Man_ movies famously have had the most disappointing bad-guy-show-downs in the genre. And though here Black gives us much more of a delivery on this front than Favreau ever did, the issues I had with _Iron Man 3_ came (almost) exclusively from A.I.M, the Mandarin and Extremis (which form the antagonist trinity now that I think of it).\r\n\r\nSo, we’ve got better a better final confrontation, but from less integral bad guys. A more human hero, stuck in a less human adventure. A better interlocking of characters, with less to do on screen. I could go on with this roller coaster, but that word essentially sums up the film. Not in that its a cliched “thrill ride”, but in that it’s a constant mess of ups and downs, with the final destination just barely justifying the start point.\r\n\r\nSpeaking non-comparitively, _Iron Man 3_ makes a good movie. Not great. But so very, very worth the watch. It’s hard for me to think objectively separate from the other films in the MCU, because I’ve seen them all so many times that there’s no way for me to forget all that’s come before when watching the movie. I’d be interested to hear from somebody who’s watched _Iron Man 3_, but not _Iron Man 1_ & _2_ or _The Avengers_. I’m sure such a person exists somewhere, and if so your input would be greatly appreciated.\r\n\r\nI think I might have made it seem as if I disliked Iron Man 3 more than I actually did. Here’s why. From _Iron Man 2_ until _The Avengers_, I watched all the MCU films in cinemas. After each one, I immediately got that feeling of wanting to go back and watch it again, a feeling that steadily grew as time passed. Each film that Marvel released had me feeling this more strongly than the last, culminating in _The Avengers_ which I saw six times in theatres, and immediately pre-ordered the whole set on Blu-Ray the moment it became available (I bought a PS3 for the sole purpose of watching them). But with _Iron Man 3_ I sort of dropped back to a pretty low interest level once I’d left Hoyts. It seemed that although it was a really good watch, it just didn’t have the staying power I’d come to expect from these incredible Super Hero films.\r\n\r\n67%\r\n\r\n-_Gimly_", "created_at": "2018-06-05T11:06:01.976Z"}, {"movie_id": 68721, "review_id": "5c8426db0e0a2643106327e4", "rating": 8.0, "review_text": "I don't understand the hate for this one. The fact that Tony Stark is barely in the suit makes for an interesting take on analyzing the humanity of the character. I also found the villain plot twist halfway through the movie to be quite clever and surprisingly satisfying.\r\n\r\nIt certainly feels more like a Shane Black movie than an Iron Man movie, but that's a great thing. It shows Marvel is willing to give their filmmakers a voice and the room to take risks in their storytelling. Iron Man 3 is a very risky movie, and to me it paid off.", "created_at": "2019-03-09T20:49:31.426Z"}, {"movie_id": 68721, "review_id": "5eee8e62c86b3a003545a177", "rating": 8.0, "review_text": "When I first saw this in 2013, strongly disliked it but decided to give it another watch during my re-visit of the MCU and... kind of enjoyed it, quite a bit. Still not fond of the twist wasting  a great actor in Ben Kingsley to be a decoy Mandarin and instead having a cheesy one with Guy Pearce's Aldrich Killian and his lame \"I AM THE MANDORIAN!\" line. But all in all, a good step up from Iron Man 2. **3.75/5**", "created_at": "2020-06-20T22:32:02.079Z"}, {"movie_id": 68721, "review_id": "60037a23223e20003db998b0", "rating": 8.0, "review_text": "Very good.\r\n\r\n<em>'Iron Man 3'</em> offers an entertaining 130 minutes. I enjoyed seeing the plot unfold, it isn't anything revolutionarily fresh but it's done in a way that's interesting to watch. The score and effects are great.\r\n\r\nRobert Downey Jr. continues to be a lot of fun as the lead, while Don Cheadle is more enjoyable than he is in <em>'Iron Man 2'</em>. Guy Pearce and Ben Kingsley are good to watch too, the latter amused me more than I thought he would.\r\n\r\nI'd rank this higher than the 2010 sequel, though it's still a fair distance off the original. This 2013 film leaves a positive impression.", "created_at": "2021-01-16T23:43:31.558Z"}, {"movie_id": 68721, "review_id": "611c172ddd2589002d63fb4f", "rating": 5.0, "review_text": "_**Worthwhile, but a bit of a letdown compared to the snappy \"Iron Man 2\"**_\r\n\r\nReleased in 2013, \"Iron Man 3\" stars Robert Downey Jr. as Tony Stark in this third installment where Shellhead takes on the so-called Mandarin (Ben Kingsley) and A.I.M. (Advanced Idea Mechanics), led by Killian (Guy Pearce). After Stark's personal world is destroyed, he is left to survive by relying on his ingenuity and instincts to rise from the ashes and protect those closest to him, like Pepper (Gwyneth Paltrow). In the process Tony seeks to answer a question that has haunted him: Does the suit of armor make the man or does the man make the suit of armor? Don Cheadle and Jon Favreau are on hand as James Rhodes (War Machine) and Happy Hogan respectively while Rebecca Hall plays an agent of A.I.M.\r\n\r\nAfter the absolutely kinetic (and inexplicably criticized) \"Iron Man 2\" this third part of the trilogy is a bit of a letdown. It's a quality superhero movie, but the first act is lethargic compared to the dynamic initial reel of the previous movie. Things pick up in the second act as Stark is separated from his loved ones and presumed dead, forced to team up with a brainiac kid. While some claim that the movie's \"more serious\" than \"Iron Man 2,\" it has the same tone and the same main characters/cast; the amount of \"more seriousness\" is marginal.\r\n\r\nPeople say \"Iron Man 3\" plays better on repeat viewings, so I'll update this review after future viewings. But I was letdown by the lame representation of the Mandarin, the ambiguous powers of the A.I.M. operatives, the myriad Iron Man suits functioning without a person in them and the fact that everyone and their brother dons the Iron Man armor or parts of it. For instance, Pepper morphs into a veritable superheroine at one point. Nevertheless, it's not bad at all and the cast is great with Rebecca Hall and Guy Pearce effective in their roles.\r\n\r\nThe movie runs 130 minutes and was shot North Carolina, Southern California and Miami.\r\n\r\nGRADE: C+", "created_at": "2021-08-17T20:08:13.455Z"}, {"movie_id": 68721, "review_id": "62f85cd5175051007f9033db", "rating": 5.0, "review_text": "**It's a substantially weaker film than its two predecessors.**\r\n\r\nAfter two frankly good films, I was curious to see what this film would bring to the public, who immediately set out to fill the studio's coffers with their tickets money. Marvel has discovered an excellent financial lode by transposing most of its characters to the cinema, and this film is destined to be a box office success, although the quality is much more questionable.\r\n\r\nI'll start with what I usually leave for last: the technical aspects and production values ​​are really excellent and constitute the strongest and most solid point of the film. Directed by Jon Favreau, who has held his chair since the first “Iron Man”, the film has retained most of the crew and core cast, which helps give the trilogy the flavor of a unique work. With a solid bet on more flashy, loud and spectacular action, the film wants to appeal to a young audience that wants something big, where CGI and effects can create authenticity and a sense of danger. The quality of the effects is undeniable, but the excessive action takes a toll on the final set. It looks like a video game, a recurring mistake in these types of movies.\r\n\r\nIn addition, the film has good cinematography, it was beautifully shot, it is sharp, and it has excellent colors and light. The work of the stuntmen is meritorious, yet regularly forgotten in the minds of viewers. The sets and costumes are very good, especially Tony Stark's house and the various armors from the movie. Another word for the soundtrack, by Dwight Yoakim, which proved to be up to the task without, however, proving to be memorable.\r\n\r\nThe cast includes most of the names we already know from the previous two films, with Robert Downey Jr. the most relevant for maintaining the leading role. The actor is good, deserves our credit, and I recognize that he tried to give his character a greater maturity and sense of experience. In this film, Stark is a much more mature, traumatized, tired and even fragile man, and his relationship with Pots has become more formal and firm, causing the former playboy to settle down and carry on a serious love relationship. I understand that this may displease some, but the film seems to take place several years after its predecessor, “Iron Man 2”, and makes mention of several events, in the meantime. With excellent technical work and the use of excellent makeup artists, Ben Kingsley shone in the role he was given and which is clearly one of the best of his recent career. Paltrow and Cheadle also leave us a positive record of his work, although it wasn't as intense as one would expect. Favreau, in addition to directing the film, has a brief funny cameo as Happy. But it's Guy Pearce and Rebecca Hall we should be worried about: they do what they can, and yet the film didn't give them much of a chance to do more and better.\r\n\r\nThe biggest problem with this movie is, of course, the plot and writing of the script, dialogues and scenes. Attempts at comedy are very unpleasant, and Stark, who once had almost a barrage of phrases and jokes for all occasions, is now a serious and weary man. The material given to the actors is scarce and does not bring anything really good. In addition, the film has almost no connection with the previous films, and especially “Iron Man 2”, whose events are never really spoken by anyone.", "created_at": "2022-08-14T02:24:21.777Z"}, {"movie_id": 68721, "review_id": "6323c5fb1b722c007fee5791", "rating": 7.0, "review_text": "**While the deeper dive into Tony Stark and his past is welcomed, the execution came up a little short compared to Iron Man’s MCU entries.**\r\n\r\nIron Man 3 might be my least favorite of the Iron Man franchise, but it's still a great movie. Iron Man 3 focuses much more on Tony Stark and his trauma following The Avengers rather than on Iron Man and the suit. A large portion of the film and even some action scenes explore who Stark is without the high-tech suit or fancy technology in general. Stark grapples with the fallout of past decisions and has to decide who he is at his core without the money or Iron Man. As expected, the entire cast dazzles in their performances, from Robert Downey Jr. To Don Cheadle to Gwyneth Paltrow, but the true standout is Ben Kingsley's Mandarin. Iron Man 3 is all about Stark's growth and development, and while that's a great idea, its poor villain and lack of actual Iron Man leave the film feeling a little hollow. I still appreciated the movie and its Christmas cheer, but the MCU has far better Iron Man movies and moments to enjoy.", "created_at": "2022-09-16T00:40:27.688Z"}, {"movie_id": 68721, "review_id": "64a5082ada10f000e2257d1c", "rating": 6.0, "review_text": "Once again another movie with very little action. Im really disappointed in these movies. Sure the stories are good but that's it.", "created_at": "2023-07-05T06:05:30.642Z"}]