[{"movie_id": 581734, "review_id": "5ff919e5ed28b900407405f4", "rating": 8.0, "review_text": "It says so much that these nomads, who have chosen to commit to this life of freedom, do so with so little. While those who have stripped them of their livelihoods carelessly enjoy the horrors of excess, a single plate or a tyre full of air become objects to treasure. The purpose of life is not in what we physically possess but what we possess in our hearts, the people we see and the sights we see. The indescribable magic of Chloé Zhao's work is that it speaks both to the pain and the glory of being alive, not in some imagined way but in its actuality. 'Nomadland' is an extraordinary film from an extraordinary artist with extraordinary stories to tell, and you can't help but feel that same call of the open road and the vastness of the sky, to leave the chaos and confusion of the modern world behind and be one with the world, both the one around us and the world within us. Being alive can break your heart, but my god, it can also be so beautiful.\r\n- Daniel Lammin\r\n\r\nRead Daniel's full article...\r\nhttps://www.maketheswitch.com.au/article/review-nomadland-the-extraordinary-chloe-zhao-delivers-another-american-classic", "created_at": "2021-01-09T02:50:13.171Z"}, {"movie_id": 581734, "review_id": "6020be2197fdec0041b24bc9", "rating": 9.0, "review_text": "I watched this because of Frances McDormand and David Strathairn, and I was surprised to find they are the only actors really. There are a lot of rolls filled by actual ca,pers and travelers.\r\n\r\nThis movie is definitely a slow burner. If you aren’t used to quiet, slice of life movies , you may find it to be slow going.it is a character study, but with many characters s. A lot of people with real stories pass through the main character’s life. She helps them or they help her, and everyone moves on.", "created_at": "2021-02-08T04:29:21.418Z"}, {"movie_id": 581734, "review_id": "603bee1b79b3d40056667d41", "rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nAs of this article's date, Nomadland has already received countless nominations for basically every ceremony that honors movies in some shape or form. This includes Chloé Zao (The Rider, Songs My Brothers Taught Me), who has also been nominated for the director and screenplay categories, gaining tremendous support from the film community since female directors are rarely recognized for their magnificent work - Emerald Fennell (Promising Young Woman) and Regina King (One Night in Miami) are also in the game this year. Despite never watching the two previous movies of Zao's career, I did know about her filmmaking style being very connected to reality and authenticity, not letting the typical Hollywood-isms impact her vision.\r\n\r\nIf there's something that definitely proves her remarkable commitment to achieve that realism is the hiring of non-actors to participate in her films. Throughout Nomadland, several *real people* tell their story, explaining why they became real-life nomads and offering an enriching, inspirational perspective of life. This is, by far, the most captivating, emotionally compelling aspect of the movie. Learning who these people are and what drives them is incredibly enlightening, shattering wrong, terrible stereotypes that should have no place in our world. With so many outstanding deliveries from the non-actors, I'm absolutely sure some of the interactions between Frances McDormand's character and the real-life nomads are unscripted.\r\n\r\nIn fact, there's a clear documentary style associated with this film. From Joshua James Richards' on-the-ground, gorgeous cinematography to the well-structured editing work (also done by Zao), the narrative holds a superficially uneventful, observant storytelling that many viewers will find tiresome and boring, which is completely understandable. It's hard to deny that the screenplay is pretty much based on following McDormand in an RV through the American West, watching her meet new people, working in a couple of different jobs, and that's really it. If people go into this movie expecting mind-blowing developments and Earth-shaking revelations, all will leave extremely disappointed.\r\n\r\nIt's a slow-paced, somewhat repetitive film told through Zao's unique vision, which is the key aspect that makes this movie work so well. Her astonishing dedication to delivering such a grounded depiction of a particular lifestyle elevates the overall piece. Technically, I already addressed that the film is beautifully shot, but Ludovico Einaudi's score is tear-inducing on its own. With heartfelt piano tracks, Einaudi's music plays during the most stunning landscapes, helping those moments to induce the viewers to enter an introspection-like state of mind. Zao's screenplay is packed with underlying themes, but the diverse, impactful views on what it means to live and how to deal with grief and personal traumas grabbed my attention the most.\r\n\r\nDespite all that I wrote above, Nomadland is highly performance-driven. Frances McDormand carries this movie with yet another powerful display to add to her already impressive career. Her reactions in every single conversation that she has with the non-actors seem to come from McDormand herself and not from her character, Fern. Speaking of her, Fern is an amazingly likable character, the absolute definition of what it means to be a good person. Following such a protagonist makes the extremely long journey a bit lighter. Every non-actor is absolutely perfect. I have nothing but overwhelming respect for them and the life they chose to live.\r\n\r\nI don't expect the general public to love this film, but I'd love to see the viewers trying to figure out what makes it so special. Many spectators will finish their viewing and think this is just another \"technical feature\" that only gets praises from critics. I sincerely wish that viewers would ask themselves why they didn't enjoy a movie as much as other people and research about it. Learn about what makes the film so inspiring and such great storytelling. Yes, it's heavily philosophical, its pacing could have been better controlled, and it doesn't really have massive surprises or significant events. But if it possesses a lot more than what it's at the surface, then investigate, read a little bit about what went into creating this movie, and maybe - just maybe - it will become a more enjoyable watch.\r\n\r\nNomadland offers a contemplative, enlightening, touching story about a nomad's life, starring real-life people that make this film much more special. Chloé Zao's unique, passionate vision and her outstanding dedication to authenticity are more than enough characteristics deserving of dozens of nominations. Gorgeous cinematography and a lovely score tremendously elevate the movie, creating the perfect atmosphere for thoughtful storytelling. Some pacing issues and an uneventful narrative based heavily on merely accompanying the protagonist through her journey negatively affect the film's overall enjoyment, which will definitely leave some viewers disappointed. Frances McDormand carries the movie on her shoulders with another commanding performance to add to her remarkable career. However, the spotlight goes to the real-life nomads who participated in this beautiful project, sharing personal stories filled with valuable perspectives on so many themes related to life and ways of living it. A worthy contender for the awards season.\r\n\r\nRating: B+", "created_at": "2021-02-28T19:25:15.072Z"}, {"movie_id": 581734, "review_id": "608ca11205a5330057c99cd5", "rating": 9.0, "review_text": "Quality.\r\n\r\nNo surprise to see the hype around <em>'Nomadland'</em>, it's extremely well made and holds a lot of heart. Frances McDormand is the star, her performance is truly outstanding. A few of the other cast members, most of whom are real life nomads, merit props too - namely Charlene Swankie, who has one great scene. The cinematography and music, meanwhile, is stunning.\r\n\r\nNot much more to note. It's simply a terrific film, one that feels incredibly real.", "created_at": "2021-05-01T00:30:10.342Z"}]