[{"movie_id": 588228, "review_id": "60de18bbb686b9002d5d8e8c", "rating": null, "review_text": "Amazon Prime’s purchase of The Tomorrow War from Paramount was a bold move as the FX-laden film starring Chris Pratt reportedly cost around $200 million to purchase and follows prior purchases of Paramount films by the streamer.\r\n\r\nPratt stars as an ex-soldier named Dan Forester who has just been turned down for a research job he has been seeking and must remain teaching science to less than enthusiastic students.\r\n\r\nWhile watching a Soccer match with his wife, daughter, and friends, the world is stunned when a group of armed individuals appear in a flash of light and tell the televised audience that they have come from thirty years in the future and are seeking help to save humanity.\r\n\r\nIt is soon learned that an Alien threat they call the White Spikes suddenly appeared and has humanity on the verge of extinction.  The nations of the world send forces into the future to help fight the war but with a very high casualty rate; a worldwide draft is soon instituted to replenish the numbers.\r\n\r\nDan is eventually drafted and told he has 24 hours to get things in order before he is deployed for seven days at which time he will be returned. Dan contemplates running and seeks out his estranged father (J.K. Simmons); who has a deep disdain for governments and conducts himself in a shady fashion to the point where Dan will not let him anywhere near his daughter.\r\n\r\nDan eventually deploys and finds a nightmare version of the future where cities are in ruin and the deadly and very tough enemy is everywhere.\r\n\r\nAs the tension mounts; Dan must team up with the leader of the resistance to develop a way to fight the aliens and save humanity before it is too late.\r\n\r\nThe film features some good FX and action and while there were many times I questioned why a different course of action was not attempted; the film eventually attempts to address many questions later in the film.\r\n\r\nWhile the final act may seem overblown and too convenient; the film works as an enjoyable and action-filled escape as long as you are willing to just go along with the ride and not ask too many questions along the way.\r\n\r\nWhile there are elements of prior Science Fiction and Horror films evident; the cast and premise work well and the movie is a step above most offerings that are sold to streaming services and is well worth a watch.\r\n3.5 stars out of 5", "created_at": "2021-07-01T19:34:19.699Z"}, {"movie_id": 588228, "review_id": "60e4945827ff990074dea224", "rating": 7.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/the-tomorrow-war-spoiler-free-review\r\n\r\n\"The Tomorrow War is one of the biggest surprises of the year, boasting an impressively creative creature design, entertaining action sequences, and a contender for the most beautiful shot of 2021. Chris McKay demonstrates all of his undeniable talent behind the camera, delivering brilliantly directed action scenes featuring excellent camera work, a chill-inducing score, and exceptional VFX - the Whitespikes look stunningly scary. Zach Dean doesn't avoid the formulas and cliches of the genre, offering a generic story with no real surprises but still possessing remarkable character work. Chris Pratt is great as the protagonist, but Yvonne Strahovski is on a whole other level, delivering one of her best performances ever in a feature film. With an overextended runtime, the last act is mostly unnecessary and less exciting, ultimately making the ending a tad underwhelming compared to the epic conclusion of the second act. I wouldn't be surprised if it gains a cult following, though. Tremendous replay value. Highly recommend it.\"\r\n\r\nRating: B", "created_at": "2021-07-06T17:35:20.721Z"}, {"movie_id": 588228, "review_id": "60eb4d0cf9a3fb00291d7e50", "rating": 8.0, "review_text": "Great watch, will likely watch again, and do recommend.\r\n\r\nIt's usually a good sign when the worst part of a time travel movie is the time travel.\r\n\r\nI could probably make an hour long video on the time travel in this movie, especially compared to \"Looper\", but I'll forego that enough to say that it's well leveraged for the purposes of the movie.\r\n\r\nThe \"White Spikes\" are amazingly well put together, though I think projectile spikes are an odd biological evolution.\r\n\r\nThe story is far from perfect, but the cast, the acting, the situation, and especially the action are all executed wonderfully with a high production value to back it up.", "created_at": "2021-07-11T19:57:00.010Z"}, {"movie_id": 588228, "review_id": "61f3a7354fd141001ec42dde", "rating": null, "review_text": "This thing doesn't just have regular plot holes or logical inconsistencies, it has scene hole, moment to moment holes, blink and you'll miss it holes. It is in fact entirely made of holes! My teenage cousin got frustrated while watching it and he likes robot dinosaurs!\r\n\r\nThis might, by some stretch of imagination, be okay if it weren't clear - from so many self-important pop-up references to personal enterprise and industry, attempts at did-you-get-it political issues critique and just awkward piggybacking on all the current popular social issues from the pandemic, war on insert-noun, veterans, STEM, disenfranchised youth, patriarchy, feminism - that somebody thought they were making a CLEVER action flick. As is to be expected, these moments and attempts summed up also contradict and nullify each other.\r\n\r\nThere once was a time when this couldn't even pass for public access cable, that time was before the reign of the tech mogul gnomes. It turns out that the only thing that kept nerds smart and hard working was the absence of social recognition.", "created_at": "2022-01-28T08:20:05.577Z"}, {"movie_id": 588228, "review_id": "630016c633a376007f86c70d", "rating": 8.0, "review_text": "**Overall : A fun popcorn sci-fi blockbuster with fun characters, scary aliens, and great action that far outweigh its minor faults.**\r\n\r\nThe Tomorrow War is a fun fighting alien creatures, time travel, sci-fi action flick that thoroughly entertains despite its flaws. The film's premise lends to some confusion with trying to change timelines, leading to moments of disjointed logic and confusing plot points. But let me be honest, if you don't take the science seriously, you will enjoy the movie. The aliens are super creepy and overwhelming. Transporting soldiers to the future to help try to overcome a failing war for survival provides a fresh take on the alien battle trope. I enjoyed the parts of the movie that took place in the future where the risk and danger were higher than the present-day parts that were more focused on exposition. Because The Tomorrow War was released straight to streaming, I had low expectations that were undeniably exceeded. I will be back to watch this one again.", "created_at": "2022-08-19T23:03:34.529Z"}]