[{"movie_id": 254201, "review_id": "562bc8739251412845004f63", "rating": 7.5, "review_text": "> The second episode: A new case in the hands.\r\n\r\nA follow up to 'The Keeper of Lost Causes' based on the Danish crime-thriller novel of the same name in the original language. That one was a classy, a brilliant initiation in the 'Department Q' series. One of the best Scandinavian detective movie I have ever seen. I expected same energetic, caliber and suspenseful in this as well. But marginally disappointing, yet it stood and delivered to the previous film's standard.\r\n\r\nIn this second episode, it was a murder mystery for Carl and Assad to crack it down. They did not choose it, the case did. It was a long pending affair in the department, since then the world has changed a lot. But the father of twins murdered who investigated privately leaves all the required evidence to the Department Q team. Now, where these two deeply dedicated detectives begin, how they dig it and whether they reach the other end of the investigation to uncover everything is the rest of the film.\r\n\r\nWith a new target in the hands, the Department Q world expands further bigger than the first film. Takes us to the two decades earlier and narrates some of the key events by introducing new characters. So it also creates curiosity about the happenings around and sufficient suspense where it all went wrong. The prediction was not that hard, but without a clear picture of what happened, I simply failed to make a guess as I do always. The story holds everything back, that's a weak point, but very gripping with those thrilling going after scenes.\r\n\r\n> \"I never met anyone as destructive as him.\"\r\n\r\nToo much of flashbacks might be the reason for movie to lose the original appeal. It reduced Carl and Assad's screen-space. It was good for this particular plot to develop the story and characters, but did not help what Department Q theme is known for. That was not at all, certainly it was a good story, I'm not arguing with that, but the presentation was not charming enough and the dearth of fine action sequences was a little setback which was absolutely necessary in the cop themed films.\r\n\r\nThe movie was shot very well with maintaining the same tone from the first, along great performances by everyone. The difference between Carl and Assad remained, we should say it was maintained as it should be. In any two buddy cop movies, they are always antipodal characteristic. It was like a cliche, but brings the better outcome. These two guys together form a best homicide team in Copenhagen police department. Now the third character introduced in this part, a secretary who loosely hangs around, but out of the league from the perspective of story narration.\r\n\r\nVery much a Danish's answer to the Swedish's 'Dragon Tattoo' films. But in a way the two are not a comparable, if you do, then this one lacks in a long way. Because of the type of cop works are different with completely different universe and environment. After the first two films the director has changed for the third film, which is set to hit the screen in 2016. Hoping for 'A Conspiracy of Faith' to do much better than this one, because many more to follow if that succeeds.\r\n\r\n7½/10", "created_at": "2015-10-24T18:05:39.783Z"}]