[{"movie_id": 884605, "review_id": "64a9a2b466a0d300e373332b", "rating": 7.0, "review_text": "MORE SPOILER-FREE MINI-REVIEWS @ https://www.msbreviews.com/movie-reviews/mini-reviews-2023-edition\r\n\r\nNo Hard Feelings doesn't avoid the genre's formulas, and it could have taken better advantage of its Rated-R rating, but it’s surprisingly much more compelling than expected.\r\n\r\nJennifer Lawrence and Andrew Barth Feldman share palpable chemistry in a raunchy, accurate comedy about letting go of the past and coming out of our shell. It truly flew by. Really enjoyed it!\r\n\r\nRating: B", "created_at": "2023-07-08T17:53:56.608Z"}, {"movie_id": 884605, "review_id": "64ba6856ab684900ff4a605c", "rating": 7.0, "review_text": "OK, so the underlying premiss here is pretty daft. The \"Becker\" parents - Matthew Broderick and Laura Benanti are concerned that their teenage son \"Percy\" (Andrew Barth Feldman) is just a little bit shy, and so they are seeking a willing gal to help get him out of his bedroom. Meantime, \"Maddie\" (Jennifer Lawrence) is struggling to make ends meet as an Uber driver with only a pair of roller-skates to her name. She spots their ad, they meet and next thing she is chatting to the young man who volunteers at an animal sanctuary. He thinks she's weird, she thinks he's weird - but she needs a car, and that's her prize if she can get him laid! That's what works about this film: right from the double entendres of the title, it's a sex comedy that doesn't actually shy away from nudity (albeit sparing) and from the fact that the parental goal here involves their son and cherries - and not those in bowl. Lawrence is on good form and she brings out the best in Feldman who is also quite effective as the scared-of-his-own shadow young man who would rather seek the comfort of four legged friends than people. It moves along quickly, the writing is enjoyably earthy at times, there are some fun, lightly comedic scenes and though no, there isn't really a lot of jeopardy to the plot, it's surprisingly easy to watch. It also can't but elicit our own memories of being a cack-handed teenager with raging hormones that we didn't understand nor know how to control. A fun soundtrack and I found it flew by. Television will be fine, though, no need to shall out for a ticket.", "created_at": "2023-07-21T11:13:26.979Z"}, {"movie_id": 884605, "review_id": "64cca1aa798e0600e363c076", "rating": 3.0, "review_text": "There’s a sweet life lesson at the heart of “No Hard Feelings,” the supposed “raunchy comedy” from co-writer and director Gene Stupnitsky. What a shame that it’s buried under a heap of dreadfully unfunny attempts at humor, dumb pratfalls,and tired sex jokes that fall flat one hundred percent of the time. No bones about it: this is not just a really terrible comedy, it’s an awful movie all around.\r\n\r\nBartender Maddie (Jennifer Lawrence) just watched her car get towed from the driveway, and needs wheels, fast. While browsing the want ads, she stumbles upon an intriguing job listing: wealthy helicopter parents (Laura Benanti, Matthew Broderick) are searching for someone to “date” their introverted 19-year-old son, Percy (Andrew Barth Feldman), before he leaves for college. The pay for sleeping with their son? A used Buick. Maddie decides to take the job but in the process, she gets far more than she bargains for.\r\n\r\nIt’s a decent premise for a movie, but Lawrence is horribly miscast in the role. She’s too old to play the part of Maddie, which makes her relationship with a teenager feel a little icky. Lawrence is also called on to do a lot of comedy work and as talented as she is, she simply lacks the knack for comedic timing (she’s especially awful at physical comedy).\r\n\r\nIt’s also a problematic message to send to young men: if you haven’t slept with a woman before venturing away from home and off into adulthood, then you aren’t much of a “man.” Just think if the roles were reversed here, and it was a 32 year old man trying to force himself on a 19 year old woman so she could get “experience” before heading to college. The standard needs to be the same regardless of the sex of the main characters.\r\n\r\nThe majority of the story consists of ridiculous situations where Maddie is aggressively trying to seduce Percy, none of them funny and all of them growing old, quickly. Stupnitsky (and co-writer John Phillips) go for the lowest hanging fruit every time, and the only laughter I could muster while watching this dreck came from forced chuckles.\r\n\r\nAnd that’s the major problem with the movie: everyone is trying so hard to turn it into a wacky, racy comedy that they miss the actual heart of the story.\r\n\r\nThe relationship between Maddie and Percy is somewhat charming, and the way they grow individually while together is actually heartwarming. All of that is overshadowed by the lame attempts to make it a raunchy, sexy, adult comedy. In struggling to be both, it succeeds at neither.\r\n\r\n“No Hard Feelings” is best when it stops trying to be something it’s not.", "created_at": "2023-08-04T06:58:50.868Z"}, {"movie_id": 884605, "review_id": "653ec8c7519bbb011b45817c", "rating": 1.0, "review_text": "Something Something Grooming... yeah, I didn't really get that vibe from this movie.\r\n\r\nBut it was creepy that a kids parents would basically pay someone off to... doink... their son.  \r\n\r\nunfortunately it doesn't work, Jennifer Lawrence is just a horrible person in this.  From pretty much start-to-finish she is a horrible human being, and in order for this story to work she needs to be likeable.  She needs to be relatable.  She needs to be someone that the male protagonist would actually fall for...\r\n\r\n... and instead she's the type of person that you don't want to know.  She's not even a rougish charmer.  She's not a lovable con artist.  She's just completely unappealing.  And that is why the film doesn't work.\r\n\r\nAndrew Barth Feldman comes across as legitimately socially awkward, but he also comes across as someone that doesn't want to be around her, and doesn't like her because of her completely toxic qualities.  \r\n\r\nThe script is at least aware enough to include that... but then does a 180 where he has to pretend that, after dealing with her, he actually wants to be around her... because the plot requires it.\r\n\r\nFor some reason he doesn't want to have sex with her because HE is awkward, not because she is awful. Which makes it a little unbelievable.  \r\n\r\nI suppose in their effort to show that Jennifer don't need no man, they forget that they were making her into someone no one would want to be around long enough to bang.  If they wrote her as someone that at least hesitated to ruin the fun of little kids.... they could have had a win.  Instead they went for completely charmless.", "created_at": "2023-10-29T21:04:07.544Z"}, {"movie_id": 884605, "review_id": "65782485564ec700e10cdef4", "rating": 7.0, "review_text": "This was a good little romantic comedy with good comedic timing. It did fall short on some parts of the film but overall a great time", "created_at": "2023-12-12T09:14:45.556Z"}, {"movie_id": 884605, "review_id": "658033a0ac617c08ae14e8f0", "rating": 7.0, "review_text": "It’s always a pleasure to come across a film that surprises, and writer-director Gene Stupnitsky’s second feature outing does just that. When this edgy romantic comedy was released earlier in 2023, I must admit that it didn’t strike me as terribly interesting or engaging, coming across as yet another piece of starry-eyed amorous fluff (albeit a tad more suggestive than most) that could nevertheless be easily dismissed. However, in light of the picture recently earning a Golden Globe Award nomination for Jennifer Lawrence’s bawdy yet uproarious performance for best lead actress in a comedy, I decided to give it a look. And I must admit I was favorably impressed to have watched a rom-com that’s genuinely laugh-out-loud funny, full of ample unexpected moments of hilarity. This delightful, delicious cinematic nugget tells the story of a pair of wealthy, overbearing helicopter parents (Laura Benanti, Matthew Broderick) who have coddled their 19-year-old intelligent, sensitive son (Andrew Barth Feldman) into becoming a virtual social hermit. They’re concerned that, as he prepares to enter college, he’s unprepared for life in the real world, so they place an ad on Craigslist to find a woman who can help bring him out of his shell. They end up hiring an energetic, quirky yet drama-prone and financially strapped 32-year-old (Lawrence) who’s down on her luck and could use the work to help keep her from losing the home that’s been in her family for years. Thus begins an unlikely but hilarious relationship between a pair of obviously mismatched “partners.” While the film falls prey to some sappy, sentimental rom-com tropes, it successfully manages to counter those trite trappings with an array of improbable but rib-tickling surprises that enliven a genre that all too often is far too predictable for its own good. “No Hard Feelings” may not break new ground in the world of cinema, but it’s a fun way to spend a few hours stretched out on the couch in your PJs with a big bowl of popcorn, one that’s sure to put a smile on your face without having to force it and maybe leave you a little worn out from all the belly laughs.", "created_at": "2023-12-18T11:57:20.639Z"}]