[{"movie_id": 12779, "review_id": "634060ef2f3b1700841141cc", "rating": 8.0, "review_text": "**_A romantic-comedy that's actually really good_**\r\n\r\nA group of rich Americans take a private cruise from Greece to Italy where a spoiled middle-aged woman, Amber (Madonna), mentally abuses the crew, in particularly the first mate Pepe (Adriano Giannini) whom she constantly refers to as PeePee. The crew puts up with her pompous antics because she's the paying customer, but everything changes when Amber and Pepe are stranded on a deserted Island, putting Pepe in a position of control.\r\n\r\n\"Swept Away\" is a 2002 remake of the 1974 Italian film starring Madonna and directed/written by Madonna's (then) husband Guy Ritchie. Despite what you may have heard, it's fun and entertaining, but also thought-provoking and moving.\r\n\r\nFor the record, I'm not a follower of Madonna; I neither love her nor hate her. In fact, I almost didn't watch this film because she starred in it, but I gave-in because I'm a sucker for survival-on-deserted-island flicks. I'd also like to point out that I've never seen the original '74 film, so I have no nostalgic bias.\r\n\r\n\"Swept Away\" failed at the box office in 2002, but only because it was barely released to theaters and critics condemned it before it was even completed. It subsequently swept (away) the Razzies as the worst picture and a bandwagon effect developed with everyone jumping into the negative feeding frenzy.\r\n\r\nIs it really THAT bad? No. Not even close. \"Swept Away\" starts as a fun, entertaining farce and morphs into a potent social commentary and, finally, a moving love story. The movie will make you laugh, make you angry, make you cry and ultimately move you -- no kidding. But it will only have this effect IF you refuse to listen to the drivel of the cookie-cutter critics and give it a chance.\r\n\r\nAs for Madonna, she's no Meryl Streep but she successfully makes you despise Amber in Act 1 and feel for her later on. She made me believe Amber was a real person. What more do you want?\r\n\r\nI'm not an anti-capitalist but the film effectively points out the flaws of this system. It also effectively reveals how money/materialism can't of itself give true happiness, love or fulfillment. Amber had everything but was the most unhappy, loathsome person you'd likely ever meet.\r\n\r\nOne reviewer referred to the film as a \"wife beater's fantasy\" but failed to point out that it could just as easily be called a \"Man torturer's fantasy\" or \"Man emasculater's fantasy.\" Let's be evenhanded with our appraisals.\r\n\r\nI admit the physical abuse of Amber on the island (slapping, kicking and especially the faux-rape) is disturbing and almost tempted me to tune out, but then I saw what the filmmakers were shooting for, the filmmakers being Madonna and her husband.\r\n\r\nIn our society we've been misled to believe that mental abuse is less abusive because it's not physical. This film effectively shows that mental abuse can be just as bad, if not worse.\r\n\r\n***SPOILER ALERT***\r\n\r\nDuring the first half hour Amber horribly torments and emasculates Pepe (and others) because she's a spoiled brat and in control. When the tables are turned and she loses control on the island Pepe utilizes extreme measures to de-spoil Amber. In other words, Pepe realized that Amber was so far gone -- so utterly spoiled -- that she literally needed slapped back to reality.\r\n\r\nThis is in line with a biblical proverb \"Blows and wounds cleanse away evil and beatings purge the inmost being.\" Let's face it, some people are so far gone (that is, spoiled) that they literally need the snot beat out of them -- that's the only thing that's going to wake 'em up to reality. Apparently Pepe realized this on the island and acted accordingly. Do I think he goes too far? Yes, but -- then again -- I wasn't the one mentally tormented for days on the boat and totally emasculated in front of others. Regardless, the story shows that his methods worked -- Amber was humiliated to the point of seeing life from a totally different perspective, a much-needed new perspective.\r\n\r\nPepe's discipline ultimately brings out spiritual character in Amber to the point where she refuses to call on passing boats to save her from her exile (two moving scenes, by the way). Why? Because she's been delivered from the bondage of selfishness, arrogance and materialism; she has experienced true love, fulfillment, team-work, companionship and independence (remember, she DOES learn how to fish for herself) for the first time in her life. It becomes more precious than gold to her and she doesn't want to let it go.\r\n\r\nAgain, I think Pepe goes too far with the physical abuse (in fact, I don't believe in physical ABUSE at all); he should've stopped with a couple of slaps, at most, but the filmmmakers are (evidently) saying she was so far gone that extreme measures were necessary. Besides, didn't she make her own bed, so to speak? Let her lie in it.\r\n\r\n***END SPOILER***\r\n\r\nThe fact that Madonna -- one of the most successful women in history and the original \"material girl\" -- utilized this film to make this point speaks volumes. Is it a sign of weakness? No, it's a sign of enlightenment and spiritual strength.\r\n\r\nBOTTOM LINE: \"Swept Away\" is much better than similar flicks like 1998's \"Six Days, Seven Nights\" with Harrison Ford and Anne Heche. Why? Because, not only is it fun and entertaining, it's also thought-provoking and moving. Really, what more do you want from a stranded-on-a-deserted-island romantic-comedy? Needless to say, those who go overboard with the negative criticism need to get real.\r\n\r\nThe film runs a short-but-sweet 89 minutes and was filmed in Sardinia and Malta.\r\n\r\nThe DVD features a 20-minute making-of piece with Madonna and Guy Ritchie interviewing each other. It's an entertaining, informative and revealing piece. The DVD also features 16 deleted scenes.\r\n\r\nGRADE: A- or B+", "created_at": "2022-10-07T17:25:03.853Z"}]