[{"movie_id": 798286, "review_id": "6452d25187a27a00e38f1565", "rating": 6.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.firstshowing.net/2023/review-ari-asters-beau-is-afraid-warrants-the-love-hate-reception/\r\n\r\n“Beau Is Afraid is by far Ari Aster's most complex, inaccessible film to date, although guilt, extreme anxiety, and a complicated mother-son relationship are clear themes deeply explored throughout five sections - the second is one of the most mesmerizing, visually stunning sequences of the year. The more I think about what I watched, the more I admire the unique, thought-provoking, overwhelmingly surreal storytelling by one of the most authentic voices working today.\r\n\r\nThat said, the three-hour runtime feels really heavy, the analysis of the movie as a whole raises some issues, and while all the technical departments are award-worthy, stating \"it's not for everyone\" is a perfect description of one of the most divisive films you'll see for a while.”\r\n\r\nRating: B-", "created_at": "2023-05-03T21:29:53.790Z"}, {"movie_id": 798286, "review_id": "6463abf2e3fa2f01662254f2", "rating": 4.0, "review_text": "Beau is Afraid certainly boasts an incredibly rich and intricate narrative, filled with a plethora of allegories, symbolisms, and thematic elements. However, one may question whether the complexity of the film is worth sacrificing entertainment value. In attempting to weave together these complex themes, Ari Aster has created a narrative that was very difficult for me to fully process.\r\n\r\nDuring the first hour of the movie, I found myself engrossed in the story, with tense scenes that blurred the lines between what is real and what is fake. However, as the film progressed, these surreal scenes became increasingly wild and disjointed, leaving me feeling disconnected from the narrative. I found myself constantly asking questions about what was happening, how we got there, and why things were unfolding the way they were. This detachment ultimately detracted from my overall enjoyment of the film.\r\n\r\nAt three hours in length, Beau is Afraid can be a daunting task for audiences to undertake. While a well-paced film can fly by (Avatar: The Way of Water and Babylon for instance), this one felt like a slog at times, and I found myself frequently checking the clock to see how much time was left. However, despite these shortcomings, the technical execution of the film was truly exceptional. Aster's direction was brilliant, with stunning camera work and beautiful cinematography. The acting was also top-notch, with Joaquin Phoenix delivering what was arguably the best performance of the year so far. The supporting cast, including Amy Ryan, Patti LuPone, and Nathan Lane, also gave standout performances.\r\n\r\nAll in all, Beau is Afraid was quite a letdown for me. While Aster undoubtedly has a brilliant mind and a talent for storytelling, this film may have suffered from a lack of restraint. Nonetheless, the technical prowess and stellar performances are certainly noteworthy and should not be overlooked.\r\n\r\nScore: 41% ❌\r\nVerdict: Poor", "created_at": "2023-05-16T16:14:42.528Z"}, {"movie_id": 798286, "review_id": "6469d1e92bcf6700e3bb0661", "rating": 6.0, "review_text": "Right from the start we appreciate that \"Beau\" is going to have an hard time with life. Luckily we skip forwards forty years and find him living an almost siege existence in a lawless city where sirens and racket keep him awake for most of the night. It's after one such a lively night that he suddenly awakes realising that he must get to the airport to go and visit his wealthy mother. Suffice to say, events conspire and he doesn't quite make the trip... He calls to alert his mother only to get the UPS man on the phone standing over an headless corpse. His mother? Well he now has to make a journey - without a functioning credit card - in time for her funeral. What now ensue are a series of mildly entertaining but largely just too surreal escapades that marry fantasy and fiction on his trip. This is a very strong effort from Joaquin Phoenix as the gentle but almost permanently bamboozled \"Beau\". He gives himself fully to the part and engenders frustration and sympathy successfully as the story progresses - in fits and starts - towards it's conclusion. Nathan Lane chips in well - if completely over the top - too, as surgeon \"Roger\" and we save the best til last with a rather bizarre denouement that sees Patti LuPone (his mother, \"Mona\") in an whole new light. At times the writing can be witty but for me this is just way, way too long and episodic. It's as if Ari Aster had an accumulation of ideas for his character that he has, almost \"Forrest Gump\" style, stitched together in the hope that what emerges at the end has been enjoyable to watch. I'm not great at the outlandish. It's not that it needs a solid beginning, middle and end but somehow I prefer the plot to be rooted in something just a bit more tangible than this is. I am glad that I saw it in a cinema, but I can safely say I won't watch it again.", "created_at": "2023-05-21T08:10:17.983Z"}, {"movie_id": 798286, "review_id": "64a896519c97bd00e24b6658", "rating": 6.0, "review_text": "It's way too long with no coherent storyline to keep you involved or interested.\r\n\r\nThe production values are very high and the look and feel of the movie are very rich... but it's not enough to hold the three hours together.\r\n\r\nBeau is the unluckiest person ever... and he is constantly jumping from the frying pan into the fire (and through no fault of his own). This becomes incredibly tedious.\r\n\r\nI watched the movie in 4 parts. No way I could sit through it in one.\r\n\r\nI've watched three hour movies that just fly by... this one went by at a snail's pace and you really felt it.", "created_at": "2023-07-07T22:48:49.231Z"}, {"movie_id": 798286, "review_id": "64b24bc90bb076014e4e659b", "rating": 10.0, "review_text": "Zero spoilers in here. \r\n\r\nAbsolutely wonderful. I can't do a big braining on what everything means in this crazy topsy-turvy roller-coaster of a movie, but it's one hell of an entertaining ride if you just sit back and enjoy it. For me, this movie needed to be watched the same way I watched Lost Highway - don't try to understand it, just be open to being frightened and entertained. \r\n\r\nSuffering from generalized anxiety myself, the first part of the movie is absolutely brilliant, showing the world through the lens of someone with a severe case of anxiety. Everything is over the top, and the attention to detail is stunning.\r\n\r\nThe movie devolves further and further into madness, somewhat akin to the way it did in Mother, except not in a frustrating way, but rather an action-packed and crazy, sometimes touching way. Oh, and hilarious. There are such funny moments in this movie, often absurdly so.\r\n\r\nI didn't read up on anything before watching this movie, and I had no idea it was going to be three hours. I didn't know Ari Aster made it, and frankly I didn't know who he was. Looking it up afterwards, I see he made Midsommar, which I found tedious and boring, and Hereditary, which I absolutely loved.\r\n\r\nI can definitely see how someone could hate this movie. I can also sympathize with being frustrated with it if trying to understand everything. I think the best way to watch this is popcorn. Watch this like you'd watch a popcorn flick, except expect absurdities instead of explosions (though we do get explosions here, too). That's how you'll be entertained by this amazing movie. I'll be watching this again.\r\n\r\nOh, and Joaquin Phoenix deserves an Oscar for this performance. Absolutely his most impressive performance so far.\r\n\r\nWatch this. It's special. Even if you hate it, you won't regret watching it.", "created_at": "2023-07-15T07:33:29.760Z"}, {"movie_id": 798286, "review_id": "6556d67aea84c710910c8e51", "rating": 8.0, "review_text": "Not for everyone indeed. But it is A24 and Ari Aster (and yeah I am a fan of his works). It is very difficult to categorize the movie... part thriller, part abstract, part (well mostly) dark comedy. \r\n\r\nWho knows Ari Aster works of before (Hereditary, Midsommar) knows he likes a lot to put abstract, symbolic and allegorical scenes, and pieces of the plot hidden thorough the movie. Beau Wasserman is unique and pitiless. \r\n\r\nThis one is surely one he put a hell of an effort to put things, and make sense in the senseless... and in chaos that is a definition for what I saw, it is pretty crazy as some flicks from the 70's (see Holy Mountain of 73, or Zardoz of 74 and you will get the LSD level of the scenes). Some more recent movies had that WTF moments too, like the middle part of Triangle of Sadness or some parts of White Noise (both of 2022) and you get the level of non-sense and comic all together.\r\n\r\nThe best definition of the Kafkaesqueness of Beau is to pick some work of the dutch painting Hieronymus Bosch of the XV century and try to grab some meaning on it. It is there but not so obvious.\r\n\r\nIn the case of Beau you can see two things: 1-) he is clearly someone with deeply psychological or psychiatric issues and 2-) he has a deep anxiety and FEAR all along the movie in the hope to not let people down or not to be a disappointment to anybody even he is clearly being it already in his mind. It is on the title of the movie.\r\n\r\nThe most \"normal\" scenes in the movie are the ones in the start of the movie in the psychiatrist bed (the ones that he must have with lot's of water - I don't know if it is a joke or not but Wass in german means \"water\" and element that is present since the beginning of the movie). \r\n\r\nIt must be interesting to see Aster working in his works, because neither one is simple, all are complex and relates to parts that we seen before. His passion for his work makes him one of the directors I admire at the most. Some people don't like him - the same way some people don't like Lars von Trier works. It is a matter of taste, and it is totally normal.\r\n\r\nFor me the story told is all above - don't try to pick what is real and what isn't, because out of the clinic door all is in Beau's head. Fragments of reality and inner issues in a bizarre blender that isn't for everyone.\r\n\r\nI wish I had seen it on the theater there were some scenes that made me laugh a lot and at the same time felt guilty like the one at his attic. \r\n\r\nOn the technical side: Joaquin Phoenix again is a powerhouse in acting (and Academy worthy maybe?), the script is pretty original (well, last year Everything Everywhere All at Once was mostly non-sense but with a sense and won tons of stuff) and the work on editing and art direction are excellent and again long colaborator Pawel Pogorzelski work as cinematography is impeccable.\r\n\r\nI liked the movie, it isn't the best of Ari Aster (and three hours are heavy on most of the cases), but is pretty good: my score is 8,3 out of 10,0 / A -.", "created_at": "2023-11-17T02:56:58.783Z"}]