[{"movie_id": 6972, "review_id": "5e1b55cfe194b00014b5ed24", "rating": 7.0, "review_text": "King George angry at them white fellas. King George say them white fella bad spirit. Must be taken from this land. \r\n\r\nAustralia is directed by Baz Luhrmann and Luhrmann co-writes the screenplay with Stuart Beattie, Ronald Harwood, and Richard Flanagan. It stars Nicole Kidman, Hugh Jackman, David Wenham, Bryan Brown and Brandon Walters.\r\n\r\nIt took a bit of a kicking from the pro critics upon release, where the consensus is that at a cost of $130 million this intended sprawling epic is an ambitious flop. For the record at the box office it practically made double its outlay, so certainly wasn't a financial flop.\r\n\r\nIt's a mixed bag for sure, a film of two differing halves. First half sends Kidman's English aristocrat to Northern Australia after she inherits the sprawling Faraway Downs Ranch. Here she finds herself in the middle of a dirty take over plot and reluctantly makes a working pact with Jackman's stock-man Drover. Seeds are sewn here for a bit of a screwball relationship, all while a cattle feud brews and the Aborigines at the ranch - particularly young Nulllah (Walters) - are in fear of racial tension. Pic then flip-flops into a love story, a war story (as the Japanese attack Darwin) and the bile strewn historical strand that features the \"stolen generations\" of half-white/half-Aboriginal children. \r\n\r\nWith all this going on, as Lurhman nods to classic epics from classic era past, the vistas are stunning and the hard work of cattle ranching is given genuine credence (helps having the rugged Jackman leading the way). Set pieces are exciting, the Japanese aerial attacks realistic for dramatic worth, while the chemistry between the leads, a worthy child performance from Walters and a quality weasel villain turn from Wenham ensure performances don't harm the pic in that department. There's even the likes of Ben Mendelsohn and John Jarratt in secondary support slots. \r\n\r\nIt isn't all it can be, and tonally it feels like there might have been some behind the scenes interference (three co-writers probably didn't help). Yet there are some genuine moments of fun and beauty here, mixed with some heart string tugs and reflection of an historical time that should never ne forgotten. Luhrman reached for \"Somewhere Over the Rainbow\" and didn't quite make it, but it's honourable and has some damn fine craft for entertainment purpose. 7/10", "created_at": "2020-01-12T17:22:23.194Z"}]