[{"movie_id": 809140, "review_id": "6280797e8261ee00515a4e4c", "rating": 5.0, "review_text": "Let me start off by saying that I completely understand all of the hate this film is getting, and that's because for the first half of the film I hated it too. For too much of this film, a lot of the characters are just unlikable slobs . . . especially Mel Gibson's character of Bill Long. Also, the story plays out . . . well, it plays out terribly for the first half of the film. It wasn't until later in the film when Stuart Long decides to become a preacher that I was actually invested, and why's that? That's because Long was an absolute piece of trash that I didn't want to watch for the first half of the film. This does not go without saying that by the end I liked Stuart Long's character in the film, but I couldn't like him for the first half.\r\n\r\nThe film isn't precisely terrible, but it isn't good. The third act is solid, but everything in the first act is bad, and the second where Stu is transitioning is mediocre. This does not make for a good film. When the film is simply bad for the first two acts, it can't just make up for it with a good third act, which sucks because the third act was actually not too bad.\r\n\r\nThe entire path of redemption message is interesting, but we've seen it done before, and with much better characters to say the least, but of course, this isn't saying that the path to redemption is bad to watch, but it is still bland and has been done multiple times before.\r\n\r\nIt was nice to see Bill Long become a semi-decent human being at the end of the film, because he realizes he has to now actually care for his son, Stu, but it doesn't really redeem him as a character within the film's boundaries. Also, Bill's character is an absolute D-bag throughout most of the film, so it makes it extremely hard to like him as a character by the end of the film . . . but, boy, if seeing that final dance with his wife wasn't something. . . .\r\n\r\nForgiveness is really what's at the core of \"Father Stu\", but I've already covered that previously. What I'm trying to talk about here is how almost all the characters have something they want to be forgiven for. Bill & Kathleen Long do seem to regret their choices that brought them to this point in their lives, and it's clear that they regret whatever tore them apart. As for Stu, he wants to be forgiven for everything. He regrets just about everything he's done in his life up to this point. The sad part about it is: There's just too much that Stu's done for the audience to really forgive him completely, although it is terrible what happened to him.\r\n\r\nIn my eyes, \"Father Stu\" isn't absolutely terrible, and I do think that it's mediocre at best by the end of the day. The third act is very well done, but because of all the other stuff beforehand it leaves a bad taste in my mouth. I think people should check this one out if they're interested, but other than that, just leave it be. Ultimately, \"Father Stu\" is a hard thumbs down for me.", "created_at": "2022-05-15T03:54:38.127Z"}, {"movie_id": 809140, "review_id": "62937b8c76eecf590ca3317d", "rating": 6.0, "review_text": "Mark Wahlberg is competent here as the eponymous boxer who takes a shine to the young church-going Carmen (Teresa Ruiz). He can't get near her, so he somewhat opportunistically decides to join her church and see if that helps. Thing is, pretty quickly he discovers that there is something to this \"God\" thing, and decides to try and get himself ordained for the priesthood - leaving all thoughts of the girl behind. Meantime, he discovers that he is suffering from a degenerative disease that will prove debilitating as he ages. It's one of those inspirational stories this, but I just didn't particularly like or empathise with \"Stu\". I found his profound and fairly sudden Damascine conversion hardly explained in the context of the film and except for a few decent contributions from the always reliable Jacki Weaver (his mother) the rest of this was all a bit lacking in substance. I never felt like I knew what made this man tick! It is nice to see Malcom McDowell back on the screen, and Mel Gibson is perfectly adequate as his rather indifferent father - but sadly, this whole film is a just another, sometimes touching, biopic of one man of many who live to inspire through their church (or not) whilst facing adversities and trials that trouble many people. It is watchable, but I'm afraid equally forgettable.", "created_at": "2022-05-29T13:56:28.841Z"}]