[{"movie_id": 531428, "review_id": "5d563f01bc86574b372d6721", "rating": 10.0, "review_text": "As the credits began to roll on ‘Portrait of a Lady on Fire’, I was practically incapable of moving or speaking. Every time I didn’t think the film could possibly get any better, Céline Sciamma elevated it to even greater, more incomprehensible heights, culminating in one of the most extraordinary moments in 21st-century cinema. This is a rare and precious film, breathtaking in its craft and intensely honest in its passions. This is a film that aches, that longs, that dances in ecstasy and raises its hands to the sky, angelic and ferocious and perfect. Simply put, ’Portrait of a Lady on Fire’ is a masterpiece, and one of the best films of this or any year.\r\n- Daniel Lammin\r\n\r\nRead Daniel's full article...\r\nhttps://www.maketheswitch.com.au/article/review-portrait-of-a-lady-on-fire-a-perfect-film-on-the-language-of-desire", "created_at": "2019-08-16T05:28:33.183Z"}, {"movie_id": 531428, "review_id": "5e1d239b95c0af0017113719", "rating": 10.0, "review_text": "The best LGBT movie ever. And that's on period luv.", "created_at": "2020-01-14T02:12:43.260Z"}, {"movie_id": 531428, "review_id": "5e7d573b6c849200126ac199", "rating": 10.0, "review_text": "Céline Sciamma, writer and director of “Portrait of a Lady on Fire,” calls her period film a “manifesto on the male gaze.” This is the most accurate, elegant description of her story of a romance between two French women in the late 1700s. This is an impeccably detailed, beautifully acted, refined drama with a strong feminist angle that’s as stirring as it is thought-provoking.\r\n\r\nMarianne (Noémie Merlant) is commissioned to paint the wedding portrait of Héloïse (Adèle Haenel), a young woman who has just left the convent. Because Héloïse is a very reluctant bride-to-be, Marianne arrives under the guise of companionship, observing the smallest of details about the woman by day and secretly painting her by firelight at night. As the two women spend their days with one another, intimacy and attraction grow, and the portrait becomes a symbol of the intensity of their love.\r\n\r\nThe lead performances are mannered and structured in the most effective way. The strong desire between the two women is manifested in a gaze or careful examination of a wisp of hair or the way Héloïse crosses her hands. There’s a quiet intensity to the emotional and physical intimacy between these two women, making this love story’s end feel all the more heartbreaking.\r\n\r\nThis is mostly an all-female film, and the men briefly seen on screen play little importance. Rounding out the characters are Héloïse’s mother (Valeria Golino) and housekeeper Sophie (Luàna Bajrami), who both fill critical roles in the story as the film explores issues affecting women at the time, including arranged marriages, career expectations, and health concerns.\r\n\r\nThe film itself is absolutely stunning, with gorgeously romantic and lush cinematography by Claire Mathon setting a sensual tone that complements the story. The artistry is outstanding, making “Portrait of a Lady on Fire” one of the most powerful, intellectual dramas of the year.", "created_at": "2020-03-27T01:30:35.173Z"}, {"movie_id": 531428, "review_id": "5f238df1c3514c00392df86d", "rating": 9.0, "review_text": "Undoubtedly worth a watch; who knew portraits were the Tinder of the 1700s.", "created_at": "2020-07-31T03:20:17.883Z"}, {"movie_id": 531428, "review_id": "62b0bfe43a48c5005257cf2a", "rating": 10.0, "review_text": "Full review: <a>https://www.tinakakadelis.com/beyond-the-cinerama-dome/2021/12/28/paint-me-like-one-of-your-french-girls-portrait-of-a-lady-on-fire-review<a>\r\n\r\nCeline Sciamma’s fourth feature film, _Portrait of a Lady on Fire_, is a triumph. Few romance movies capture the totality of love, loss, and remembrance in the way Sciamma does in this film. The story is simple: Marianne (Noémie Merlant) has been hired to paint a portrait of Heloise (Adèle Haenel) to be sent to the Milanese nobleman she is to marry. He will not marry her until he sees what she looks like. Other artists have tried and failed to paint Heloise, but she has resisted because she doesn’t want to be married. Marianne pretends to be Heloise’s walking companion, all the while studying Heloise so she can paint her in secret. Eventually, though, Marianne’s secret is revealed and Heloise agrees to sit for her.", "created_at": "2022-06-20T18:43:48.247Z"}]