[{"movie_id": 2502, "review_id": "5f92519a55c1f40037272a3c", "rating": 8.0, "review_text": "Well done sequel that's not quite as good as Identity but still entertaining. Most of the movie was shot well however could've done without the shaky cam during the car chase scene at the end. Otherwise, solid movie through and through. **4.0/5**", "created_at": "2020-10-23T03:44:26.760Z"}, {"movie_id": 2502, "review_id": "63e709afd388ae00b6392365", "rating": 8.0, "review_text": "**The Bourne Supremacy is my favorite of the franchise because it cranks up the action, raises the stakes but also remembers to grow and deepen its characters.**\r\n\r\nThe Bourne Supremacy takes Bourne to new heights with bigger set pieces and effects as well as new depths by exploring more of Bourne’s mysterious past and trauma. The action in Supremacy is cranked up with a larger budget allowing more exciting sequences with multiple car chases, explosions, and hand-to-hand fights. This sequel also highlights Bourne’s spy craft and skills at infiltrating. He pieces the clues of a mystery together by stealing information, flipping sources, creating new contacts, tapping phone lines, and more. In addition, matt Damon shows more of Bourne’s struggle and agony in this film as he discovers more about his past and is disgusted with his past misdeeds resulting in a quest for some sort of redemption. The Bourne Supremacy takes everything from the action to the storytelling to the next level with that sequel that, in my opinion, is the best of the franchise.", "created_at": "2023-02-11T03:21:19.421Z"}, {"movie_id": 2502, "review_id": "64f566c1e0ca7f00ae3af550", "rating": 7.0, "review_text": "\"Jason Bourne\" (Matt Damon) lives quietly with girlfriend \"Marie\" (Franka Potente) until a CIA-Russian deal goes wrong, their safety is compromised and after moving around from pillar to post trying to stay one step ahead of their pursuers - tragedy ensues. All of which drives the highly trained assassin to the conclusion that the CIA have screwed up his life for the last time - and he sets out for answers, and revenge! It hasn't quite the style of the first film, but as sequels go it's a strong, gripping effort with Brian Cox reprising his role as \"Ward Abbott\" and Joan Allen entering the fray as the CIA Deputy Director \"Landy\" who sees \"Bourne\" as a lethal threat who must be apprehended and/or eliminated at all costs. As with the first film, the story sticks closely to Robert Ludlum's book and Paul Greengrass picks up well from Doug Liman with a pacy and exciting story of betrayal and manipulation. Great stuff.", "created_at": "2023-09-04T05:10:25.506Z"}]