[{"movie_id": 278927, "review_id": "57acf1c89251415882000311", "rating": null, "review_text": "A great movie for the whole family. Watch my full review here.\r\n\r\nhttp://www.hweird1reviews.com/allreviews//the-jungle-book", "created_at": "2016-08-11T21:44:40.460Z"}, {"movie_id": 278927, "review_id": "57c8b6e1c3a3685be9000cf5", "rating": 8.0, "review_text": "> The red flower adventure!\r\n\r\nThe Rudyard Kipling's famous children's book was adapted numerous times for stage shows, television series, live-shot and animation films, and now here's the modern version and also the first digital 3D version. The Disney done it again bring all the classics to a new life, but it is a great team work, especially the post-production was terrific.\r\n\r\nIt is one of those stories never gets boring for repeat reading/listening/viewing. Of course, there were plenty of changes to the original source, but I would say it was upgraded so well. Jon Favreau did an awesome job as the director, definitely it is his one of the best films and will be remembered for very long. All the above he got the best screenplay with supportive production and crew.\r\n\r\nNeel Sethi was obviously a perfect choice for the man-cub, he had given his best and no one could doubt it was his first film. The entire film was shot in the studio settings and the whole time he had to act alone, because the remaining characters in the film are CGI. So in that viewpoint he actually did a breathtaking job being a very young.\r\n\r\nThe CGI characters were really excellent, but the non-fur animals like elephant looked a bit fake. I mean anatomically and character performances were perfect, only visually the 3D models were out of the blend in the screen with others. These are very small things to notice, but for the todays technology, it was not bad, especially thinking the film is primarily targeted children.\r\n\r\nThe story was simple, like half of the film was an introduction and almost all the important characters from the book were launched at a high profile. It was actually the story with a backdrop of red flower. So the narration moves different part of the jungle, lot like the levels in a game. Various adventures take place and well composed stunt sequences.\r\n\r\nI mentioned stunts right, but there were no violences, I mean nothing seriously to concern about as expected for a Disney film. Yet because of those actions, the film is very much suitable for adult viewing. So apart from the children and families, it can be watched by anyone. One of the top Disney films to do best at the box office worldwide by grabbing almost $1b.\r\n\r\nSo aggressive, furious Shere Khan ever to portray. I think the little children may get scared for his unpleasant face look and the strong roar. By the way all the songs were amazing and the end credit was very interesting. Finally, I saw it after a long wait and anticipation, most importantly, I'm very happy how beautifully it was made.\r\n\r\nThe film was not shot in India, but the locations were so resembling and gives the perfect Indian feel. Climbing a cliff by Baloo and fighting the monkeys, like that there were numerous jokes. Surely one of the grandly made children's film at the recent time. I've heard the sequel is already on the progress, so bring it on, at least a trilogy before Neel turn to a big boy.\r\n\r\n8/10", "created_at": "2016-09-01T23:16:49.501Z"}, {"movie_id": 278927, "review_id": "57c9773d9251415e9f0005e1", "rating": 5.0, "review_text": "I had only one true issue with Jon Favreau's _Jungle Book_, and while it does seem like sort of an unfair one, it's also a pretty huge one.\r\n\r\nFor months before I got the chance to see this remake, I heard non-stop about what a great actor the kid playing Mowgli was, how photorealistic all the animals were, and how you would never be able to guess that the backgrounds were all actually sound stages that had been animated over. Well I just watched _The Jungle Book_, and I found all three of those compliments to be patently untrue. That might sound like three issues, but in reality they all boil down to the same one thing, suspension of disbelief. Or more accurately, the lack of it. From the word go, there wasn't s moment that I found myself being continuously drawn out of the story because of one of those reasons (usually the look of the creatures). I was not once able to fully engage, and though I recognise that from a plot point of view, this version was even better than the 1967 one, I still found myself constantly aggravated by the harsh meshing of Mowgli against the world around him.\r\n\r\n_Final rating:★★½ - Not quite for me, but I definitely get the appeal._", "created_at": "2016-09-02T12:57:33.765Z"}, {"movie_id": 278927, "review_id": "58b03fcf9251411a6000e8e2", "rating": 8.0, "review_text": "This is without a doubt a very good family movie. Many people seem to compare it unfavorably with the “original” animated movie from Walt Disney. To me these are quite different movies and should not really be compared. I have not read the book but I have a feeling that this movie follows the book more closely. It is a wee bit darker, more serious and incredibly beautiful to watch.\r\n\r\nI quite liked the original jungle book movie. It was one of my favorites when I was a kid. I am therefore quite happy that this was not just a “dumb” remake with modern CGI and that I quite liked this take of the classic story. This movie is, as I wrote, much more serious and a wee bit darker. It is less of a children’s movie than the original.\r\n\r\nThe wolves are getting much more time in this movie which is good. Mowgli’s opponents are also much less comical and much more sinister. Kaa is a beastly snake with no remorse, King Louie is a huge, scheming, and tyrannical ape King and finally Shere Khan is a ruthless, human hating, tiger that kills anyone or anything that stands in his way.\r\n\r\nThe CGI is top notch as far as I am concerned. The jungle scenery is absolutely stunning and it is really worth watching the movie just for the scenery. Combined with a classic adventure story that is not half bad makes for a really a good movie.\r\nI was definitely positively surprised by this movie. For me it is a big success.", "created_at": "2017-02-24T14:14:39.085Z"}, {"movie_id": 278927, "review_id": "5f1100b943494f0033336f47", "rating": 6.0, "review_text": "Really good watch, would watch again, and can recommend.\r\n\r\nI'll honestly go as far as to recommend this over the original 1967 version.\r\n\r\nI don't think is quite as charming as the original, and it has a very different animation style, both with great quality of detail in it.  From the individual strains of fur, to the types of animals included (I've done so much research on Indian wildlife today), you can really see the details of the cg effects.  Just watch the end credit sequence alone, and it'll prove it.\r\n\r\nThere are 3 huge improvements to this versus others: Sher Khan's face, King Louie, and the intensity of the animal fight scenes.  The movie isn't free of problems: I imagine someone will have issues with talking animals vs non-talking animals, that he'd have to learn the language (so how would he ever understand Sher Khan or Baloo?).\r\n\r\nIf anything, I think the writing took a hit.  Where the original had a subtle but strong fables sequencing to it (sort of modular moral stories with shifting focus on characters), this is structured much closer to how many video game stories are structured, serialized chapters with some level of power creep and shifting focus of environment and goals but all focused on Mowgli.  And I don't think the writing is bad, but this Jungle kid (never actually reveals his backstory, somewhat of a relief honestly) is performing clean engineering using vines and pulleys and armor (that wouldn't work) with calculated positioning.  I understand that some people just have talent for some things, but I had to question whether or not I could do the same thing.  I could, but I'd have to do it different ways.\r\n\r\nAnd in all fairness some of the stupid /inconsistent things he gets up too, even though he's a \"take charge\" Mowgli in this version really got to me: I was literally cheering for Sher Khan at certain points.\r\n\r\nUltimately I had a good time with it, and I think most people and possibly their pets will too (my cats were interested for a while).", "created_at": "2020-07-17T01:36:57.312Z"}, {"movie_id": 278927, "review_id": "65748625cadb6b080f8ff573", "rating": 7.0, "review_text": "An uneasy truce between the wolves and tiger \"Shere Khan\" becomes tested as \"Mowgli\" (Neel Sethi) gets older and harder to keep safe. Pre-empting things getting even more dangerous, they send him under the guardianship of the panther \"Bagheera\" to the nearest man village where he can grow up with his own kind. What now ensues are some engaging adventures through the jungle where he meets the clever bear \"Baloo\" - who knows how to get his honey supply sorted out; \"Kaa\" - the devious snake and, of course, the Kong-esque \"King Louie\". Now \"Mowgli\" isn't exactly sold on the man village thing, and the more he spends time in the forest with it's critters the less he wants to spend time with his people. Can \"Baloo\" and \"Bagheera\" deliver him in one piece? \"Bare Necessities\", \"Trust in Me\" and \"King of the Swingers\" add a bit of hypnotising and toe-tapping to a rather creatively animated story that merges the plentiful CGI with the live-action scenes really well - especially at the conflagration that is imaginatively created with quite a bit of menace and, of course, a nod to the healing balance of nature. Sethi has something of the Sabu to his performance. It must have been difficult for him to work with so much green screen, but he still manages to inject a degree of natural characterisation into his efforts - especially with the pesky bees and the even more pesky apes. It's not a great film for television - if you can see it at a cinema, then the photography and creativity accompany Roald Dahl's story of friendship and loyalty enjoyably.", "created_at": "2023-12-09T15:22:13.642Z"}]