[{"movie_id": 48303, "review_id": "50ae52b9760ee323150014c0", "rating": 8.0, "review_text": "Sweet movie about the living troubles of a 15 years long couple.\r\n\r\nJuliette Binoche and William Shimell do a great performance.", "created_at": "2012-11-22T16:28:41.000Z"}, {"movie_id": 48303, "review_id": "5b0ae8a20e0a260d890093dd", "rating": 6.0, "review_text": "Abbas Kiarostami's last few films were made outside his native Iran, and his 2010 effort CERTIFIED COPY is set in the colourful towns and countryside of Tuscany. Its two main characters have arrived in Italy from elsewhere: a Frenchwoman (never named, and played by Juliette Binoche) has lived in Arezzo for several years now, running an antique shop, while James (William Shimell) is an Englishman invited to lecture on an art history book that he has written.\r\n\r\nAs the film opens, James is in fact giving that lecture, speaking of how a high-quality copy of a work of art may said to be better than the original. He soon meets the French antiques dealer, and the two spend an afternoon touring the nooks and crannies of Tuscany. With the Frenchwoman’s awkwardness and Jame's suave, confident air, Kiarostami is clearly riffing on the romantic comedies of the last two decades. But then the film takes a magical-realist turn: the two begin speaking as if they have been married for many years already. The apparent relationship between the two continues to evolve and morph over the course of the film's 106 minutes (and what seems to be for them just a Sunday afternoon spent together) as Kiarostami broods on the nature of marriage as the years go by: people change over time, a husband and wife will eventually be rather copies of their youthful selves, but will they be copies better than the originals, or a sad mockery of their youthful idealism?\r\n\r\nFor anyone who has been married (people who haven't may not get much of the film), CERTIFIED COPY is a moving evocation of the rigours of staying together with another person, and the shadowy undercurrents of even apparently happy unions. However, I was ultimately left with mixed feelings. Starting this film with a highly didactic lecture was, in my opinion, a bad choice: no audience wants to feel lectured to right off the bat. Then, the script is a bit too conversation-driven, becoming in parts a logorrhea that will overwhelm even viewers who can understand its trilingual French-Italian-English dialogue (it's probably horrible for those who rely on subtitles). Kiarostami could have trimmed the dialogue without sacrificing any part of his message.\r\n\r\nBefore making this film, Shimell had been known only as an opera singer on the stages of Europe. He manages to make the leap to film actor quite well, with all the subtlety that his role requires -- indeed, I know someone quite like James in both background and personality, and Shimell's depiction bore a resemblance so close it was chilling. Juliette Binochedeftly manages to change her mood and bearing instantly to signal another shift in the film's intrigue. In spite of the European setting, much of Kiarostami's personal technique remains (as well as general aspects of the Iranian New Wave like only the voices of minor roles heard, with the characters themselves not shown onscreen).", "created_at": "2018-05-27T17:19:30.114Z"}]