[{"movie_id": 425, "review_id": "62f80880a313b8007cf3b5d9", "rating": 7.0, "review_text": "\"Manfred\" the mammoth is heading north just as just about every other critter is migrating the other way to avoid the harsh winter. Unfortunately for him, he encounters the sleepy-head sloth \"Sid\" whom he rescues from a pair of rhinos, only to bitterly regret his kindness as this pesky mammal is soon getting on his nerves. Meantime, a pride of sabre-toothed tigers are plotting revenge on a human village whose hunting parties have taken their toll on their now dwindling numbers. Their target is a baby - but luckily it's mother manages to plunge it off a waterfall where, drenched, it is rescued by our two squabbling travellers. The tigers still haven't given up hope of securing their rather meagre lunch, and \"Diego\" - a sort of wily and menacing character is charged with luring the party to an ambush at \"half peak\" where their trap will be sprung.... This is all fairly predictable fayre, to be honest. You just know that the initial hostilities will all mellow and that teamwork, resilience and loyalty will prevail. It's not without it's humour though, and there are some fun animated action scenes that use well the surrounding snowy scenarios. Personally I found it better when it was just the beasties, the human angle was a little dull and didn't really add much. Some good scoring mixing modern with classical styles, a bit of fun ice skating and \"Diego\" did rather enjoyably remind me of \"Scar\" from the \"Lion King\" (1994). I saw it on my own at a cinema this morning which was a shame - it's a solid story with some reasonable characterisations and the animation is efficient rather than ground breaking. Certainly it is all just a bit too derivative, but 20 years on, it still has traction and I did rather enjoy it.", "created_at": "2022-08-13T20:24:32.764Z"}, {"movie_id": 425, "review_id": "64a3efc0e8d02800ff8b3299", "rating": 8.0, "review_text": "I actually enjoy this animation series. Every one is really funny and has a good story.", "created_at": "2023-07-04T10:09:04.805Z"}]