[{"movie_id": 418078, "review_id": "59b6a959c3a3682aee015db0", "rating": 5.0, "review_text": "I don't need happy endings in my movies. A downer ending is often what makes a movie great. But I do like satisfactory ones. _It Comes at Night_ did not give that to me. Mystery is often its own reward, and I do believe that's what writer/director Trey Edward Shults was going for here, but it didn't wind up hit that resonant for me. This particular movie felt like it wasn't about the journey, it was about the destination, and we essentially didn't get one.\r\n\r\nJoel Edgerton is fantastic of course, but any one of the other actors could have been as well, we'll never know because they were never given that opportunity. Which really says it all with _It Comes at Night_. There seemed like there was something very worthwhile just on the other side of the veil, but we'll never know, because we never got to see it. And with cinema, if we didn't see it, does it really count?\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2017-09-11T15:18:49.034Z"}, {"movie_id": 418078, "review_id": "5a1ebf44c3a3680b8d07a922", "rating": 6.0, "review_text": "**It's always family first in the apocalyptic world!**\r\n\r\nIt was not what I was expecting, enjoyed it though. The trailer, the posters hints something else. So I thought it could be a horror, but it was even a terror or a thriller flick. Well, there were a few occasions where it was edgy, though in the most of the film nothing really happened. Slow but not boring. A simple storyline, limited cast and a apocalyptic theme. Surely you would have seen hundreds of this kind, so when you watch it, you won't find anything new out of it. Then remains the question, is it any worth!\r\n\r\nI liked a simple take. Just like the film 'The Survivalist'. A small family living in an isolated place, but very precautious about any outside threat. The world is infected with an unknown disease and people are dying everywhere. Recently they had buried one of their family members. So they are not taking any chances with anyone. But now after a terrifying encounter, another family joins them and how things go on from there are the rest of the tale to tell us with a small twist.\r\n\r\nWell, you won't see Joel Edgerton doing a solo film often. But this was a different, because of a small budget and the kind of narration. He did good and so the rest his co-stars. Firstly, it was not a horror film. Then there were a few intentional scenes to scare the viewers, but it wasn't anywhere near to scary. I've watched the whole film and I still don't know what comes at night. Dreams? Nightmares? Looks that's what it implies. Other than that it is a drama film with a little thrill. It can be watched nothing more than once.\r\n\r\n**6/10**", "created_at": "2017-11-29T14:08:04.903Z"}, {"movie_id": 418078, "review_id": "63b243b657530e0080150103", "rating": 3.0, "review_text": "**The marketing made me expect something this movie was not and ultimately dissatisfied me with what I got.**\r\n\r\nMarketed as a horror creature movie, It Comes at Night disappoints due to the severe lack of creature horror. Instead, the film follows a family surviving an apocalyptic virus that has all but wiped humanity off the face of the earth. Paranoia saturates every moment of the movie, with characters constantly fearing how others might attack or infect those they care about. The film's scariest moments are the weird dreams the son keeps having. The twists at the end most likely are meant to shock but left me deflated. While It Comes at Night might be beloved by cinema fanatics, I couldn't get past the deceptive marketing. I wanted monsters and got family drama and paranoia.", "created_at": "2023-01-02T02:38:46.947Z"}, {"movie_id": 418078, "review_id": "63daa99ea9117f007f21f026", "rating": 8.0, "review_text": "It Comes at Night is very realistic interpretation of a post-apocalyptic world which follows a family trying balance survival with their own morality.\r\n\r\nI found almost every aspect of the story to be incredibly grounded; from the way the house is set up to the interactions between our main two families. The whole entire film the families are walking on eggshells trying not to disturb the peace that has settled for our main characters. No matter how long these two families have been in each other's company, they cannot truly trust each other in these desperate times. It creates a significant amount of tension as the audience is nervously waiting for the ultimate end to their harmony.\r\n\r\nThe cinematography and sound design are excellent in this film. The shots from inside the house feel incredibly claustrophobic and maze like, especially in the night scenes. The audio creates some truly terrifying moments as the muffled sounds of banging and rummaging echo through the halls. \r\n\r\nOur performances are all excellent. The extremely raw, pragmatic, and emotional mannerisms our characters display work so well with the dark and gritty reality of their world. Kelvin Harrison Jr. was a standout, his empathetic nature mixed with dark foreboding undertones was a very complex role that I think he nailed. Joel Edgerton was also great as always.\r\n\r\nOverall, It Comes at Night is a great film and interpretation of what a real apocalyptic event would be due to the world and humanity that I really enjoyed despite its limited action.\r\n\r\nScore: 81%\r\nVerdict: Great", "created_at": "2023-02-01T18:04:14.457Z"}]