[{"movie_id": 629542, "review_id": "624abe8815a4a1006380d546", "rating": 6.0, "review_text": "The \"Bad Guys\" make the most secure location look like a candy store, and they tease the hapless police chief \"Luggins\" who seems incapable - despite having gazillions of officers - to catch them. Enter the new governor \"Foxington\" who basically ridicules them, declaims their achievement and provokes them into pulling the ultimate crime - the theft of the golden dolphin. What now ensues is an \"Ocean's 5\" style logistics exercise as the five of them carefully plan the theft. The trophy is to be presented to the icon of decency \"Professor Marmalade\" but is he quite who he seems? Is the governor? These films are a bit ten-a-penny, and this one isn't really very special. The dialogue is entertainingly quick-fire now and again (especially the snake and the piranha); \"Weaps\" - the extra nimble taratunla provides the gadgetry and the animation is efficient with plenty of action once the film gets moving. The ending, though, is daft and hurried and who knew there were so many millions of guinea pigs in the world!? I saw this on my own on a big screen, but I think this will do just as well on the television.", "created_at": "2022-04-04T09:46:48.187Z"}, {"movie_id": 629542, "review_id": "6259938374d6c01b71085168", "rating": 8.0, "review_text": "I really enjoyed the movie. It's funny, the action scenes are very well done, the characters are charming, the dialogues are excellent and the animation style, in a mix of 2D and 3D, is the icing on the cake to complete an (almost) perfect animation.\r\n\r\n'Almost' because the plot was pretty average. It's interesting and even brings a nice message, but I think it lacked a little more development, especially in making the movie more unpredictable. Halfway through the movie you already knew who the villain was and how the movie was going to end. They even added multiple 'twists' to make the story more unpredictable, but almost all of them were far-fetched and failed to surprise me.\r\n\r\nDespite that, this movie was a breath of originality from Dreamworks after a decade of bland animations. I'll give it a solid 8.", "created_at": "2022-04-15T15:47:15.557Z"}, {"movie_id": 629542, "review_id": "62640738f48e0d31edddb24c", "rating": 8.0, "review_text": "It’s a shame that the story isn’t nearly as appealing as the animation in _The Bad Guys_. The film is smart and funny with slick animation. _The Bad Guys_ is a delightful heist that you crave to be a part of.\r\n\r\n**Full review:** https://hubpages.com/entertainment/The-Bad-Guys-2022-Review-A-Visually-Stylish-Animated-Caper", "created_at": "2022-04-23T14:03:36.317Z"}, {"movie_id": 629542, "review_id": "62dc8cf9dc1cb4004fab83e5", "rating": 7.0, "review_text": "MORE SPOILER-FREE REVIEWS @ https://www.msbreviews.com/\r\n\r\n\"The Bad Guys is one of the lightest, most pleasant, genuinely positive viewings of the year. With a clear distinction between being \"good\" and \"bad\", stereotypes and preconceived notions are brilliantly addressed in a sweet redemption story that doesn't try to reinvent the wheel.\r\n\r\nThe voice cast is exceptional, elevating an admittedly formulaic narrative in a remarkably impactful manner. Despite being more geared towards children, the entertainment levels are high enough for any generation. The blend of 2D and 3D animation works flawlessly, offering an overall distinct look compared to what audiences are used to.\r\n\r\nIn the end, it's yet another recommendation for families.\"\r\n\r\nRating: B", "created_at": "2022-07-24T00:06:17.800Z"}, {"movie_id": 629542, "review_id": "631fa40eb4a543007d41514a", "rating": null, "review_text": "Visually great and stylistically cool! Wish it was a bit less derivative, but the character dynamics and lightness really keep that from being too big of a detractor for me. I had fun!\r\n\r\nAlso: love the fact that the guy who says “Marmalade” in PADDINGTON 2 is named Professor Marmalade in this.", "created_at": "2022-09-12T21:26:38.246Z"}]