[{"movie_id": 9966, "review_id": "58a3976592514157b20000b7", "rating": 5.0, "review_text": "Americanized Pang brothers go mainstream and sadly the results are not very good. I actually wanted to like this film, because I enjoyed the Pang Bros. previous well-known horror film \"The Eye\" and for that reason alone, I had some really high hopes with this one too. Well, I guess it was my bad and I must say now that I'm genuinely disappointed; since I was expecting something that would be just as dark and scary as \"The Eye\", considering that we are talking about the same directors, but this time, they even had a bigger budget to work with. Proof that good directors can screw it up (or at least in my humble opinion) and that won't have anything to do with the financial resources.\r\n\r\nIn \"The Messengers\", the Solomon family, moves to an isolated farm, with the purpose of starting a new life and leaving an unpleasant memory behind. However, as soon as they arrive to their new house, the teenage daughter Jess, starts to experience some really odd situations and she claims to see people living inside the cellar. Creatures that are not in peace with themselves and need to give her a message before it's too late. However, her parents, who are pretty much fed up with her and her dreadful behavior, don't believe a word she says. Unfortunately, it is only a matter of time for them to realize that Jess may not be lying this time, after all and that there's actually something in that house…something that has been waiting in the dark for a few years and is waiting to be released.\r\n\r\nI won't complain about the fact that these kinds of stories were already told about a thousand times. I'm not one of those movie fans who complain about the lack of innovation when it comes to the plot. Honestly, I think most films (especially horror films) out there, share a decent number of similarities and while many reviews comment on the simplicity and unoriginality of the plot, I will mainly focus on the fact that this film is overall not scary, which is my main concern. It seems like The Pang Bros. basically sold their talent to the devil, just to enter in the American film industry, without realizing that there was no need to copy the most superfluous and silly PG-rated contemporary horror flicks. \"The Messengers\" turns out to be one of those movies where nothing really happens...ever. It's just a nice variety of hallucinations and situations that end up being reduced to \"Did it really happen or was it just my imagination?\". No, I'm sorry but I just had about enough with these nonsense. I suppose the real action starts happening during the last twenty minutes, but that just doesn't do it for me. The denouement turns out to be somehow far-fetched and it left me with the hateful \"That's it?\" feeling inside my head. Overall, not the worst movie ever and it's not like it is unwatchable. It happens to be entertaining for moments and it has a small number of well-done ghostly sequences that made the whole thing endurable in some way. I also enjoyed the scenes with the crows, since they reminded me a lot of \"The Birds\", which is like partying with an old best friend, or something like that. The music during the opening and final credits is in my opinion the actual high point and that is not a very good sign, unfortunately. Another thing that is not exactly a good sign, would be the overhead microphone that can be seen more than once during the film. No comments about that little detail.", "created_at": "2017-02-14T23:48:53.618Z"}, {"movie_id": 9966, "review_id": "5f641a101684f70036425926", "rating": 4.0, "review_text": "Bad watch, probably won't watch again, and can't recommend.\r\n\r\nI actually like Kristen Stewart, and I think she performed decently in this, but she worked her ass off carrying the movie.  John Corbett was the only other person pulling their weight in this movie.\r\n\r\nThe story itself was okay, but it does have a lot of problems.  My biggest was just their defiance of reality.\r\n\r\nThe \"in you face\" thing is that the farm is plague with \"crows\" that are clearly ravens.  This is done because you can train ravens much easier, but they're GIANT birds by average comparison of what size birds most people see.  And then they do stupid things like leave feed out far enough away from where you would take it (those are not light bags), and when birds come, he shoos them farther into the car as the trunk is the only part open.\r\n\r\nThey are planting sunflower seeds, which just means lots of things trying to eat it, but the timeline is all over the place.  They go to plant seeds, and there are tiny plants in the background.  There is an incident early on, then what seems like a week passes, but then it's almost end of harvest.  And then there is still a giant bag of seeds to plant, and it isn't part of the harvest because it's by itself and I don't think they start harvesting during the movie.\r\n\r\nThere is also the mold which she doesn't seem to know how to treat or why it would come back...just silly.  But its details like these that show how poorly written the script is, especially the dialogue.\r\n\r\nThe effects are actually pretty interesting, they did a good job on the birds, the wall, and the \"flowing ground\" was really interesting, but it's not enough to have a cool effect or two.  You might as well, just have lots of odd explosions then.\r\n\r\nOverall, just not worth the watch, unless you want to see a movie where Kristen Stewart is objectively the best actor.", "created_at": "2020-09-18T02:23:12.114Z"}, {"movie_id": 9966, "review_id": "61916225f85958002b72a60c", "rating": 4.0, "review_text": "_**Little Haunted House on the Prairie**_\r\n\r\nA troubled family from Chicago (Dylan McDermott, Penelope Ann Miller and Kristen Stewart) moves to the prairie of North Dakota after purchasing a dilapidated farmhouse where they plant a sunflower crop. Unfortunately, the estate’s past interrupts their enjoyment of their new home. John Corbett plays a drifter who hires-on while Dustin Milligan plays the daughter’s potential beau.\r\n\r\n“The Messengers” (2007) is a haunted house flick from the Pang brothers of Hong Kong, which is their first American film. The basic set-up is exactly the same as “Cold Creek Manor” (2003) with the difference of a rundown farmhouse substituting for the woodsy manor. From there it throws in elements of “The Grudge” movies mixed with “The Amityville Horror” and “The Birds.” \r\n\r\nWhile I appreciated the colorful prairie setting, this is easily the least of these because the story is too simplistic and dramatically dull. Fans of Kristen might be interested though; she was 16 during shooting.\r\n\r\nThe film runs 1 hour, 30 minutes, and was shot at Indian Head and nearby Regina, Saskatchewan, Canada, which are just a couple hours’ drive north of the border of North Dakota.\r\n\r\nGRADE: C-", "created_at": "2021-11-14T19:23:17.903Z"}]