[{"movie_id": 610253, "review_id": "6169df8d6728a8002a5d5f0f", "rating": 4.0, "review_text": "Given I wasn't a big fan of Halloween 2018, the bar on Halloween Kills was rather low and... pretty much met it. While some of the deaths were pretty gruesome, the rest was kind of bland and character decisions as dumb as others. Like the initial sequel, Halloween II, Jamie Lee Curtis spends the bulk of her time in the hospital.\r\n\r\nThere was also a scene early on when Michael fights a bunch of firefighters just came off as silly looking, maybe because I'm so used to seeing him butcher people one by one, the shot, beyond being clumsily choreographed, showed him taking on 5-6 people; just looked strange.\r\n\r\nI don't know, there's not a whole lot to this sequel and like Halloween '18, not sure I look forward to revisiting. **2.0/5**", "created_at": "2021-10-15T20:07:41.729Z"}, {"movie_id": 610253, "review_id": "6175c636fd7aa400908a2049", "rating": 1.0, "review_text": "What would happen if a bunch of Trump followers would try to kill Michael Myers?\r\nWatch this movie and find out the hard way or take a good nap.", "created_at": "2021-10-24T20:46:46.257Z"}, {"movie_id": 610253, "review_id": "62bdfb13eb64f1058d79c1c3", "rating": 4.0, "review_text": "When Halloween (2018) hit the screen, it was a breath of fresh air to the franchise bringing more gore while still maintaining the roots of suspense. This movie does away with the later, making Michael and killing machine in some scenes. Add that with the unnecessary social commentary, forced return of former castmates, and unlikeable characters that make your root for Michael. I was waiting for this movie to end, bad sign.\r\n\r\n**Verdict:** _Poor_", "created_at": "2022-06-30T19:35:47.199Z"}, {"movie_id": 610253, "review_id": "6540f44b57530e012cf4b9a7", "rating": 7.0, "review_text": "A worthy effort, if nothing all that memorable.\r\n\r\nI found <em>'Halloween Kills'</em> to be a touch below 2018's <em>'Halloween'</em> in terms of entertainment and general interest, but like that one it does what it needs to do and produces something that is (narrowly, in this case) worth watching. I would've liked a bit more progression in the story, as this very much feels like the middle entry in a three-parter.\r\n\r\nThis flick gives more screen time to those around Jamie Lee Curtis, which isn't necessarily a positive (given Curtis is as good as she is) but the actors all do find jobs - even if no-one particularly stands out, at least to me. Away from the cast, the deaths are solid and the use of the iconic theme is spot on.\r\n\r\nI didn't love this, almost nonplussed by it in truth but overall I think it just does enough to merit being filed under 'good'.", "created_at": "2023-10-31T12:34:19.388Z"}]