[{"movie_id": 239563, "review_id": "60368c2e336e010041907199", "rating": 8.0, "review_text": "Great watch, would watch again, and do recommend.\r\n\r\nAny movie that gets me to well up with tears is an automatic winner in my book.\r\n\r\nI always wanted to see Bill Murray play a grumpy old man, and this movie is a little more \"About a Boy\" than \"Up!\", but it's a good middle ground between the two.\r\n\r\nThere is something wholesome, even when it's specifically not, about a kid being taught life lessons by someone.  It's something special that I feel like I haven't see enough of, and I'd love to do myself.\r\n\r\nIt's also interesting to see a coming of age story that doesn't revolve around the character coming of age and a romance.  It is possible to grow up without focusing on sex, it's like a reverse Bechdel test.\r\n\r\nThis is completely worth the watch, and the movie does a great job of embodying it's own message of being rough on the outside with goodness on the inside.", "created_at": "2021-02-24T17:26:06.751Z"}, {"movie_id": 239563, "review_id": "63230c083d35570084228d01", "rating": 8.0, "review_text": "i had watched this years ago, and upon watching it again recently, I was surprised to see that it features Melissa McCarthy. I must not have been as familiar with her special comedic skills then as I am now or I would have remembered.\r\n\r\nThis is one of my favorite quiet films. It ends up as a feel good movie — one of those where a large group of people appreciate someone at the end. Like anything from the Alan King character in Memories of Me (at his funeral!) to the exceedingly less likable Al Pacino jerk in Scent of a Woman. I believe the Vin character would be less likable himself in the hands of many actors. I have been pleasantly surprised at Bill Murray’s acting curve since Saturday Night Live. He brings bits of himself into most roles, I think, but he is great at subtle gestures, tone of voice, pausing for effect, and other tools of acting. He reminds me of Mark Ryland, who also makes acting look easy. I actually feel sure that Murray’s totally improvised the final scene during the end credits where he waters a plant and everything else in his back yard.\r\n\r\nI like that the movie doesn’t take shallow, cheap shots at people like it could. Even the cheating, divorcing dad is given a more positive spin before we are done. The four main actors are terrific here, and the two child actors who play Oliver and the bully are great also. \r\n\r\nAs a side note, I saw a statistical oddity on a certain review site name after a rotten vegetable (or fruit, depending upon who you ask), as this is the only movie I have looked up that has the exact same rating by both the critics and the audience (78). That sounds about right to me, too. And speaking of credits, I really need to try to stop wincing when I see The Weinsteins listed in the opening credits.", "created_at": "2022-09-15T11:27:04.787Z"}]