[{"movie_id": 399057, "review_id": "59bb359ac3a3680ef0004b79", "rating": 9.0, "review_text": "My immediate response as soon as this finished was \"MASTERPIECE.\" Lanthimos is back to _Dogtooth_-level craziness with this film and I couldn't be happier. _The Lobster_ was a favourite of mine in 2016, but something about this one's hopelessness drew me in more - odd, I know. Lanthimos' films have characters stuck in dead end situations where they are able to make a choice, but the results of the options are bad and worse. It's a dour story and the film is relentlessly unsettling, but this is what I've come to expect and want out of this Greek maestro.\r\n\r\nSacred Deer is a suburban Greek tragedy that draws inspiration from Euripides’ _Iphigenia in Aulis_ - a character even mentions this title in a key scene - and it plays out both as you'd imagine and with great shock and originality. Lanthimos and his writing partner Efthymis Filippou may just be my favourite writing team working today - they haven't let me down yet.\r\n\r\nThe cast is spectacular here with Nicole Kidman and Colin Farrell in top form bringing the odd words of Lanthimos and Filippou to life - albeit a very, very strange life. Farrell, having worked with Lanthimos on The Lobster, had nothing but high praise for the director during tonight's Q&A after the screening of the film. He even said they were planning another project to work on together. He's slowly becoming a muse and their relationship is turning into a DiCaprio-Scorsese type partnership (except I look forward to these way, way more).\r\n\r\nThe audience I was in had a hard time with this film - there was audible shock and disgust during the film and the applause as it ended was slight. I think people were genuinely scandalized by this one and that makes me like it even more. Keep shocking audiences, Lanthimos, you Greek bastard. I'll be in line every single time!", "created_at": "2017-09-15T02:06:18.196Z"}, {"movie_id": 399057, "review_id": "5a2cc32a0e0a264cc81519b9", "rating": 5.0, "review_text": "I am a big fan of some of Yorgos Lanthimos' earlier work, so _The Killing of a Sacred Deer_, which I had been told in no uncertain terms would be a straight up horror movie, was well and truly on the agenda for 2017. Unfortunately, I found that not only was _Sacred Deer_ not at all a horror, but more importantly that it lacked the dark whimsy of something truly odd, like the director's previous film, _Lobster_. Instead it opts for an outright uncomfortable tone. The world is real, boringly so, and it is only the characters who seem unbelievable. Which is a 180 on the sort of absurdism I usually gravitate towards. That said, _Sacred Deer_ still contains some beautiful cinematography, and a couple of the most genuine laugh-out-loud moments I've seen in a movie all year.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2017-12-10T05:16:26.168Z"}, {"movie_id": 399057, "review_id": "5a3dbaa0c3a3680ba60070b6", "rating": 7.0, "review_text": "Finally got the chance to see this via Amazon.\n\nDogtooth and The Lobster (from the same Greek director, who I must admit has a keen sense of storytelling) did not impress me at all. Very interesting ideas; atrocious presentations. Dogtooth was indecipherable and The Lobster is cruel, ugly, and not humorous in any fashion (I've no idea why it's billed as a black comedy.)\n\nHowever, this latest film is entertaining to me despite it's grim and inky-black nature (based on the ancient Greek play, which is where the title is loosely derived from.) Perhaps it's a bit more straight-forward despite its cryptic nature, a bit more involved in some form of reality we can recognize and less inference as to what the hey is really happening. But I sure watched it w/ more interest than The Lobster (I've no interest in the director's film prior to that one.)\n\nA successful heart surgeon (w/ a past history of alcoholism, sober for some time at present) is shown to have an uneasy alliance w/ the teenaged son of a patient who died on the operating table. It's clear the boy has some hold over this surgeon, who seems eager to please him but his heart's not into it (no pun intended.)\n\nThe boy's true intentions are revealed as events move forward; the surgeon's wife and two children (a few years apart, both intelligent in their own ways) are placed in grave danger as well as dear old Dad, and to reveal just how would spoil it for first-time viewers.\n\nThe camera-work here is impeccable, as are the jarring soundscapes, found-sounds, and industrial noise which makes for harrowing listening. The actor playing Martin, the teenaged oddball w/ a shared secret, is riveting to watch in a well-suited role. \n\nSacred Deer isn't so much a horror-film as a drama w/ strong elements of dream-like reality, awkward young romance, and assorted chills and cold calculated sex-scenes involving \"playing dead\" and \"the other.\"\n\nMy biggest complaints would be as before w/ this director's work: everyone speaks their lines as if hearing them through an ear-piece to parrot back, which makes the cast seem rather stilted and robotic. This director favors a weird tangent of \"Mamet-speak.\"\n\nThe ending is about what you'd expect, following the matter-of-fact discussions which precede it. Up until that point Sacred Deer does a pretty good job keeping us wondering what will happen next, where will things lead, what is that kid's gift and whereupon was it bestowed; unfortunately the outcome isn't as entrancing or unexpected as I'd hoped.\n\nBut overall worth my time to watch. Considering how disappointed I was by the previous films by the director I'd watched (great reviews, all of which confounded and puzzled me) this film was much less of a bore and a chore to watch. A pleasant, unpleasant surprise indeed.", "created_at": "2017-12-23T02:08:32.777Z"}, {"movie_id": 399057, "review_id": "60df7b0c1e9225002cc127f8", "rating": 3.0, "review_text": "**What a shame this could have been excellent**\r\n\r\nThis film depicts the life of upper class people as we like to imagine it, and brilliantly so. The medical doctors couple have it all figured out, speak in complete sentences and are firm and polite. The house is gorgeous, the children are smart and well behaved. The setting of the story as a whole is very well done, believable and with great actors to boot.\r\n\r\nThe score is not so great. At times we have experimental \"music\" that just annoys and does nothing for the mood, but the visuals are exciting to watch, we have interesting camera angles, no shaking and clever zooms and motion.\r\n\r\nThe pace is slow, yet \"The Killing of a Sacred Deer\" is never boring. There is always a plot twist which is explored after, things take their time but rightfully so.\r\n\r\nWhy the relatively detailed review for a 1.5 star rating? The problem is that the climax is just a huge letdown. The audience can't help themselves but wonder what is going on, guessing on the crime the apparently genius 16 year old villain commits. It is never explained. The makers thought it would be enough to have the bad guy win. It is not enough.\r\n\r\nIn the end everything good about the movie was negated by breaking the suspension of disbelief in a petty way, just ending the movie.\r\n\r\nEven \"The Leftovers\" explained its phenomenon, and that show did not need to. There the mystery was the premise for character development, here the mystery is a tool to keep the viewer's attention.\r\n\r\nI'd like to give less than 1.5 stars, because of how cheated I feel and because of the waste of talent and production value. But I'm sure there are people who love this and people who will learn from this.\r\n\r\n18 December 2017\r\n\r\nI am migrating my reviews from a different site which has become simply garbage. TMDB looks awesome and I look forward to be a part of it.", "created_at": "2021-07-02T20:46:04.655Z"}, {"movie_id": 399057, "review_id": "6349a280501cf2007a1e968f", "rating": 6.0, "review_text": "I found this to be one of the better Yorgos Lanthimos films, but I just cannot get behind his writing style. The stories he delivers are incredibly unique and I want to like them so much more than I actually do. Despite those drawbacks, _The Killing of a Sacred Deer_ was a mind-bending movie that threw me for a loop. The performances were great all around, as they should be with a star-studded cast featuring Colin Farrell, Nicole Kidman, and Barry Keoghan. The plot was incredibly twisted and dark. I enjoyed this film, but much like Lobster, and really wish there was a more modern spin on the writing instead of the short choppy and somewhat awkward framing that Lanthimos is known for.\r\n\r\n**Score:** _65%_ |\r\n**Verdict:** _Decent_", "created_at": "2022-10-14T17:55:12.194Z"}]