[{"movie_id": 235260, "review_id": "63c1fb5fe16e5a0081924461", "rating": 1.0, "review_text": "OK, this might be bias in comparison...but not for the back and forth that you're reading in most of the reviews.\r\n\r\nUnless something is BLATANTLY political to the point that it irritates me for reasons of propaganda...I try to slam BOTH sides in these reviews.\r\n\r\nI don't really feel that I have to here because the film is about Jesus and coming out the door we already know that people are going to be insanely pro-Religion or adopt that anti-religious stance that borders on pathology.\r\n\r\nSo, instead we're going to go right to the review and state flatly that there are better movies about Jesus that you can watch.\r\n\r\nThe Last Temptation of Christ is, of course, top on that list. This is seconded by Jesus Christ Superstar. And, in both cases, even if you are a fundamentalist Christian or have such a phobia against religion that you feel compelled to hate everything on principal...you should be able to agree that those are two stellar films on purely dramatic and cinematic basis.\r\n\r\nSon of God really isn't...at all. It tries very hard to be as faithful to the Jesus story as it can and still be a dramatization...but because of that it falls short on the \"drama\" department.\r\n\r\nIt comes across feeling sort of stale and I'm not entirely sure how it can recover.\r\n\r\nThe people involved in Son of God did do some things right, \"The Bible\" was compelling...but it was delivered in short segments that worked as little stand alone stories and made the entire series really very watchable and enjoyable.\r\n\r\nYou can't really do that here, and they failed when they adopted The New Testament a few years later.\r\n\r\nI suppose the best way to review it would be to say that is has a lack of emotional focus. The depiction of Jesus is almost void of a real dynamic personality and because of that the only real dramatic value is situational and that doesn't work with the way that the film is laid out.\r\n\r\nIf you are looking for films about Jesus, there are far better options...but those options are significantly less accurate. But, I'm of the view that if you want accuracy, read about it.\r\n\r\nIf you want entertainment, on the other hand, sit on the couch and watch the show. But not this one, Son of God falls short on entertainment.", "created_at": "2023-01-14T00:46:23.218Z"}]