[{"movie_id": 87502, "review_id": "6078cc419f37b00057a42796", "rating": 8.0, "review_text": "With Robert Zemekis at the helm, it has to be good, right?\r\n\r\nPretty much. Not the strongest performance by Cheadle, but otherwise the cast is great. John Goodman is a welcome surprise half-way through and really brings this home.\r\n\r\nWith a feel good ending, what more do you 1-3 star people want??\r\n\r\nIt's Denzel!!", "created_at": "2021-04-15T23:29:05.094Z"}, {"movie_id": 87502, "review_id": "6320faa89a3c490082369be2", "rating": 6.0, "review_text": "The title Flight is a perfect illustration that brevity really is the soul of wit. Its six letters describe not only the protagonist's occupation (flying), but also what he spends most of the film doing (fleeing), and if we only added a seventh letter (-y), it would describe the character himself. The film itself could stand to be shorter, but overall it's no exception to the rule that no good movie is too long. \r\n\r\nIn addition to illustrating the aforementioned Shakespearean principle, director Robert Zemeckis inverts a famous Simpsonian maxim; in this case, alcohol is first the solution and then the cause of all the problems. \r\n\r\nOne can identify a compulsive smoker when he lights a cigarette with the butt of the previous one; Similarly, one can spot an alcoholic when he soothes his hangover with leftover beer from the day before — and that’s just the start of commercial pilot William 'Whip' Whitaker's (Denzel Washington) breakfast of champions.\r\n\r\nWhip is still drinking in the cabin of Flight 227 bound for Atlanta, making himself a screwdriver, or several, before taking a nap. He wakes with a start when the plane begins to nosedive. Unable to regain control, Whip is forced to make a controlled crash landing in an open field, saving most of the \"102 souls\" on board. \r\n\r\nThis includes a maneuver where Whip flies the plane upside down, and it's not just him but also Zemeckis who takes a huge risk and lives to reap the reward. The scene avoids becoming unintentionally funny because part of its purpose is precisely to provide some much-needed humor to ease the almost unbearable tension; at the same time, it manages to stretch the audience's suspension of disbelief without breaking it for two reasons: 1) it has real precedent, and 2) it's exactly the kind of thing someone flying under the influence would do.\r\n\r\nThere’s no doubt that Whip has the expertise to pull off this maneuver successfully; the question is whether he would have dared to execute it while sober. Moreover,, the cause of the accident is a mechanical failure completely unrelated to Whip's sorry physical state. \r\n\r\nBut Flight is not, like Druk, an apology for alcoholism. In an inferior film the vehicle, be it a plane or a car, would crash as a direct result of the driver/pilot's drunkenness, and the driver/pilot would be the only or one of the few survivors, making him feel even guiltier. Flight instead debunks the myth of invincibility that every alcoholic invokes by leading us to believe, practically to the end, that Whip might very well be literally invincible.\r\n\r\n\"Maybe I'm a fool,\" Whip muses, \"because if I'd just told one more lie, I might have walked away from the whole mess.\" But he knows as well as we do that after that “one more lie” there would be another lie, and another, and another, and that eventually his lies would have caught up with him, because ultimately there is no escaping the negative effects of addiction. \r\n\r\nLike the similar Clean and Sober, Flight loses momentum with a Romantic Subplot that a nearly two-and-a-half-hour film doesn't need; on the other hand, I really liked Washington’s and Zemeckis's attention to detail — for example, when in the middle of crash landing Whip has the presence of mind to make a flight attendant tell her son that she loves him so that the box black can record it (in case they don’t make it), or the way his facial language unequivocally expresses the world of difference, the passage from hell to paradise, that exists before that first line of cocaine — supplied by John Goodman in a pair of hilarious cameos, each one heralded by the presence of “Sympathy for the Devil” on the soundtrack — and after.", "created_at": "2022-09-13T21:48:24.193Z"}]