[{"movie_id": 823482, "review_id": "655a336d67dcc900e337a915", "rating": 8.0, "review_text": "Packing a lot of material and ideas into a single film can result in a muddled, confusing mess, no matter how well-meaning a filmmaker’s intentions might be. However, in his third feature outing, writer-director Kristoffer Borgli succeeds for the most part when it comes to tackling such an imposing task. This offbeat tale of tenured but underappreciated university professor (Nicolas Cage) takes viewers on a wild ride through the diverse realms of fame, metaphysics, cancel culture, unrelenting group think, and unexpressed, underpursued desire, and the downside consequences of each. All of this comes about when the middle-aged everyman protagonist inexplicably begins showing up in the dreams of countless people, many of whom he doesn’t even know. This curious oneiric anomaly – an inspired metaphor for one’s presence on social media and in the public eye – quickly transforms him into an overnight viral media sensation, one that starts off with a generous showering of attention and lustful admiration but that almost as quickly leads him to become a scorned put-upon pariah. He swiftly becomes more than just yesterday’s news; he turns into the object of a targeted campaign of cancel culture, hate speech and unapologetic ostracism. And, ironically, it all stems from something he never wanted nor asked for in the first place (at least in the form it ultimately took). From the foregoing description, it might sound like the filmmaker has tried to overstuff this vehicle with far too much material for viewers to process and comprehend, and there are points in the story (especially in the last half hour) where a good case could be made for that argument. However, in telling this allegorical fable, the director manages to keep the narrative’s ideas distinctly sorted and in context to drive home his message, a powerful cautionary tale about the point we’ve collectively reached as a society with respect to these powerful and potentially damaging matters and practices. These are notions that we all need to hear but seldom do because of all the noise surrounding us that prevents us from hearing the music because of all the notes. For all this seriousness, however, “Dream Scenario” is loaded with hilarious, laugh-out-loud humor and fine performances all around (especially Cage and Michael Cera as an empty-headed, self-absorbed brand management expert), complemented with skillful film editing and carefully selected incidental shots that effectively punctuate the mood of many scenes. The script is generally solid, too, though it begins to stray somewhat from the material that works best in the final act, and there are a few graphically violent sequences that sensitive viewers should be wary of. On balance, though, this is the kind of production that should be made in greater numbers in an age where so many of us have lost touch with reason, our existence and ourselves. Maybe watching an offering like this could help us all sit up, think and get back on track while we still can.", "created_at": "2023-11-19T16:10:21.191Z"}, {"movie_id": 823482, "review_id": "655f2678706e5600e151abfb", "rating": 6.0, "review_text": "When college professor \"Matthews\" (Nicolas Cage) starts appearing in the dreams of strangers (oh, and his wife!), his whole life is turned topsy-turvy. Initially it's all a rather benign phenomenon with his appearances fleeting, inconclusive and harmless. Until, that is, he meets one person who has been having a rather more intimate experience. Not only does this meeting not go very well (on various levels!) but it seems to change the very nature of the illusions for everyone, turning them more into nightmares... A predictable, occasionally violent, backlash ensues which makes the man's life - and that of his family - all but insufferable. What to do now his fame has come back to bite him? I quite enjoyed the first half hour of this quirky and entertainingly written drama. Cage is always rather good at taking the rise out of himself, and he seems to be enjoying the ride at the start. Once the story turns a bit darker, though, it runs out of steam. It's charm and uniqueness becomes rather subsumed in a rather unsubtle whack at the \"cancel culture\" that exists amongst those who live their lives via social media. It's not the first or the best to draw a parallel between what's real and what's fact - even when such distinctions are easily identifiable, and after a while I felt the film had no clear idea of how to conclude without actually proving it's own, rather depressing, point. The idea is interesting, the delivery is fine - but the end product is all a bit underwhelming.", "created_at": "2023-11-23T10:16:24.220Z"}, {"movie_id": 823482, "review_id": "659a0800c995ee01a2a6ad55", "rating": 7.0, "review_text": "It must be not the most original movie but hey, it is something unexpected. Being from A24 I did what I do on almost all movies - didn't read anything about it beforehand. \r\n\r\nAfter watching the movie and taking my conclusion, I researched a bit about it: it is a black comedy movie from the norwegian (ok strange film spoiler) Kristoffer Borgli produced by Cage and Ari Aster. Ok, this also got my attention: the director has only 3 movies with this one, being the last one \"Sick of Myself\" (2022) literally the opposite of what this one talk about - a satyre of cancel culture in a mildly surrealistic way (maybe there also enters a pun later in the movie about France). \r\n\r\nHe is a normal biology professor that starts popping into millions of people dreams and gains notoriety just to be the the fruit of nightmares and start to be cancelled by the society.\r\n\r\nThe base of the acting is the \"good actor version\" Nicolas Cage as Paul Matthews, a college professor and Julianne Nicholson as Janet Matthews, Paul's wife. Other recognized actors like Michael Cera in minor papers. \r\n\r\nThe cinematography by Benjamin Loeb (\"Mandy\", 2018, \"Pieces of a Woman\", 2020, \"After Yang\" 2020) is very effective especially in the use of angles. On the soundtrack, that is very adequate without any music other than OST the last music (credits one) City Of Dreams by \r\nTalking Heads is very nice.\r\n\r\nBut the real deal with the movie aside from the theme and story is Nicolas Cage in another good role, Thanks God for that.\r\n\r\nOn my score, not a movie for everyone, only those who enjoy northern Europe cinematography, a solid 7,5 out of 10,0 / B+ - I am sure you can call the story something you've seen before.", "created_at": "2024-01-07T02:10:08.780Z"}, {"movie_id": 823482, "review_id": "659c107dca4f6760e0ccedcf", "rating": 9.0, "review_text": "Only Cage can create such an awful, self-centred person on screen and maintain relatability. He is incredible. Creative little woke-sterpiece giving an unbelievable twist to some modern issues that results in tragic comedy.", "created_at": "2024-01-08T15:10:53.129Z"}]