[{"movie_id": 70981, "review_id": "5094ca9419c2956f3a0000f8", "rating": 4.0, "review_text": "The special effects are great, the scenery and photography is lovely but the film is as a whole a big disappointment. You would have thought that with such a budget they could have hired some guy to make a basic sanity check of the script but obviously that wasn’t in the budget for this one. I do not know if a lot of Hollywood people are idiots or think the audience are idiots or both but for Christ sake, how difficult can it be to come up with a plot that holds together and are at least half believable?\r\n\r\nA trillion dollar expedition to discover the “makers of mankind” and they put together a band of asocial morons for crew where not even the scientists among them seems to have met each other before the wake up millions of miles from Earth.\r\n\r\nAlmost everyone behaves in a completely unbelievable way. Yeah, it looks okay so let’s remove the helmets for instance? Right, apart from the immediate danger to your own health, what about quarantine procedures…idiots?\r\n\r\nWhy did the robot put the mutagen in the drink? It’s just illogical and never really adequately explained. Speaking of robots, robots have a power source and it’s not spread all over them. If you rip their head of they do not continue to talk like nothing had happened. In the original Alien they at least had to hook him up to something. It goes on. The entire film is just a jumble of illogical acts one after another. \r\n\r\nThen we have the ending. What a joke. Apart from the fact that Elizabeth’s actions are just ridiculous, how does she expect to live on a alien ship without food or any other supplies?\r\n\r\nThis film had good promise. The idea of getting to know the origin of the aliens intrigued me and the basic plot idea was cool. However, the film was really ruined by a script obviously written by total morons.", "created_at": "2012-11-03T07:41:08.000Z"}, {"movie_id": 70981, "review_id": "56824e26c3a3684be3013ec1", "rating": 6.0, "review_text": "Although this is not a great movie, I was positively surprised, given the tons of bad references I got from this movie.\r\n\r\nThe background story is interesting and the cast is quite decent. Theron and Elba played well but specially remarkable are Rapace and Fassbender.\r\n\r\nIn any case, it does have many flaws in the script. Several characters are stupid beyond comprehension, several things are completely unexplained, Pearce character is really bad and the crashing of the alien spaceship is just ridiculous, as it is the killing of Theron's character.\r\n\r\nIn any case, it doesn't leave a bad after taste and I am looking forward to the continuation of the story.", "created_at": "2015-12-29T09:11:02.568Z"}, {"movie_id": 70981, "review_id": "6218187ba275020042725219", "rating": 7.0, "review_text": "Looks good, but feels a bit hollow to me.\r\n\r\n<em>'Prometheus'</em> - which serves as a (loose) prequel to <em>'Alien'</em> - didn't excite me and I didn't feel like I got anything from it. It's still a good film and it is a pleasant looking one at that, with neat special effects et al. I also like the casting for this 2012 release.\r\n\r\nNoomi Rapace is probably the film's standout, though Michael Fassbender, Guy Pearce, Charlize Theron and Idris Elba are also involved - the latter two feel a bit underused, we get a fair bit of them both but still I wanted to watch them more - especially Theron, who feels a bit tacked on.", "created_at": "2022-02-24T23:44:59.178Z"}, {"movie_id": 70981, "review_id": "63c1e32da5743d00c3bf8946", "rating": 1.0, "review_text": "What? Seriously...WHAT?!\r\n\r\nI don't understand what I watched.\r\n\r\nAlien was a monster movie in space. It was a great movie, it was scary and you could taste the tension....but it was just a monster movie in outer space. It was really just a merger of horror and science fiction.\r\n\r\nAliens was a fun movie. But it was just Space Marines v Monsters. It was just a merger of action and science fiction.\r\n\r\nWe can go on and on and on but, I think Scott is buying the fanboys that are reading too deeply into the Alien franchise. It's not \"Chinatown\" it's just the Alien movies.\r\n\r\nPrometheus was just too much for the franchise, FAR TOO MUCH. Watching it felt like that moment when you realize that the top came off of the salt shaker and now you're going to have to just bare threw the mess bite by bite.\r\n\r\nThere was so much that, in the end, there wasn't really anything at all. Everything that was good about Alien and Aliens was totally forgotten here and you were left with, well, pretentious ramblings.\r\n\r\nThis is a monster movie that thinks it's \"Taxi Driver.\" It's putting on airs and you can see straight through it.", "created_at": "2023-01-13T23:03:09.728Z"}, {"movie_id": 70981, "review_id": "64363897946318012638aa71", "rating": 7.0, "review_text": "Good Sci-fi 👍🏾\r\n\r\nFinding a map left by our creators and then following it lightyears away for the search of the meaning of life, and immortality... Forget the horror part of the film, that plot alone had me fully immersed.\r\n\r\n_I watch this one at least twice a year. _", "created_at": "2023-04-12T04:50:31.797Z"}, {"movie_id": 70981, "review_id": "6575c041e93e95218dcb1fa4", "rating": 10.0, "review_text": "Follows greatly the Hero with a Thousand Faces, very well executed.\r\n\r\nProbably the best science-fiction ever made, along Kubrick's Space Odyssey 2001, where you can actually learn something about true **technology**.\r\n\r\nWell done for those who can see. We need more!", "created_at": "2023-12-10T13:42:25.944Z"}]