[{"movie_id": 480414, "review_id": "5cb88fa9c3a3683abf837c29", "rating": 5.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nIt’s not as bad as The Nun, let me write this straight away. If there’s one thing that this movie proves is Michael Chavestalented filmmaking skills, which offers hope for The Conjuring 3. Contrary to the other spin-off of the universe, The Curse of La Llorona toned down on the lazy exposition and elevated its scary sequences, simply by having a more capable director. Beautiful one-take scenes are spread throughout the runtime, which not only increase the suspense but prove that Chaves actually works hard to provide a terrifying environment.\r\n\r\nHe also delivers some effective and innovative jump scares, even though most of them still follow an annoyingly predictable timing. These are still heavy on the cliche of “character turning her head, big ugly monster face screams and the score goes from silence to screeching volume.” Scenes like these aren’t scary anymore and they feel dated, as well as the typical origin story. There’s nothing new or exciting in an “urban legend turned true.” Fortunately, the backstory is simple, it isn’t filled with explicit exposition every two minutes, and the short runtime helps the film to develop through a fast pacing. Sadly, it’s just another common horror screenplay that the writers took from the scripts cabinet.\r\n\r\nLinda Cardellini gives a strong performance as the protagonist. Even though every character in this movie makes questionable decisions that lead to avoidable events (something inevitable in horror films), Anna is a compelling and courageous woman, who only wants to do what’s best for any children, not only their own. Raymond Cruz portrays Rafael, a priest who sort of almost is a deus ex machina. He barely has any kind of decent character development, but he works well enough as comic relief to lighten up an otherwise too dark tone. The kids are good, but Patricia Velasquez (Patricia Alvarez) is way over-the-top, which doesn’t help her already not-so-good script.\r\n\r\nAll in all, The Curse of La Llorona is … okay. It’s not near as horrible as The Nun, and honestly, that’s a good compliment for such a typical and cliche horror flick. Michael Chaves truly saves what could have been a disaster with another director. Wonderfully handled one-take sequences, which elevate the suspense levels, and he also produced some imaginative jump scares, even if most of them still lack actual scariness. Linda Cardellini is great as the lead, but every character is compelled to make dumb decisions to move the plot forward. Some characters needed more care in their scripts, and more focus on the story to tell instead of just creating scares after scares.\r\n\r\nClose, but not close enough …\r\n\r\nRating: C+", "created_at": "2019-04-18T14:54:33.241Z"}, {"movie_id": 480414, "review_id": "5cfe4b699251415cd7b8e745", "rating": 4.0, "review_text": "Where I'm from, this was marketed as _The Curse of the Weeping Woman_ 'cause I guess Australia can't be trusted with to pronounce a Spanish word. Similarly, I guess Warner Bros. can't be trusted to make a horror movie without cramming it into the bloated _Conjuring_ franchise.\r\n\r\nI love seeing Linda Cardellini get work, but I don't know that a La Llorona movie was the best choice to put her in lead of, and I do know that **this** La Llorona movie was a bad choice, just like... Generally speaking. \"Bad\" might be too far. Bland? Old hat? Something along those lines might be a label that fits a little better. Definitely not the label \"good\" though.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2019-06-10T12:22:01.810Z"}, {"movie_id": 480414, "review_id": "5d6700a26082eb0016a585a4", "rating": 3.0, "review_text": "Acting was fine but the rest was one big cliche of the supernatural-horror genre with too many jump scares and the evil entity pretty much reminded me of the Nun, which makes sense since this is set in the Conjuring Universe.", "created_at": "2019-08-28T22:30:58.083Z"}]