[{"movie_id": 568620, "review_id": "60f99d35f056d5004762a7b0", "rating": null, "review_text": "The latest film in the G.I. Joe cinematic universe has arrived with “Snake Eyes: GI Joe Origins”. The film was originally planned to arrive in March of 2020 but faced delays due to cinematic closures during the Pandemic.\r\n\r\nThe film opens with a young boy being orphaned after a group of thugs kills his father. Years later the man is still obsessed with finding out who killed his father and earns a living in underground fighting known as Snake Eyes (Henry Golding)\r\n\r\nHis exploits get the attention of Kenta (Takehiro Hira); who hires him into his organization with a promise to help him find the man who killed his father.\r\n\r\n \r\n\r\nSnake Eyes soon finds himself working on the docks where he smuggles guns into fish bound for Japan. Despite his misgivings working for criminals, he befriends a man named Tommy (Andrew Koji); who teases him about his demeaning work by calling him “Fish Boy”.\r\n\r\nWhen Kenta forces Snake Eyes to kill Tommy for being a spy; Snake Eyes refuses and the two make a daring escape to Japan. It is learned that Tommy is next in line to run his clan and that Kenta was banished years prior and plans revenge.\r\n\r\nDespite mistrust from a trusted associate named Akiko (Hakura Abe); Snake Eyes begins his training in the Ninja Arts which should he survive will make him a valued part of the Clan which Tommy believes is correct thanks to his Blood Debt to Snake Eyes.\r\n\r\nThe film focuses on various aspects of training before branching into the larger story of divided loyalties and honors which results in a few battles and chases along the way.\r\n\r\nWhile the film does space the action out; it does provide some great cinematography and the action is entertaining even if it lacks much tension.\r\n\r\n \r\n\r\nThe biggest issue is that the G.I. Joe/COBRA connection seems a bit forced as The Baroness (Ursula Corbero) arrives to move things along but it is mainly for the purpose of getting characters to do this and get that so the film can move towards the climactic action.\r\n\r\nSamara Weaving does show up as Scarlett but she does not have a very large part in the story and aside from a few limited action moments; she seems to be more of the token G.I.Joe representation.\r\n\r\nGolding and Hira are very good and their intertwined and complicated relationship is giving plenty of time to develop as their past is a large part of their futures and the film does a good job in explaining their past and future motivations.\r\n\r\nThe film blends Asian and Western film styles and in doing so creates an enjoyable film that for me was more enjoyable than the prior films in the series. To me those films focused mainly on action and this one was focused on developing characters.\r\n\r\nWhile it remains to be seen what direction future films in the franchise will take; it would be interesting to see more of Snake Eyes story down the line.\r\n\r\n3 stars out of 5", "created_at": "2021-07-22T16:30:45.337Z"}, {"movie_id": 568620, "review_id": "612a36e012197e00436e5b8b", "rating": 3.0, "review_text": "If you are looking for the G.I. Joe style storytelling and action this may disappoint. It's a very different style and kind of predictable in many ways.", "created_at": "2021-08-28T13:15:12.363Z"}, {"movie_id": 568620, "review_id": "617786cdc2b9df0062213a72", "rating": 5.0, "review_text": "Bland and forgettable martial-arts thriller that delves deeper into the character but outside of Henry Goulding who was good in the role, there's not much else to the film. The rest of the cast wasn't terribly charismatic and Samara Weaving talents is completely wasted in a small supporting role (shows up basically for the third act). I don't know, while the first two GI Joe films weren't very good, there were a few entertaining moments, this one I found pretty boring for the most part, worse yet, the fight scenes suffered from bad editing and poor lighting. **2.5/5**", "created_at": "2021-10-26T04:40:45.505Z"}, {"movie_id": 568620, "review_id": "61ac8f10aafebd0095163468", "rating": 4.0, "review_text": "I actually liked the two first G.I. Joe movies, G.I. Joe: The Rise of Cobra and G.I. Joe: Retaliation. This one… not so much.\r\n\r\nIt could have been a really good movie but it ended up as a huge disappointment. The story should have been a cool revenge story but it ended up being a convoluted mess making Snake Eyes one of the bad guys for most of the movie. It is also hugely predictable after the first 20 minutes of the movie. Did the writers really think that the “twists” would come as a surprise for anyone? They probably did since Hollywod writers usually reside on the low end of the intelligence scale nowadays. Putting three of those hacks together to write a movie doesn’t help of course.\r\n\r\nI could have accepted all of that if the rest would have been cool with lots of fights and special effects. Sadly the movie is mediocre, at best, in these areas as well.\r\n\r\nSnake Eyes is not only a bad guy but he is rather stupid as well as devoid of any charisma. His acting is quite poor which can be said for most of the actors actually. Apart from the mediocre acting there’s really no one in the movie that you feel like rooting for. No one stands out, everyone just excels in mediocrity. The only person in the entire movie that has any coolness factor worth talking about is Scarlett but she is not in the movie for more than a few scenes.\r\n\r\nThere are a few scenes with some special effects, cars flipping over, huge snakes etc. but not really that much for this kind of movie. That could have been fine since this movie should be a lot about martial arts. Amazingly enough, not even here does it deliver. Most of the martial arts scenes involve a lot of flipping around with arms and swords but they mostly look like they have been written for a PG rated TV show for teens and pre-teens. They are simply poor. Tommy looks like he needs to take a dump before every fight with that ridiculous pose of his.\r\n\r\nThis is not a 1-star movie as some rate it. That’s just ridiculous. It has some entertainment value. However, it could have been so much better. Unfortunately I suspect this movie has done the G.I. Joe franchise a disservice for some time to come.", "created_at": "2021-12-05T10:06:08.142Z"}, {"movie_id": 568620, "review_id": "624190509451e7008c92d692", "rating": 5.0, "review_text": "It's one thing offering us Henry Golding as a pretty chap you'd want to take home to meet your mother, it's quite another telling him to abstain from shaving for a few days and hope that turns him into a convincing, highly trained ninja! That's what is in store for us here as this latest GI Joe spin off presents our hero as the rescuer of the heir of an ancient Japanese clan - \"Tommy\" (Andrew Koji). Once he is thoroughly ingratiated with this noble family, it transpires that old \"Snake Eyes\" has an agenda all of his own - and it's not exactly honourable! The rest of the film follows a well trodden path of suspicion, betrayal, reconciliation and - of course - loads of epic looking sword fighting and gravity-defying action scenes. As with so many films in this genre, way too much emphasis has been placed on the look of the thing - the characters are instantly forgettable, the plot thinner than any rice paper could ever hope to be and the ending dragged this, quite unnecessarily, over the two hour mark. It needs a big screen to do the photography and visuals justice, but maybe just pay daytime rates?", "created_at": "2022-03-28T10:39:12.363Z"}]