[{"movie_id": 379686, "review_id": "60f36d1133a53300753f75dc", "rating": 8.0, "review_text": "A very creative alternate to the original. The story line is all original and updated with current times. Lots of great puns and looney jokes. Better than what I expected. However nobody can be Michael Jordan", "created_at": "2021-07-17T23:51:45.881Z"}, {"movie_id": 379686, "review_id": "60f6c8a3f1759c00765c6d12", "rating": 8.0, "review_text": "Pros:\r\n- Kong and the Iron Giant gave eachother a fist bump!\r\n- It featured many characters from Warner Bros.\r\n- Porky Pig roasting Al-G Rhythm in a rap battle\r\n- Gabriel Iglesias and Zendaya provided the voices of Speedy Gonzales and Lola Bunny, respectively \r\n- It was better than the first film\r\n- LeBron James!\r\n- There could a be a possible Space Jam spin off titled Wonder Bunny!\r\n\r\nCons:\r\n- They never showed the Pepe Le Pew scene.\r\n- I was hoping the Tune Squad would play against villains of Warner Bros.; Wicked Witch of the West, Sauron, Pennywise/It, Agent Smith...\r\n- I was expecting a surprise twist, where Al-G Rhythm turns out not to be a bad guy but was actually helping LeBron understand his son more. The writers should've done more.\r\n- Cringing moments", "created_at": "2021-07-20T12:59:15.210Z"}, {"movie_id": 379686, "review_id": "624187acdd83fa008a548dd2", "rating": 4.0, "review_text": "This has to be in the running for turkey of the year. It's such a shameless example of bad storytelling, bad acting, and product placement that they might as well just have given you a goodie bag as you (prematurely) left the cinema replete with your Warner Brothers tattoo. It's centres around the son of LeBron James being kidnapped by an evil AI. The only way he can be rescued is by LBJ and his new bestie \"Bugs Bunny\" putting together a team that can win a basketball game against team selected by the AI. That's about the height of it - there are no characterisations worthy of note amongst the humans, and though it is quite nice to see some of Warner's cartoon characters on a big screen again, any nostalgia that evokes is soon washed away by the sheer naffness of this whole enterprise. Quite whom this is for is anyone's guess - but it sure wasn't for me...", "created_at": "2022-03-28T10:02:20.637Z"}, {"movie_id": 379686, "review_id": "63577ec39b8616008ae02419", "rating": 1.0, "review_text": "**An excuse for yet another CGI animated film.**\r\n\r\nI think this movie shouldn't have been made the way it was made. The secret to the success of the first “Space Jam” was its originality and the way it combined the drawings and a real basketball star in a movie where he could play a little with himself. Here, what we have disappoints anyone and only serves to raise money for the public without delivering a product that truly meets expectations.\r\n\r\nThe film's biggest problem is obviously its script: it all starts when LeBron James, a basketball player, turns down a contract with Warner Bros. The contract was crafted by a computer algorithm that has somehow taken on a life and will of its own, and is determined to make itself noticed, even in the worst ways. By imprisoning the sportsman and his son in a digital universe, things get complicated. James will have to play basketball against the live algorithm, and he will ask the only one who might possibly have a good idea for help: Bugs Bunny. It is, as we can see, a basic script, very poorly written and poorly designed, which is not able to properly sustain the film.\r\n\r\nI don't want to be mean to LeBron James. He's not an actor, he's not expected to do a great job as an actor. I think he did a lot with what he got, which was pretty bad, but I also think he's not famous enough to support the movie the way Air Jordan did before. Maybe he's famous in the USA! Outside the US, no one knows who he is. Don Cheadle, thus, ends up being the most prominent actor in the film, even if in a Machiavellian and tiresome character. Cedric Joe does what he can, but his character is terrible, and it was very poorly thought out. Self-centered, selfish, vain and resentful of his father, the kid is nasty almost until the end.\r\n\r\nTechnically, the film bets everything on the CGI of great visual effect and fails completely: if there's one thing that doesn't work well, it is the stylized and tiresome look of this film. I've acquired a special dislike for the computerized versions of Bugs and the rest of Looney Tunes. They are terrible and ugly. There are things that shouldn't be modernized, so they don't lose their essence! In addition, the film has tiresome cinematography and is excessively long, with no script or material to fully justify it. I liked, however, the many tributes that are made to the films of the past of the Warner studio: we have everything from “King Kong” to “Casablanca”, with the passage guaranteed by the “Harry Potter” franchise to “Matrix” and “Mad Max”. It was the part of the movie that I found most sympathetic and honorable, but I still don't recommend this movie.", "created_at": "2022-10-25T06:14:27.166Z"}]