[{"movie_id": 398978, "review_id": "5dca0eaeab1bc700150841bd", "rating": 8.0, "review_text": "It would almost be wrong to call ‘The Irishman’ a film; rather, it acts more like a tapestry. This isn’t telling one story, but a number of stories spanning decades that just so happen to involve the same group of dangerous gangsters, sharing the same threads of beautiful cinematography, great visual effects and patient editing. With his increasingly lengthy run times, Scorsese seems to be realising that a life cannot be condensed down into a clean 100-minute arc, and audiences should get excited by the opportunity to experience the art of film in this way. It’s a sight to behold.\r\n- Ashley Teresa\r\n\r\nRead Ashley's full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-irishman-kissing-scorseses-ring-again", "created_at": "2019-11-12T01:45:18.238Z"}, {"movie_id": 398978, "review_id": "5dd9fd4812aabc0011928329", "rating": 7.0, "review_text": "**_Far too long, but arguably Scorsese's most thematically complex_**\r\n\r\n>_Don't let any man into your cab, your home, or your heart, unless he's a friend of labour._\r\n\r\n- Jimmy Hoffa\r\n\r\n>_When Jimmy saw that the house was empty, that nobody came out of any of the rooms to greet him, he knew right away what it was. If Jimmy had taken his piece with him he would have gone for it. Jimmy was a fighter. He turned fast, still thinking we were together on the thing, that I was his backup. Jimmy bumped into me hard. If he saw the piece in my hand he had to think I had it out to protect him. He took a_ _quick step to go around me and get to the door. He reached for the knob and Jimmy Hoffa got shot twice at a decent range – not too close or the paint splatters back at you – in the back of the head behind his right ear. My friend didn't suffer._\r\n\r\n- Frank \"The Irishman\" Sheeran, with Charles Brandt; _\"I Heard You Paint Houses\": Frank \"The Irishman\" Sheeran and the Inside Story of the Mafia, the Teamsters, and the Last Ride of Jimmy Hoffa_ (2004)\r\n\r\n>_In 2004, a small publishing house in Hanover, New Hampshire, unleashed a shocker titled I Heard You Paint Houses. It was written by Charles Brandt, a medical malpractice lawyer who had helped Sheeran win early parole from prison, due to poor health, at age 71. Starting not long after that, Brandt wrote, Sheeran, nearing the end of his life, began confessing incredible secrets he had kept for decades, revealing that – far from being a bit player – he was actually the unseen figure behind some of the biggest mafia murders of all time._\r\n\r\n>_Frank Sheeran said he killed Jimmy Hoffa._\r\n\r\n>_He said he killed Joey Gallo, too._\r\n\r\n>_And he said he did some other really bad things nearly as incredible._\r\n\r\n>_Most amazingly, Sheeran did all that without ever being arrested, charged, or even suspected of those crimes by any law enforcement agency, even though officials were presumably watching him for most of his adult life. To call him the Forrest Gump of organised crime scarcely does him justice. In all the history of the mafia in America or anywhere else, really, nobody even comes close._\r\n\r\n- Bill Tonelli; \"The Lies of the Irishman\"; _Slate_ (August 7, 2019)\r\n\r\n>_I'm telling you, he's full of shit! Frank Sheeran never killed a fly. The only things he ever killed were countless jugs of red wine._\r\n\r\n- John Carlyle Berkery; Quoted in \"The Lies of the Irishman\"\r\n\r\n>_I haven't read the script of The Irishman, but the book on which it is based is the most fabricated mafia tale since the fake autobiography of Lucky Luciano 40 years ago._\r\n\r\n- Nicholas Gage; Quoted in \"The Lies of the Irishman\"\r\n\r\n_The Irishman_ is 209 minutes long and spans 60 years (1944 to 2004), taking in such events as the end of World War II in 1945; the 1957-1964 feud between Senator (later Attorney General) Robert F. Kennedy and Jimmy Hoffa, president of the International Brotherhood of Teamsters; the election of John F. Kennedy as President in 1960; the Bay of Pigs Invasion in 1961; the assassination of JFK in 1963; the election of Richard Nixon as President in 1968; the Watergate scandal from 1972 to 1974; and Nixon's resignation in 1974. All of this historical context, however, is mere window dressing, and at no time is it where the film's focus lies. Instead, _The Irishman_ is about aging, loss, taking stock, regret. To a certain extent, it is to the gangster genre what John Ford's _The Searchers_ (1956) was to the classic western.\r\n\r\nBased on the 2004 book by Charles Brandt, _\"I Heard You Paint Houses\": Frank \"The Irishman\" Sheeran and the Inside Story of the Mafia, the Teamsters, and the Last Ride of Jimmy Hoffa_, _The Irishman_ was written for the screen by Steven Zaillian (_Schindler's List_; _A Civil Action_; _American Gangster_) and directed by Martin Scorsese (_Taxi Driver_; _The Last Temptation of Christ_; _The Aviator_), whose _GoodFellas_ (1990) and _Casino_ (1995) are two of the most celebrated gangster movies ever made (although, I think I'm the only person on the planet who dislikes _GoodFellas_; I love _Casino_ though). An old-school auteur in the mould of filmmakers such as Francis Ford Coppola, Brian De Palma, Michael Mann, Terrence Malick, and Oliver Stone, Scorsese, Malick, and Mann are three of the very few such filmmakers who remain as relevant today as they were when they first broke into the business. I personally haven't really liked much of what he's done in the last couple of decades, but there's no denying Scorsese is a filmmaker who still seems to have a lot to say.\r\n\r\n_The Irishman_ has received a rapturous reception, with critics and audiences proclaiming it as one of Scorsese's best movies. And although I certainly don't disagree that it has (many) masterful elements, but it's just too blooming long, taking far too much time to get to the last act (which is superb). Shorten it by 20 minutes in the mid-section, and you have a masterpiece. Now, don't get me wrong, I have no problem with long films – Coppola's _The Godfather Part II_ (202 minutes) is one of the finest films ever made; three of my all-time favourite movies are the Director's Cuts of Sergio Leone's _Once Upon a Time in America_ (250), Kevin Costner's _Dances with Wolves_ (236), and Malick's _The Tree of Life_ (190); I adore Kenneth Branagh's _Hamlet_ (242), and I'm a big fan of films such as Jerzy Hoffman's _Potop_ (315), Bernardo Bertolucci's _1900_ (317) and Béla Tarr's _Sátántangó_ (442...yep, 442). However, such length has to be narratively justified, and I just felt that in _The Irishman_, it wasn't. A runtime of around 170-180 minutes would have been perfect, but as it stands, the film's 206 minutes occasionally feel padded and (dare I say it) self-indulgent. Nevertheless, the acting is universally superb, the directing is more contemplative than we've seen from Scorsese in a while, Thelma Schoonmaker's editing is predictably awesome, and Rodrigo Prieto's cinematography is flawless. If only it was 20 minutes shorter.\r\n\r\nThe film opens in 2003 as we meet an elderly Frank Sheeran (Robert De Niro). A World War II veteran who was stationed in Italy, Sheeran now lives in a nursing home and is close to death. Wanting to die with something of a clear conscience, he decides to speak about his time as the go-to hitman for the Northeastern Pennsylvania-based Bufalino crime family. We then cut to 1975 as Sheeran, family patriarch Russell Bufalino (Joe Pesci), and their wives are embarking on a three-day drive to attend a wedding. As they pass by the spot where Sheeran and Bufalino first met, we cut to 1954, with Sheeran working as a truck driver for a slaughterhouse. Although, he has a reputation for reliability, on the side, he's selling more than a little of the meat to Felix \"Skinny Razor\" DiTullio (Bobby Cannavale), a wiseguy working for the Philadelphia and New Jersey-based Bruno crime family led by Angelo Bruno (Harvey Keitel), an ally and friend of Russell. When Sheeran sells the entire contents of his truck, however, turning up at the delivery location with an empty storage, the company charge him with theft, but he's successfully represented by Bill Bufalino (Ray Romano), Russell's cousin. Sheeran and Russell become good friends, and soon, Russell has Sheeran carrying out various hits. Loyal to the Bruno and Bufalino families, and adept at his job, Sheeran quickly moves up the underworld ladder, and Bufalino introduces him to Jimmy Hoffa (Al Pacino). The president of the Mob-funded Teamsters union, Hoffa is facing investigation by the United States Senate Select Committee on Improper Activities in Labor and Management and is struggling to deal with rising teamster Anthony \"Pro\" Provenzano (Stephen Graham). Hoffa is volatile, unpredictable, confrontational, and believes himself untouchable, so Bufalino wants Sheeran to babysit him and try to keep him out of trouble. Hoffa and Sheeran hit it off, and soon Sheeran is Hoffa's unofficial bodyguard. However, despite Sheeran's best efforts, as the years go by, Hoffa continues to antagonise his Mob backers, and some of them soon come to see him as more of a liability than an asset.\r\n\r\nOriginally set at Paramount, when _The Irishman_'s budget started pushing $150m before shooting had even begun, the studio deemed the project too expensive and dropped it. Then came Netflix, who not only put up the money, but they also offered Scorsese a near unheard-of degree of creative control – the kind of control that almost no one person has been given over a project this big since Michael Cimino pissed away $44m ($115m in today's money) of United Artists' money on Heaven's Gate (1980), a film originally budgeted at $11.6m, and which earned back only $3m at the box office, ending the _auteur_-driven New Hollywood era, nearly bankrupting UA, and fundamentally altering the way movie studios did business. Netflix's involvement with _The Irishman_ is an interesting situation because here you have a film that simply could not have been made through the modern studio system (at least not in its current form). Netflix is usually derided for their purchase of movies originally intended for theatrical release, which are then packaged as \"Netflix Originals\", with many predicting that streaming services will ultimately destroy the cinema industry entirely. As with many such films, _The Irishman_ was given a limited theatrical release to ensure it qualified for Oscar consideration (Netflix _really_ to have a Best Picture winner in their catalogue). However, disgruntled about there being only a three week gap between theatrical release and streaming debut, major cinema chains such as AMC, Cinemark, Regal, and Cineplex all refused to carry it, with AMC's Adam Aron stating they would only be open to showing the film if Netflix \"_respects the decades-old theatrical window, that suggests that movies come to theatres first for a couple of months, and then go to the home._\" For all that, however, it's hard for a lover of cinema not to celebrate Netflix stepping in to save such an ambitious and artistic film, to say nothing of the unprecedented control they gave Scorsese. It was a great PR move, sure, but it was also a massive financial risk, so you really can't condemn their involvement.\r\n\r\nLooking very briefly at the real-life background of the film's narrative, most historians today dismiss Sheeran's account of how important he was to the Bufalino family, and several of his claims have been proven as fabrications (for more information on this, see Bill Tonelli's August 2019 article \"The Lies of the Irishman\" for _Slate_ and Jack Goldsmith's September 2019 article \"Jimmy Hoffa and The Irishman: A True Crime Story?\" for _The New York Review_). Nevertheless, the film uses Sheeran's book as the main source for the story, so it's best just to put the many historical embellishments to the back of your mind. Aside from killing Hoffa, some of Sheeran's most flamboyant claims include killing Joe Gallo, delivering a truckload of weaponry to soldiers preparing for the Bay of Pigs Invasion (handing the truck over to E. Howard Hunt, no less), giving a bag containing three rifles to a pilot days before Lee Harvey Oswald killed Kennedy, and delivering a suitcase containing a $500,000 bribe to Attorney General John N. Mitchell to pass on to Nixon. Historians, however, tell us he did none of these things, maintaining that he was a low-level goon with a drinking problem who was never assigned to any important task. This has been corroborated by several former Mob bosses who knew Sheeran. According to Tonelli,\r\n\r\n>_not a single person I spoke with who knew Sheeran from Philly – and I interviewed cops and criminals and prosecutors and reporters – could remember even a suspicion that he had ever killed anyone._\r\n\r\nSo, either he was the greatest and most clandestine Mob hitman of all time, or he was full of shit.\r\n\r\nIrrespective of this, however, _The Irishman_ is a film written in regret. Scorsese has often been accused of making Mob recruitment films, and it's well-known that real-life gangsters love _GoodFellas_ and _Casino_. In _The Irishman_, however, there's a thematic maturity not present in those films – the violence is presented with a degree more solemnity, the emotional fallout of such a life with a degree more finality. Much of this is tied up in Sheeran's daughter Peggy (played by Lucy Gallina as a child and Anna Paquin as an adult). An almost completely wordless role, Peggy is introduced in a scene in which she watches her father viciously beat the grocer for whom she works because he pushed her. The impression of him which this gives her is something Sheeran spends much of the rest of the film trying to ameliorate.\r\n\r\nAnother important element in the film's thematic complexity, particularly the theme of death, is that as each gangster appears for the first time, a subtitle tells us who they are, but also lists the date of their deaths and how they were murdered (which almost all were). There's no better illustration of just how concerned the film is with the nature of transience – every single one of these guys is a colossus in their own mind, and each deems themselves invincible (as do we all when young). Yet none of them make it out of life alive. In the film's last act, this theme is distilled down to its very essence, essentially positing that the only important thing you leave behind is your relationships with other people, and Sheeran has badly mismanaged his, resulting in him sitting alone in a nursing home at Christmas, waiting to die. In _GoodFellas_ and _Casino_, the protagonists lose their wealth, possessions, status, and so on, but in _The Irishman_, the loss is more existential – Sheeran loses his soul. Telling himself for much of the film that he's an inherently decent person insofar as he loves his family and is loyal to his friends, it's only at the very end that he comes to realise he was a monster. Scorsese is here showing us that men like Sheeran and Bufalino must erase their humanity to function effectively in this world (or conversely, that they can function effectively because they have no humanity to begin with), suggesting that men with no conscience are not only not men, they're not even alive.\r\n\r\nThis issue comes to a head in a remarkably well-acted scene towards the end of the film in which Sheeran calls the widow of a man he has recently murdered (all the man's wife knows at the time of the call is that her husband is missing). Assuring her that he's there for her should she need anything, Sheeran urges her to try to think positive, explaining that he believes the man will turn up eventually. It clearly causes him a degree of pain, but the fact that he can do it at all speaks to his sociopathy if not necessarily his psychopathology. The last act, as the violence settles and the zingers and insults dry up, is remarkably bleak in a way that the last acts of _GoodFellas_ and _Casino_ aren't, and as we watch Sheeran sitting in that nursing home, taking stock, spelling out his regrets, reminiscing about his actions as a young man, it's impossible not to see the meta dimension – Scorsese himself looking back on his career, remembering the classics of yesteryear, keenly aware that old-age is beginning to creep up on him.\r\n\r\nIn terms of the acting, the closest we get to a poor performance is Pacino, who portrays Hoffa as if he was playing, well, Al Pacino. This is arguably the biggest he's gone since Taylor Hackford's _Devil's Advocate_ (1997), a film in which he quite literally played Satan. But in terms of portraying Hoffa, look at footage of the real Hoffa, then watch both The Irishman and Danny DeVito's _Hoffa_ (1992) in which Jack Nicholson plays the character, and tell me who gives the more authentic performance. Don't get me wrong, Pacino is fun to watch (I would gladly see an entire film composed of nothing but him and Stephen Graham insulting one another), and most of the laughs come from his over-the-top antics, but it's not an especially accurate depiction of the real man. As for De Niro, this is his first not-phoned-in performance in decades, possibly since _Casino_ and Mann's _Heat_ (1995), and he imbues the character with real interiority and complex psychology, without diluting Sheeran's inherent inhumanity. However, the real standout performance is Pesci. Nine years since his last live-action film, Pesci falls back into the groove without missing a beat. However, those looking for the fireworks of Tommy DeVito or Nicky Santoro will be disappointed – this is literally the inverse of such performances. Pesci's Bufalino is quiet, calm, considered, highly intelligent, but cold and sociopathic, the kind of man who wouldn't so much beat your head in, but would order someone else to do so without giving it a second thought.\r\n\r\nIf the film has a single problem, it's the runtime. Depending on your perspective, 206 minutes is either too long or, ironically, not long enough. I could certainly see this story working well as a six-hour miniseries, but as a film, it needs trimming. As mentioned above, the last act is devastating; there's little tension as such, but there sure is pathos. However, by the time we got to this point, I was starting to feel the film had outstayed its welcome, when I should have been the most heavily invested in the story. This has been a recurrent problem in recent Scorsese films, most notably _The Aviator_ (2004), _The Wolf of Wallstreet_ (2013), and the horrendous _Silence_ (2016), but this is the first time he's strayed from over-long into self-indulgence. The film simply doesn't warrant this length; whole scenes could easily be removed without compromising the story, the character beats, or the emotion. This is mostly felt in the long middle section in which Scorsese broadens the story to take in the Kennedy and Nixon presidencies, without ever really tying the historical material to Sheeran's narration. Presumably, he's trying to show the interconnectedness between the underworld and politics, but given the time he spends on it, that isn't especially clear.\r\n\r\nAnother problem, albeit a smaller one, is the digital de-aging. Apart from a scene showing a 20-something Sheeran, in which De Niro looks like he's made of (cheap) wax, I thought the technology was deployed pretty successfully; it's a little jolting at first, but easy to get used to. What stood out, however, was the tired bodies beneath those de-aged faces. This is most notable in the scene where Sheeran beats up Peggy's boss – a pivotal moment that drives a permanent wedge between the two as she witnesses for the first time his savagery. Except the beating is pathetic – the kicks are about five miles away from the man's face and De Niro's exhausted stomps wouldn't flatten a wet cardboard box. It's a shame as, it's a good scene, but the lack of correlation between face and body is undeniably jarring. Another issue is one that has cropped up in all of Scorsese's Mob films – glorification. Obviously, _The Irishman_ is about the toxic masculinity of this world and the lonely endgame (if one even gets to the endgame), but much as was the case with his (frankly stomach-churning) softening of Jordan Belfort in _Wolf of Wall Street_, Scorsese runs a very real risk of glamorising what he claims to be condemning.\r\n\r\nWith 20 minutes shaved off, this could have been one of the best films of the century thus far. For me, _The Irishman_ was a very good movie, but certainly not the masterpiece many others have felt it to be. But that's just me, and I can certainly recognise and celebrate such ambitious and _auteur_-driven filmmaking, especially coming, as it does, at a time when more and more it feels like films are being made by committees rather than by artists. Arguably Scorsese's most eschatological film, certainly since _Kundun_ (1997), _The Irishman_ is essentially a story of how one man lost his soul, and, by extension how the world for which he lost it dehumanises and degrades those who participate in its rites. Although brought down by old-age, abandonment, and the merciless nature of human existence, Scorsese refuses to afford these men an easy out – they made their choices, and they must now live, and die, with the consequences.", "created_at": "2019-11-24T03:47:20.565Z"}, {"movie_id": 398978, "review_id": "5e083218a1c59d0016a88e0d", "rating": 6.0, "review_text": "This being nominated for SAG's \"Best Acting Ensemble\" is basically like when _Bohemian Rhapsody_ won \"Best Editing\" at the Oscars.\r\n\r\nThis uh... This movie's better though.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-12-29T04:56:56.416Z"}, {"movie_id": 398978, "review_id": "5e0a04f71684f700139d6452", "rating": 10.0, "review_text": "It might not be Martin Scorsese’s best film yet, but it’s one more proof that he’s one of the most talented filmmakers ever. With Robert De Niro delivering his best performance of the decade, Al Pacino going crazy and Joe Pesci brilliantly coming out of retirement, The Irishman is a wonderfully-written, (very) long story about friendship and life. The best editing (Thelma Schoonmaker) of the year makes the runtime smoother, but it still drags on for too long. I also feel that Anna Paquin’s character should have had more impact. The de-aging VFX is mind-blowing, even if it takes a few minutes to get used to it.\r\n\r\nRating: A-", "created_at": "2019-12-30T14:08:55.429Z"}, {"movie_id": 398978, "review_id": "5fa5b0421b7294003c90f853", "rating": 7.0, "review_text": "Wanted to love this but there were moments where I sort of lost interest. And while I don't at all mind lengthy movies (Godfather Part II and Apocalypse Now are two of my favorite movies), this one was probably a good 20-minutes too long IMO. That said, nice to see De Niro at least trying to act rather than sleepwalk through a role and seeing Joe Pesci was great. Pacino however I never 100% bought into playing Hoffa. Guess it's worth checking out but doesn't hold a candle to other Scorsese's films. **3.5/5**", "created_at": "2020-11-06T20:21:22.884Z"}, {"movie_id": 398978, "review_id": "604acd87ea37e0005a40c4f9", "rating": 10.0, "review_text": "A fascinating watch - totally worth the 209 minute run time.\r\n\r\nThere's so much to like about <em>'The Irishman'</em>. From the top class performances, the ace cinematography, the excellent music and, most importantly, the captivating plot. I enjoyed this more than (the great) <em>'Goodfellas'</em>, which is my only previous experience of a Martin Scorsese film.\r\n\r\nRobert De Niro is always a fantastic watch and here he is no different, I absolutely loved every scene of him as Frank. Al Pacino (Jimmy) and Joe Pesci (Russell) are also superb, Pacino particularly. Away from those three, you also have Ray Romano, Bobby Cannavale, Stephen Graham and Harvey Keitel involved. Awesome cast.\r\n\r\nNo idea how true to life it is, all I care is if it delivers a fantastic film - and it undoubtedly does. I felt entertained for every second. The de-aging effects are cool to see, also. I understand why some may fault this. Me? Loved it!", "created_at": "2021-03-12T02:10:15.707Z"}]