[{"movie_id": 3527, "review_id": "5b563d1dc3a3685c88029538", "rating": 6.0, "review_text": "Caught between Earth and Sky  \r\n\r\nRELEASED IN 2005 and directed by Wim Wenders, \"Don't Come Knocking\" tells the story of a 60 year-old B-Western film has-been, Howard Spence (Sam Shepard), who is sick of his meaningless scandalous carnal existence. While on a film set in Utah he jumps ship and flees on a horse, searching for SOMETHING, like a reason to exist. He ultimately travels to Butte, Montana, where he gets reacquainted with an ex-girlfriend (Jessica Lange) and meets an angry young musician (Gabriel Mann) as well as a mysterious spiritual woman (Sarah Polley). Meanwhile the film company sends an eccentric bounty hunter (Tim Roth) to fetch Shepard for breach of contract.\r\n\r\nAlthough this is generally a quiet drama, it has a hip and likable artistic flair. The film is highlighted by magnificent Western locations and a nice modern Country/Western/Rockish score/soundtrack (non-twangy).\r\n\r\nWe can all relate to Howard's search on some level; hence, despite the film's slow drama it generally maintains the viewer's attention throughout its runtime, unless you strictly favor fast-paced, quick-edited explosion-every-five-minutes thrillers.\r\n\r\nThe two youths Howard meets in the story, Earl and Sky, represent two extremes. Earl's name is fitting because he's full of volcanic rage that spits out from deep within the Earth (Earl/Earth, get it?). Sky, on the other hand, is completely spiritual in nature (hence, sky/heaven). She's full of warmth, love, compassion and forgiveness. In fact, she's the crucial Christ figure without which there would be little reconciliation for anyone in the story.\r\n\r\nTake note of the scene where Sky meets Howard in his hotel room. Sky just looks at him with the understanding eyes of divine love. This naturally makes Spence uncomfortable; he's never experienced this before. He doesn't know what to do, so he asks her to leave.\r\n\r\nOn a side note, Jessica Lange still looks good for being in her mid-50s but I found her character strange and annoying. Also, Earl's girlfriend (Fairuza Balk) is an entertaining free spirit who looks like she might be the daughter of Steven Tyler.\r\n\r\nThe third act of \"Don't Come Knocking\" is too low-key for my tastes, but the movie’s worthwhile if you favor the cast and have a taste for eccentric indie dramas, as well as stories about the modern West with echoes to the past.\r\n\r\nTHE MOVIE RUNS 1 hour, 51 minutes and was shot in Butte; Arches National Park and Moab, Utah; Elko and Wendover, Nevada; and Los Angeles. WRITERS: Sam Shepherd and Wim Wenders.\r\n\r\nGRADE: B-", "created_at": "2018-07-23T20:39:57.463Z"}]