[{"movie_id": 459003, "review_id": "64c15cb8871b34010107343c", "rating": null, "review_text": "Mavka: The Forest Song (2023) is an enchanting and magical tale that beautifully weaves love and responsibility in the heart of the forest. The captivating world of Mavka draws you in, and the dilemma she faces between her duty and newfound love with Lukas keeps you emotionally invested throughout. The film is a delightful blend of romance and fantasy, leaving you with a warm heart and a sense of wonder long after the credits roll.", "created_at": "2023-07-26T17:49:44.188Z"}, {"movie_id": 459003, "review_id": "64cf6c7a549dda011c282df4", "rating": 6.0, "review_text": "You can't help but spot the Disney and Pixar influences in this gentle Ukrainian family adventure that pits mankind against the beauty of nature. That beauty is personified by the eponymous forest sprite who, along with her community of mythological and animal creatures lives in fear of encroachment by the ravages of neighbouring human kind. On the other side of the mountain live those very people. The status quo is maintained until the arrival of \"Madame\" - in search of a leaf that may bestow immortality. She offers a great prize to anyone prepared to cross the hills and find it. Meantime, the young \"Lucas\" has some familiarity with their neighbouring realm and, so in need of the money, he sets off and, well what follows now is a combination of romance and a brutal illustration of just how cavalier mankind can be when nature gets it it's way - peppered with some comedy slapstick largely provided by the would-be fashionista \"Frol\". The animation is delicately drawn - apparently there is no tech used here - and the characterisations gently convey a message of love, loyalty and the flaws and strengths of human nature. It's even got the odd power ballad to give Edina Menzel a run for her money and though you probably won't remember this for long, it's an enjoyable - if a bit too long - watch with a message for everyone.", "created_at": "2023-08-06T09:48:42.551Z"}]