[{"movie_id": 8942, "review_id": "549f33839251411d530033bc", "rating": 9.0, "review_text": "A woman, Wendy (Michelle Williams), is trekking through America, well, she does have a car, although not of much use to her (it breaks down early on in the movie). She also has a dog, Lucy, whom she loses early in the movie. We have no idea where this woman came from exactly, but we know where she is going, and why. Alaska... to get work. Of course, this might not be the entire truth, just what she tells people. She is not poor, but she has clearly not been wasting her money so far and she is not about to do that now, although, circumstances might take that decision right out of her hands.\r\n\r\nThis woman has experienced something, and carry the scars. She does not trust people well, but learns to trust some people throughout the movie. But luckily, the movie does not provide all the answers... we have to figure them out for ourselves. These are the movies that I like the best.\r\n\r\nMichelle Williams is amazing in this role, heartbreaking really. She makes good decisions, but also some terribly wrong ones that might change her journey significantly. I found myself being angry at her early on for making a really stupid and unnecessary decision, but how wonderful to finally see a character who isn't perfect. Flaws is what define a human.\r\n\r\nThe movie itself is slow paced, taking its time to follow Wendy around. It never rushes the story for a second, and when it is over, you can't help but think that it could have easily been 2-3 hours longer, as you want to see what happens to Wendy and Lucy. The images are very realistic, following Wendy close. They are not perfect, but neither is life, and this movie wants to show us just that... life. This is clearly an indie movie, and one of the best I've seen in a good while. I've seen another movie by the director, Kelly Reichardt, and it was filmed in the same way.\r\n\r\n_Last words... Wendy and Lucy is a story about being human, about surviving in the world, about searching for something, a purpose maybe. It is also about friendship and trust, about the choices that we make, the choices that come to define us and our lives. Yes, it might seem like a small movie, but in reality, it is the biggest story of all, the story of our lives._", "created_at": "2014-12-27T22:32:35.222Z"}, {"movie_id": 8942, "review_id": "5564a217c3a36851cf004d77", "rating": 8.0, "review_text": "Michelle Williams is one of the photogenic face in Hollywood and also like her performance. But won the negative impression of mine over portrayal of her character in 'Take This Waltz'. Doing a villainous role may get appreciation, for example, the Joker from Batman, but doing things that affect morality is really hurt if you really like that person. After that movie, I was not into her films and she also did not do any major roles. Accidentally I came to know about this movie, which is in fact a bit older movie than what I was talking about and after knowing more about it, I got interested and I could not resist from watching. Frankly, this movie filled the gap created by the earlier crack.\r\n\r\nThis movie falls in the line of 'Open Road' and 'Into the Wild' when it comes to rendering the main character. If you have already seen those two, or any other similar flicks, then you would find this movie was very much intense. Wendy, a woman in her late 20s with her dog Lucy are on an expedition to the other end of the country seeking a solution to the difficulty for having a normal life and job. One must have to keep walking on either of way to see a light at the end of the tunnel and that's what Wendy does here.\r\n\r\n> \"You can't get an address without an address.\r\n> You can't get a job without a job.\"\r\n\r\nThis movie commence middle of her destination, where she's stranded after her car broke-down. It won't say anything about the earlier account of Wendy or what might happen after the timeline of this film. All the 80 minute of narration takes place in the Oregon city which is just a glimpse of her life for us as a movie, but a major impact thenceforth in her life. The struggle during fixing her car is what depicted simply, but beautifully on the screen.\r\n\r\nThe story is about the man and his pet's relationship, that's what the meaning of the title, like 'Marley & Me'. Also being a young woman, society is no safe for roaming freely all the places alone at all the time. Plain drama, it was, but something meaningful story, a lesson to learn, a character to study and a life to experience. A kind of journey of self- discovery during understanding how the civil system works. Thematically there's nothing wrong, but 'setting an example' wise, this movie is not safer for other than the adults. Among the best movies of the year it was released. Impossible not to recommend others, especially by me to you perhaps.\r\n\r\n8/10", "created_at": "2015-05-26T16:40:55.267Z"}]