[{"movie_id": 937278, "review_id": "63bbe4f4a6e2d2008b3e7d24", "rating": 7.0, "review_text": "Fans of the BBC sitcom \"One Foot in the Grave\" might recognise something of the \"Victor Meldrew\" in Tom Hanks' portrayal of the eponymous curmudgeon. Formerly head of the community association, he takes it upon himself each morning to do his \"rounds\" - checking the gates are closed, the permits are displayed, the recycling is correct - all pretty anal, really. A combination of circumstances are about to rock his rather pedestrian world, though. He is laid off after thirty-odd years at work, a deed which renders him pretty rudderless; and he gets new neighbours - \"Marisol\" (Mariana Treviño), husband \"Tommy\" (Manuel Garcia-Ruffo) and their two daughters. Now their arrival causes him no end of irritation (and, if truth be told - for me too!). The family are pretty hapless and soon \"Otto\" finds himself helping them out and gradually, her forceful and annoying character starts to morph into something more accommodating and he begins to feel just a tad useful. Now it ought to be said that most of this story evolves against a backdrop of attempts by the older man to kill himself. There is humour to be had here, as well a rather nuanced message illustrating the effects of loneliness and a general resignation that the fruitful section of his life is finished. Gradually using \"Marisol\" and a few other neighbours as conduits, we learn of the tragedies that have led him to his current predicament, and to a position where there might just be a new light at the end of his tunnel. From a character perspective, I preferred the \"Otto\" at the start of the film. A rather bitter and amusingly sarcastic figure, but as the plot develops we lose that sharpness, the story becomes a little too cluttered and I found the initial poignancy falls away as a rather sentimental degree of melodrama edges into it all. Still, Hanks offers a strong performance and after her distinctly annoying start I found myself increasingly engaged with the whole family across the road who might just offer \"Otto\" some validation and/or salvation. It's also a remarkable understatedly inclusive film. This community has all sorts of colours, shapes and sizes - and \"Otto\" for all his faults, has no truck with discrimination. This inclusiveness is delivered to us quietly as if it is all no big deal. A more productive and subtle method than many offering the screamingly obvious box-ticking characterisations. This is a good film, not a great one, and I am not sure it needs to be seen in a cinema - but I would certainly suggest you do get round to watching it.", "created_at": "2023-01-09T09:57:08.418Z"}, {"movie_id": 937278, "review_id": "63daab6ba6c104007c0745fb", "rating": 7.0, "review_text": "A Man Called Otto is heartfelt and sad story about a widowed husband trying to find his place in the world without his wife. It is incredibly touching and can resonate with any audience member no matter the age. \r\n\r\nGoing into the film, I was expecting it to have it's sad moments but there are times where this movie gets very dark. This was a surprise and it is a major tonal shift from the rest of the film. It works really well as this tonal juxtaposition is a metaphor for how Otto is feeling on the inside versus the positivity that is given to him in his every day life.\r\n\r\nTom Hanks delivers a great performance here. He had great comedic timing and delivered a tremendous amount of emotion in just his subtle facial expressions. Mariana Treviño was excellent and her chemistry with Hanks is superb throughout the film. Her hard fast nature is able to drive a wedge into Otto, giving him the ability to open up for the first time and genuinely live since the passing of his wife. It worked wonderfully and was a highlight of the film. The majority of the other performances were poor... I liked the kids though.\r\n\r\nThe plot is pretty generic in terms of overall structure, I could have predicted the ending after the first ten minutes. It differentiates itself by having a very real and brutal look at the mental health of a widower. How someone's lack of direction and companionship can lead them down a dark path. It was great. This movie does try to shoe horn in some social commentary about transgender acceptance and societies selfishness with phones. I am all for giving that type of representation in film, but it was done here in a very inorganic way, making it feel not genuine.\r\n\r\nOverall, this movie accomplished its goal and made me cry. It really affected me as both my grandmothers are widowed and it let me gain a view of what they went through in the aftermath of losing a partner.\r\n\r\nScore: 72%\r\nVerdict: Good", "created_at": "2023-02-01T18:11:55.232Z"}, {"movie_id": 937278, "review_id": "6419afa40d5d85007b69529d", "rating": 7.0, "review_text": "I had read the book and watched the original Swedish version of the movie before I had a chance to watch this, so I suppose I had  some baggage to carry going into it.\r\n\r\nBut I liked the film, especially the irrepressible Marisol, Otto’s new neighbor next door. I tried to avoid the thoughts of “Was that in the original?” and the like and just let it roll over me. Oddly enough, I wasn’t sure that the two characters that played young and old Otto seemed like the sort who would be DIY experts. I am not sure there is a look for that sort of skill set. Perhaps his social ineptitude planted that doubt in me.\r\n\r\nBut it was worth watching, if not something I will ever feel the urge to repeat.", "created_at": "2023-03-21T13:22:44.968Z"}]