[{"movie_id": 717930, "review_id": "646462dc44a4240124de618f", "rating": 8.0, "review_text": "A CIA agent in Afghanistan has to try escape the hostile territory when his disguise is blown. If you apply some suspension of disbelief to accept that it would be possible to a single man to survive being followed by an army of enemies, Kandahar is actually a quite well-made movie! Very contemporary, following the US withdrawal from Afghanistan, the movie does a good job showing the hostile atmosphere where different factions (Taliban, I.S.I.S, and the Iranian government) fight each other but have a common hatred towards the western interference. Definitely worth watching, especially if you enjoy \"war escape\" movies.", "created_at": "2023-05-17T05:15:08.087Z"}, {"movie_id": 717930, "review_id": "648d0665c2ff3d00ad0157b6", "rating": 6.0, "review_text": "Yet another military pot boiler, starring, once again, Gerard Butler.\r\n\r\nKandahar pretends to be open and inclusive. There's a modest plug for nationalism/patriotism, from the perspective of different nations.That said, this film is essentially about saving a man who commits a pretty awful act of terrorism, in another nation, at the behest of the CIA.\r\n\r\nIts quite watchable, there's a lot of serviceable action. That' said, its hard to overlook the predictable marketing of US/UK exceptionalism as \"A-OK\". Sorry but as far as this viewers concerned, it's anything but \"OK\". \r\n\r\nIn summary, a pro Western military action flick. Quite watchable in its own way but as they say \"it is what it is\". There's no changing that.", "created_at": "2023-06-17T01:03:33.757Z"}, {"movie_id": 717930, "review_id": "648f92ec559d220139be73a3", "rating": 10.0, "review_text": "The Best", "created_at": "2023-06-18T23:27:40.154Z"}, {"movie_id": 717930, "review_id": "64cca484706e5600eaa73255", "rating": 5.0, "review_text": "Gerard Butler is an actor who knows his strengths and takes roles that play to them, and his charismatic lead performance is one of the best things about “Kandahar,” a military action thriller about undercover CIA operative Tom (Gerard Butler) who is stuck deep in hostile territory in Afghanistan with his translator, Mo (Navid Negahban). It’s vaguely familiar to this year’s “The Covenant” from Guy Ritchie, yet the two films are very different. Here, the two men must work together to avoid the elite special forces unit that has been tasked with hunting them down after their mission is exposed.\r\n\r\nThe plot is very by-the-book and simple, but Mitchell LaFortune’s script features thoughtful writing with a politically-minded slant. There’s a lot of conversational drama that feels draggy in parts (and a lot of it is offset by massive explosions and flashy shootouts), but the screenplay is not mindless. It’s exhausting to keep track of the roster of characters and factions and how they are working with or against each other, but the focus on the narrative is the relationship between Mo and Tom and their will to survive. Their friendship is crucial to the story, but you must suspend disbelief because there’s no way these two would develop such a close bond in such a short amount of time.\r\n\r\nThe film is well cast and features solid performances from all involved, which in turn helps create a stronger emotional bond between the audience and the characters. The stakes are high and the danger feels real, which makes every shootout affecting and tense. You’ll genuinely root for these guys to make it out alive, but getting to their final extraction point quickly becomes a dicey proposition.\r\n\r\nDirector Ric Roman Waugh, who worked with Butler on “Angel Has Fallen” and “Greenland” is perfectly acceptable behind the camera, but the too-dark cinematography and annoying overuse of shaky handheld cameras are both extremely aggravating as a viewer. The monotonous chase – shoot – repeat formula grows tiresome very quickly.\r\n\r\nDespite its somewhat predictable story, “Kandahar” tries to tackle some sophisticated commentary about the cycle of violence and war in the Middle East. This makes it a decent (if forgettable) movie where the action scenes come with a dose of emotional weight, and not just explosions for the sake of empty entertainment.", "created_at": "2023-08-04T07:11:00.160Z"}, {"movie_id": 717930, "review_id": "64da522159e8a900ac06c183", "rating": 5.0, "review_text": "When a CIA mission goes awry, agent \"Harris\" (Gerard Butler) finds himself stuck in Afghanistan with his interpreter \"Parshand\" (Farhad Bagheri) and with his identity now on the open market! As you might expect, the next two hours is spent on the usual, derivative, cat and mouse antics as they try to stay one step ahead of pursuing warlords, mercenaries and - well, luckily, I don't actually have a gun! It's so formulaic and unnecessary this film and by half an hour in there isn't the slightest hint of jeopardy, nor much respect for an ancient culture that is treated as if it were just another outing for an American political and military establishment that treats all parts of the world as if they were extensions of Texas. The dialogue is banal and a bit like after his last outing - \"Plane\" (2023) we really ought to be telling Mr. Butler to hang up his rifle and leave well alone. Nothing at all new here, and it really is a bit of a waste of time.", "created_at": "2023-08-14T16:11:13.797Z"}, {"movie_id": 717930, "review_id": "6598b1716e938a0200004f66", "rating": 6.0, "review_text": "Another okay Butler action movie, but a little low on the action part. They tried to make the main villain guy way too \"cool\" and he just ended up seeming like a bad anime character. Bunch of white savior stuff going on here and some comments could be made about how the translator wouldn't need saving by the US if not for the US in the first place. Ummm, ya, whatever, looking forward to more Butler! You can put this ham on your face if you want, but it's a bit slimy.", "created_at": "2024-01-06T01:48:33.716Z"}]