[{"movie_id": 220289, "review_id": "5fa220d10c12550037290f87", "rating": 7.0, "review_text": "If you have an affinity for mind-bending riffs on quantum physics, you'll enjoy \"Coherence.\" Most of these types of stories take the concepts of quantum mechanics (entanglement, superposition, etc.) which exist at the most microscopic--level (electrons, particles) and posit that similar effects could happen at the macro-level (real-world people and physical objects).\r\n\r\n\"Coherence\" takes a nightmare dinner party scenario (ala \"The Invitation\") and applies the quantum concept of coherence and \"many-worlds interpretation\" (or multiple universes) that is triggered by a passing comet. \r\n\r\nIt's better to come into this with as little info as possible to enjoy the unwinding of the mystery. While its a bit of a slow burn at first, the filmmakers really nail the ending.", "created_at": "2020-11-04T03:32:33.335Z"}, {"movie_id": 220289, "review_id": "6300177e96e30b00911f5ff6", "rating": 7.0, "review_text": "**Overall : The greatest movie you've never heard of.**\r\n\r\nCoherence kept popping up on lists of best sci-fi films which was surprising because I had never seen a trailer or heard anything about it. I found it free to stream somewhere, so I checked it out, and I am so glad I did! What I found was a very low-budget film with a cast you have never heard of but a premise and script that were so well executed that this movie blew my mind! The panic and anxiety of the characters as they try to understand what is happening around them is told with such brilliance that the audience is lost, intrigued, overwhelmed, and bought in all at the same time. I'm telling you - watch this movie!", "created_at": "2022-08-19T23:06:38.950Z"}, {"movie_id": 220289, "review_id": "639f8578be6d8800d9ccbdbd", "rating": 9.0, "review_text": "Superficially, the story is simple: a dinner-party among 4 couples of friends, that just happens to be on a night that a comet is blazing closer to Earth. Someone mentions a curious set of events during an earlier comet passage, about a century before, and how that affected a local population.\r\n\r\nEarly on you can spot some slight \"incoherences\" coming from how characters exchange dialogues, and from the middle on, you start feeling spooked, as you start putting things together.\r\n\r\nBe prepared for a movie that you will have to have the pleasure of re-watching 2-3x, in order to grasp every single detail and meaning contained in this mind-boggling experience.\r\n\r\nWhat is more rewarding in all this rich and masterful script/ plot, is that it speaks so loud and clearly about how we lead our own particular lives and how we get where we are (or not...?). One way or another, you will look back on your own important decision moments in life and start wondering \"what if...\". A definite must. 9/10", "created_at": "2022-12-18T21:26:16.201Z"}]