[{"movie_id": 206647, "review_id": "563e06159251413b1300c821", "rating": null, "review_text": "<a href=\"http://www.cutprintfilm.com/reviews/spectre/\"</a>\r\n\r\nIn hindsight my excitement for Spectre seems a bit foolish. After Skyfall, director Sam Mendes openly stated that he wouldn’t direct another Bond movie. And even so, Skyfall wasn’t the best of the new Bond films by any measure – dragging on for much too long. But somehow I got sucked into the hype of Mendes’ vision for an homage to the classic Bond, with that somewhat iconic poster of Craig mimicking Roger Moore, and trailers the emphasized a kind of retro re-visitation of some old villains and themes. But Spectre is none of those things, instead it is a film where everyone involved feels like they are just going through the motions. Spectre tries very hard to be an homage to the vintage James Bond classics, but instead ends up feeling more like a mockery of the series.\r\n\r\nFor starters the script is outrageously weak and predictable. Bond goes from shootout, to chase, to sex scene, saying and doing the exact same things he has done for the last 23 movies. Instead of a complete story, the film is just a collection of set pieces and scenes loosely stitched together. And while some of them work well on their own, by the second or third fight scene, you won’t be able to stop yourself from yawning. When you aren’t yawning you’ll be laughing, and not in a good way. The dialogue is downright cheesy. Gone is all of Bond’s smooth charm and ability to sting his opponent’s with his tongue just as much as with his gun. Instead at one point, he throws a watch bomb and says: “Time flies!”\r\n\r\nBond is one a secret mission, assigned to him by M (Judi Dench) via a video message delivered after her death. The film doesn’t ever attempt to invest the audience in this mission, or in Bond’s motivation for seeking out Oberhauser (Christoph Waltz) – which apparently has something to do with his foster-father and his childhood, again – but it never seems important to the story or to James. Meanwhile, a new joint secretary, Max or C as he is known (Andrew Scott), is attempting to unite the world’s intelligence under one surveillance network – and through doing so making the Double-0 program obsolete. Lucky for him, Sam Mendes is already doing that for him.\r\n\r\nHowever, Spectre is a beautiful film. There are about five or six huge set pieces, all of which are wonderfully filmed. And if you are just in the mood the veg out and watch Bond cruise through the streets of Rome in a prototype Aston Martin, than this is the movie for you. But things go on for entirely too long, which would be fine if something of interest were happening. But almost nothing does. Bond gets in a situation and gets out, all while throwing a few pithy, laughable, lines out.\r\n\r\nDaniel Craig has never been more disconnected from the character James Bond, than he is in Spectre. I must say first, that I love Craig as an actor and as James Bond – he is my favorite of all the Bonds. But here, he is uncharacteristically not James Bond. A scene for instance where bond throws his gun into the river, is done in such a fancy foppish way that I cringed. It is tough to properly convey how Craig misses the mark in Spectre, but when you see it, you won’t be able to help feeling the same way.\r\n\r\nMaybe Sam Mendes and screenwriter John Logan did succeed at creating a perfect homage to the Roger Moore era Bond films? Because in reality, none of those films standout as great movies. From start to finish, Spectre feels like someone filling out a madlibs of Bond scenes, and praying that when they read it back, it makes some sense.", "created_at": "2015-11-07T14:09:25.776Z"}, {"movie_id": 206647, "review_id": "563ed3f9c3a3681b4d034302", "rating": null, "review_text": "Well, cinema’s most treasured and resilient British spy guy is back as the legendary James Bond makes his twenty-fourth outing on the big screen in the highly anticipated and slickly-made Spectre. Worldwide Agent 007 fans understandably maintain their embedded expectations and vision as to what calculating and cunning mission their suave and sophisticated gun-toting, martini-sipping espionage thrill-seeker will encounter in his latest globe-trotting episode. Whatever Bond enthusiasts have in mind for the future twenty-fifth entry of the “licensed to kill” Lothario they should simply settle for the present stimulating currents that trickle as mind-bending material in the polished and percolating Spectre.\r\n\r\nAs for the dynamic performer that have served his time with action-oriented cinematic sensibilities through three previous super-charged James Bond installments, the steely-jawed and diligent Daniel Craig is back on the saddle again for his fourth stint as the crafty 007. Naturally both ardent and casual Bond followers can rattle off the filmography of Craig’s on-screen tour of duty as the debonair and daring secret service operative and even rate the previous films as they compare and contrast each edition.  Some may give special attention to Craig’s first foray into stepping inside Bond’s explosive shoes for 2006’s Casino Royale that is considered a spectacular introduction for the dramatically trained actor. In 2008’s Quantum of Solace, it was a mixed bag at best as Bond followers for the most part gave this second 007 rendition an ambivalent sign of approval (not too many were thrilled with the awkward movie title either). Thankfully, 2012’s Skyfall bounced back for Craig’s take on the roguish Bond and made for some exceptional brownie points as the cagey spy returning to creative prominence. Now 2015’s Spectre hopes to make some hearty tie-ins to Craig’s past big screen adventures as the stoic jet-setting dynamo ridding the world of masterful riff raff.\r\n\r\nIn actuality, Spectre is serviceable in that it is an elaborate and excitable reminder of the preceding Bond films where bits of nostalgic elements from yesteryear are sprinkled throughout its presentation. Sure, some wily 007 fanatics may spot a few of the tossed in nods to the aforementioned Casino Royale and Quantum of Solace in particular as the proceedings unfold. For the most part, Spectre acts as a mere bridge to the launching of the upcoming 25th Bond actioner in waiting. To be fair the other Bond films have served as a welcome mat to the next chapter of the late Ian Fleming’s engaging and charismatic man of action so why should not Spectre be any different in this regard? Still, this spy caper has its signature swagger that Bond aficionados relish with familiarity: heart-pumping action sequences, exquisite locales, desirable and devious Bond women, majestic car chases, larger-than-life villains and their loyal henchmen, imaginative gadgets and inventive technology and yes…the indomitable James Bond at your service. Nevertheless. the minor knock on Spectre is that it could have risen to the occasion more than it did as it occasionally feels as if it is going through the mischievous motions. It never resorts to the levels of Bond-ish drudgery in Quantum of Solace so that certainly is a relief in that aspect.\r\n\r\nSpectre does incorporate its share of opulence, mystery, suspense, shadowy tension and perilous plight. However, where the standard Bond film-making characteristics are somewhat consistent and captivating (i.e. the breathtaking opening sequence of the Day of the Dead celebration in Mexico City) there is also a questionable consideration for the weak-kneed Bond theme song in Sam Smith’s “Writing’s on the Wall” which seems so inadequately suited for a James Bond signature tune. Even the indifferent observers of the James Bond film franchise for the last five decades can attest to the two most important stamps of a Bond film–its opening scene and surging theme song.  Thankfully, Spectre’s grand opening sequence obeys traditional Bond practices but Smith’s doggedly tired-sounding “Writing’s on the Wall” feels as it belongs attached to an old televised After School special from the mid-70s. Wouldn’t you give your kingdom for Paul McCartney and Wings’ “Live and Let Die” or Carly Simon’s “Nobody Does It Better” or perhaps even Sheena Easton’s “For Your Eyes Only”?\r\n\r\nOne thing that can be said about Craig’s Bond in Spectre and that is his image transformation has been elevated to that of a fashion plate whose GQ stylized look has taken quite a step up. Not since Roger Moore’s Bond has there been a clear case of dazzling attire on display for Agent 007 to strut his stuff in spiffy clothing accessories throughout his ventured travels. Craig, billed as a “blue-collar” Bond whose demeanor is more blunt and workman-like, takes comfort in basking in the finesse shadows of a classic Agent 007 almost foreign to his distinctive spin on the iconic spy. In fact, the overall vibe for Spectre seems to lie in the middle of old school and new school James Bond mythology where the shading suits both camps of the ever-lasting film franchise.\r\n\r\nDirector Sam Mendes, who handled the direction for the previous Skyfall, finds the right tone and temple for Spectre that certainly shows off its lavish and ambitious production values as the set designs, scenic locations, fabulous pre-credits action sequence are all indescribable in majestic scope. No one can accuse Spectre as to not holding its own in visual functionality. Wisely, Mendes does not forget his Skyfall background players as they reunite with Craig’s Bond and partake in the sensationalized cat-and-mouse caper. It is refreshing to see Ralph Fiennes back as “M” not to mention Ben Wishaw’s “Q” front and center. And a Craig-fronted Bond film would not be the same without Naomie Harris as Miss Moneypenny.\r\n\r\nAgent 007 fans will find a common \"Bond\" with Daniel Craig and his fourth outing as the licensed to kill Lothario in the stunning and kinettic SPECTRE\r\nAgent 007 fans will find a common “Bond” with Daniel Craig and his fourth outing as the licensed to kill Lothario in the stunning and kinetic SPECTRE\r\nIt is a given that the diabolical criminal network known as SPECTRE has always had its affiliation with the Bond universe especially in the classic Sean Connery Bond-age years. Instinctively, SPECTRE’s evil heart and soul was pumped continuously by that organization’s dastardly mastermind Ernst Stavro Blofeld. Oscar winner Christoph Waltz does the sordid honors of taking the reins as Bond’s nemesis Franz Oberhauser in Spectre with devilish delight and is more colorfully corrupt thanks to his handy go-to muscular minion Mr. Hinx (ex-professional WWE wrestler and “Guardians of the Galaxy” star Dave Bautista) echoing the memories of beloved brute Jaws (played by the late Richard Kiel) from The Spy Who Loved Me and Moonraker). \r\n\r\nWe can never forget that along with Agent 007 folklore comes the responsibility of being labeled a treasured Bond babe. And although the latest sultry women represented in Spectre will never make us forget the iconic likes of Dr. No’s Ursula Andress (Honey Ryder) or Casino Royale’s Eva Green (Vesper Lynd) for that matter they still hold their own and give a measure of titillation to both Bond and the vast amount of male admirers wishing they carried a gun and wore expensive tuxedos while being at the receiving end of a provocative smooch by these vibrant vixens. Lea Seydoux’s Madelene Swann and Italian siren Monica Bellucci’s Lucia are on board as the Bond bombshells for hire.\r\n\r\nAs a whole, Spectre has its up and down moments and never is quite sure about standing alone as an independent Bond story or being dismissed as a pit stop for 007-related flashbacks and reference bits ode to yesteryear’s glory of the super spy’s engaging and raging exploits. The verdict is that Spectre ultimately satisfies one’s craving for the invincible James Bond whether you can to relive his vintage reputation or look forward to a millennium-enhanced production that will grow with the ageless wonderment pertaining to Fleming’s literary ladies man-turned movie-making mainstay of action-packed cinema for half a century. As one-time Bond songbird Carly Simon would attest in her soothing lyrics, “nobody does it better…”  Yet in the dimensional escapist world of James Bond this particular go-around could have been a tad bit better.\r\n\r\nSpectre (2015)\r\n\r\nSony Pictures\r\n\r\n2 hrs 28 mins.\r\n\r\nStarring: Daniel Craig, Christoph Waltz, Lea Seydoux, Naomie Harris, Ben Whishaw, Dave Bautista, Monica Bellucci, Andrew Scott\r\n\r\nDirected by: Sam Mendes\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Spy-Espionage Caper/Action & Adventure/Suspense Thriller\r\n\r\nCritic’s rating: ** 1/2 stars (out of 4 stars)\r\n\r\n(c) Frank Ochieng (2015)", "created_at": "2015-11-08T04:47:53.765Z"}, {"movie_id": 206647, "review_id": "5649fed29251413ad500b5ac", "rating": 6.0, "review_text": "A \"correct\" Bond movie. All the expected stereotypes are included, Waltz is an OK bad guy and the intro scene is something really impressive.\r\n\r\nNothing else really new ...", "created_at": "2015-11-16T16:05:38.566Z"}, {"movie_id": 206647, "review_id": "56c093a59251412be0000529", "rating": 7.0, "review_text": "> Not your usual Bond movie, but still a good entertainer.\r\n\r\nWhat I liked from a couple of last Bond movies was they were off the regular 007 style, like not overly rely on spy's special gadgets. This change has been since the day one of Daniel Craig as a famous British spy, James Bond. Anyway, he's the most fittest (muscular) Bond I've ever seen and he's celebrating 10 year anniversary with this film release. But the question is whether he to do another film or done with the franchise. The doubt after the confusing end of this film.\r\n\r\nThe end was quite clear on the story perspective, so I kind of felt it was a farewell for Craig. But, later I came to know that the official source says Bond25 will be his fifth and so on till he opts out himself. 'Spectre' was a very simple Bond movie I have ever seen, but I can say the production quality was so good that you can't resist the enjoyment. The actors, they were also good, but not as I anticipated. Maybe many scenes were very ordinary for a Bond movie, that's comparable with the nowadays action movies, otherwise it was not as bad as critics expressing their disappointment.\r\n\r\nYou can't believe what I was disappointed, you know when they say what the C stands for - is that the best word they come up with against the M for Moron? Anyway, James Bond movies have always had ups and downs, the last film 'Skyfall' was a mega hit and now this has not stood up to that standard. But very entertaining with all the actions and unexpected turns in the narration. As a spy movie, it was okay, but as a Bond movie is what might upset you, so its upto you how you look at it. But to be honest, I enjoyed it.\r\n\r\n7/10", "created_at": "2016-02-14T14:48:05.502Z"}, {"movie_id": 206647, "review_id": "6154920881c7be008e08b3f8", "rating": 7.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/spectre-spoiler-free-review\r\n\r\n\"Spectre fails to reach the tremendous potential of its intriguing narrative and fascinating antagonist, but Sam Mendes still pulls off a decent James Bond flick.\r\n\r\nThe screenplay raises significant issues with an incredibly dull subplot that deeply affects the pacing of a bloated runtime. In addition to this, Christoph Waltz's lack of impactful screentime is disappointing, to say the least, despite a brilliant performance from the actor.\r\n\r\nFortunately, the jaw-dropping action set pieces elevate the overall film, which also benefits from gorgeous cinematography (Hoyte van Hoytema) and exceptional acting across the board. Daniel Craig and Léa Seydoux's characters relationship is emotionally compelling, making Bond's mission feel more like an interesting personal journey.\r\n\r\nOne of the best movies of the franchise is buried somewhere under the messy screenplay, but what can be found at the surface has much to appreciate.\"\r\n\r\nRating: B", "created_at": "2021-09-29T16:19:20.125Z"}, {"movie_id": 206647, "review_id": "6353bf6643250f0082593fa9", "rating": 6.0, "review_text": "Now that Dame Judi has shaken her off her cinematic mortal coil, the new \"M\" (Ralph Fiennes) is facing increasing pressure from whizzkid \"C\" (Andrew Scott) to shut down the 007 programme and rely on an international, computer generated, system of intelligence gathering. Needless to say, \"007\" (Daniel Craig) has his doubts about this and after a manhunt to Rome (via Mexico) that must have cost billions, he alights on an exclusive gathering of the criminal great and good working for the eponymous organisation. Along the way, he manages to enlist \"Q\" (Ben Whishaw) and \"Moneypenny\" (Naomie Harris) in his quest to find the daughter of his old nemesis \"Mr White\". She - \"Madeleine\" (Léo Seydoux) may well know how to help him thwart the ambitions of this secretive and deadly organisation before it is all too late. There are plenty of (extended) action scenes here and the gadgets work well enough, but the story is thin and the characterisations lacking. The dynamic lacks jeopardy - we know who is likely to be behind the cunning plots right from the start and neither Fiennes nor Scott bring much to the party. Indeed the latter is really rather poor. What menace there is, is delivered via some underwhelming contributions from Dave Bautista's \"Hinx\" and from the appearances of Christoph Waltz, but they are all too infrequent to bolster the storyline before an ending that was, frankly, ridiculous - even by \"Quantum of Solace\" (2008) standards. The producers seem to be constantly trying to reinvent \"Bond\" without realising that the more they compromise the standards of the story and weaken the traditional characters, the less impact the franchise has when surrounded by many others of this genre that benefit from stronger writing and a more charismatic star. This is shorter than many of Daniel Craig's other outings as Ian Fleming's master spy, for which I was grateful because this is all rather mediocre from start to finish.", "created_at": "2022-10-22T10:01:10.885Z"}, {"movie_id": 206647, "review_id": "63be6ebffc31d317148de397", "rating": 1.0, "review_text": "The word \"convoluted\" comes to mind, as does the word \"unwatchable\"\r\n\r\nBy the time Spectre came out, I was honestly sick of Daniel Craig's James Bond hates being James Bond depiction. And now I've come to really despise him, I mean Moore used to be my least favorite Bond, and I like him so much more than Craig.\r\n\r\nBut... the script was kind of all over the place. I think they were trying to do twists and turns, but they were stuck under steering with each turn, so all the twists they tried to throw at you never really worked. It ended up feeling like they were trying to be confusing for the sake of being confusing, and didn't know how to make it all feel confusing for the sake of being mysterious.\r\n\r\nI mean Christoph Waltz is a great actor, but even he couldn't find his footing in that mess of a story.\r\n\r\nThe action was never suspenseful or even really enjoyable...\r\n\r\n... and it all leaves you with the feeling that this is a Bond movie made by people who forgot how to tell a story. And that is kind of fitting given that is what Sony seemed to be threatening to do with Bond for a while, and it was 2015, just before the Hollywood Era of \"story and characterization don't matter\"\r\n\r\nIt can only go down hill from here.", "created_at": "2023-01-11T08:09:35.555Z"}, {"movie_id": 206647, "review_id": "63e70886a2e60200b5ed5835", "rating": 7.0, "review_text": "**Spectre has plenty of style, class, action, and spectacular moments but the film lacks the passion and zeal of Casino Royale or Skyfall.**\r\n\r\nAfter the incredible bombastic success of Skyfall, the return of Sam Mendes, and the announcement of Christoph Waltz as the villain, expectations skyrocketed to ridiculous heights. Unfortunately, these expectations climbed too high for Spectre to meet. While the story did a decent job of trying to tie all the Craig Bond films together and introduce a new supreme criminal mastermind, it didn't fully satisfy or carry the weight it intended. There were some exceptional action sequences, with the opening scene in Mexico City as one of the most stunning and impressive of the franchise. The train fight with Dave Bautista was incredibly entertaining as well, but much of the action felt restrained like Craig was tired of the role and didn't want to push the boundaries on some stunts. Seydoux and Bellucci each brought something new with their Bond Girl portrayals providing emotional exploration and depth unusual for a Bond film. Spectre is a great spy movie and a fun Bond flick, but unfortunately, it didn't live up to the level of hype and expectation set before it. After Casino Royale and Skyfall delivered so much more than a typical Bond film, Spectre seemed to settle for the status quo (which is still good but had all the pieces it needed to be incredible.)", "created_at": "2023-02-11T03:16:22.287Z"}, {"movie_id": 206647, "review_id": "643eb092d7a70a04ddab446d", "rating": 3.0, "review_text": "Spectre has an introspect into what is wrong with modern Bond movies.\r\nNamely, that they don't work, because 007 is about action, exotic sceneries, cinematic brilliance, beautiful women, gadgets that go wrong or right, and most of all the wit and charm and atmosphere.\r\nI'm not sure when the forma should have changed from exciting to dull, probably around 1995, but it changed before that year.\r\nAnd it should have changed in a productive and interesting way. \r\nInstead, it changed to just total dullness with not one good aspect. The motivation of characters other than 007 is total zero in credibility. The inspiration is zero. The strategy is zero. The dialog is clumsy.\r\nThis is to be expected from the changes around 1970, when the writer's guild became immensely jealous of talent and good writing, and only produced the writers with zero talent.\r\nAnd now those writers are the \"judges\" of new writers, God help this culture.\r\nThe change in format should have changed long ago, about 1995, into \"sons and daughters of 007\", with 007 as a background figure, say fifth or sixth billing, with his sons and daughters taking center stage in this \"less action, more computer\" world.\r\nA lot of us said this well before 1995. It was painfully obvious, but we live in a world where Hollywood went total hack in the seventies, with those hacks endorsing the worst hacks of today.\r\n\"Spectre\" kind of gives us an introspective look at this with the timeline element. Bond faces the usual super enemy power, and fights the establishment which brings in the computer age.\r\nThe character of 007 is the only thing that is salvaged in these new movies. It isn't Daniel Craig's fault that he is 007 for the worst writers, writers who are into the neo Nazi ideology of the seventies where women must be blond and pale, and any man who tries to save a brunette is doomed, but save a blond, and you're a success. The Hitler worship is so extreme in the modern Bond movie writing that it's impossible to deny it is there. \r\nAnd the directors are pathetic. Even given the ideal exotic locales, they manage to dumb down the scenery. One feels like the director actually says \"How can we make this beautiful and exotic scenery look dull and depressing? Aha! I can do it!\"\r\nOf course the day will come when Craig will be the beneficiary of this fame and get to do actually good films for which he'll be remembered. \r\nThis movie is pretty much formula. The action is okay enough, and it isn't as contrived to be depressing as Casino Royale or A View to a Kill, but it is depressing and dull.", "created_at": "2023-04-18T15:00:34.427Z"}]