[{"movie_id": 389015, "review_id": "59bb354b925141327d004640", "rating": 7.0, "review_text": "I had zero expectations going into this as not much is known about the movie except for the cast - and obviously the story as it was a huge news event in the 90s - but it turned out to be a wildly entertaining albeit flawed biopic. The film settled on a style and tone that falls somewhere around the Coen brothers territory, but also gave me Christopher Guest vibes with its talking head moments and Paul Thomas Anderson level soundtrack use. It had a lot of cinematic elements, but overall it's a super accessible crowd pleaser.\r\n\r\nThere are two big problems I have with this film, however. Its soundtrack, while filled to the brim with classic songs, often felt out of place or completely unnecessary at times. For an iconic 90s story, having only 70s songs was an interesting choice. A lot of the songs played at strange moments as well and sometimes they were just too on-the-nose. For example, Supertramp's \"Goodbye Stranger\" plays as Jeff and Tonya separate for the first time. The other problem with this film involves the inclusion of the fourth wall breaking moments. This happens maybe 10 times throughout the film, but it didn't add anything and in fact distracted me from the story when it happened.\r\n\r\nThat said, what's great about this movie is how *truly* funny it is. I was expecting a few laughs because of the ridiculousness of the story, but the comedy here was really smart. It plays like a crime-gone-wrong Fargo-esque tale in its latter half and it works this way really well. The performances are strong especially from the always good Allison Janney (who is a huge scene stealer) and Margot Robbie. I've never seen Robbie give a performance like this before and I consider this her first big, meaty roll that allows her to use all of the acting bones in her body. She's funny, charming, brash, and you can tell she really committed herself to this role. Very impressed.", "created_at": "2017-09-15T02:04:59.826Z"}, {"movie_id": 389015, "review_id": "5a4a685ac3a36805df013826", "rating": 8.0, "review_text": "Fantastic feel-good story with an anti-establishment vibe. The movie challenges your interpretation of the events at the time, and has several sobering moments (oj news coverage, tonya spitting blood). Also funny as all get out.", "created_at": "2018-01-01T16:56:58.228Z"}, {"movie_id": 389015, "review_id": "5aa261a3c3a36829a50085e1", "rating": 6.0, "review_text": "With the Oscars only a week away and the 2018 Winter Olympics on right now, it seemed like the appropriate time to finally watch _I, Tonya_, the movie for which lead Margot Robbie has received her first \"Best Actress\" Academy Award nomination.\r\n\r\n2017 has had a lot of biopics, and a good number of those garnered awards buzz/consideration, and for all of them, I had (to varying degrees) the same complaint: They're to much about the \"what\" and not enough about the \"who\". _I, Tonya_ bucks that trend completely, and gives us a movie in which I felt I truly got to know these characters. Now how accurate those \"characters\" are to their real life counterparts is another discussion for another time, but contained within the movie itself, I was very satisfied with the insight I got in _American Ice Skater Story_.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2018-03-09T10:27:47.175Z"}, {"movie_id": 389015, "review_id": "62d2eb52c15b550071b87701", "rating": 9.0, "review_text": "_I, Tonya_ is a fun and interesting biopic. Margot Robbie is fantastic in almost every role she does, and that is no different here. I absolutely loved her as Tonya, although there were a few times her Harley Quinn voice snuck in there but it worked. Julianne Nicholson was great as Tonya's mom, she had this cold a gruel demeanor that was very sharp and funny. Sebastian Stan is excellent, the raw anger and emotion he demonstrated was captivating. For a supposed comedy biopic I did not laugh all that much, but that is 100% okay with me as the tone was light enough to have an amazing time with this film. Music choice was excellent throughout.\r\n\r\n**Score:** _90%_\r\n**Verdict:** _Excellent_", "created_at": "2022-07-16T16:46:10.558Z"}, {"movie_id": 389015, "review_id": "637ea8e885b10500c926bfcf", "rating": 7.0, "review_text": "**I, Tonya is an intriguing biopic told in a fresh, unique way that most any cinephile can appreciate.**\r\n\r\nDirector, Craig Gillespie, took a wild, unbelievable true story and told it with a brilliant frenetic, crazed energy that emphasized I, Tonya’s insane tale all the more. The documentary-style interviews further delved into the deranged psyche of its characters trusting the story to unreliable narrators forcing the audience to question every moment. I loved the hypothetical or dream sequences that exaggerated the public’s account of the life and drama of Tonya Harding. I honestly didn’t think I would enjoy this movie, but Margot Robbie’s outstanding frenzied Oscar-worthy performance and unique storytelling proved me wrong.", "created_at": "2022-11-23T23:12:40.161Z"}]