[{"movie_id": 299536, "review_id": "5adff809c3a3683daa00ad3d", "rating": null, "review_text": "\"It is a bold undertaking, to readjust what is expected of the MCU/Avengers formula, and there are moments when the sheer scale and momentum match the narrative ambition...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2018/4/25/avengers-infinity-war.html", "created_at": "2018-04-25T03:37:45.144Z"}, {"movie_id": 299536, "review_id": "5ae02e1e0e0a26156900f6da", "rating": 10.0, "review_text": "Amazing.  Visually stunning.  So much going on, but somehow also clear and easy to understand.  A little flabby in the middle third, but given the huge cast and story to cover it is very understandable.  The highlight was the parings of characters from different stories and their interactions.\r\n\r\nIf you aren't a Marvel fan this film won't convert you, but if you have liked any of the previous films you will like this too.\r\n\r\n10/10", "created_at": "2018-04-25T07:28:30.434Z"}, {"movie_id": 299536, "review_id": "5ae0a3d20e0a26156301455e", "rating": 8.0, "review_text": "Just a very short, NO SPOILERS review I wanted to get down while it's still fresh.\r\n\r\nFor a movie with this much riding it, to come out not feeling disappointed, is a **massive** achievement. While I absolutely do love it I had some things that I felt were maybe imperfect about _Infinity War_, but my biggest concern was that it seemed like it would be absolutely meaningless to somebody who didn't put in the effort of watching the 18 movies leading up to it. You can probably assuage that fear though, because I went to see it with two people who had only seen _Black Panther_ at this point, and they both loved it, with minimal confusion.\r\n\r\nPersonally? I can't wait to see it again. This is probably the most excited I've been about the second watch of an MCU film since the first _Avengers_.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2018-04-25T15:50:42.281Z"}, {"movie_id": 299536, "review_id": "5ae4205b0e0a266c71003206", "rating": 4.0, "review_text": "The third act turns on a character being an idiot. That story beat renders all that the heroes do before and after it immaterial. That moment so preoccupied me that I couldn't enjoy the rest of the story, and made it impossible to ignore the flick's other glaring flaws anymore: the villain's motive makes no sense, the glove exists only to produce plot contrivances, the score is so obvious it might as well be cue cards on screen (\"Feel sad now\") ...\r\n\r\nThe first half is some of the best action in a Disney Marvel entry yet, and the other half is so stupid that it sours the whole MCU experience.", "created_at": "2018-04-28T07:18:51.311Z"}, {"movie_id": 299536, "review_id": "5ae77ce60e0a262b9700a2df", "rating": 9.5, "review_text": "Best MCU movie, more than that.... BEST SUPERHERO MOVIE EVER. Hands Down", "created_at": "2018-04-30T20:30:30.139Z"}, {"movie_id": 299536, "review_id": "5ae85089c3a368134801a38e", "rating": null, "review_text": "Nice Movie.", "created_at": "2018-05-01T11:33:29.599Z"}, {"movie_id": 299536, "review_id": "5ae866939251410cdc016c31", "rating": 8.0, "review_text": "Massive, epic movie. I'm so happy that Marvel is stepping up their game with their villains. For too long, MCU villains have been too bland and generic. But lately, the villains have improved with Michael Keaton's Vulture, Michael B. Jordan's Killmonger, and now James Brolin's Thanos. Thanos has appeared in several other MCU films, but he seemed rather flat in those movies. Here, he's allowed to be fully developed as a character. Especially touching is his relationship with his adoptive daughter, Gamora. It's actually surprisingly tender and moving. Thanos is the actual main focus of the film, and if he failed as a character, the entire movie wouldn't have worked. So bravo, Marvel!", "created_at": "2018-05-01T13:07:31.580Z"}, {"movie_id": 299536, "review_id": "5b043a7a0e0a2623ec029554", "rating": 10.0, "review_text": "Best Movie Ever...", "created_at": "2018-05-22T15:42:50.675Z"}, {"movie_id": 299536, "review_id": "5b3a6dfcc3a36845b800feee", "rating": 6.0, "review_text": "***Moving ending, but the least of the Avengers movies IMHO***\r\n\r\nRELEASED IN 2018 and directed by Anthony & Joe Russo, \"Avengers: Infinity War\" chronicles events when the Avengers team-up with several allies to defeat the cosmic despot Thanos, whose goal is to collect all six Infinity Stones to attain unimaginable power and radically solve one of the Universe's most challenging problems.\r\n\r\nThe story focuses on Thanos, Thor and the Guardians of the Galaxy, especially Gamora, as well as Iron Man, Doctor Strange and Spider-Man. The rest of the cast members are more peripheral, e.g. Black Widow, Captain America, Black Panther, Vision and Scarlet Witch.\r\n\r\nThis is easily the least of the Avengers trilogy. Not to mention \"Captain America: Civil War\" (2016) and \"Thor: Ragnarok\" (2017) are significantly more compelling and all-around entertaining. Actually, all three Thor flicks are palpably superior, as is \"Iron Man 2\" (2010). If you haven't already, I encourage you to watch these movies prior to viewing \"Infinity War,\" as well as \"Black Panther\" (2018) and the two \"Guardians of the Galaxy\" flicks (2014/2017); otherwise you'll likely be lost because all these movies lead up to this one.\r\n\r\n\"Infinity War\" is certainly an ambitious comic book movie in that it notably juggles so many super-beings, but this lack of focus isn't conducive to suspense or great drama. It's merely decent with overkill CGI. The big battle in the closing act with the easily slaughtered four-armed dog-creatures is curiously dull; moreover, the attempts at humor sometimes feel forced and fall flat, but several jokes are laugh-out-loud funny, e.g. \"Rabbit.\" Thankfully, the film adds moving drama and gets extra points for a bold, poignant climax, which sets up the 2019 sequel \"Endgame.\"\r\n\r\nTHE MOVIE RUNS 2 hours, 29 minute and was shot in New York City, Scotland and Philippines with studio work done in Pinewood Atlanta Studios in Fayetteville, Georgia. WRITERS: Christopher Markus and Stephen McFeely.\r\n\r\nGRADE: B-", "created_at": "2018-07-02T18:25:00.691Z"}, {"movie_id": 299536, "review_id": "5b72ec050e0a267ef11b5f8c", "rating": 10.0, "review_text": "I Love this movie.", "created_at": "2018-08-14T14:49:41.668Z"}, {"movie_id": 299536, "review_id": "5b97fa459251413c68000753", "rating": 1.0, "review_text": "It's the epitome of superhero trash and the franchise of manchildren.  The ultimate smashing your toys together to battle only this time it's for the world to see.", "created_at": "2018-09-11T17:24:21.037Z"}, {"movie_id": 299536, "review_id": "5c8425420e0a26430a636548", "rating": 7.0, "review_text": "In 2012, Marvel Studios changed the cinematic landscape with a payoff that was five films in the making, proving a linked universe of movies could work.\r\nIn 2014, they proved to be one of the finest purveyors of entertainment by releasing two of the best genre films of all time back to back.\r\nIn 2018, Avengers: Infinity War is the culmination of ten years of narrative buildup. All the pieces were patiently put in place. The payoff? Never did my inner 8 year old think he would ever be watching a movie with Iron Man and Spider-Man sharing the same screen together, but here we are. Avengers: Infinity War is a very fine piece of 'turn your brain off' storytelling, except it actually goes the extra mile to have some intelligence.\r\n\r\nWe all know the film isn't the Endgame, but we're primed and ready for Part 2. Shut up and take my 💰 Marvel!", "created_at": "2019-03-09T20:42:42.240Z"}, {"movie_id": 299536, "review_id": "5e05aa094c1d9a0019dd7bca", "rating": 10.0, "review_text": "One of the best Marvel Movies!", "created_at": "2019-12-27T06:51:53.631Z"}, {"movie_id": 299536, "review_id": "5e20f463397df000149688a3", "rating": null, "review_text": "Josh Brolin portrayed Thanos really beautiful. He was an amazing villain that kept all the Avengers on their edge and made them think it was a bit hopeless to really go against him.", "created_at": "2020-01-16T23:40:19.011Z"}, {"movie_id": 299536, "review_id": "5e21db442811a10015a1eb92", "rating": null, "review_text": "This is a blast of a Marvel movie and I can't wait to see what will happen next. You are clueless and you don’t know what will happen, keeping us all on the edge of our seats. Fascinating!", "created_at": "2020-01-17T16:05:24.461Z"}, {"movie_id": 299536, "review_id": "5e24a3f25ed8e900136086cd", "rating": null, "review_text": "Here we are 10 years later with one of the most anticipated movies of all time! The CGI was much better, the story was better...everything about the Infinity War was great!", "created_at": "2020-01-19T18:46:10.876Z"}, {"movie_id": 299536, "review_id": "5e24ab72a894d600123a5194", "rating": null, "review_text": "It is unlike anything ever done in the history of cinema. This one is masterfully woven from the culmination of Marvel movies throughout the years. Truly amazing!", "created_at": "2020-01-19T19:18:10.795Z"}, {"movie_id": 299536, "review_id": "5e24b4a2a894d600123a5d05", "rating": null, "review_text": "The character development for Thanos was so good that it made me think that maybe he was right. He was the villain that surpassed all the other villains from the past Marvel movies. Trust me, this is the movie that might have changed the MCU.", "created_at": "2020-01-19T19:57:22.005Z"}, {"movie_id": 299536, "review_id": "5e24bace1dcb770012ca1ac8", "rating": null, "review_text": "GOOSEBUMPS! Infinity War is worth watching. The usual comedic banter between the casts, the awesome CGI, amazing plotline, the results did not disappoint.", "created_at": "2020-01-19T20:23:42.296Z"}, {"movie_id": 299536, "review_id": "5e24c482a894d600123a7538", "rating": null, "review_text": "Avengers: Infinity War was clearly much better than Avengers: Endgame in the sense that 1) it was better in terms of writing, 2) it is the true culmination of an entire decade of MCU films, and 3) Endgame gave me more questions than answers.", "created_at": "2020-01-19T21:05:06.945Z"}, {"movie_id": 299536, "review_id": "5e24ca861bf2660012fbb79a", "rating": null, "review_text": "Excellent film! The Russo brothers really did a great job in making this movie, an epic conclusion to the first decade of MCU.", "created_at": "2020-01-19T21:30:46.829Z"}, {"movie_id": 299536, "review_id": "5e24d052a894d600153a8bd4", "rating": null, "review_text": "This movie has clearly a much darker tone than the previous ones, but that is what makes it more special. Really cool action scenes with occasional humor made it stand out more.", "created_at": "2020-01-19T21:55:30.327Z"}, {"movie_id": 299536, "review_id": "5e259f0e21c4ca0015f897f3", "rating": null, "review_text": "Infinity War went above my expectations. I thought it would be more mediocre, but in the end, I can say that the whole movie was breathtaking and definitely lived up to its hype.", "created_at": "2020-01-20T12:37:34.972Z"}, {"movie_id": 299536, "review_id": "5e26fe2ced2ac2001539b57f", "rating": null, "review_text": "The crossover no one expected but everyone loved. Honestly, what made this movie truly spectacular and unique was the writing and the pacing which will keep you wanting more.", "created_at": "2020-01-21T13:35:40.696Z"}, {"movie_id": 299536, "review_id": "5e270e13c68b6900143dc697", "rating": null, "review_text": "Death flags everywhere. The Russo brothers did a great job of making this movie a great one.", "created_at": "2020-01-21T14:43:31.029Z"}, {"movie_id": 299536, "review_id": "5e2907a59638640019ab382a", "rating": null, "review_text": "This is a lot to take in one sitting. This movie was so jam-packed with story, dialogue, and events that calling it a movie might be an understatement.", "created_at": "2020-01-23T02:40:37.679Z"}, {"movie_id": 299536, "review_id": "5e29131d98f1f1000ff56a20", "rating": null, "review_text": "Thanos was on a mission, and it was a terrifying one. The way Josh Brolin carried the Thanos character made the movie very awesome.", "created_at": "2020-01-23T03:29:33.040Z"}, {"movie_id": 299536, "review_id": "5e31061e6743fa00111e72b2", "rating": 10.0, "review_text": "Good", "created_at": "2020-01-29T04:12:14.989Z"}, {"movie_id": 299536, "review_id": "5e31d690ac8e6b0018bf938f", "rating": 8.0, "review_text": "Awesome Movie", "created_at": "2020-01-29T19:01:36.444Z"}, {"movie_id": 299536, "review_id": "600b8a5522e480003f006ba6", "rating": 9.0, "review_text": "This is exactly the sorta thing I want from an Avengers film! Full blown, no punches pulled action. In that regard, it's an outstanding watch!\r\n\r\nDespite knowing practically little about the MCU up until a few weeks ago, I still knew this was a film that was going to see - so to speak - excrement hit the fan... and boy did it! It's a great ride.\r\n\r\nLike <em>'Captain America: Civil War'</em> did, <em>'Avengers: Infinity War'</em> does an incredible job at juggling the gargantuan number of characters. It's ridiculous, but totally awesome, how many faces we see appear again. I thought they got the screen time for all, more or less, down to a T. Not an easy job, that.\r\n\r\nSpeaking of the cast, it's Robert Downey Jr., Chris Hemsworth and Josh Brolin who stand out most in my memory. Them three are excellent, especially the latter. Away from those lot, it's very cool to see all the other worlds - including from <em>'Doctor Strange'</em> and <em>'Guardians of the Galaxy'</em> - come together into one film. As for new additions, there aren't many - Peter Dinklage being the pick.\r\n\r\nThere are many references that I had already become aware of just via the internet, so it was quite amusing seeing them all unfold here and there. The effects looked great to me, as they have basically all the way up until this point of the MCU. The comedy is good again, also.\r\n\r\nNeedless to say, I can't wait to see <em>'Avengers: Endgame'</em>!", "created_at": "2021-01-23T02:30:45.222Z"}, {"movie_id": 299536, "review_id": "63c20bc18efe7300f0a344a4", "rating": 10.0, "review_text": "I walked into this frightened that there would be too man characters and the result would be an empty vacant shell of a movie that was pulled in so many different directions it couldn't make sense of itself.\r\n\r\nYay, I was wrong.\r\n\r\nSeriously, they did a good enough job. They focused on Gomorrah, Thor, and Strange and Stark enough to make a plot despite the insane amount of characters. And the rest they used as filler, with only the Vision story coming up a bit light due to population.\r\n\r\nAnd the Vision story was a bit of a draw back. It was there but it wasn't, but at least it was there, it was important, but it seemed tertiary and a little too much so.\r\n\r\nThe Humor was also scaled back. But Spider Man did a good job, Cap had a few and laughs,and yet again, it was only Panther and the Wakandans that took themselves too seriously to be in a Marvel movie.\r\n\r\nI'm sorry, someone really needs to tell the MCU that it is fine if the Black Panther cracks a smile or a one-line once or twice. We won't mind.\r\n\r\nThe tone was more action than action/comedy...but with \"War\" in the title, you kind of expect that.\r\n\r\nHowever, they do NOT even address the elephant in the room...why did Widow go blond? Was it to have more fun or was it simply because she was on the run. The world may never know.\r\n\r\nWhat we do know is that we missed Hawkeye, even if he is on and off again retired. And we missed Ant-Man, but given how many people were here, the absences were noted but not really noticed.", "created_at": "2023-01-14T01:56:17.305Z"}, {"movie_id": 299536, "review_id": "6487d0e9e2726000e8c230ab", "rating": null, "review_text": "Nice", "created_at": "2023-06-13T02:14:01.130Z"}]