[{"movie_id": 10592, "review_id": "5b1032129251415ec80087c2", "rating": 8.0, "review_text": "Like Hogan's Heroes but serious and quasi-realistic\r\n\r\nRELEASED IN 2002 and directed by Gregory Hoblit, \"Hart's War\" is a war flick about a paper-pushing lieutenant with a background in law (Colin Farrell) who is unexpectedly captured in Belgium and taken to a POW camp in southern Germany in the closing months of the European theater of the war. He eventually befriends and defends a Tuskegee Airmen (Terrence Howard). Marcel Iures plays the humane German commandant while Bruce Willis plays the tough-as-nails American colonel of the POWs. Cole Hauser is on hand as a racist soldier. \r\n\r\nThis is obviously not a conventional WWII flick. Although it starts out with some great war action, it has more in common with films like \"Stalag 17\" (1953) and \"The Great Escape\" (1963), albeit with modern filmmaking craft. As my title blurb points out, it's reminiscent of Hogan's Heroes but without the comedy, plus elements of “A Few Good Men” (1992). The film isn't really about survival in the POW camp, but rather the tensions of the prisoners and the criminal drama.\r\n\r\nSome have complained that no fascist camp colonel in his right mind would allow such a trial as depicted in the movie. But there are several reasons why the commandant would allow it: (1.) for entertainment, (2.) to witness and understand the American way, (3.) he knew the war would be over soon and wanted to have the Allie's favor, or (4.) a mixture of the above. Keep in mind that the commandant went to school in the US after the first world war so he was enamored by American lifestyle and had a fondness for jazz. I'm sure entertainment was a huge factor since POW camp life is just as boring for the captors as it is for the captives over time.\r\n\r\nThe climax telegraphs that this is a war MOVIE and not real life, but it's packed with action and gripping drama. It’s also ultimately quite moving. Although it failed at the box office, \"Hart's War\" is a very good WWII POW camp movie and, in some ways, great.\r\n\r\nTHE FILM RUNS 125 minutes and was shot in the Czech Republic.\r\n\r\nGRADE: B+/A-", "created_at": "2018-05-31T17:34:10.923Z"}]