[{"movie_id": 286565, "review_id": "57c8b58c92514148de000b8d", "rating": 8.0, "review_text": "> You can't hold back forever your crush on someone.\r\n\r\nI don't know why it is underrated, probably that's a mistake. Because this is not your usual teen movie, but a different perspective tale and told in a quite exciting way. It was from the director of 'Robot & Frank', it is only his second film and he's now in my watch-out filmmakers list. Both the films were different genre and topic, and I totally loved them. This film was adapted from the book of the same name who wrote 'The Fault in Our Stars'. The film talks about a childhood crush and how long does it takes one to get courage to open his heart.\r\n\r\nQ short for Quentin, when he first time saw the girl named Margo, he has instantly fallen in love with her. But having differences over how to enjoy the life, they had drifted away. Until when the actual story begins in the final year of their high school. So Q finds some clues when Margo disappeared like usual, but this time he considers it seriously and goes after her to reveal his love. What follows is a road adventure and a mini twist in the tale.\r\n\r\nGreat cast, but I think it is the Nat Wolff's best performance as the lead. The supporting roles were not here to just support, but participated beyond the usual. Cara Delevingne was not bad either, but her part was like in and out frequently. So overall it had best set of characters with uniqueness from one another. Which means don't expect a silly teen comedy, it was awesomely designed to impact all generations. So the entertainment is guaranteed.\r\n\r\nIt is not just a romance between two, that is what I was surprised. The narration points out a one love story, but in the end you would end up watching a multiple romances. Something very refreshing and all the lines were very matured, which kind of feels like the real world stuff. I really liked the conclusion, proves why one should watch it. Whatever the others say, I definitely recommend it. A sweeter and a heartwarming teen film.\r\n\r\n8/10", "created_at": "2016-09-01T23:11:08.714Z"}]