[{"movie_id": 55465, "review_id": "5f8c94343927120038294220", "rating": 5.0, "review_text": "Decent watch, probably won't watch again, and can't recommend unless you're just dying for more Harold and Kumar.\r\n\r\nThe movie feels very forced.  A buddy adventure, like the first two movies made sense, but a \"reconnection through adversity\" trope feels tired and it seems to take a lot, to include new buddy teams and cross competition just to get them to a point where their buddy adventure high jinks can start and we get some nostalgia for the previous movies.\r\n\r\nThe Neil Patrick Harris bit feels super problematic, though it is HIM doing it so I guess it is okay.\r\n\r\nIt's a \"Harold and Kumar\" adventure in a movie about moving away from \"Harold and Kumar adventures\" towards something  about responsibilities and putting family first.", "created_at": "2020-10-18T19:15:00.843Z"}, {"movie_id": 55465, "review_id": "64796dac17497300fb39e702", "rating": 2.0, "review_text": "**It has quality, it has several interesting points to observe, but it has a stupid humor that is completely lost by the message it conveys about drugs and sex.**\r\n\r\nI saw this movie on television by mere chance, just now, and I confess that I didn't like it. It is in fact a light film, it has some good scenes and moments, it even has several quality points as I will discriminate, but if we think about it, its style of humor, based almost entirely on jokes about sex, use of all kinds of drugs and such, spoils everything. I know there are people who like these easy laugh comedies, but I'm far from being one of them.\r\n\r\nKal Penn and John Cho give life to the main characters, who they already know very well because it is the third film in this franchise (which I haven't seen and, after this, I won't see it). The film also introduces us to Danny Trejo, Paula Garcés, Richard Riehle and Danneel Ackles, to name just a few supporting actors in this film. The actors are doing what they can with the material at hand, I think that's one of the redeeming values of this film, but there's not much they can do when the material is intentionally bad and still makes money.\r\n\r\nOn a technical level, what I liked the most were the stop-motion animations that appear in a given situation in which the protagonists are stoned. It was a quality asset, and using it was creative and original, even though the film isn't worth our time and money. The settings are also good, especially Cho's house, overloaded with decorations and Christmas lights to the point of being cheesy, thus evidencing the lack of taste of its owner, a drug addict of Korean descent who simply gets rich. The soundtrack also deserves a positive note, if only for its work with the classic songs of the season.\r\n\r\nAs you can see, the film had the potential to be very interesting and was only lost by its lewd humor, the vile, absolutely despicable jokes, and the film's total obsession with sex and drugs. What was the target audience for this crap? Drug addicts and sex maniacs? A bunch of teenagers without any brains to think? Let's be honest: on the one hand, the film conveys the idea that Harold and Kumar (the junkies on duty, that is, the main characters) are totally irresponsible, immature and unworthy of being considered for a serious matter. This is a positive message because indeed drug users and sex addicts are despicable, irresponsible, unworthy of being considered mature or trustworthy. And I emphasize: marijuana, whatever the name you want to give it, is a drug and its consumption is addictive and leads to crime and death. It's an addiction like any other. However, on the other hand, and despite the fact that the film gives us this positive message, it also makes an apology for consumption! What do we see? People who have fun and laugh when they're high, even if they do stupid things! But drugs are like alcohol and all other addictions: at that moment it seems like a good idea, but in exchange for these moments, we sell our soul.", "created_at": "2023-06-02T04:18:52.215Z"}]