[{"movie_id": 780609, "review_id": "6289895e134d580067c534d5", "rating": 9.0, "review_text": "People will hate _Men_ if they go into it wanting a straightforward story or a film that has one, clear cut meaning once those end credits crawl across the screen. _Men_ doesn’t offer either of those things. The film features stunning cinematography, a mesmerizing forest sequence, and a thrilling score that is as unsettling as it is operatic. Rory Kinnear is exquisitely chilling. This is the type of horror film that is purely, disgustingly, and gloriously nasty and ambiguous. _Men_ is simultaneously a film you shouldn’t think too much about and yet absolutely think about all the time once it’s over.\r\n\r\n**Full review:** https://hubpages.com/entertainment/Men-2022-Review-A-Bizarre-Graphic-and-Unforgettable-Folk-Horror-Film", "created_at": "2022-05-22T00:52:46.441Z"}, {"movie_id": 780609, "review_id": "629b34b565e0a237015df243", "rating": 6.0, "review_text": "\"Harper\" (Jessie Buckley) heads off to rural Gloucestershire in England to take a break after the apparent suicide of her husband \"James\" (Paapa Essiedu). On arrival at the manor house she has rented for a fortnight, she is welcomed by the typical country squire type in \"Geoffrey\" (Rory Kinnear). She goes for a walk, during which she notices that she is being followed - and the man following her is naked. Spooked, she returns to her home to find that this is just the start of some seriously bizarre goings on in this tiny hamlet. What flaws this all from the start for me is that we see everyone in this community - the policeman, vicar, schoolboy, pub landlord as variations of the same man - Kinnear, yet the \"Harper\" character does not seem to clock this; she certainly doesn't acknowledge it, and that just doesn't work for me. If I were in a village where everyone looked the same, I'd have been out of there in a shot. Anyway, she lingers on for a while as things become more perilous and she is clearly the focus of the malevolent intentions of this creature - and it all builds to quite a clever feat of special effects and not a great deal else. There is a largely undeveloped underlying plot line about her on-the-rocks marriage that may have had some bearing on the conclusion, but to be honest I was rather bored by the repetition of it all by then. The exterior photography is nice enough and Buckley is competent, but Kinnear's roles are all about the skills of the make up artists. The dialogue is nothing special leaving the score to work hard to try to create a sense of peril that, in the end, I felt was just ... lacking. It's no worse than many of the recent Blumhouse efforts, but that doesn't make it very good, either.", "created_at": "2022-06-04T10:32:21.367Z"}, {"movie_id": 780609, "review_id": "62f6c3adf9183a0091b7723f", "rating": 5.0, "review_text": "MORE SPOILER-FREE REVIEWS @ https://www.msbreviews.com/\r\n\r\n\"Men is undoubtedly one of the most unique, macabre, weird, expectedly divisive films of the year.\r\n\r\nRob Hardy's cinematography is truly impressive, navigating viewers through eye-popping visual details with the help of mesmerizing makeup and VFX. The score by Ben Salisbury and Geoff Barrow is also quite atmospheric and haunting.\r\n\r\nNevertheless, Alex Garland exhaustively repeats his obvious, heavy-handed message to the point of losing all emotional connection with the underdeveloped protagonist. The last act focuses too much on excessive, unpleasant gore to prove a point over and over again unnecessarily, functioning as a distracting, underwhelming conclusion.\r\n\r\nJessie Buckley - extraordinary - deserves much better, as does the versatile Rory Kinnear, who plays multiple roles.\"\r\n\r\nRating: C", "created_at": "2022-08-12T21:18:37.947Z"}, {"movie_id": 780609, "review_id": "64623477ef8b3200e3ae1b08", "rating": 4.0, "review_text": "Men, directed by Alex Garland, is a movie that fails to live up to its potential despite having some redeeming qualities.\r\n\r\nThe cinematography is fantastic and haunting, with creative shots that add to the overall experience. But this quality dips towards the end, with the director focusing more on horror elements in the tune of slasher/home invasion instead of psychological. The sound design is excellent, and the sinister feel really adds to the movie's overall mood. The acting is good, but nothing too spectacular. No performances really blew me away. However, the body horror in the movie is fantastic, and it had the hair on the back of my neck standing up. Even though I do think it is not entirely needed, I have to give props in that department.\r\n\r\nUnfortunately, the script is pretty dreadful. The message is very in your face, overly complex and did not work for me. It was quite a turn off too, as it seemed as though the director was trying to say all men were the same and were terrible human beings. I know it had deeper meaning than that, but that surface level message is undeniable. I mean honestly, every person she encounters is such a massive piece of shit, not one person would have held out a helping hand? \r\n\r\nSomething that did really bother me was that the movie starts off as a creative psychological horror, but takes a spin in the third act that divulges into body horror mixed with slasher elements, which really takes away from the intriguing first 45 minutes of the film. Combine that with dreadful pacing, which will result in the audience feeling like they're waiting for the movie to be over. \r\n\r\nOverall, Men is a forgettable movie that had potential, but unfortunately, failed to deliver in many aspects.\r\n\r\nScore: 40%\r\nVerdict: Poor", "created_at": "2023-05-15T13:32:39.807Z"}]