[{"movie_id": 6973, "review_id": "54a1f7c69251411860000270", "rating": 8.5, "review_text": "A soldier disappears after he has come back from Iraq. His father, Hank Deerfield (Tommy Lee Jones), is alerted and sets off in the hopes of finding his son. He soon finds out that his son was actually killed, brutally you might say, his body cut up and burned. The evidence lead in no real directions, but it soon becomes apparent that his army bodies are lying, also, the images that Hank recovers from his son's phone, seem to suggest that something happened in Iraq.\r\n\r\nTo say anything more would be to ruin the movie. However, this movie is not just a crime story, where we follow the father and cop (Charlize Theron) as they get to the bottom of the mystery. This is a story about war, the people in it and at hoome, as well as bravery and sorrow. It is told carefully, and with skillfully precision by the entire cast, and Paul Haggis.\r\n\r\nBy the end, we don't even really care about the murder being solved, just that the father finally made peace with his son. He understands better than anyone what war does to a man, you can see that clearly in his eyes  throughout the movie.\r\n\r\nOnly one thing bothered me about this movie, and it is actually something that bothers me quite often. Music. I don't mind music in movies, I don't even mind music that enhances a certain emotion, sorrow, happiness etc. No, what bothers me is that moviemakers feel that they need music so badly, when really, they don't. More often than not, the images and actors speak the words clearly, we don't need the sad tones to emphasize what we are already feeling. It's not that bad in this movie, but I did notice it a few times, where it bothered me.\r\n\r\n_Last words... don't watch this movie and feel like you need to \"figure it out\". It's not about that at all, just allow yourself to be swept away be the amazing cast and let the story onfold itself in front of you. This is not a story about a crime, but a story about a father... and a son._", "created_at": "2014-12-30T00:54:30.448Z"}]