[{"movie_id": 257088, "review_id": "57028953c3a36856a50032c5", "rating": 6.0, "review_text": "> Most deserved remake, but relying on CGI for everything ruined it.\r\n\r\nThis movie is only about stunts, the story wise, it's a great disappointment. I have seen the old version, for a 90s movie, the actions were fantastic with an awesome story. In this remake I don't know where's the story, the characters were underdeveloped and it rushed towards the end with plenty of high octane action sequences everywhere. This formula won't work all the time like '300' and 'Fury Road', but it's really good for watching in digital 3D.\r\n\r\nThe story was kind of sameness, but slightly altered, especially about that 8 ordeal and stunts were obviously freshly designed. The graphic works were weak in some parts, it failed to give a natured effect. Yeah, I think CGI is the issue, the movie relied on it for everything.\r\n\r\nThe cast performances were fine, but a big star in the lead might have given a different result. It's entertaining, but that was not enough these days, especially for a cop movie we expect details, not just physical tricks. IMO its a one time watch movie, or better try the original.\r\n\r\n6/10", "created_at": "2016-04-04T15:33:39.664Z"}, {"movie_id": 257088, "review_id": "57e080249251410455000bb9", "rating": 6.0, "review_text": "I went into watching this expecting the worst, but it wasn't bad. (In comparison, I gave the Bigelow original a 9/10). To its advantage was an intriguing update of the original W. Peter Iliff screenplay to incorporate a) more extreme sports; and b) more aspects indicative of the present generation, great cinematography and both Delroy Lindo and Ray Winstone--who are both 'cash money' in terms of great supporting actors.\r\n\r\nDisadvantages include awful soundtrack choices, a highly-unbelievable and lazily-written, underdeveloped script, the actors selected aren't nearly in the class of Patrick Swayze, Keanu Reeves, Gary Busey and Lori Petty...and the director's no Kathryn Bigelow.\r\n\r\nGood for a watch, out of curiosity, especially if you liked the original and are a fan of extreme sports. Otherwise, it's probably not worth your time.", "created_at": "2016-09-20T00:17:40.843Z"}]