[{"movie_id": 179111, "review_id": "5207af14760ee36305220f42", "rating": null, "review_text": "In an off-camera field somewhere in England, a battle is raging. A small, vicious part of the English Civil Wars of the mid-17th century. Stumbling out of the hedgerow into the empty neighbouring field is Whitehead (Reece Shearsmith, The League of Gentlemen). He's clearly no soldier and he's no heart for the horrors of war. He's joined on this quieter side of the hedges by Jacob, Cutler and - when he awakes from his death-like concussion - Friend. It transpires at least one side in this skirmish was on a specific mission: to hunt down the villainous O'Neill (Michael Smiley, Kill List), an alchemist's servant who has stolen his master's valuable documents and writings so's he can practice the dark arts for himself. Whitehead is another servant to the alchemist, sent to sniff out O'Neill. Still, sod that. It's all gotten a bit, well, bloody for these fellows, and besides, Cutler knows of a lovely alehouse, just yonder past this field. So they're not deserting you understand, they're just... well, going for a quick beer. No harm done, eh? Anyway, they haven't eaten in awhile, so Cutler's just going to make them a stew from the mushrooms that grow in a huge circle in this field. And what's that in the middle of the field, tied to a huge length of rope? They pull on the rope; it takes all four of them to pull the object over to them, and as it transpires, it's a man. It's O'Neill, the man Whitehead was charged with finding. Why was he so heavy? There have been tales of course that time moves differently for people inside the mushroom circles that grow in fields in England, thus altering their density. In fact, a lot of weird sh*t happens around these mushroom fields. And that mushroom stew Cutler made is making our guys feel really, um, strange. And they haven't caught O'Neill, he seems to have caught them. And Cutler seems to know O'Neill. And who's idea was it to go look for a pub? How much further IS this pub, anyway? It's almost as though they've been set up... oh...\r\n\r\nA lot of what may or may not be happening in A Field in England - the latest from Ben Wheatley (Kill List, Sightseers), working from a script by his partner Amy Jump (who also co-wrote Kill List with Wheatley) - past the half-hour mark is depicted in strange ways indeed, that we may share in our compadres' hallucinogenic nightmare. Slow-mo? Check. Terrifying Aphex Twin-style rictus grins? Check. Renaissance penis diseases? Check. Everybody periodically freezing for a wood carving tableau? Check. Ten minutes of fit-inducing stroboscopic imaging, set to droning Lynchian industrial soundscapes? Oh, you better BELIEVE there's a check right there.\r\n\r\nProblems? A few, IMO. The off-kilter sojourns into psychedelia will polarize the viewers of A Field in England. We get it, it's the mushies. So when these episodes seem to go on and on (and ON), it begins to feel self-indulgent. As though somehow, weird for weird's sake equals high art, or something. It can become a litttle arduous and even makes the movie feel overlong at times; not good for a film which clocks in at a brisk 91 minutes. The film is in black & white, which works, but it's also in crisp deep-focus digital video, which gives it an amateurish sheen. It feels more like men playing dress-up than genuine period. The vaguely humourous bent of Reece Shearsmith and of Richard Glover (Friend) is welcome but, juxtaposed against the tiny cast and the zero-budget \"one-field\" location, it feels like an episode of The Comic Strip Presents.... And not one of the early classics, either. This is no A Fistful of Travellers' Cheques or Gino: Full Story and Pics. No, this feels more akin to Les Dogs or Spaghetti Hoops. With more knob-rot (this film was made for £300,000. Peanuts, relatively. But seriously, where has that money gone? I can't see it on the screen. Five mates, some fancy dress and an iPhone to record it on. Job done!).\r\n\r\nI've seen enough of Wheatley's output now to know that I like him, or rather, that I want to like him, but... hm. Something's not quite right, I fear. He struggles to get across fully what he wants to say, and then he appears to justify any lapses in narrative logic after the event. Kill List was brilliant but maddeningly incomplete. Subsequent interviews seemed to indicate to me that rather than being purposely enigmatic, he'd just lost more exposition than he really should have in the edit. In an interview on the DVD for A Field in England, he muses that AFiE serves as a sort-of unofficial prequel to Kill List, an origin story to the cult operating in that (superior) movie. But it appears to me as though that thought only really occurs to him as he's speaking.\r\n\r\nAll that said, it warrants at least a look. I doubt many are going to fall in love with A Field in England, whilst many ARE going to hate it. For much of its runtime, either nothing much is happening, or crazy weirdness is happening. But on those occasions when something IS happening, it definitely holds the interest. And the tiny cast is excellent; Michael Smiley, Reece Shearsmith and Richard Glover in particular. I'm going to rate A Field in England 6/10, which may rise to a 7 upon another viewing. . That I actually want to give it another viewing says something in and of itself, I think.", "created_at": "2013-08-11T15:34:44.692Z"}]