[{"movie_id": 61891, "review_id": "52516f37760ee37fe9073f80", "rating": 8.0, "review_text": "Good entertaining fictional historic movie. Just don't try to chew on whether the history is true or not but enjoy the plot.", "created_at": "2013-10-06T14:09:59.604Z"}, {"movie_id": 61891, "review_id": "63ed79e2699fb700cee1e1eb", "rating": 7.0, "review_text": "**A film that would be much better with less sudden flashbacks, fewer anachronisms and a more careful explanation of the theory it comes to present.**\r\n\r\nI've already written a lot here, and I've said it a few times, but it's worth saying again that, although I'm a historian and I like Shakespeare's work, I'm not a native English speaker (I'm Portuguese and I speak the language of my country) nor am I an intensive or specialized connoisseur of the playwright's life and work. Therefore, I certainly won't offend anyone if I say that, until I saw this film and documented myself a little to write about it, I didn't know that there were controversies surrounding the identity of Shakespeare. It is perfectly normal that there are doubts about the authorship of some of the works of an ancient author, there are many examples. Less normal is that there are doubts surrounding the totality of his work.\r\n\r\nThe film advocates the following theory: the real Shakespeare neither wrote a line nor knew how to write. Who really wrote the works, dramatic and poetic, to which he lent his name was someone who, for social and political reasons, could not do so: the Earl of Oxford, a nobleman and courtier. I'm not going to question whether this is true or false, there are people better qualified to talk about it. What I can say is that I wasn't convinced. If Oxford, for some reason, could not exhibit his literary work, how did he acquire fame as a playwright and poet? It does not make sense. Furthermore, for me, until this moment, Shakespeare was an author who did not deserve discussion. Trying to turn him into someone else's figurehead seems to me something that can only be asserted with overwhelming evidence, and not only do we not have that evidence, but the amount of historical inaccuracies and anachronistic errors that the film carries as well do not make us comfortable about the theory it presents.\r\n\r\nHowever, the most complicated thing about this film are not the anachronisms or the far-fetched theory that it brings us, but the flashbacks and flash forwards that occur almost without warning and make it very difficult to follow the story. I also didn't like the way the film assumes from the outset that the audience is familiar with Shakespeare's life and the Tudor period. I happen to know, but people don't have to read an English history textbook before seeing a movie. When I saw Roland Emmerich's name in the director's seat, I also feared the worst. I feared that we had something brutally destroyed or that we were witnessing some kind of disaster. Luckily, or maybe not, we only have to mourn the loss of the Globe Theatre, completely consumed by a fire. Anyone who thought he was going to be able to make a film without destroying something didn't know him.\r\n\r\nThe film has excellent actors, and most of them do an impeccable job. I particularly liked Rhys Ifans and Sebastian Armesto, but Rafe Spall, David Thewlis and Joeli Richardson were also excellent in their roles. Vanessa Redgrave also does a well done job, but she had already played this role before, in another film, if I'm not mistaken. On a technical level, the film relies heavily on high-quality, well-crafted CGI, and on a selection of filming locations made with great care and discretion. On all levels, the film appears to be a major production, with some effort and investment.", "created_at": "2023-02-16T00:33:38.107Z"}]