[{"movie_id": 522016, "review_id": "61e6b78fc613ce001cf51e2f", "rating": 6.0, "review_text": "The cast do great, just a shame the rest of <em>'The 355'</em> isn't up to their level.\r\n\r\nJessica Chastain, Diane Kruger, Lupita Nyong'o, Penélope Cruz and Fan Bingbing all produce, all of them give enjoyable performances and never became uninteresting, irritating or whatever to me. They are the film's major plus. I'm struggling for other positives, cinematography at a push?\r\n\r\nUnfortunately, I came away from watching feeling underwhelmed. The second half really drags, not helped by an extremely lame 'twist'. The first half isn't perfect but does hold potential, once the main bunch eventually team up it's more interesting. The editing is a little iffy, too.\r\n\r\nThere are quite a few talky scenes that aren't worthwhile at all, especially early on with Chastain and Sebastian Stan. Things improve when the action sequences get underway, not that they are anything extraordinary but what we see is satisfactory; it's the bits in between that let this 2022 release down.\r\n\r\n6/10, despite the well performing cast; who almost made me give this 7/10.", "created_at": "2022-01-18T12:50:23.012Z"}, {"movie_id": 522016, "review_id": "6212c4898138310042d39975", "rating": 5.0, "review_text": "Pretty lifeless global action-thriller where it seemed co-writer and director Simon Kinberg was attempting to emulate the Bourne franchise (the cinematography and score especially reminded me of that series). \r\n\r\nThe story is thin, predictable and really sounded familiar but can't put my finger on what (thinking Casino Royale with the short selling of stocks at least), but a thin story is fine (a few of the Mission Impossible movies didn't have the strongest plots or villains), if only the main cast had any chemistry which I didn't feel they did, despite a few of them being solid actresses.\r\n\r\nThis yet another film that filmmakers thought would be a potential franchise as it's left open ended for a sequel. I guess there was potential and maybe under a better director would've been at least an entertaining flick, but in the end I found it to be forgettable. **2.25/5**", "created_at": "2022-02-20T22:45:29.831Z"}, {"movie_id": 522016, "review_id": "624479e36dc5070093194ec1", "rating": 5.0, "review_text": "MORE REVIEWS @ https://www.msbreviews.com/\r\n\r\n\"The 355 holds excellent performances from all people involved - especially Jessica Chastain (It: Chapter Two) and Lupita Nyong'o (Us). However, the generic screenplay, poor dialogues, and barely developed characters turn a film with much potential into another disappointment from Simon Kinberg (The New Mutants).\r\n\r\nThe action sequences actually include interesting choreography, but the use of quick cuts and shaky cam doesn't always work favorably. The narrative is loaded with the usual formulas of the respective genre, and some attempts to approach the theme of feminism efficiently fall flat.\r\n\r\nPersonally, it's saved by the fact that it was primarily filmed in real locations, helping with the entertainment levels.\"\r\n\r\nRating: C", "created_at": "2022-03-30T15:40:19.625Z"}, {"movie_id": 522016, "review_id": "625345eeb6c2644e86c5a932", "rating": null, "review_text": "An all women movie, I might just love it. Specially when I think Chastain and Kruger are people I just love watching .. usually.\r\n\r\nSome action, some tension, yeah !! But it's so fake, you'd think it's a Chinese production : globalization is so good to us.\r\n\r\nNow, when you add a hint of a progressive agenda, it just becomes so much better .. At least it brings some kind of a content. Yeah, content here is mostly replaced by contempt.\r\n\r\nThese women are charismatic and attractive (except BingBing who's just a pain for my sorry eyes and ears) and need to stick together .. how intriguing (stick what ? not sure yet). If only we could believe these characters more then 10 minutes.\r\n\r\nNow if you withdraw the story, it's all fine, everybody else did a good job.\r\n\r\nAn action movie written by a lazy teenager helped by his assertive mum, how come anyone followed ?", "created_at": "2022-04-10T21:02:38.134Z"}, {"movie_id": 522016, "review_id": "62dc0637e9da69042db494a9", "rating": 8.0, "review_text": "It will be more exciting if Penélope Cruz show some spy's skill.", "created_at": "2022-07-23T14:31:19.054Z"}, {"movie_id": 522016, "review_id": "637ea8b46e938a00871642b6", "rating": 6.0, "review_text": "**While The 355 might not have been a stand-out blockbuster of a film, it still was enjoyable.**\r\n\r\nThe 355 hit almost every line of dialogue and every typical character type you have seen in a spy movie but still found a way to entertain its audience, even if it was only slightly entertaining. The cast was stellar, and the performances were solid. Unfortunately, the 355 stumbles with a stale, unimaginative script that is incredibly predictable and keeps the peril and danger from feeling very perilous or dangerous. I didn’t finish the movie feeling I had wasted my time, but I couldn’t say I would recommend it. Jessica Chastain, Lupita Nyong’o, and the rest of the cast seemed to have fun working on this project together, and their chemistry was entertaining. Still, the trite dialogue kept all of it from being great. I wish The 355 had been trusted with a bigger budget and a more experienced director. It had enough strengths that even with all its flaws, it was a decent film, but it could have easily been a great movie.", "created_at": "2022-11-23T23:11:48.896Z"}]