[{"movie_id": 42684, "review_id": "5aa21d080e0a262c71004cf4", "rating": 3.0, "review_text": "The ending could maybe have been engaging if it made sense, but even putting the best possible spin on _Skyline_, it still repeatedly commits the cardinal sin of the entertainment industry: Being boring.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2018-03-09T05:35:04.618Z"}, {"movie_id": 42684, "review_id": "5cce71f29251417be1249933", "rating": 6.0, "review_text": "***Aliens attack Earth and seek to SUCK YOUR BRAINS OUT***\r\n\r\nA couple (Eric Balfour & Scottie Thompson) visits some friends in Los Angeles when aliens attack the city and they hold up in a posh apartment complex. The other protagonists are played by Brittany Daniel, Donald Faison, Crystal Reed and David Zayas.\r\n\r\n\"Skyline\" (2010) combines elements of other Alien invasion flicks like “Independence Day” (1996), “Battle: Los Angeles” (2011), “Cloverfield” (2008) and “War of the Worlds” (1953/2005) with an ending reminiscent of the same in “Night Skies” (2007). The people-snatching aspect recalls “The Forgotten” (2004).   \r\n\r\nThe director brothers are visual effects designers who were working on the blockbuster “Battle: Los Angeles” while making this indie, which only cost about $10 million. Sony Pictures sued, but the case was later dropped. It must’ve scared the directors because they haven’t returned to directing since (as of this writing) even though “Skyline” made $21 million domestically and $78 million worldwide, which led to the sequel “Beyond Skyline” (2017) by other filmmakers.\r\n\r\nBeing made by effects experts, it’s not surprising that the F/X in “Skyline” are top-of-the-line. Some of the aliens or crafts look like they were modeled after sea creatures, like octopi and jelly fish. There are also probing tentacles, as seen in “War of the Worlds.” Meanwhile the main vessels and some of the aliens are similar to those in “Independence Day.”\r\n\r\nUnfortunately, there’s not enough human interest and the story is too one-dimensional to be overly gripping, for me anyway. Still, this is a grave, tense account of what a malevolent alien invasion might be like. It lacks the lighter side of “Independence Day” and other eye-rolling aspects (e.g. the pro-American angle), but “ID” had more human interest and a plot with a much larger scope. This one amounts to: Aliens attack earth and snatch victims, the end. Yet it’s well done for what it is. \r\n\r\nThe film runs 1 hour, 32 minutes and was shot in Los Angeles with shots of New York City, London and Hong Kong at the end.\r\n\r\nGRADE: B-", "created_at": "2019-05-05T05:17:38.508Z"}, {"movie_id": 42684, "review_id": "649e59c9c072a2014faf76f9", "rating": 8.0, "review_text": "The story does unfold slowly, but it was far from boring (in my opinion).\r\nI'm not sure why they started off with backstory and explaining why the two main characters were at the apartment block. It didn't help the story.\r\n\r\nI thought the story was well presented and from a Sci-Fi perspective was plausible.\r\nThe production values were very high with excellent special effects. The feel of the movie was very real and you felt what the characters would be feeling... so I guess this means the acting was believable.\r\n\r\nAt no time did I need to suspend my disbelief.\r\nTo me, that is the mark of a good Sci-Fi movie.", "created_at": "2023-06-30T04:27:53.554Z"}]