[{"movie_id": 49444, "review_id": "5260d96319c2954af713fa6d", "rating": 7.0, "review_text": "Threre are few sequels that are better than the original. This is one of them.\r\n\r\nSmarter, with good plot and an amazing animation. Perfect for a movie session with the family.", "created_at": "2013-10-18T06:46:59.960Z"}, {"movie_id": 49444, "review_id": "5daae954223a8b0015569fd9", "rating": 5.0, "review_text": "Admittedly, I wasn’t the biggest fan of the first “Kung Fu Panda.” Don’t get me wrong, it’s alright, but that’s all. Just alright. The jokes about him being big and clumsy get old after an hour and a half, to the point where it almost seems like a movie that’s trying to (ironically) fat shame kids.\r\n\r\n“Kung Fu Panda 2” is really more of the same. Same characters, same plot, same jokes. It’s extremely predictable with literally no surprises, giving the characters little depth. What we are presented with here is essentially a paint-by-numbers family film. If you’re okay with that, then more power to you. It’s pretty harmless brain candy, but if you’re looking for more substance or any way to challenge your kids a little, look elsewhere. Again, it’s just kind of...there. Ironically zen, in a way.", "created_at": "2019-10-19T10:45:40.262Z"}, {"movie_id": 49444, "review_id": "5e2067c6f04d0100150fc51d", "rating": 6.0, "review_text": "Kung Fu Panda 2 excitedly kicks, punches and belly flops its way through overused visual humour. “Everybody was kung fu fighting!” much more so in this sequel when compared to its predecessor. The Furious Five were slapping Shen’s army of diabolical wolves left, right and centre. Master Shifu prodding his stick conveniently during the climactic battle. And a plethora of other anthropomorphic beasts harnessing the power of said martial art. This very much felt like an animated martial arts feature, one aspect the original was sorely missing. However, despite DreamWorks’ best efforts in continuing Po’s search in becoming the Dragon Warrior, its quality offers no improvements. Unable to surpass the boundaries of family-friendly humour that reduces the visual splendour and narrative heft to progress the story onto the next level.\r\n\r\nPo, having realised who his parents truly are (not a goose...), must save China with the Furious Five from the malicious peacock Shen and his fascination with metallic weapons. DreamWorks constantly pump out family orientated animations with powerful morals every year. This sequel illustrating the ability to manipulate our past childhoods to shape the person we want to be. For Po, this meant ignoring the familial scars that Shen caused, producing his prepubescent abandonment. A notable moral that many should abide by, but unfortunately is weighed down by excessive comedy that diminished a vast amount of beautiful moments. Aside from the tantalising scene when Po finally discovered what happened to his parents, conveyed through mesmerising hand-drawn animated flashbacks, all other heartfelt examples were brutalised by Po’s apparent requirement to exercise his bumbling personality. Black’s prolific voice doesn’t help matters, with a lack of sincerity to his vocal performance, but the frantic pacing and rushed sequences made for a frustrating central narrative.\r\n\r\nThat’s not to say this sequel is poor, in fact it’s just as consistent as its predecessor. Rather infuriating is all given the tender bamboo seeds that were lovingly planted, unable to grow into ferocious stalks. The humour, as overwhelming as it is, does provide characterisation to these animals. Po in particular. Making it hugely accessible for all members of all families to watch and enjoy.\r\n\r\nThe action sequences were splendid and vibrantly colourful, with some ingenious editing that made one chase scene resemble ‘Pac-Man’. The oriental aesthetics and environments built a beautifully inclusive world for the characters to roam in. The antagonist, Shen, was far more memorable and sinister in comparison to...ummm...I forgot his name. The snow leopard? We’ll go with that. Mostly due to Oldman’s vocal work that has a larger range than the entirety of his filmography (and that’s saying something!). The red and black lighting was, at times, excessive in depicting “evil” and surprisingly dark. No, not thematically. It was literally difficult to see anything!\r\n\r\nAside from that, Kung Fu Panda 2 slaps. And punches. And kicks. But also tumbles repetitively due to Po’s constant buffoonery. It does however set the third film up nicely, so guess I’ll have to give that a go...", "created_at": "2020-01-16T13:40:22.946Z"}]