[{"movie_id": 8055, "review_id": "629dcad7a284eb0050a27f9f", "rating": 7.0, "review_text": "David Kross is really effective in this tale of a young boy (\"Michael\") who encounters \"Hanna\" (Kate Winslet) as he shelters in her doorway from a rainstorm. In fairly short order, this fifteen year old boy becomes her lover; in return she gets him to read to her. He is soon infatuated and devastated when he turns up at her apartment one day to find her gone. Skip on thirty years or so and he - now Ralph Fiennes - takes over a retrospective of her story as we discover she was tried for being a particularly nasty Nazi prison camp guard and she is sentenced to life imprisonment. Throughout her internment, the two continued to correspond - he would send her tapes to aid in her learning to read... Stephen Daldry has created a delicate masterpiece here, I think. Winslet is very much on form as the story goes from a bit of sexual fantasy for the young man, through to a far darker, more horrific, second part. There is something unnervingly natural about Winslet's performance; from the playful and generous - though temperamental - lover for this naive young boy, then the odious and distinctly unrepentant, almost belligerent, woman at her trial. Despite that, somehow, Daldry manages to elicit just a grain of sympathy for her. Was she inherently bad or just inherently weak - or both? Did she crave for affection just as much as the young \"Michael\" did when they met? His story is one of emotional barren-ness growing up in a large family where his relationship with his father was distant and chilly and the young Kross really does shine in the role. There is plenty of sex at the beginning, but it's not gratuitous; it's exploratory - for both of them and that intimacy also adds richness to what is ultimately quite a sad tale that, though thought-provoking when it comes to the whole concept of forgiveness and reconciliation, did make me realise that so many people caught up in the Nazi machine were ill-educated and frightened. It's also worth noting the subtle role played by Bruno Ganz as his legal professor \"Rohl\". This is a character who proves to be a crucial conduit for the young man as he has to come to terms with what he thought she was, and what he now knows she became. The pace of this production is measured, the photography frequently intimate and lingering and the attention to the detail from the production designer also adds potency to this visceral and touching story that I really did find well worth a watch.", "created_at": "2022-06-06T09:37:27.451Z"}, {"movie_id": 8055, "review_id": "646cddddc3514c2b0a34096c", "rating": 4.0, "review_text": "I didn't turn this movie off after the beautiful sex scenes only because two others were watching it with me. The mere fact that \"Germans\" were speaking English totally destroyed the whole \"suspend disbelief\" for me. This film is an awful rendition by Brits of an award-winning German book. Perhaps, only someone from the Nachgeborenen (to coin Bertolt Brecht's meaning of German post-Holocaust generations) should have made this film. The two stars are for Winslet and Kross. The rest sucks.", "created_at": "2023-05-23T15:38:05.531Z"}]