[{"movie_id": 259694, "review_id": "57ed863b9251414c8d0003a4", "rating": 7.0, "review_text": "**The young women's attempts to get the life they wanted.**\r\n\r\nAnother novel based film from the director of 'Love, Rosie'. About the four young women that tells how to enjoy the life by balancing the men and the parties. Very interesting cast, hot ones like Dakota Johnson, Alison Brie and even she's in her 40s Leslie Mann looked so fantastic. The narration had layers to focus on these different people and their different attempt to get the life they wanted. In that, I kind of like Leslie's, maybe the age fact and to be touched by her love tale with decency. But Dakota and Alison led it with their glamorous way and theirs each tale as well not bad, particularly depicting the present world's youngster's culture.\r\n\r\nFrom the all, the biggest surprise was the Rebel Wilson, who I never liked much as I did for in this, definitely she was at her best. The story was good, seems it was squashed with the too many contents, but awesomely managed to bring them all in one direction by linking them to the main characters. So that makes the stories of everyone take place within the circle and delivered a good entertainment, Lots of fun, even though it is a pure commercial film, there are many things from it that makes us to think seriously. Particularly thinking them from the youngster's perspective about the current world status in the entertainment segment.\r\n\r\nI don't know those who are complaining about it had they watched the same film, Because it is a fine entertainment, even though it is chick film, anybody, particularly adults can have a great time. In a thin margin, there was about men as well, how they're caught between the women they are in love and those women what they believe in. I'm being a man, I really enjoyed it despite target audience is women. I know this is not a masterpiece, but definitely not the worst film of the year or decade. In the film, everyone wanted to be in the relationship, so I did not get it, but the end clarifies decently about the title. Surely worth a watch, if you want a good entertainment.\r\n\r\n_7/10_", "created_at": "2016-09-29T21:23:07.076Z"}, {"movie_id": 259694, "review_id": "64a3c411e8d028011cf95b17", "rating": 8.0, "review_text": "Really good movie. Really funny and not your typical romance movie. Very raunchy comedy.", "created_at": "2023-07-04T07:02:41.218Z"}]