[{"movie_id": 792307, "review_id": "64f352a0caa50800e952eb4e", "rating": 9.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://fandomwire.com/poor-things-venice-film-festival-review-emma-stone-shines-in-the-best-film-of-the-year-so-far/\r\n\r\n\"Not only is Poor Things the best movie of the festival, but it's also the best of the year so far, as well as a new personal favorite of Yorgos Lanthimos' career.\r\n\r\nA brilliantly thought-provoking, insanely hilarious story packed with substance, focused on a fascinating self-discovery journey filled with thematically rich layers. Astonishing performances from the entire cast, but Emma Stone is truly impressive as an exceptionally expressive force who should win many awards.\r\n\r\nA technical masterclass across all filmmaking areas simply puts the icing on top of a near-perfect cake.\"\r\n\r\nRating: A", "created_at": "2023-09-02T15:20:00.629Z"}, {"movie_id": 792307, "review_id": "657f89d5528b2e06e73b1616", "rating": 8.0, "review_text": "When the circumstances of our lives don’t suit us, it’s time to reinvent ourselves – something that happens both literally and metaphorically in this latest offering from director Yorgos Lanthimos. But the way that result comes about here represents a truly inspired fusion of genres, including comedy, romance, social commentary and sci-fi, making for one of the most inventive, unusual and hilarious releases of recent years. This offbeat feminist fable tells the story of how a pregnant, young, anonymous suicide victim (Emma Stone) is reanimated with the aid of a brain transplant from her unborn fetus, an achievement accomplished by a colorful, controversial but well-meaning surgeon/scientist a la Dr. Frankenstein (Willem Dafoe). He nurtures his subject back to life, health and sentience, a sometimes-challenging process that finally surfaces when she discovers sexuality, the trigger for exploring a new, independent life for herself, both physically and emotionally. Through a series of adventures over the course of a trip through Europe with a free-wheeling, lusty but lecherous, self-serving lawyer (Mark Ruffalo), she finds herself as a self-actualized woman in an age where that’s more of a rarity than a standard, particularly in a world where men treat women more like property than people. While the film’s pacing could use some shoring up in the middle, this offering nevertheless entertains with uproarious laughs throughout, even when the narrative turns more thoughtful and substantive. The superb performances by Stone, Dafoe and Ruffalo are top shelf, contributing to the picture’s whopping 13 Critics Choice Award and 7 Golden Globe Award nominations. The film is also visually stunning in its cinematography and editing, as well as in its spectacular and whimsical production design, filled with images reminiscent of the movies of Wes Anderson and Terry Gilliam while sustaining a look all its own. Admittedly, this release features a good deal of explicit sexuality, both visually and in the dialogue, so sensitive viewers should take note. However, as one of the most anticipated pictures of this year’s awards season, “Poor Things” never disappoints, serving up a solid offering that consistently tickles the funny bone while giving audiences much to think about – and there’s nothing poor in any of that.", "created_at": "2023-12-17T23:52:53.939Z"}, {"movie_id": 792307, "review_id": "65a2756785867801315b8f16", "rating": 7.0, "review_text": "It's almost as if Yorgos Lanthimos had sat down for a transcendental conversation with James Whale! Student \"Max\" (Ramy Youssef) is a student recruited by his professor \"Godwin\" (Willem Dafoe - aka \"God\") to come and help him work on his latest project. She's called \"Bella\" (Emma Stone) and it soon transpires that she is the product of some very creative surgery on the part of \"God\" - a man who has, himself, had one or two experiences under the knife at the hands of his scientist father! You see, a pregnant woman took her own life by jumping from a bridge, but was luckily fished out of the water before her baby died. The surgeon managed to deliver the baby then replace the dead brain of the adult with the one from the nascent infant! Needless to say, \"Bella\" is on an actively steep learning curve and is quite capable of throwing the odd tantrum to get what she wants - and that is, initially, to go out and explore. Gradually more empowered, and a little more mature, she discovers the delights of the orgasm - and after that there's no stopping her. \"God\" tries to control her by suggesting a marriage to \"Max\" but he insists on such a fastidious contract that \"Duncan\" (Mark Ruffalo) concludes she must be worth investigating. He meets her and offers her her dreams, she convinces \"God\" to let her go with him and soon she is embarked on a trip around Europe enjoying the frequent delights of \"furious jumping\"! The always learning woman soon tires of her beau, and realises that she can have loads of fun and earn at the same time - before \"God\" falls ill and she must return home to not just that life, but surprisingly to the one she thought she had left behind on the bridge. This film is genuinely laugh-out-loud at times, and the performance from Emma Stone has to be her best. She plays the almost porcelain-like and childish \"Bella\" when we meet her expertly, and that skill prevails as her character evolves into a savvy, street-smart and capable woman who quickly learns to fight fire with fire. Ruffalo is also on super form as her travelling companion and Kathryn Hunter also turns in a solid performance as her Parisian paymaster \"Swiney\". The narrative takes us on a fantastic tour of European cities, but also on a wonderfully evocative tour of humanity - warts and all. \"Bella\" has a practical and analytical mind that at times seems ludicrously detached, then somehow she ends up having got it right all along. It might look a bit long at just shy of 2½ hours but it really flies by and I couldn't help but feel sorry for the poor billy goat at the end of this creatively interpreted and very well adapted story of what were originally supposed to be Glaswegian hotspots!", "created_at": "2024-01-13T11:35:03.397Z"}]