[{"movie_id": 117251, "review_id": "5ae345770e0a262a55044457", "rating": 4.0, "review_text": "I have to say, or in this case write, that this was a fairly disappointing movie. It is pretty much a Die Hard wannabee with a daughter-dislikes-father sub-plot. I do not mind the reusing of the Die Hard concept if the film is good. This one is not really. The script is a stupid, unintelligent political script.\n\nIt starts off badly with some nonsensical crap about a controversial (that is putting it mildly) political deal with the Middle East about pulling out troops from all the bases in the Middle East. To add to this the entire situation have come about because the president just left several people to hang out and dry when he decided to pull the plug on operations in the Middle East. By hanging out and dry we mean get killed or spend some quality time in the regional prisons. That put the president on the bad guy list instead of the good guy as far as I am concerned. I do not know if the writer was trying to make a political statement, which I never like in my movies, or is just plain stupid. Given the rest of the script I would go for stupid or both.\n\nThe good thing with the movie is that there is quite a lot of action and some of it is rather okay to watch. There are a few funny moments as well. I quite liked the tour guide for example.\n\nUnfortunately, even if you try to forget about the political nonsense, the rest of the script is just full of utter stupidity. It starts of not too bad with the diversion at the Capitol and the initial take over of the White House even though a whole bunch of armed, obviously unscreened, guys getting into the White House to work on the president’s home theatre like that is not very believable.\n\nAfter that it gradually degrades though. Cale is nowhere as charismatic, nor as professional, as McClane and there are lots of silly and stupid moments. For example, the car chase starts of not too bad but then Cale get’s into some bloody dream mode and gets shot up. Just dumb. During the same episode the tank scene is just ridiculous. Would they only have one tank? Not very likely. It takes forever for it to move. It is also highly improbable that it could be taken out like that by a hand-held launcher by a front hit. Rear or side maybe but not a front hit. The writer is obviously clueless about military matters. The fumbled chopper attack is embarrassingly bad. The worst is probably when Cale’s daughter stops and air-strike by waving a flag outside the White House. I almost turned off the movie at that point.\n\nIt is too bad because the movie had the budget and some nice actors to be a good action movie but was just ruined by a louse script with a totally unnecessary bunch of political nonsense in it. The next time I see a movie were the script is written by James Vanderbilt I am going to be very cautious.", "created_at": "2018-04-27T15:44:55.710Z"}]