[{"movie_id": 141052, "review_id": "5a0c5d3e9251414d94012bfd", "rating": null, "review_text": "The long anticipated “Justice League” has finally arrived finally combining the biggest stars of the DC universe into one film. The proposed film has faced many obstacles on the way to the big screen ranging from script issues, massive reshoots and a change of Director for said reshoots due to a family tragedy that Director Zack Snyder suffered.\r\n\r\nThe film follows Batman (Ben Affleck) and Wonder Woman (Gal Godot), as they look to assemble a team of other gifted individuals to help fight off a pending invasion.  \r\n\r\nThe death of Superman has left a void on the Earth, and this has paved the way for an ancient evil to return as he attempts to conquer the planet after he collects the three needed artifacts that his plan requires.\r\n\r\nIn a race against time, Batman and Wonder Woman recruit Aquaman (Jason Momoa), The Flash (Ezra Miller), and Cyborg (Ray Fisher), to battle to save the planet. Naturally they battle amongst themselves as well as their massing enemies but ultimately decide on a dangerous plan that can tip the odds in their favor and save the day.\r\n\r\nThe action in the film is good but it often plays out like a video game. With so many blatantly obvious CGI backgrounds, the movie looked like a video game. There were numerous scenes that looked like they were lifted from Injustice and Injustice 2 that I mused to myself that someone must have used their Power Up for the shot.\r\n\r\nAffleck and Gadot are good and work well with one another, but there are some serious casting issues with the film. The biggest for me was Ezra Miller as The Flash. I did not like his effeminate, nerdy, socially awkward, and neurotic and at times cowardly take on the character. This is not the Barry Allen I grew up reading in comics or the one that has been portrayed twice in a much better fashion on television. His comic relief status grew old fast and his character really offered little to the film.\r\n\r\nIt has been well-documented that Joss Whedon not only handled the rewrites for the film but took over directing duties to complete the film. You can see elements of his humor scattered throughout and the film does move along at a steady pace without dragging.\r\n\r\nThe biggest issue is that so many of the characters are just stiff and one-dimensional. They really are not overly interesting so it is hard to really connect with them and the tasks they are facing. Unlike Marvel who have excelled with dysfunctional groups who fight amongst themselves as well as the forces of evil, this group seems to be going through the paces rather than being fully engaged with the task at hand and each other.\r\n\r\nIn the end “Justice League” is better than I expected, and the two bonus scenes in the credits show some interesting potential down the road.  As it is, it is flawed entertainment that requires audiences to overlook a lot of issues.\r\n\r\n3 stars out of 5", "created_at": "2017-11-15T15:29:02.613Z"}, {"movie_id": 141052, "review_id": "5a106496c3a3686286032952", "rating": 8.0, "review_text": "An enjoyable superhero team movie. It's really being unfairly trashed by the critics. It's not up to the excellence of this summer's Wonder Woman film, but it's quite fun to watch. What made this film better than some of the other previous DCEU films is that it has a sense of humor. Previous films were rightfully criticized for being too dark and humorless. Gal Gadot is the stand out as Wonder Woman. This film did a better job in its portrayal with Superman. In Man of Steel, he battled Zod, which resulted in massive human casualties, without a care, which does not fit the character at all. That made me mad as a Superman fan. Here, he shows concern for innocent civilians, flying away with an entire building of people to make sure they would not be harmed in the battle against the villain. The one weak spot is the Big Bad, Steppenwolf. He's a rather fake looking CGI creation that lacks depth. But he's only the precursor to the REAL villain--Darkseid. The two end credit scenes are entertaining. The last one teasing the formation of the Legion of Doom/ Injustice League is particularly intriguing.", "created_at": "2017-11-18T16:49:26.210Z"}, {"movie_id": 141052, "review_id": "5a18b5b30e0a264cd001f25c", "rating": 8.0, "review_text": "though thanks to bad reviews I wasn't sure about seeing this one but let me tell you my worries were put to rest very very soon this was one of the best times I have had at the movies this year the critics really missed the mark here I loved all the action and even the humor it was a good family movie as long as you have older kids due to the fact that the villans could be very frightening in spots and also this has a high level of action and it could overwhelm the youngest of kids but I still say get some snacks from the snack bar and be ready to have a super fun time at the movies with the entire family this thanksgiving weekend whether you go alone or take a group this is the movie to see", "created_at": "2017-11-25T00:13:39.632Z"}, {"movie_id": 141052, "review_id": "5a1dec030e0a264cd007017d", "rating": 3.0, "review_text": "When it was first announced that 2016 would see _Batman V Superman_ and _Suicide Squad_ movies, I said to myself \"Okay, I didn't like _Man of Steel_, but there's two very different DC entries coming up, I'll watch both of them, and if I like even one of them I'm willing to give this franchise a go.\" \r\n\r\nI didn't like either of them.\r\n\r\nMarvel had never interested me growing up. I was a Batman-kid through and through, so as hard as a decision as it was to make, I decided I wouldn't be back to watch this run of DC movies, because for me, it was three swings, three misses.\r\n\r\nEnter _Wonder Woman_ earlier this year. Though I had decided to not give this film series any more of money, I went back on my word and watched it opening weekend. Half \"one-last-hail-Mary\" and half \"I don't mind voting with my money to see more female-led superhero movies\". I loved it so much, that I was instantly back on the DC universe train.\r\n\r\nNow we have _Justice League_.\r\n\r\nI like to rank franchises according to my personal tastes. When it comes to what I refer to as the \"DCIThoughtSheWasWithU\" I dislike _Man of Steel_, _BVS_ & _Suicide Squad_ all roughly the same amount for different reasons, so it's tough to work out which comes in second place, which is third an which is fourth. But as surely as I know that _Wonder Woman_ comes first, _Justice League_ comes last.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2017-11-28T23:06:43.577Z"}, {"movie_id": 141052, "review_id": "5a5c6f4b925141323e00794e", "rating": 6.0, "review_text": "**Our childhood superheroes all together !!**\r\n\r\n\r\nYet again a new DC installment from one of the most controversial directors of Hollywood Zack Snyder, who directed Man of Steel (2013) and Dawn of Justice (2016). The large of number of nerds around the globe are waiting for this from the childhood to see their favorite iconic heroes team up for the first time in Cinematic history. The basic plot of movie revolves around some deadly external threat wanting to conquer earth like every other CBM adaptations. The movie offers the same story as we see in most of the fandoms where a group of lonesome warriors come together to save earth.\r\n\r\n“Men are still good”, deeply inspired by the Superman, Batman has again gained his faith in humanity and wants to start working for it and saving it. The Batman continuing its investigation on what Lex Luthor was planning to do in Dawn in Justice. Diana and him are uniting some new members like Victor Stone Aka Cyborg and Arthur Curry aka Aquaman and Barry Allen aka Flash in order to find their potential for good and unite against common threats when the world need it.The movie shows how people who lives alone finds it hard to adjust among new people. One of most important part of the movie is The Superman in his full character development, and showing to audience that sometimes Superhero needs other Superheroes to save them, because at the end of the day everybody loves a classic DC story where “Superman saving everyone and beating the crap out of bad guys”.\r\n\r\nThe performance of characters was good as the “material” was given to them. Batman which is played by Ben Affleck in JL was a bit out of character unlike the previous ones i.e. in Dawn Of Justice where he was The Freaking Bat ,The Worst Knightmare. He was purest personification of Frank Miller’s The Dark Knight, brutal, badass emotionless vigilante who everyone fears but in JL he was watered down too low and Yeah the guy smiles too. It may be horrifying to see Joker smiling but trust me its more horrifying to see Batman smiling . After her wonderful victory over RT Gal Gadot could do a lot better. Wonder Woman was kind of distracted and could not establish character as she did it in Dawn Of Justice and Wonder Woman,or may be we were expecting more. Cyborg who is a brilliant sportsman who lost his life after an accident. It was good to see Zack tried to show how life of normal human changes after horrifying accidents. The guy is in conflict with himself which is brilliantly played by Ray Fisher. Just like Ben Affleck Ezra miller too was first hated then became everyone’s favorite kid in JL. His conversations brings the tone of movie somewhat lighter. Now we have king of Atlantis, He looks like Khal Drogo had a kid with some most beautiful mermaid. Thanks to Jason Momoa ,Aquaman is total badass unlike its previous versions . I don’t want to spoil Superman but yeah Henry really nailed it.He finally became The Superman everybody wanted. His journey is complete. He knows why he is here, to save us all. We had another badass mortal on the team, He is Alfred portrayed Sir. Jeremy Irons. Actually we are not in a position to judge Sir Jeremy but yeah he was one of the best parts you will love in JL. We saw his sassy quick-witted talk with Bruce. You may find the movie is not catchy ,may be this was result of messed up situation where Zack Snyder left the movie due to his personal problems and put it in hands of other director Joss Whedon. Those two are totally different in their approaches so it resulted in such situation.\r\n\r\nAlthough you may find a lot of negativity about this movie like previous DC films, because one of the things that audience forgets that DC characters are very dark unlike their contrary Marvel whose characters are cheesy and kind of funny, their stories and plots revolve around words like Hope , Justice and humanity not like Shawarma or Devil’s Anus jokes .This is a average movie not an Avengers movie. One thing I want to say that they kind of rushed to create a team up rather than Solo movies of Characters. This kinds of things  makes hard for audience to adjust as they don’t bond with DC characters as easily they do with Marvel one’s. The CGI was somewhat down as compared to other CBM’s and could have been a lot better. \r\n\r\n\r\n_Overall_, the movie will attract you if you see it as first team up not if you compare with other ones. This DC movie is worth watching.", "created_at": "2018-01-15T09:07:23.953Z"}, {"movie_id": 141052, "review_id": "5a95966ac3a3681170000386", "rating": 4.0, "review_text": "The much-anticipated Justice League, the follow-up to 2016’s Batman v Superman: Dawn of Justice, was finally released on November 17, 2017. After Batman v Superman and Suicide Squad were both negatively received, Warner Bros. saw a glimmer of hope with the highly-received Wonder Woman and hoped this would push the DCEU forward onto greatness. I saw Justice League on the 19th of November and my consensus: It’s Not Good. Opening to $94 million for its first weekend and with a 40% rating on Rotten Tomatoes, Justice League underperformed both financially and critically. 10 years ago, I would have laughed at the idea of a Guardians of the Galaxy film beating Justice League at the box office and be much better received. Justice League’s performance puts the future of the DCEU in jeopardy.\r\nDue to a personal tragedy in Zack Snyder’s life, he stepped down as director and Joss Whedon (director of The Avengers and Avengers: Age of Ultron) took over post-production with reshoots and filming additional scenes. Most would have assumed that because of Joss Whedon’s reputation, he would be a great asset to the production of Justice League. However, that was strongly not the case. Zack Snyder intended to make this movie with a much lighter tone than Batman v Superman, but Zack Snyder’s style just does not blend well with Joss Whedon’s. What we’re left with is a DC film badly trying to be a Marvel film and the tone is an inconsistent mess throughout. The film loses its sense of identity and doesn’t know what tone (light or dark) it wants to incorporate. Thanks to Warner Bros. meddling with the production of the film and purposely sabotaging Zack Snyder’s vision (as much as I dislike his directing style), we’re left with a film full of sloppy editing and pacing, inconsistent tone, forgettable/unmemorable music, rushed “development” of characters, a terribly developed villain, thin plot and clunky CGI throughout. \r\n\r\nThe movie directly follows the death of Superman in the previous film, triggering a sense of fear in people and allowing Steppenwolf and his army of Parademons to seek the 3 Mother Boxes on Earth to trigger a mass transformation of the planet. But instead of showcasing his initial invasion on Earth, the film starts off with disjointed scenes that don’t connect with one another. First with a video recording of Superman looking like he doesn’t want to even be recorded, then jumps to Batman using a criminal to capture a Parademon, then again to Wonder Woman thwarting a terrorist plot (which has nothing to do with the overall narrative), then jumps to a fully-bearded Bruce Wayne attempting to recruit Aquaman. There is no smooth transition between scenes and just results in a jumbled mess that really doesn’t show us a sense of urgency as to why Diana and Bruce want to recruit a team of meta-humans. \r\n\r\nThe movie should really give us a reason as to why Steppenwolf should be feared, but instead, he is portrayed as a generic, badly rendered CGI figure that utters generic villain dialogue and just suddenly appears in Themiscyra through a Boom Tube. We are not given a scene showing who Steppenwolf is or why he’s returned to Earth before arriving to Themiscyra. While there is a scene showing Steppenwolf’s original invasion on Earth and his subsequent defeat by the combines forces of Humans, Atlanteans, Amazonians and Green Lanterns, it’s narrated by Wonder Woman and misplaced during a random moment when she’s explaining the Mother Boxes after he has invaded Themiscyra. The movie should have started off with developing a strong sense of interest for Steppenwolf and his reason for obtaining the Mother Boxes (is he doing this on his own accord or is a higher being – Darkseid – ordering him to do so?). Then show his original invasion on Earth without having Wonder Woman to tell us about Steppenwolf. Steppenwolf is basically Loki: They both wore a helmet with horns, they were both given orders by a higher being to retrieve a box (or boxes), they both commanded an army of disposable CGI monsters, they both arrived to Earth through a portal, and both attempted to conquer the world. But the big difference? Loki is actually likeable, while Steppenwolf is greatly forgettable. \r\n\r\nSuperman, the “beacon of hope” as described by Bruce Wayne, is nothing of the sort. He was portrayed as a strongly brooding figure in both Man of Steel and Batman v Superman, but we do not once see Superman acting as this beacon. Instead, he looked as if he hates saving people and always has a blank expression on his face. There is no sense of romance between him and Lois or him being a beacon of hope, we’re just told that and are expected to believe that. However, his character sees much improvement in Justice League. One of the aspects I enjoyed about the film was actually Superman. In the film’s climax, he actually felt and acted like the Superman we all knew and loved in the past (excluding his two previous films). His revival was quite satisfying, especially when Bruce knew he may not be the same person as before. Then we’re given a glimpse into an Evil Superman where he easily manages to take on all the Justice League members. What I especially liked was seeing The Flash attempt to run behind Superman and as he’s in the Speed Force, Superman moves his eyes and head to stare directly at Barry, catches him off-guard and he’s left with a “WTF” expression on his face. This was honestly one of the best moments of the entire film, but is very short-lived. Lois Lane comes to the rescue and seems to knock Superman out of his disoriented state and they fly back to Smallville. After some brief dialogue, Superman seems to be back to his old self. I just felt his state of mind reverting back to his original self was rushed and relied heavily on Lois Lane to do the job.\r\n\r\nBatman is seen as the weakest member of the Justice League and is turned into a complete joke in this film. He even utters one-liners and is a much more light-hearted character in stark contrast to his debut in Batman v Superman. It’s very out of character for Bruce Wayne/Batman to be this way. It makes him seem like the DC equivalent of Tony Stark. It’s also apparent that Ben Affleck wants to no longer play Batman, I can totally tell that he just doesn’t seem to care anymore about the role. But he is given terrible material to work with, and I can understand why he would want to stop playing the role. I just hope Ben Affleck can see a glimmer of hope in the upcoming Batman solo reboot. \r\n\r\nNot much to say about Wonder Woman, since her solo film was spectacular and she continued to be damn amazing in this film, but I was utterly disgusted that DC felt it was necessary to overly-sexualize her by capturing close shots of her chest and ass. They even get up-skirt shots of her. It undermines her character established in her solo film and delegates her to being mere eye candy in the eyes of men. Plus the terrorist plot she thwarted, though it was an awesome moment, has no purpose and was a waste of screen time.\r\n\r\nCyborg is easily the least interesting character of the group. There’s brief development that I assume he holds resentment towards his father for bringing him back as “monster.” We’re not given an inner struggle with Cyborg struggling to deal with the fact of his condition, but the film has to quickly gloss over the Justice League members introduced in Batman v Superman via e-mail attachment in order to form the team. His only shining moment is in the final battle where he is the only one that can separate the Mother Boxes before Steppenwolf can enact his plan. But in Batman v Superman, from the video file, it seemed as if the Mother Box fused with Cyborg, so why is the box still a separate entity? It should have been fused with Cyborg and would raise the stakes a bit higher because Steppenwolf could use Cyborg to fuse with the other Mother Boxes and would force the Justice League to do everything in their power to save him. \r\n\r\nEzra Miller’s The Flash seems to be DC’s response to Tom Holland’s Spider-Man. However, The Flash is a much worse version of Spider-Man with very cringe-worthy dialogue. He’s socially awkward and without hesitation, he immediately agrees to join Bruce Wayne for the reason of wanting friends. What the hell? We saw some development with Barry Allen striving to prove his father’s innocence, but why join the Justice League for the sole purpose of making friends? Plus he even explains to Batman that he has never been in a battle, yet he was shown to be the one that apprehended Captain Boomerang. He is never given a shining moment except for saving a family in Russia and challenging Superman to a race in the mid-credits scene. \r\n\r\nJason Momoa as Aquaman was actually amazing, though he is bogged down by very limited screen time and little to no development. It honestly makes me quite excited for the upcoming Aquaman solo film slated for release late-2018. But a major annoyance I had with Aquaman was that he completely disappears from the movie after fighting off Steppenwolf, then suddenly reappears when the team is fighting Steppenwolf and Parademons in the sewers. There is no explanation as to how he arrived to the sewers, he just appears there. And that is the only time we truly see his powers is when he stops a column of water from flushing them out. In the final battle, they are nowhere near a water source, so what good is Aquaman if he cannot use his powers? However, it leaves me wanting to know more about Aquaman. Despite those annoyances, I thought the scene where Aquaman is unknowingly sitting on the Lasso of Truth and starts to speak the truth about their situation was fantastic and quite humorous, especially his reaction to when he realizes he was sitting on the lasso. \r\n\r\nThe final battle between Steppenwolf and his army of Parademons against the Justice League has very low stakes and takes place in an obscure location in Russia. Unlike The Avengers, where the battle took place in New York and resulted in severe collateral damage, which raised the stakes a lot, Justice League’s climax doesn’t have a sense of world-ending urgency. It’s just a giant CGI battle with the only memorable moment being Aquaman riding a Parademon through a building. There’s no shining moments like Hulk slamming Loki or Hawkeye jumping off the building and shooting at the Chitauri as he’s falling. As Cyborg is struggling to separate the Mother Boxes, Superman appears when all hope seems to be lost and absolutely beats the shit out of Steppenwolf, breaking his weapon and his own Parademons attack him since they smell his fear of defeat. It made Steppenwolf seem like nothing but a giant push-over. But what especially irks me is that the original plan was to have Steppenwolf attempt to sway Superman to join him, Superman is given an apocalyptic vision( similar to the one Batman saw) and he actually sees Darkseid and this snaps Superman out of it and he delivers the final blow to defeat Steppenwolf. \r\n\r\nThough it’s a competent film and I really wanted to enjoy this film, Justice League is a complete let-down that should have been a huge movie event. Given its box office numbers and critical reception, this puts the future of the DCEU in a troubling position. They really should have given each of the heroes a solo film before releasing Justice League, but it’s apparent that Warner Bros. was way more concerned with catching up with Marvel than actually developing a shared universe with well-developed characters. Justice League just did not resonate with me and we can mainly thank Warner Bros. for rushing this film and delivering a disappointing product. \r\n\r\nClosing Comments \r\n- When Cyborg links up to the Nightcrawler, Alfred asks him if he knows him. Alfred and Diana were in the Batcave together when Cyborg reached out to them, Alfred should have recognized his voice completely.\r\n- Steppenwolf should have been a much better-developed villain with a well-defined purpose.\r\n- Mixing the styles of two directors in this film gave it a wildly inconsistent tone. \r\n- The humor, thought it did lighten up the mood, doesn’t work well with Zack Snyder’s style and feels out of place. \r\n- What was the deal with putting so much focus on that Russian family? It takes you out of the element of the final battle and is a cheap attempt at raising the stakes.\r\n- When Steppenwolf was first defeated thousands of years ago, why did they all entrust the humans with a Mother Box? Shouldn’t the Green Lantern Corps be alerted that one of their own perished in the battle? They could have taken the Mother Box back with them, but they didn’t.\r\n- Overall, the movie suffers from trying to do too much with too little time. DC really needs to reevaluate their future releases and as much as we all want another Justice League, they should put all their focus on standalone titles to fully flesh out their characters for now.\r\n- That post-credits scene featuring Slade Wilson/Deathstroke visiting a recently escaped and bald Lex Luthor is a set-up for the Injustice League/Legion of Doom, which would make for an interesting idea for the Justice League sequel (if it does happen).\r\n\r\nRating: 4/10", "created_at": "2018-02-27T17:33:30.362Z"}, {"movie_id": 141052, "review_id": "5ac1df4b0e0a260c390196b7", "rating": 9.0, "review_text": "This was my type of Super Hero movie. Simple, straightforward plot without much social nonsens and preaching. Little in terms of the all too common whining and sel pitying by the heroes. They are heroes all the way without any nonsensical vendettas or moral bullshit (mostly). There is an episode with a temporary memory lapse and some unnecessary slowdown but it is quickly dealt with.\n\nOn Wikipedia you can read that the movie was criticized for its “overuse of CGI”. Well, go watch another movie then for Christ sake! News Flash: It is a Super Hero movie! There are supposed to be a shitload of CGI in a super hero movie. Personally I enjoyed every second of the FX loaded scenes.\n\nI am quite happy to finally see a real Super Hero movie and especially to see Batman and Superman again after that utterly abysmal train wreck Batman v. Superman.\n\nI liked all the heros in this movie. The Flash was a bit silly at times but it was bearable. Gal Gadot is as hot (I had to say it) as ever as Wonder Woman. There are a few comical moments but luckily they are not overdone. Aquaman accidentally sitting on Wonder Woman’s “truth lasso” was quite hilarious actually.\n\nThe SF was generally great. I really liked the explosive action scenes. The colorful tendrils that invaded the land around Steppenwolf’s lair was a bit si-so though. They should have kept them just black and red at least.\nSteppenwolf himself was okay. From a distance he was pretty great but up close (and there was really too many up close scenes of him) he looked…not so great, especially when talking.\n\nThere are a couple of stupid faults of course. Usually involving the good guys just standing around looking while the bad guy screws them. Leaving the, obviously, all important third mother box unguarded and the lust looking stupid when Steppenwolf grabbed it was a real low.\n\nAnyway, I really liked this movie. I do hope we get more like it.", "created_at": "2018-04-02T07:44:11.950Z"}, {"movie_id": 141052, "review_id": "5b8c1c790e0a261d70038468", "rating": null, "review_text": "The length is so fitting on the storytelling, what else does everyone need? I know that the trailer had so many scenes that we wanted to see, but for me, the movie and its duration are perfect!\r\n\r\nThe performances were amazing, especially Jason Momoa as Arthur Curry/Aquaman!\r\n\r\nAnd the story was great, but not lie BvS, my favorite DCEU movie actually, but still, it has a great story though!\r\n\r\nThe CGI of Steppenwolf was great too, Steppenwolf as a character was threatening and violent, and that's a thing I wanted to see actually! The CGI in general was great and stunning!\r\n\r\nA Justice League movie that every DC fan deserves in my opinion.\r\n\r\nI'm gonna give it a 10/10, I think it's an amazing movie, with such great stuff in it.. and it's absolutely worth watching!", "created_at": "2018-09-02T17:23:05.324Z"}, {"movie_id": 141052, "review_id": "5ba99cfd0e0a2661270057c9", "rating": 6.0, "review_text": "The Movie was highly paced. The movie was focusing on how the Justice league assembles. Stupidly shown the Mother Boxes and Stepenwolf. No future prospectus or hints unlike Dawn of Justice. Darkseid and Stepenwolf relation unknown. The movie falls apart as it was mainly focused on Resurrection of Superman and Assemble of other members.", "created_at": "2018-09-25T02:27:09.868Z"}, {"movie_id": 141052, "review_id": "5e20f5758f26bc001571ff24", "rating": null, "review_text": "Never lived up to its hype. The story was a bit rushed, the humor was forced, and it was a bit messy. All were happening at once that you couldn’t understand what was going on.", "created_at": "2020-01-16T23:44:53.728Z"}, {"movie_id": 141052, "review_id": "5e21dce12811a10015a1ef90", "rating": null, "review_text": "I have to say, I find it lighthearted and entertaining at least, though sometimes, you will find the plot to be rather confusing.", "created_at": "2020-01-17T16:12:17.719Z"}, {"movie_id": 141052, "review_id": "5e24a4cb1bf2660016fb1ea9", "rating": null, "review_text": "I think hardcore DC comic fans will appreciate the movie more than the general audience will. Being a DC fan, I enjoyed it a bit more because of the references from the comic books that it made.", "created_at": "2020-01-19T18:49:47.636Z"}, {"movie_id": 141052, "review_id": "5e24ac1aa894d600123a529f", "rating": null, "review_text": "A good movie with all your favorite characters. Pretty entertaining, but it won't match up to the meticulous world-building of the MCU. Still, a pretty decent movie.", "created_at": "2020-01-19T19:20:58.017Z"}, {"movie_id": 141052, "review_id": "5e24b5b11dcb770012ca1423", "rating": null, "review_text": "The biggest flaw of the film was that it didn’t fully utilized its characters. They just jumbled up some of the members of the Justice League from the comics, gave it a substandard representation of a villain, and called it a day.", "created_at": "2020-01-19T20:01:53.213Z"}, {"movie_id": 141052, "review_id": "5e24bb991dcb770016ca2185", "rating": null, "review_text": "Great potential, poor execution. I was disappointed, to be honest. We were expecting a lot for this movie, but I guess DCEU was a tad bit too late in the film game. Their TV series was much more promising than their movies.", "created_at": "2020-01-19T20:27:05.144Z"}, {"movie_id": 141052, "review_id": "5e24c57e8f26bc001179d89a", "rating": null, "review_text": "It was a pretty decent movie. Better than what I expected, but it was deeply flawed.", "created_at": "2020-01-19T21:09:18.536Z"}, {"movie_id": 141052, "review_id": "5e24cb1f8f26bc001179eae3", "rating": null, "review_text": "The Flash was definitely the comic relief for this one! I thoroughly enjoyed it, but I would have liked it, even more, if it is not kind of being rushed.", "created_at": "2020-01-19T21:33:19.919Z"}, {"movie_id": 141052, "review_id": "5e24d1295ed8e9001760eeee", "rating": null, "review_text": "If I can point it all out, there is so much wrong with this movie, especially the villain. I will choose Batman v Superman, which had really awesome action scenes, than this Justice League.", "created_at": "2020-01-19T21:59:05.143Z"}, {"movie_id": 141052, "review_id": "5e25a281a894d6000f3c4446", "rating": null, "review_text": "DCEU is making a comeback with this one! Finally, after many years of slumber, it is catching up with MCU at least. Although I can say it is not the best of the best, at least, they are finally learning.", "created_at": "2020-01-20T12:52:17.783Z"}, {"movie_id": 141052, "review_id": "5e25a28e8f26bc00137b382e", "rating": null, "review_text": "DCEU is making a comeback with this one! Finally, after many years of slumber, it is catching up with MCU at least. Although I can say it is not the best of the best, at least, they are finally learning.", "created_at": "2020-01-20T12:52:30.688Z"}, {"movie_id": 141052, "review_id": "5e25a29ebfeb8b0011d66d79", "rating": null, "review_text": "DCEU is making a comeback with this one! Finally, after many years of slumber, it is catching up with MCU at least. Although I can say it is not the best of the best, at least, they are finally learning.", "created_at": "2020-01-20T12:52:46.251Z"}, {"movie_id": 141052, "review_id": "5e270073ed2ac2001039f781", "rating": null, "review_text": "One word: Disappointing! I mean, I didn't expect much from DC since the movie franchise was not their forte, but they should have at least tried to make a decent looking movie.", "created_at": "2020-01-21T13:45:23.564Z"}, {"movie_id": 141052, "review_id": "5e270f5cc68b6900143dc84a", "rating": null, "review_text": "If they had more time, they could have built the elements of the Justice League much better. The characters were introduced haphazardly, the plot was a mess, the villain was a bit meh, and in the end, they needed Superman to save the day. Go figure!", "created_at": "2020-01-21T14:49:00.442Z"}, {"movie_id": 141052, "review_id": "5e29084f9638640019ab394b", "rating": null, "review_text": "Do not listen to the harsh critics and give this movie a try. It was enjoyable for me, and satisfied the DC fan in me!", "created_at": "2020-01-23T02:43:27.040Z"}, {"movie_id": 141052, "review_id": "5e2914349638640013ab3d69", "rating": null, "review_text": "“Yeah. I…I need friends.” This line from Barry Allen always cracked me up. What the Justice League built in the short amount of time they had was trust, friendship and camaraderie, and I think that is one of the important factors in a team, hero or not.", "created_at": "2020-01-23T03:34:12.684Z"}, {"movie_id": 141052, "review_id": "5ecf76e396386400226c133f", "rating": 6.0, "review_text": "It was good.\r\nFirst half, clearly Zack Snyder's work. But the second half you can tell Joss Whedon took over (I started to notice the lame humor in the 2nd half) as it's clearly something you'd expect from an MCU movie. Whedon clearly had no grasp on Snyder's vision.\r\n\r\nI mean, the film itself wasn't at all bad, but I do understand why critics and fans alike hated it.\r\nCan't wait for the Snyder cut!", "created_at": "2020-05-28T08:31:31.604Z"}, {"movie_id": 141052, "review_id": "604d14d389f74900688da399", "rating": 6.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nEveryone knows about the story behind the production of this film, right? TL;DR Zack Snyder () was the original director and got to shoot most of the movie, but a tragic family issue made him step off the project. Enter Joss Whedon (), the new director who reportedly changed much of what was originally intended through reshoots and re-edits, delivering a less than two-hour superhero flick as demanded by the studio. At the time, my expectations were extremely low, not only due to its complicated production phase but also due to the DCEU’s filmography until that point. Man of Steel, Batman v Superman: Dawn of Justice, Suicide Squad, and Wonder Woman were the films that preceded the get-together of Justice League.\r\n\r\nIgnoring my opinion on each film, my biggest fear walking into this movie was the fact that only two members of the team had an origin film (Superman, Wonder Woman) while Batman shared the spotlight with the two previous heroes in BvS. So, how would they introduce three new superheroes and get them all together as a team to fight an unknown villain in under two hours efficiently? Well, I didn’t know the answer, and after rewatching this movie for the second time, it’s clear both Whedon and Snyder had an impossible task. People quickly jump to comparisons, and it’s easy to look at Marvel’s own cinematic universe after its undeniable commercial success and call it “the best formula”. However, I defend that there’s no good or bad method.\r\n\r\nEven with an origin film for almost every major superhero, The Avengers has approximately a two-hour-and-thirty-minute runtime. This proves that it doesn’t really matter how much screentime the characters already have, there’s still a necessity of creating a story that efficiently and logically brings them all together to fight a common enemy. Justice League was doomed from the moment the studio mandated that runtime restriction, independently of its production issues and crew changes. Snyder, Whedon, or any other filmmaker would struggle to deliver a movie that could reach the fandom’s incredibly high expectations. Despite all of its unquestionable flaws, I still find this film decent enough.\r\n\r\nCast-wise, DC is proving to be as impeccable in its choices as Marvel or any other studio with massive franchises. From my second favorite Batman actor of all-time to the absolutely perfect casting of Wonder Woman, the newcomers are more than worthy of belonging to this fantastic universe of characters. Ezra Miller brings a quirky personality to Barry Allen / The Flash that really humors me. Jason Momoa might have changed the world’s opinion on Arthur Curry / Aquaman by delivering a cool, badass performance that will end many jokes about the supposedly useless superhero (everyone has seen the countless memes throughout the last decades). Finally, even though Ray Fisher seems to be a good actor, the fact that Victor Stone / Cyborg is 95% CGI doesn’t help his display.\r\n\r\nHowever, the predictable issue with the screenplay comes true, negatively affecting these new characters. The first act features extremely rushed introductions to the heroes, cutting from one place to another with no flow or rhythm. It almost feels like six different character trailers randomly mixed together with no connection between each setup. In addition to this, Steppenwolf (Ciarán Hinds) and his cliche motivation related to the pursuit of three MacGuffins are as lazy, unexciting, and generic as it could be. By far, the worst aspect of the entire movie. From the horribly non-menacing, amateur design to the awfully cliche development, Steppenwolf will go down as one of the worst villains ever seen in a superhero film.\r\n\r\nChanging to the good side, Ben Affleck and Gal Gadot share quite a few compelling dialogues that I actually wish I could have seen more of their characters’ reluctant yet strong friendship. A bit more of Batman comes through to the audience, but there’s still a lot to uncover from this version of The Dark Knight. However, it’s in the action sequences these characters shine, which leads me to the only compliment I can offer Steppenwolf: it works well enough as the entertaining punching bag of the Justice League. Contrary to their introductions, Aquaman, Cyborg, and The Flash all have key moments during the action-packed third act, working together as the team of superheroes the world so desperately needs.\r\n\r\nBatman planning everything, Wonder Woman leading with heart, and the new metahumans showing their skills make the last thirty minutes partially compensate for the rapid-fire first hour. However, it’s Superman - trailers and posters showed him, so this is definitely not a spoiler - who steals the show. I find Henry Cavill a great casting choice for Clark Kent, but the previous movies didn’t let both the character and the actor reach their respective potential. Justice League holds a surprising, outstanding moment in Superman’s return to action, making me genuinely wish for his sequences rather than the rest of the heroes. Finally, something exciting about The Last Son of Krypton (yes, the digitally-removed mustache still stands out, but it’s such an irrelevant nitpick)!\r\n\r\nTechnically, the costumes look great, though they’re toned down by the murky aesthetic. For example, Wonder Woman’s suit popped off the screen in Patty Jenkins’ colorful film, but in this one, all costumes seem to lack glow. On the other hand, Gotham looks fantastic in that dark atmosphere, and the final battle emphasizes a red filter that surprisingly works quite well. The action sequences are mostly easy to follow, even though CGI often overwhelms the screen, but I can’t deny that some scenes really left me astounded. The editing team (David Brenner, Richard Pearson, Martin Walsh) obviously had struggles with so many reshoots and modifications, but overall, Whedon was able to put together a relatively coherent movie story-wise.\r\n\r\nJustice League remains surprisingly decent, even after all these years. Despite its massive production issues and the studio’s mandate for a runtime shorter than two hours - dooming the film even when Zack Snyder was still at the helm - Joss Whedon still manages to deliver a reasonable superhero flick. Every actor offers excellent performances, namely Ben Affleck and Gal Gadot, but the negative expectations regarding the lack of screentime to introduce and develop unknown heroes come to fruition. Whedon and Chris Terrio couldn’t do better than an extremely rushed first act, skipping from a new character onto the next one with no connection between storylines or even consecutive scenes. In addition to this, from his awful design to his generic evil intents, Steppenwolf is undoubtedly one of the worst villains ever put to screen. The action-heavy third act features enough entertainment to compensate for some other minor issues with the screenplay, delivering outstanding sequences worthy of a much better movie. In the end, I hope that the upcoming Snyder Cut brings a lot more of the captivating character interactions that elevated this film, but without the restraints of studio orders.\r\n\r\nRating: B-", "created_at": "2021-03-13T19:38:59.850Z"}, {"movie_id": 141052, "review_id": "62404e62c740d9005d712bcf", "rating": 4.0, "review_text": "What on earth is the point of this drivel? In theory an exciting cast and character list, but in practise a terrible, soulless piece of dreadfully scripted nonsense. What's happened to Henry Cavill's face? Wasn't Grant Gustin available? Luckily for Amy Adams she rarely features in this B-movie; hell even the special effects remind me of early X-men stuff. Really not good.....", "created_at": "2022-03-27T11:45:38.164Z"}, {"movie_id": 141052, "review_id": "63c20ca68efe7300a0eb14e0", "rating": 1.0, "review_text": "Cyborg looked like he was totally CGI didn't he? And late 90s CGI too. Should have just worn the hoodie throughout the entire film, it hurt watching what is an actor that did a stellar job playing someone that was hurting and at odds with his very being...made into a distraction because the CGI was absolutely horrid.\r\n\r\nBeyond that the movie was awful. Well, it was awful in a totally boring kind of way...and this was a superhero movie. They managed to make it boring.\r\n\r\nPart of it could be that, like Wonder Woman, it tried to be too dark and serious, but even then Wonder Woman was a hell of a lot more fun...even if they tried to make her film into yet another Batman movie. At least she had her moments.\r\n\r\nIn Justice League, ONLY she had her moments. Seriously. The Flash, well, he really didn't do anything that wasn't forced, but then Aquaman, he had a moment...but it was forced.\r\n\r\nEverything seemed a bit forced. And the big reveal was revealed before hand...so you really didn't even get that wow moment.\r\n\r\nAll in all, it kind of sucks, really bad. But at least it didn't feel as long as Batman V Superman.", "created_at": "2023-01-14T02:00:06.266Z"}, {"movie_id": 141052, "review_id": "646a5f97d1857201802d5808", "rating": 8.0, "review_text": "Awesome movie. It's like the marvel series but it's DC's best of the best. Has comedy and action throughout. Easily one of my favorite movies.", "created_at": "2023-05-21T18:14:47.499Z"}]