[{"movie_id": 83899, "review_id": "522d842c19c2955e90034384", "rating": 8.0, "review_text": "Stereotypes exist for a reason. Without them, You're Next would have very little to work with. Luckily the film uses what would be eye-rolling moments and turns them on their heads. It had a rather nestalgic feel, while feeling fresh at the same time. Solid effects and passable acting makes this a must for any genre fan.", "created_at": "2013-09-09T08:17:48.904Z"}, {"movie_id": 83899, "review_id": "5a76facb92514105a904298c", "rating": 8.0, "review_text": "**A messed up family, cleaned up by an outsider!**\r\n\r\nThis kind of films is usually low rated by me. It's very rare that I find one good film and that happened to be this one. I was braced for another disappointment, then I totally got surprised when it reached half way mark. Good twist too. In fact, there are many twists in the final quarters. Not like breathtaking, but very acceptable with kind of story and characters it had.\r\n\r\nAnother home invasion film. A family reunites for the parent's wedding anniversary at their rural vacation house. Slowly all the children arrive with their life partners, and then suddenly while dining, the attack takes place. Creates full of chaos, the family does not know what to do. But one of the members' retaliation makes thing complication for the attackers. What follows after that, and how it all ends are the rest of the story.\r\n\r\nFirst of all, this is not a horror film as labelled. It is a terror. We don't have a such genre, so it comes under horror. But the best way to call it a thriller. Sharni Vinson was very good. It's because of how her role was designed. Best film so far by this filmmaker, until his upcoming big titles. A one-night-event film, and of course a limited cast. They make sequels for crap films, but this one definitely deserves one. So I'm expecting one. Thos who love this genre must see it.\r\n\r\n_8/10_", "created_at": "2018-02-04T12:21:31.991Z"}, {"movie_id": 83899, "review_id": "5bd50ab6925141039b0212a0", "rating": 8.0, "review_text": "You're Next is directed by Adam Wingard and written by Simon Barrett. It stars Sharni Vinson, Nicholas Tucci, Wendy Glenn, A.J. Bowen and Joe Swanberg. Music is by Mads Heldtberg and cinematography by Andrew Palermo.\r\nBloody and bloody good fun!\r\n\r\nThe Davison family and partners meet up for a family reunion at a remote holiday home and quickly find that their inner issues are the least of their worries.\r\n\r\nThe splinter of horror that encompasses home invasion, that most terrifying of subject matters, has had enough filmic entries to actually fill a house! So when another one comes along with good hype and a promise of reinvigorating the formula, it's cause for horror film fans to start salivating.\r\n\r\nYou're Next doesn't reinvent anything, but it consistently and confidently keeps the formula well oiled and proves to be one of the better films of its type. The set up is standard, a big old country house in the woods, a whole bunch of likable and dislikable people, and of course some outside assailants about to unleash hell on everyone in the house. Refreshingly this is not a roll call of pretty teenagers being stalked and slashed, this is an assorted bunch, young and old, all shapes and sizes, and the family bickering that precedes the carnage is a smart move, because once family members start getting killed there's a genuine sense of grief and regret coursing through those yet to be sliced and diced.\r\n\r\nIt's nice to find that Wingard has great respect for his target audience, he's made a film for fans of the sub-genre and inserted a darkly comic streak that pays off royally. It's often very nudge nudge and wink winkery, but always in the right places. The director also proves to have a devilish eye for a murder scene, with some of the killings here high grade in blood, physicality and originality. Elsewhere the makers give us a great heroine, a truly resourceful gal that fights back with a ferocity that's both sexy and frightening, and while the revelation of why these events are happening is hardly original -\u0096 or that the back story given for our heroine's skills is just silly -\u0096 Wingard plonks it all together with such bloody verve it hardly matters.\r\n\r\nSome less than good acting from a couple of the cast, and the overuse of shaky-cam stops it from going through the roof out into the genius stratosphere, but this is a cracker of a home invasion horror and well worth a night in with the lights off and the volume tuned up loud. 8/10", "created_at": "2018-10-28T01:02:46.985Z"}, {"movie_id": 83899, "review_id": "5f1d750273520500374c2ec0", "rating": 8.0, "review_text": "**The following is a long-form review that I originally wrote in 2013.**\r\n\r\nThough initially shown in 2011, You're Next has only just gained a theatrical release in the past month. A release for which I'm very glad. Being in Australia, a horror movie in cinema is not common, there's rarely if ever more than two showing at the same time, and very often none.\r\n\r\nStylistically it blends a lot of cliche business with some much more out there and alternative ideas. The cinematography is not unlike that of The Strangers (plus there's some similarity in events) and the vibe reminded me of the Saw franchise (though the events themselves most certainly did not). The result is a film that is oddly both a predictable and completely atypical horror.\r\n\r\nThough the most major of the plot twists was seen coming by everyone I saw You're Next with, and personally only one of my many predictions about the film failed to eventuate, I'd still rate it as Adam Wingard's best work to date (who has previously been responsible for on A Horrible Way to Die, Pop Skull and What Fun We're Having as well as collaborative segments The ABCs of Death and both V/H/S entries).\r\n\r\nThe cast is small, and not exactly overburdened with big names. In fact I only recognised AJ Bowen out of the lot of them (from his work on other Wingard pieces as well as The Signal and Hatchet II). Sharni Vinson who plays a character named Erin (a twist on the Final Girl trope usually seen in slasher films) was unknown to me, though an Australian in a major role of an American film was cool to see. She earned much praise for her portrayal, though personally I felt this was at least as much (if not more so) due to good writing than good acting.\r\n\r\nMy personal accolades go to the villains of the piece, dubbed simply Fox Mask, Tiger Mask and Lamb Mask (above). Particularly Fox Mask, but that may well be a bias seeing as Hoyts sent me a Fox Mask Mask for free. As well as tickets. Good kids.\r\n\r\nYou're Next has some new ideas to display, as well as some class act ways of getting around issues like budget constraints. It has some well designed kills, a mostly-engaging story and some absolutely hilarious moments (probably intentional, but laugh-out-loud funny either way). But it didn't blow me away, nor was it groundbreaking. The \"new stuff\" brought to the table tended to come about in short bursts through an otherwise standard setting, rather than actually being original overall. I enjoyed my time and I'd recommend giving it a a watch, but ultimately it sat in the category of \"good\" rather than \"memorable\".\r\n\r\n-Gimly", "created_at": "2020-07-26T12:20:18.158Z"}, {"movie_id": 83899, "review_id": "5f9b3f0466a7c30036989b90", "rating": 6.0, "review_text": "It has a lot going for it, but the parts that aren't quite so positive drag it down a lot.\r\n\r\nThe horror aspects of <em>'You’re Next'</em> are good. All the deaths are pretty neat, with the villains certainly look the part. Sharni Vinson is memorable in the lead role of Erin, but she's really the only cast member that I enjoyed in this.\r\n\r\nThe set-up, character decisions and ultimate twist are dreadful. I have a decent threshold of ignoring when characters do dumb things, but this film takes the biscuit in that regard. I was questioning so much of what they all do, to the point it got irritating. Some of the editing and camera work isn't great either.\r\n\r\nGoing back to the cast. Vinson is definitely the best person onscreen, her character turns into a very cool one as the film progresses. With that said, I never felt she fitted in well. Vinson as Erin as a film's sole protagonist would be awesome, but she's unfortunately held back a lot in this.\r\n\r\nI guess if you want a 95 minute slasher that doesn't take any thinking or anything of the sort, then this is a film that's worth a watch. However, for me, the supporting elements aren't good enough to match the solid horror.", "created_at": "2020-10-29T22:15:32.728Z"}, {"movie_id": 83899, "review_id": "63097b6fca7ec6007efce997", "rating": 7.0, "review_text": "**What would happen if the main character of a horror movie wasn’t a moron? You’re Next answers that question with entertaining violence and clever stereotype subversion.**\r\n\r\nYou’re Next begins as a typical horror slasher with an isolated group of family/friends falling under attack from masked axe-wielding murderers, but a couple of twists and turns along the way set this movie apart. The true stand-out that makes You’re Next so much more interesting than any other slasher is that the female lead is not a stereotypical inept final girl but a strong, capable survivalist, much more than the killers bargained. You’re Next is brutal, gore-filled, and dark but satisfies by turning many horror stereotypes on their head with characters actually making some intelligent decisions in a slasher movie! Like many scary movies, there is some brief and unnecessary sex and nudity, so be prepared, but if you can get past that (or fast forward), the rest of the film is a blast!", "created_at": "2022-08-27T02:03:27.041Z"}, {"movie_id": 83899, "review_id": "63ef874135818f0085e9fbdd", "rating": 7.0, "review_text": "You’re Next is a classic slasher film that has brutal kills and suspense, but suffers with a lackluster story and disappointing performances.\r\n\r\nThe story here is pretty generic with a group of unknown assailants brutally invading a home. There are some twists that the writers attempt to put into it, but most of them are pretty predictable and lack any serious shock.The plot uses the same trope that is used in countless horror films of our lead character luckily having some type of background training that allows her to be able to expertly defend herself. It is fine, but there is something terrifying about seeing an everyday person being thrown into these scenarios.\r\n\r\nThe performances are pretty bad across the board. Sharni Vinson does a great job and really carries the film overall. The mother and father are simply terrible. Every line delivered by them feels forced and uncomfortable. The other performances are all okay, but really do not make an impact at all.\r\n\r\nOverall, my enjoyment of this film is heavily swayed by the gore, violence and suspense present throughout the entire runtime. There are some brutal scenes that had me verbally gasping, which is always a treat to have in a slasher film. Despite my complaints, there is enough here to find enjoyment and with a runtime of only 94 minutes, I would recommend this to any slasher fan.\r\n\r\nScore: 72% |\r\nVerdict: Good", "created_at": "2023-02-17T13:55:13.259Z"}]