[{"movie_id": 648579, "review_id": "6264c4816eecee30f2cef968", "rating": 8.0, "review_text": "It certainly seems like _The Unbearable Weight of Massive Talent_ will have a deeper impact on you if you’re at least somewhat of a fan of Nicolas Cage’s work, but could also be amusing for fans of absurd adult comedies. Pedro Pascal is the humorous wingman we all wish we could have; soft-spoken and yet a priceless factor in the overall ludicrous nature of the film. Meanwhile, Nicolas Cage continues to reign supreme as a talented lunatic at the top of his game. _The Unbearable Weight of Massive Talent_ is an outrageous and uproarious expedition into hilarity and absurdity. Nicolas Cage and Pedro Pascal are an unlikely yet brilliant comical duo that will have you rolling on the sticky movie theater floor with laughter.\r\n\r\n**Full review:** https://hubpages.com/entertainment/The-Unbearable-Weight-of-Massive-Talent-2022-Review-The-R-Rated-Action-Comedy-of-a-Lifetime", "created_at": "2022-04-24T03:31:13.745Z"}, {"movie_id": 648579, "review_id": "6267a4ff1967570067a37d8d", "rating": 7.0, "review_text": "No-one could ever accuse Nicolas Cage of not having a sense of humour. He plays himself for most of this, depicting a somewhat fallen star whose agent (Neil Patrick Harris) finds him a gig for $1m to go to the birthday party of his wealthy Mallorcan superman \"Javi\" (Pedro Pascal). Lack of options force him to travel and he quite quickly befriends his adulatory, spring screenplay writer, amigo. Snag - well Tiffany Haddish (\"Vivan\") is the CIA on the island, and she tries to co-opt him onto a cunning plan to trap \"Javi\" - whom she believes to be a criminal kingpin behind the kidnap of the daughter of a politician. What now ensue are some quite fun escapades as the actor has to turn his hand to skills he would do off pat if he were in front of a camera, but not so readily in \"real life\" - and it turns out that he isn't half bad, either. Is \"Javi\" really the baddie? Will Cage rise to the challenge? All is revealed in this amiable parody of not just many of his own films, but of espionage and action drama in general. It's got some car chases, fancy locations, power boats and a room with a waxwork that would not have looked out of place with Peter Cushing and Christopher Lee. A bit ripe at times, the dialogue is peppered with plenty of wittiness and Cage plays the exasperated, then terrified, then motivated actor with aplomb and with his tongue in his cheek. Pascal makes for a fun foil keeping the bromance bubbling along nicely, and with Sharon Horgan delivering well as his long-suffering ex-wife (\"Olivia\") this is a well paced and enjoyable adventure romp.", "created_at": "2022-04-26T07:53:35.180Z"}, {"movie_id": 648579, "review_id": "626ad563394a8700a21a62de", "rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/unbearable-weight-massive-talent-spoiler-free-review\r\n\r\n\"The Unbearable Weight of Massive Talent is an admirable tribute to one of the most iconic actors of his generation: Nicolas Cage. A hilariously insane, absurd journey through a career filled with unforgettable gems, equally ridiculous and without any creative constraints.\r\n\r\nFrom the hundreds of delicious references to past works and characters to the phenomenal chemistry between Pedro Pascal and Cage, it will be more complicated for viewers unfamiliar with the latter's life and filmography to get carried away by the chaotic, naturally exaggerated atmosphere.\r\n\r\nRegardless, witnessing Cage play himself is worth any ticket. Endless entertainment for fans of a pure talent that deserves much, much more acclaim.\"\r\n\r\nRating: B+", "created_at": "2022-04-28T17:56:51.591Z"}, {"movie_id": 648579, "review_id": "63184743ed2ac20098672563", "rating": null, "review_text": "Full review: open.spotify.com/episode/5cQovXzt5NNCQZr8ooTeow?si=69d80cd4b8744aca\r\n\r\nTo keep it brief, this movie lives in my head rent free. I truely enjoyed everything about this unique movie and I just cant speak highly enough about it. The way it's written was absolutely amazing, and to put something like this together is just special and unique. I can't thank the directors, writers, co-stars and everyone involved to put together this somewhat of a tribute movie, and do it so well. Easily one of favourite movies of the year, and probably one of favourite of recent times.", "created_at": "2022-09-07T07:24:51.972Z"}, {"movie_id": 648579, "review_id": "636fcfc12495ab007821bf8a", "rating": 7.0, "review_text": "**Nic Cage proves himself a classy, good-natured, down-to-earth star by poking fun at himself and his career while making a delightfully funny film.**\r\n\r\nThe Unbearable Weight of Massive Talent is a hilarious meta ride filled with goofy charm and outrageous comedy. Nic Cage made this movie possible and wonderful - both because the movie is a parody of his career and because he was willing to be a good sport and play an exaggerated crazier version of himself. The story bears some similarities to Hot Fuzz as characters unknowingly discuss upcoming plot points that come later in the film. The whole thing is bonkers, entertaining, good-hearted, and silly. Pedro Pascal expands his acting range by playing an obsessed Nic Cage fan that boosts the comedy further by matching Cage's manic craze with sincere adoration and enthusiasm. As a Nic Cage fan, I laughed out loud repeatedly. As an action-comedy fan, it's a pretty funny and enjoyable way to spend an hour.", "created_at": "2022-11-12T16:54:25.476Z"}, {"movie_id": 648579, "review_id": "63b8908924b33300931be3af", "rating": null, "review_text": "The Unbearable Weight of Massive Talent is the Nicholas Cage show that I wanted but didn't fully know I needed.\r\n\r\nThis movie is fun, zany, witty, and just pure entertainment. I had a smile on my face for the entire movie. It doesn't take itself or the persona of Nicholas Cage very seriously. Often times poking fun at the career of Cage and the multitude of movies he has been, while simultaneously painting him as an absent and poor father. This is no easy task for an actor to face, but he does it excellently and really embraces his faults.\r\n\r\nThe plot is no cinematic masterpiece but it doesn't have to be. The best points in the is movie is the chemistry between Nick Cage and Pedro Pascal. They were beautifully synergized on screen and carried this movie to conclusion. It was so much fun seeing them develop a bromance that often times I found myself forgetting he was even suppose to be a villain.\r\n\r\nIt is not often you find a movie that is so self aware of what it is trying to be, but this movie tackles that so effectively creating a fun experience that any audience can enjoy.\r\n\r\nScore: 78%\r\nVerdict: Great", "created_at": "2023-01-06T21:20:09.345Z"}, {"movie_id": 648579, "review_id": "63f1984488634800aacab8df", "rating": 7.0, "review_text": "Good stuff!\r\n\r\n<em>'The Unbearable Weight of Massive Talent'</em> is what I expected it to be. A breezy, comedic and extremely meta story with Nicolas Cage - sorry, I meant: Nick ... f*cking ... Whoa! Cage! Talking of whom, it's amusing seeing two Cages, especially the de-aged one!\r\n\r\nCage is great throughout. Away from him, Pedro Pascal is good value too. Overall, it's not a film to be taken serious - the opposite, in fact - but I had a positive time watching it. The calls to Cage's prior work, e.g. <em>'<a href=\"https://letterboxd.com/film/con-air/\">Con Air</a>'</em>, is fun.", "created_at": "2023-02-19T03:32:20.633Z"}]