[{"movie_id": 44115, "review_id": "52fd32f892514152b201365a", "rating": 6.0, "review_text": "Franco provides a nice performance but the movie is not that hooking and Boyle repeats his visual techniques once and again.", "created_at": "2014-02-13T21:02:49.000Z"}, {"movie_id": 44115, "review_id": "58a9b3fc92514173ea009b0b", "rating": 9.0, "review_text": "127 Hours depicts the true story of a guy named Aron Ralston, who went canyoneering in Utah in April 2003. Through a pretty serious event of misfortune, he gets trapped in a canyon by a boulder that pulverises his arm against the canyon wall; literally between a rock and a hard place. And, the desperate measures he resorts to in order to free himself. From a Hollywood perspective, this sounds like it could be turned into a wildly spectacular action film with a bold, heroic protagonist, hysterical relatives and \"Where is my son? PLEASE FIND MY SON!!\" (*intense sobbing*) - type of dialogue. Yes? No. Boy, am I glad this was directed by Danny Boyle... The man we all know for his raw, authentic film style. Instead of aforementioned blockbuster drama, he opted for an incredibly realistic, documentary-like film. 127 Hours starts off with no form of introduction whatsoever. We do not get to 'meet' Aron or any of his relatives. However, any such introduction quickly proves to be redundant as, over the fast-paced opening credits, we see Aron enthusiastically preparing for and taking off on a hiking trip (ignoring his mother's phone call in the process...), and there you have it: this is a 'too cool for school', overconfident adrenaline junkie, and that's all we need to know. This overconfidence gradually proves to be the source of pretty much all his problems, as it is later on revealed that Aron neglected to tell anyone where he was going... Oops.\r\n\r\nLike I said, this film looks and feels very much like a documentary, like National Geographic made a big budget reconstruction of the event. The film makers' choice to cast James Franco was a very good one. He is simply amazing. Mind you – he is alone in this film for about 95% of the time. This requires an actor with the guts and skill to carry an entire film, and I must admit, Franco probably wouldn't have been my first choice. But – to my pleasant surprise – he pulls it off, and is actually very worthy indeed of his Oscar nomination. He displays an impressively wide range of emotions, all equally convincing. Panic, disbelief, despair, delusion, hurt and hallucinations. But even confidence, coolness, exhilaration and rationality; it's all there. Aron Ralston, as a character, starts off as a seemingly quite cocky, confident, care-free dude who just wants to enjoy himself and do what he loves most: exploring nature. Without telling his family. But as the film progresses, and Aron realises just what kind of mess he's in, you can slowly see a change occurring in him. And the fact that, after a while you greatly start to sympathize with him and even admire him, despite his obvious stupidity before, is all due to James Franco. He has really proved himself to be a very fine character actor with the capability of moving his audience. There is one scene in particular which I found really captivating. During the 'Tuesday' scene, Aron records himself on his camcorder, acting like he's on a talk show, answering his own questions. This scene is top-notch, acting wise, and this is where you really start to feel for him. \r\n\r\nThroughout Aron's ordeal, we are shown various flashbacks of his childhood, friends, family and loves. This might seem like a cliché, but honestly, what else are you supposed to think about when you're stuck in a canyon for five days? Some people have suggested they think Aron to be a superficial person for not having some kind of spiritual enlightenment while he was trapped, but honestly, I don't think it's anybody's business to judge what Aron thought and felt throughout his ordeal. We all deal with hardship in our own personal way, and talking to God is not necessarily an option for everyone. Some of us simply draw support from family and love and good memories. I know that's what I'd do. \r\n\r\nNow, back to technical talk. The sense of realism of 127 Hours comes greatly from the grainy, unsteady camera work and graphic depiction of everything. Which is a note that comes with a warning: this film is not for the faint of heart. What surprised me is that the scene where Aron 'releases' himself is visually very graphic. I won't go into detail, but you really shouldn't watch this if you don't have the stomach.\r\n\r\nThere were only a few minor things which bothered me during this film. It has a few moments which, inevitably are a teeny bit boring. But then again, even that seems to fit into the story, so perhaps it makes sense. And I personally think the music wasn't always very well chosen, some of it didn't really fit somehow. But none of this is really any bother.\r\n\r\n127 Hours may not be as profound as Into the Wild, but it's certainly a very well-crafted film which deserves respect on its own merits. Also, the photography of the film is really beautiful and some of the scenery of the canyons is truly breathtaking. I would recommend it for the pretty pictures alone. Anyhow, if you're interested in a really good episode of \"I shouldn't be alive\", this is the film for you.\r\n_(September 2011)_", "created_at": "2017-02-19T15:04:28.184Z"}, {"movie_id": 44115, "review_id": "58c47f3c925141638a0027df", "rating": 1.0, "review_text": "It was the borring movie I ever watch.\r\n\r\nAnd I will not recomend anyone go see this.", "created_at": "2017-03-11T22:50:36.529Z"}, {"movie_id": 44115, "review_id": "5e073fab4c1d9a0013e1644c", "rating": 5.0, "review_text": "I can certainly appreciate the lengths that those involved in _127 Hours_ went to. Being that the movie is 90% bottle-episode, wherein the lead doesn't even have the luxury of something as simple as being allowed to pace about, it's not unfair to say that _127 Hours_ doesn't have a whole lot going on. To try and inject a bit of life into it, director Danny Boyle throws in a number of unique filming styles, and I'll absolutely give props to him for that outside-the-box sort of thinking, but it doesn't actually change the fact that there's still not a whole lot going on. Franco is not a bad actor, but it's a big ask of someone to run something like this solo, and it ends up being a bigger one than he can fully manage. _127 Hours_ is not something I ever found fully engaging. Oft-intense, and kind of gross, but not fully engaging.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-12-28T11:42:35.735Z"}]