[{"movie_id": 23759, "review_id": "630afb6cca7ec6007bcd2180", "rating": 1.0, "review_text": "According to Wikipedia, Centurion “received mixed reviews and performed poorly at the box office” when it was released, but I wonder how many people picked up on its fascist undertones. \r\n\r\nThe movie is set in Britain during the Roman invasion in 43 AD. Now, unless it’s propaganda or revisionism, the long and short if it is, or should be, that in an invasion the invaders are the bad guys and the invaded the good guys – forget geopolitics; I’m talking about simple storytelling here. \r\n\r\nBut Centurion expects us to identify with the invading forces, a rapport that it slyly, yet deliberately, encourages by having the Romans speak the Queen’s English, while the native Picts – the ‘others’, as it were – speak Gaelic, a Scottish language that even Scots hardly know. In modern terms, what this movie wants from us is tantamount to asking us to cheer for Nazis or, conversely, jeer at Ukrainians. \r\n\r\nSure, the hero is but a soldier and, as we know from Tennyson’s Charge of the Light Brigade, a soldier’s lot is “not to reason why … but to do and die” – but precisely therein lies the problem. Quintus Dias (Michael Fassbender), and by extension writer/director Neil Marshall, never question warmongering; what does bother them, though, is “war without honor.” We are, therefore, meant to take a moral stance based on whether one side fights ‘dirty’ or not, without taking into account what each is fighting for. Thus the Picts, who are defending their home and freedom, are scorned because they “will not be drawn into open combat. Instead, they pick at the scab until we bleed, hiding in the shadows like animals, striking hard and fast then falling back into the night.” Never mind that the Romans were the ones who drew first blood. \r\n\r\nMeanwhile, the main antagonist is a character whose “village [was] slaughtered as punishment for resisting Roman rule … they burnt out her father's eyes …. raped her mother until she was begging to die … before she too was raped … finally they cut out her tongue that she may not speak ill of the bloody Roman Empire.” \r\n\r\nThat’s your plucky, underdog hero right there — but when it comes down to Quintus and her, we’re somehow supposed to root for him. Moreover, we are required to approve of Quintus’s romantic interest, a woman called Arianne who helps the Romans out of spite because she has been ostracized by her fellow Britons (I believe the denomination for such an individual is ‘collaborator’). Quintus himself eventually turns his back on the Roman Empire – but only because they, for reasons not worth mentioning, try to kill him – in order to join Arianne as a pariah. \r\n\r\nDid Marshall figure that, given enough time, one can look at history as if it were mythology – without the hindrance of having to make a distinction between right and wrong? After all, you can safely choose between Greeks and Trojan in the Iliad and retain a clear conscience, but I shudder to think of a future where Saving Gefreiter Reichmann would be a viable idea for a blockbuster.", "created_at": "2022-08-28T05:21:48.442Z"}, {"movie_id": 23759, "review_id": "64d9c862f495ee029355d44a", "rating": 6.0, "review_text": "The eponymous \"Quintus\" (Michael Fassbender) is struggling through the snow to escape the menacing Picts who have just ambushed and destroyed his outpost. He has to get the message to \"Gen. Virilus\" (Dominic West) before the whole of Britain is overrun by these warlike people. That man commands the ninth legion, and en masse they head north into the perilous wilderness - guided by \"Etain\" (Olga Kurylenko) - to seek vengeance. Further into enemy territory they go before betrayal and disaster befalls them. Only \"Quintus\" and a few of his colleagues manage to escape. Can they make it to Hadrian's Wall and safety? The photography is good in this film, the Scottish scenery is shown off in all it's glory, hostility and bleakness as the men strive to outrun their enemy and reach safety. The rest of it, though, is all rather disappointing. Neither the acting nor the writing is really up to very much, and with the possible exception of rather adept with a blade \"Tarak\" (Riz Ahmed) and his extremely fast-acting dead cap mushrooms, the whole thing is just a bit clunky and slow with too much score. The combat effects are generally quite good, though, and at times it has an authentic brutality to it, but neither Fassbender nor West are really in their element and I felt it seemed a great deal longer than 100 minutes. I like the genre and I have seen much worse, but given this must have had a decent budget this could have been better with just a little less prattle, some better casting and a bit more action.", "created_at": "2023-08-14T06:23:30.390Z"}]