[{"movie_id": 377447, "review_id": "586cc328c3a368037b0056e8", "rating": null, "review_text": "When American audiences last saw our diminutive chopsocky champion in the iconic Jackie Chan he was kicking butt and taking numbers alongside ex-<em>Jackass</em> and <em>Dukes of Hazzard</em> star Johnny Knoxville in the flaccid and forgettable 2016 voltage vehicle <em>Skiptrace</em>. Well, the sixty-something martial arts megastar has found yet another frenetic farce to strut his stuff as he stars and co-produces in the vintage actioner <strong>Railroad Tigers</strong>, a vanity project that enlists his son Jaycee by his side as the nepotism card is dealt for the rollicking father-son tandem and their ragtag of hangers-on. \r\n\r\nThe good news is that <strong>Railroad Tigers</strong> is more of an entertaining roar than the aforementioned tiring and convoluted <em>Skiptrace</em> (this is not saying that much in terms of a compliment). However, the bad news is that <strong>Tigers</strong> does not challenge Chan and his high-strung hucksters to anything creatively crafty or freshly distinctive despite its nostalgic, stylish feel and loose ode to classic cinema that range from the old-fashioned <em>Robin Hood</em> movies to collaborative capers such as <em>The Dirty Dozen</em> and <em>The Magnificent Seven</em>. Still, <strong>Railroad Tigers</strong> is serviceable enough to satisfy watching the aging Chan and his applied magical mastery of chops, kicks and punches provide the escapist cartoon-inspired fight sequences that is the veteran actor's trademark trickery. <strong>Railroad Tigers</strong> is all-too-familiar film fodder for the Kung-Fu Crown Prince of Pain but Chan's off-kilter western chugs along in a Chinese-language action movie that systematically delivers more than it sputters to the finishing line.\r\n\r\nNo doubt that Chan has seen his better days in cinema as the maturing martial arts statesman continues to tinker around with formulas while still trying to keep his cinematic relevance in tact. One can definitely applaud Chan for his staying power on the big screen regardless of the classic hits, box office bombs or middling movies that have painted his film-making resume. Chan hooks up once again for the third time with his <em>Police Story 2013</em> and 2010's <em>Little Big Soldier</em> director Ding Sheng as he finds himself in a period piece centered around the exploits of a moving train. Indeed, <strong>Railroad Tigers</strong> is a rip-off of sorts and the premise is as predictable as one of Chan's acrobatic and comical kinetic pokes to the groin. Time does not stand still for anybody and that includes the combative senior citizen with the impish grin and stored bundle of energy that still oddly resonates on the big screen for Chan fans worldwide. Although it is understandable that we yearn for the young Jackie Chan of yesteryear with his <em>Supercop</em> identity one should try to appreciate the traveled actor's attempt to recapture his roguish reputation in a battered body that has seen its share of high-wire hedonism. \r\n\r\nIt is 1941 in eastern China where Ma Yuan (Chan) is the head porter for a rural railroad station. Ultimately, Yuan becomes the leader of a rebellious squad of railroad workers-turned-freedom fighters whose sole purpose is to hijack a Japanese supply train during the Sino-Japanese war effort in order to accommodate their fellow impoverished citizens. Furthermore, Yuan and his mischievous minions set their sights on the big prize--blowing to smithereens the bridge that serves as the major supply route for the train in crippling the Japanese transport system. The cockeyed crew are deep-rooted in craziness due to the fact that a.) the risky mission is suicidal in nature and b.) the fact that even professional soldiers are not ballsy enough to take on this kind of agenda against the mighty Japanese forces. Nevertheless, Yuan and his renegades undertake what is an ambitious albeit far-fetched gamble.\r\n\r\nNaturally, the combination of the clumsiness and caliber of choreographed fisticuffs of Chan and his cheeky charges is the physical source of appeal for this action/comedy military-western. Writer-director Sheng inexplicably takes a while to let the animated nuttiness roll before the wackiness is fleshed out along with the kooky characterizations that includes the offspring of Chan's in Jaycee as one of the maneuvering misfits that participate in this peculiar Far East <em>The Bridge on the River Kwai</em> knockoff. The supporting players contribute fairly effective to the farcical proceedings including Darren Wang's Chinese soldier that informs Yuan and his giddy group on the Japanese operations, Wang Kai's noodle distributor/sharpshooter Fan Chaun, Alan Ng's pick-pocketer San, Xu Fan's Xing'er (crushing on Chan's Ma) and Huang Zitao's tailor Dahai to name a few. Other noteworthy personalities featured in the mix are the villainous Japanese presence led by Hiroyuki Ikeyuchi's military law enforcer Yumaguchi and his femme fatale colleague in Zhang Luxin's Yuko. \r\n\r\nOverall, <strong>Railroad Tigers</strong> hits its stride as Chan and company gives their audience the desired ingredients to make this messy mayhem acceptable--awestruck stunt work, quirky-minded theatrics from the amusing Chan and an obvious nod to some of Hollywood's notable salute to train heist flicks and wartime fables that stimulate more than sedate. These <strong>Tigers</strong> claw their way into a frivolous lather but whether or not Chan's latest spectacle deserves a boarding pass to enjoy the same blueprint thrills...well, hey...would you rather see the sequel to <em>Skiptrace II</em>? We rest our case...      \r\n\r\n<strong>Railroad Tigers</strong>\r\n\r\n2 hrs. 5 mins.\r\n\r\nStarring: Jackie Chan, Jaycee Chan, Zitao Huang, Kai Wang, Darren Wang, Hiroyuki Ikeyuchi, Zhang Lanxin, Alan Ng, Zhang Yishang, Fan Xu, Sang Ping, Wang Ta Lu\r\n\r\nDirected by: Ding Sheng\r\n\r\nWritten by: Ding Sheng and He Ke Ke\r\n\r\nDistributed by: Well Go USA Entertainment, Beijing Sparkle Roll Media, Shanghai Film Group Co., JQ Pictures LTD.\r\n\r\nProducers: Jackie Chan, Qi Jian Hong, Ren Zhong Hun, Song Ge. Joe Tam \r\n\r\nMPAA Rating: NR\r\n\r\nGenre: Comedy/Action & Adventure/Martial Arts\r\n\r\nCritic's rating: ** stars (out of 4 stars)\r\n\r\n(c) Frank Ochieng 2017", "created_at": "2017-01-04T09:40:56.035Z"}]