[{"movie_id": 565, "review_id": "5bd67a630e0a2622bd03c7d2", "rating": 8.0, "review_text": "Is she still in the dark place?\r\n\r\nAfter the mysterious death of her niece Katie, journalist Rachel Keller starts to investigate an urban legend about a videotape which kills you seven days after watching it. With dire consequences coming her way if she can not solve the mystery....\r\n\r\nThe sentence, English language remake of successful foreign horror film has been known to instill fear of the wrong kind in many a genre fan. So when it was announced that Gore Verbinski was to remake Hideo Nakata's terrifying nerve shredder, Ringu, the reaction in horror circles was akin to someone urinating on your chips. Refreshing to report then that The Ring is a candidate for best American remake and proof positive that remakes sometimes can be a good thing.\r\n\r\nStarring Naomi Watts (who is terrific) as Rachel, Verbinski and writer Ehren Kruger (adapting from Kôji Suzuki's novel) successfully transfer the atmospherics of Nakata's piece to a dank and eerie Seattle. It's with atmosphere that The Ring starts to play on your nerves, because after viewing the creepy and unsettling tape itself, we ourselves have been set up for the race against the clock theme that is driving Rachel on. So as the mystery starts to unravel, and sadness threatens to take a hold, the story quickly shifts direction to give horror one of its most baddest and cruelest characters. It's the kind of impact that crawls under your skin and refuses to move when you are trying to sleep at night.\r\n\r\nThough the story has been streamlined from its source, The Ring still has a bit too much filler in its meaty structure. Feeling a need to give Watts a quest among quests, Verbinski almost over cooks the mystery essence of the plot. However, with much relief he reins it in to stop any sort of scooby doo like nonsense detracting from the creepy sense of dread that has been built up previously. The ending here works a treat, but it is a tone down from the source and with that it's not even close to Nakata's version, and just maybe it has something to do with Dream Works wanting to secure a PG-13 rating? \r\n\r\nWhat is left though is a truly suspenseful and unsettling thriller - come horror film. One that even on revisits manages to bother and keep one on the edge of the seat. It made an $80 million profit in America alone, ensuring that a sequel was sure to follow. Now was that one a bad idea! 8/10", "created_at": "2018-10-29T03:11:31.936Z"}]