[{"movie_id": 10189, "review_id": "5e3fd7b941465c0018cb4c80", "rating": 8.0, "review_text": "When it comes to comedy, I'm like a patchwork. My favourite kind is the one I grew up with which is the Looney Tunes cartoons. I can watch them over and over again, and I will always laugh. I also love dark British humour, slapstick, and wait for it.... American.\r\n\r\nAmerican humour (especially these days) gets derided, most often due to it being \"dumbed down\" so the collegiate set can understand it, often using toilet humour as its best punchline. I somewhat disagree, I say that the humour people use between themselves is what drives movies made by Judd Apatow & co.\r\n\r\nTake Pineapple Express for example, this movie seems on some level to be fairly realistic. I use that term very loosely, because of course many things that happen in this film, could, and should never happen. Anyhow, the comedy, the dialogue, the fight sequences, and other interactions between the characters are the reasons I think make it feel this way.\r\n\r\nThe fight sequences aren't ones that I could say seem all that choreographed, of course there are \"X\" spots they need to hit, but for the most part I think it is done on the fly, or like much of the comedy, improvised.\r\n\r\nPineapple Express follows the story of a process server Dale Denton (Rogen), & his pot dealer Saul Silver (Franco), as they avoid henchmen (Robinson & Corrigan) of Ted Jones (Cole), Marijuana kingpin of L.A. after Dale witnesses a murder Ted commits. With a corrupt cop on the take (Perez) also on the hunt, staying alive for the buyer & supplier turned stoner buddies becomes an adventure of friendship as well as appreciation of the relationships built by people in this lifestyle.\r\n\r\nThe name Pineapple Express comes from the name of the variety of weed Saul introduces to Dale.\r\n\r\nI enjoy this movie because of the old fashioned approach taken to deliver the laughs and the story, and the characters feel very relatable to almost anyone on some level.", "created_at": "2020-02-09T09:58:17.782Z"}, {"movie_id": 10189, "review_id": "5f67ce3008cf87003a4e0726", "rating": 6.0, "review_text": "Decent watch, probably won't watch it again, but can recommend.\r\n\r\nI'll be upfront, while it's not really for me, I think most people will enjoy this movie, if for nothing else, then the idiot banter.\r\n\r\nFranco's a good actor, but sometimes he and Seth put too much of themselves in the movie, and it gets worse when they're together on screen.  This basically looks like they just took what they do hanging out on a Friday sometimes and put it on screen in places, basically anytime the action dies down and they start to lean into the lull.\r\n\r\nThe first story that gets interrupted by the main plot, could easily have it's own movie, romantic comedy or drama: an older man, legitimately and legally dating a high school girl has a LOT of situations to it, and has amazing potential.  Once it gets interrupted by the \"on the lamb\" trope, I would have honestly thought it would disappear as it would in most movies, or at worst, she would show up looking for him or to get something from his place and get abducted.\r\n\r\nThe re-return to the original story line is almost funny enough itself in concept, but in actuality I just end up waiting to get back to the movie, and they do things like that throughout the entire movie.\r\n\r\nIt is conceivable when things are happening to the main characters that derail them, but when they're actively derailing themselves, then it just gets sad.  You start to question things that you shouldn't, and it's not even because they're high, as they directly have a conversation about how the weed is really bad for them, given everything that is happening.\r\n\r\nI'm not a fan of drug humor, or abuse humor (usually), and everything that isn't that is so ridiculous that it's hard to like.\r\n\r\nThere are good jokes woven in here, but a lot of this is \"I wanted to make a movie with my  buddy while we act like idiots\", and as a fan of Kevin Smith, I respect that, but that should put you in the frame of mind that this isn't a top tier movie, and Kevin Smith writes better dialogue.", "created_at": "2020-09-20T21:48:32.908Z"}]