[{"movie_id": 803114, "review_id": "631391501511aa007ba3cf48", "rating": 3.0, "review_text": "The story was good, but acting was bad and the devastating part of this movie was horrible CGI. Such CGI in 2022 isn't acceptable.", "created_at": "2022-09-03T17:39:28.493Z"}, {"movie_id": 803114, "review_id": "631fa839e55937007f379a48", "rating": null, "review_text": "YouTube Red type beat :/\r\n\r\nAlica Silverstone was definitely a miscast here", "created_at": "2022-09-12T21:44:25.807Z"}, {"movie_id": 803114, "review_id": "635fcb3007e281007db4ad7f", "rating": 1.0, "review_text": "the only \"terror that surfaced\" was the ACTING!", "created_at": "2022-10-31T13:18:40.749Z"}, {"movie_id": 803114, "review_id": "63bf5705e16e5a00819112b0", "rating": 6.0, "review_text": "To put it straight forward, this movie has its fair share of reviews from both ends of the spectrum. Is this a perfect film? No, far from it. Is it an awful film? I don't think that either.\r\n\r\nThere are reviews calling this the 'worst shark movie ever made' and a 'waste of time'. Though it is definitely flawed, I wouldn't even go near that. When people say that, they must either be referring to the entire film or just the third act, because the sharks really don't even show up until then (this is actually a bit of a compliment).\r\n\r\nYes, the CGI sharks don't look their best, especially at the end. But I'd guess that the VFX team didn't have the required time to perfect them. And (*spoilers*), the ending with the shark killed by chomping on an anchor, feels like it was just pulled from \"The Shallows\".\r\n\r\nBut, there are actually some great (and even amazing) aspects to this film. Though the third act is where it all just kind of falls apart, the story is decent and the build up to the characters getting stranded at sea, and the tension of when their supplies and shelter get smaller in nearly every scene, is done pretty well. And the cinematography, especially in the beginning, looks absolutely gorgeous and professional.", "created_at": "2023-01-12T00:40:37.440Z"}, {"movie_id": 803114, "review_id": "63c173a98efe7300a0ead7a1", "rating": 1.0, "review_text": "**The Requin falls victim to its extremely annoying lead and a budget that apparently couldn’t afford water in its shark movie.**\r\n\r\nHaving an actress with some big-screen films on her resume would help The Requin rise above its cheesy shark movie competition, but it most definitely did not. In fact, the lead character of this movie was the worse part! Her frantic screams, frustrated outbursts, and emotional moments made the typical c-list shark movie actors look much better. It is shocking how annoying her performance was. On top of that, the green screen was very noticeable and overused, making me wonder how much water even made it into this movie. I am surprised that this director also made The Princess, which was a well-done, fun action movie. What happened to this movie, then? The Requin isn’t just a bad movie; it is bad for a bad shark movie! Don’t waste your time.", "created_at": "2023-01-13T15:07:21.354Z"}]