[{"movie_id": 184346, "review_id": "57f40c4bc3a3680560000301", "rating": 7.0, "review_text": "**An unusual team of two to fight the evil spirits!**\r\n\r\nThis was based on the real account. A cop from the New York who witnessed those unexplained events are what this film depicted for us. I think it is slightly an underrated film. Not because of true story, but from the entertainment perspective. From the beginning till the end, I enjoyed watching it. Horror means there's no big scary stuff in it, still being true to the genre, it told a decent story. It was well written and directed, a film that I almost missed, but now I can gladly suggest it to the others. But it is just an above average, yet worth a watch.\r\n\r\nThe story follows a cop who witnesses a series of strange events, which also influence his past. In the most of the case, he's trying to find one particular person, a painter seen in and around the city. So he and his partner finally find that strange man and when they do, it is already too late. One of them gets injured and the other one tries his best teaming up with a priest to fight the demon that terrorising the city. The film ends with an interesting event. Looks a sequel won't be a bad idea, since the duo is still fighting the devils as what the end statement reveals.\r\n\r\nThere's a recent television series I'm watching called 'Outcast' and this film is kind of resembles that. Anyway, this one came first, but what makes they both be alike is the unusual team up between two different field people. The series is like a follow-up of this film, or maybe inspired by this original story. Eric Bana is not everybody's favourite, but his films are quite enjoyable and for this, he had given his best. Co-stars are not bad either; particularly Edgar Ramirez was awesome as a priest. I hope you would find it interesting as I did. It would be beyond that for some, so all I say is watch it with a low expectations.\r\n\r\n_6.5/10_", "created_at": "2016-10-04T20:08:43.290Z"}]