[{"movie_id": 11892, "review_id": "53a2e3740e0a262271001640", "rating": 6.0, "review_text": "A pact made with relentless fire that requires that, while some live, others die.\r\n\r\nA modern spin on the Leopold and Loeb case, directed by Barbet Schroeder and starring Sandra Bullock as a cop with emotional baggage trying to prove that two high school kids (Ryan Gosling and Michael Pitt) have committed what they think is the perfect murder - just for kicks, allegedly.\r\n\r\nThere's nothing exactly awful about the film, it's well performed by the principal players, engrossing in narrative, beautifully lensed by Luciano Tovoli and Schroeder layers the production with a suitable feeling of unease. Sadly there's no psychological depth given the two boys by writer Tony Gayton, which renders the whole motives and means, and the investigation of such, as being a shallow exercise in thriller film making.\r\n\r\nRunning at two hours in length doesn't help matters, because this further irritates that more meat was not written onto Gosling and Pitt's bones, while it also exposes just how hackneyed and clichéd the picture is. Which when the story should be psychologically profound, marks this out as a frustrating viewing experience. 6/10", "created_at": "2014-06-19T13:19:48.428Z"}, {"movie_id": 11892, "review_id": "5fef88ce5907de003d38f78d", "rating": 6.0, "review_text": "Decent crime-thriller that I saw back in 2002 (probably in theaters as I did go on a weekly basis back then) and while never really impressed me, still found it watchable thanks to the performances from a young Ryan Gosling (only his fifth film) and Michael Pitt, and Sandra Bullock was alright as a damaged homicide detective. Plot plays like an episode of Criminal Minds, which isn't a bad thing to me. Also fun seeing Nick Offerman in a bit role. **3.25/5**", "created_at": "2021-01-01T20:40:46.734Z"}, {"movie_id": 11892, "review_id": "62c5422e3e6f2b03321f864e", "rating": 5.0, "review_text": "This is yet another role in which Sandra Bullock plays a cop on the outskirts of her team. She is \"Cassie\", a woman with intimacy issues who gets teamed up with \"Sam\" (Ben Chaplin) whom she toys with as if he were a kitten both personally and on their case to investigate what looks like the perfect murder. A distinct lack of clues leads her bloodhound nose to a school where, without the slightest shred of evidence, she alights on the wealthy \"Haywood\" (Ryan Gosling) to whom she takes an instant dislike. Further ferreting around lead the pair to \"Pendleton\" (Michael Pitt) who is partial to a little caviar, as was the corpse. Might they all be connected? I've rarely seen a potentially decent ensemble cast wasted like this. Bullock just isn't at the races, her character is frankly really quite boring and the rapport with the out of his depth Chaplin just doesn't work. There is the glimmer of an homo-erotic relationship between Gosling and the always enigmatic Pitt, but I think maybe that is just because my brain was scrabbling around trying to find a reason to make it through this really disappointing feature. In the end it is a battle of wills, and those who seem to hold all the aces play their hand as if their arms had been amputated; serendipity plays way too big a part in the denouement and at just shy of two hours, I found myself looking out of the window at the seagulls more than I might have liked. Not very good!", "created_at": "2022-07-06T08:05:02.789Z"}]