[{"movie_id": 75656, "review_id": "51bf611519c295526d174171", "rating": null, "review_text": "That movie was amazing !", "created_at": "2013-06-17T19:18:45.283Z"}, {"movie_id": 75656, "review_id": "51ca68ae760ee336d40e7226", "rating": null, "review_text": "Mantap di tunggu part 2 nya", "created_at": "2013-06-26T04:06:06.475Z"}, {"movie_id": 75656, "review_id": "5207d66a19c2957de6067c7e", "rating": 4.0, "review_text": "Lot's of FX and no story. Flat characters and poorly told.", "created_at": "2013-08-11T18:22:34.698Z"}, {"movie_id": 75656, "review_id": "559f0c61c3a36808140026f1", "rating": 9.5, "review_text": "Best magical movie ever definitely my number two movie of all time number one being Armageddon.the four horsemen couldent have been played by better actors and actress.isla fisher is awesome.😃", "created_at": "2015-07-10T00:05:53.616Z"}, {"movie_id": 75656, "review_id": "5f09d86c93db9200364f1bd5", "rating": 8.0, "review_text": "The closer you think you are, the less you'll actually see.\r\n\r\nNow You See Me is directed by Louis Leterrier and collectively written by Ed Solomon, Boaz Yakin and Edward Ricourt. It stars Jesse Eisenberg, Mark Ruffalo, Woody Harrelson, Isla Fisher, Dave Franco, Mélanie Laurent, Morgan Freeman, Michael Caine and Michael Kelly. Music is by Brian Tyler and cinematography by Mitchell Amundsen and Larry Fong.\r\n\r\nAn F.B.I. Agent and an Interpol Detective are tracking a team of illusionists who appear to be pulling off bank heists during their performances. Real magic? Or elaborate criminology?.\r\n\r\nWe are in the realm of the fantastical, where illusions and impossible tricks reside. It's a nifty backdrop to this splendidly flashy slice of misdirection hokum. Our four magicians, each with their own personal skills - and calling themselves \"The Four Horsemen\" - enact a number of elaborate stage shows that has all members of the law baffled.\r\n\r\nTheir rich benefactor played by Caine, is smug about his charges, Freeman is the myth buster trying to unearth the secrets of the \"four\", while the cops are constantly pulling their hair out. What does it all mean? How will it pan out at the end?. Well it's great fun, the tricks are expertly staged, the cast give gravitas to their respective characters, if only the big reveal at the end wasn't a bit too far out there...\r\n\r\nThere's a bit of a steal and a nod to another heist caper film, while that finale can make or break your overall opinion of the piece. Yet the journey is so enjoyable and intriguing, it's kind of forgivable anyway...  8/10", "created_at": "2020-07-11T15:19:08.684Z"}, {"movie_id": 75656, "review_id": "6326301dfd4a96007a294184", "rating": 7.0, "review_text": "**Now You See Me is a fun genre-mash-up with a fresh new take for heist film fans.**\r\n\r\nYou have seen magician movies like The Prestige and The Illusionist. You have seen heist films like Ocean's Eleven and The Italian Job. Now You See Me decides to combine the genres and make money disappear with a little Abra Kadabra. This clever and fun film puts its robberies on center stage for the crowd to marvel at their magic shows, making their audiences believe it's all part of the show. A cast of up-and-coming stars like Dave Franco and Jesse Eisenberg are coupled with high-caliber Hollywood veterans like Morgan Freeman, Michael Caine, and Woody Harrelson. Great laughs, fun characters, and an exciting plot really do the trick for Now You See Me. There are some pretty major plot holes, but if you don't take a movie about magicians pulling off complex heists in public before crowds while being hunted by authorities too seriously, you will love this movie.", "created_at": "2022-09-17T20:37:49.565Z"}]