[{"movie_id": 329135, "review_id": "55976b68c3a36855e8000a9a", "rating": 7.0, "review_text": "The pre-release buzz around Mani Ratnam's O Kadhal Kanmani was that it is a sequel to Alaipayuthey and while the maker has denied this, nonetheless, the film does feel like a spiritual cousin to the earlier film. The circumstances that led to the films couldn't have been any similar. At the time he made Alaipayuthey, Mani Ratnam had delivered a couple of films (Iruvar, Dil Se) that did not work at the box office and questions were raised on whether this avowedly mainstream filmmaker was not connecting with his audience. This time, after the failed experiments of Raavanan and Kadal, these questions are being raised yet again. \r\n\r\nAnd the filmmaker shows that his touch is in tact and he can still make a romance come alive on screen. With some help from PC Sreeram, whose gorgeous, superbly-lit frames capture the beauty of both Mumbai and the cramped quarters of the lead couple, and AR Rahman, whose hip songs and background score, keeps the scenes throbbing, Mani Ratnam has given us a romantic film for this generation. Unlike Kadal, which never came together as a whole despite some standout moments, the scenes here flow organically, and let us soak in the breezy romance between Adhi and Tara (Dulquer Salmaan and Nithya Menon, who sizzle on screen). \r\n\r\nThere are scenes that seem to mirror, as if purposefully, Alaipayuthey. As in that film, the meet-cute happens at the railway station and at a wedding. The pair woos each other on the train. Even the financial background of their families (Tara is super rich, while Adhi is a middle-class boy), and their fashionable jobs (if Alaipayuthey's Karthik was working in an IT startup and Shakti a medical student, Adhi here is a video game designer, while Tara is an architecture student) are similar. Like Shakti, Tara goes on a study tour (here, it is Ahmedabad) and like Karthik, Adhi follows his lover there. There is also an older couple as in that film informing their romance. And, there is even a search for a loved one that finally makes the lead couple realize what they actually want. \r\n\r\nBut this is a love story about youngsters from this generation, who tend to give career the same importance as relationship. So, unlike Karthik and Shakti, who couldn't wait to get married, Adhi and Tara want to be together but at the same time, realize that their relationship comes with an expiry date (much like Arjun and Meera from Ratnam's Ayitha Ezhuthu) as she will be moving to Paris for higher studies while he might go to the US or the UK to earn more money. So, they settle for a live-in relationship and stay in the house of the elderly Ganapathy ( Prakash Raj, who gives his most understated performance since his brief role in Vettaiyaadu Vilayadu) and Bhavani (Leela Samson making a spirited debut). Ganapathy is a retired bank officer and Bhavani, a classical singer whose Azheimer's is in its early stage. Their easy-going relationship is one of the highlights in the film. \r\n\r\nStill, for all its infectious vigour, crackling dialogue and youthful vibe, there are times when we sense that we are watching a film that is lacking in punch as this tale is short on conflicts. This is especially true in the second half when, after a point, the characters seem to be repeating themselves (the whole sequence when Adhi and Tara decide to enjoy their last few days to the hilt seems redundant). Too much screen time is also given to the video game that Adhi is developing (an action thriller set in Mumbai where the hero has to rescue the heroine from a two-headed villain), which feels like a script that Ratnam discarded at some point in his career. \r\n\r\nBut these are minor niggles that we need not be concerned too much about right now (but still need to be mentioned because we have come to expect so much from this director). They don't really take away much from how entertaining the film is, and more importantly, this is the time for us to celebrate a return-to-form of one of our premier filmmakers.", "created_at": "2015-07-04T05:13:12.123Z"}]