[{"movie_id": 567598, "review_id": "5e5dcc5555c9260017548768", "rating": 8.0, "review_text": "**_A savage and hilarious satire_**\r\n\r\n>_It hurts us to be paid so little. I have to do this and they sell one piece of clothing for more than I get paid in a month. We cannot eat nutritious food. We don't have a good life, we live in pain for the rest of our life and die in pain. Low wages is the main reason. How much burden can a woman take? Husband, children, house and factory work – can we manage all these with such a meagre salary? So we are caught up in the debt trap. Is there no solution for our problem? The targets are too high. They want 150 pieces an hour. When we can't meet the targ__ets, the abuse starts. There is too much pressure; it is like torture. We can't take breaks or drink water or go to the toilet. The supervisors are on our backs all the time. They call us donkey, owl, dog and insult us, make us stand in front of everyone, tell us to go and die._\r\n\r\n- Sakamma Mahadevaiah (sweatshop employee working for GAP supplier Texport Overseas in Bengaluru); \"India's clothing workers: 'They slap us and call us dogs and donkeys'\" (Gethin Chamberlain); _The Guardian_ (November 25, 2012)\r\n\r\n>_In 1911, 146 apparel workers died at the Triangle Shirtwaist factory in New York City when their building caught on fire. They jumped to their deaths in front of the very people who purchased the clothing they made. The outrage of seeing these people die lead to consumer and political activism to ensure this did not happen again. Better fire safety, building safety, and workplace safety standards came out of this activism. And during the twentieth century Americans fought and demanded for change. We got the minimum wage, the eight-hour day, workers' compensation, Social Security, the Clean Air Act, the Clean Water Act, and a whole lot more._\r\n\r\n>_By the 1960s and 1970s, the corporate response eventually became to move production overseas, first to Mexico, then to east Asia, and today all across Asia and Central America. They did so not only for cheap wages, but to avoid workplace safety regulations and environmental regulations. So in 2013, when over 1,100 workers die at Rana Plaza in Bangladesh, it is the same industry as the Triangle Fire, with the same subcontracted system of production that allows apparel companies to avoid responsibility for work as the Triangle Fire, and with the same workforce of young and poor women, the same type of cruel bosses, and the same terrible workplace safety standards as the Triangle Fire. The difference is that most of us can't even find Bangladesh on a map, not to mention know enough about it to express the type of outrage our ancestors did after Triangle._\r\n\r\n>_This separation of production from consumption is an intentional move by corporations precisely to avoid being held responsible by consumers for their actions. And it is very effective._\r\n\r\n- Erik Loomis; \"\"No one is making them stop\": Why corporations outsource catastrophe – and workers pay the price\" (Scott Eric Kaufman); _Salon_ (July 6, 2015)\r\n\r\n>_If someone gave you £1 every 10 seconds, it would take you more than 300 years to become a billionaire. Someone on the national minimum wage would have to work 69,000 years to get paid £1 billion, and a newly qualified nurse would have to wait 50,000 years. No one needs or deserves to have that much money, it is obscene._\r\n\r\n- John McDonnell (Shadow Chancellor of the Exchequer), speech on November 18, 2019\r\n\r\nWe live in an era where wealth is distributed upwards and the gap between the haves and have-nots has become wider than ever. According to inequality.org, the richest 1% of the world's population controls 45% of global wealth, whilst adults with less than $10,000 capital make up 64% of the population and control less than 1% of the wealth. In 2018, Oxfam reported that the wealth of the 26 richest people in the world was equal to the combined wealth of the 3.5 billion poorest people. This is the _milieu_ of _Greed_, a hilarious satire from incredibly prolific genre-hopping writer/director Michael Winterbottom (_Family_ (TV); _Welcome to Sarajevo_; _24 Hour Party People_; _Code 46_; _A Cock & Bull Story_; _A Mighty Heart_; _The Killer Inside Me_; _The Trip_ (TV); _The Emperor's New Clothes_). Examining how the rich get richer whilst the poor get unpaid jobs building faux-Roman coliseums on Greek islands, the film focuses specifically on a successful British clothing entrepreneur, and its bread and butter is the concomitant grotesquery that results when an individual has the same wealth as a small country. Effectively mixing send-up and satire with more serious socio-economic points, _Greed_ doesn't really do or say a huge amount that hasn't been done or said before, but it's entertaining, amusing, and undeniably relevant.\r\n\r\nSir Richard McCreadie (Winterbottom's regular leading-man Steve Coogan in full-Steve Coogan mode) is one of Britain's richest men, and in possession of Britain's whitest teeth. The perma-tanned \"self-made\" billionaire is the owner of several thriving clothing chains and is known as \"the King of the High Street\", although a less complimentary nickname is \"Greedy\" McCreadie. The non-linear narrative depicts three main events in McCreadie's life. We see his rise to power, when, as a young man (played by a wonderfully loathsome Jamie Blackley), he opens multiple businesses (all of which fail) as he learns the ins and outs of asset-stripping, the importance of using foreign sweatshops, and how to exploit realty and tax practices without breaking the law. In the modern-day, we see him hauled before a Parliamentary Select Committee convened to investigate the bankruptcy of one of his chains. And, in the film's present, on the Greek island of Mykonos, the final (chaotic) touches are being put to McCreadie's Roman-themed 60th birthday bash – complete with mandatory togas, a fake coliseum, and a real, albeit somnolent, lion (McCreadie is obsessed with Ridley Scott's _Gladiator_ – and yes, the fact that there were tigers rather than lions in that movie is brought up several times). The party is scheduled to take place in a couple of days, or at least it will if the underpaid Bulgarian workers will ever finish the coliseum, the optically-unappealing Syrian refugees will ever leave the nearby public beach, and the litany of celebrities who promised to swing by will ever stop cancelling.\r\n\r\nMuch of the story is told through the lens of McCreadie's \"official biographer\" Nick (David Mitchell in full-David Mitchell mode), a classically-trained literature buff who drops quotes from Shakespeare and Shelley into everyday conversation, and who hates himself for agreeing to write a fawning celebration of McCreadie – a task which sees him shadow the man himself on Mykonos, having previously visited McCreadie's Sri Lankan sweatshop to talk to the workers about how much they love their job and 'appreciate' McCreadie for employing them. We also meet Margaret (Shirley Henderson in heavy makeup), McCreadie's acerbic Irish mother, who's been with him every step of the way; Samantha (Isla Fisher), McCreadie's ex-wife, who's come to Mykonos with her spectacularly French boyfriend, François (Christophe de Choisy), although it's obvious she and McCreadie still have feelings for one another; Naomi (Shanina Shaik), McCreadie's current wife; Finn (Asa Butterfield), McCreadie and Samantha's obviously damaged son, who has a penchant for bringing up Oedipus's patricidal tendencies to anybody within earshot; Lily (Sophie Cookson), McCreadie and Samantha's daughter, who's filming a (staged) reality TV show with her obviously gay 'boyfriend' Fabian (Ollie Locke); Melanie (Sarah Solemani), the under-pressure party-planner; Frank (Asim Chaudhry), the world's most laid-back lion handler; Amanda (an extremely impressive Dinita Gohil), McCreadie's overworked PA, who comes to occupy the spotlight in a very unexpected manner; a cadre of (hilariously bad) lookalikes for all the guests who've cancelled, in an effort to fool the press (the Rod Stewart and George Michael jokes are especially worth looking out for); and a host of (real) celebratory cameos, including Stephen Fry, James Blunt (a viciously self-effacing appearance that's one of the funniest moments in the film), Pixie Lott, Ben Stiller, Colin Firth, Fatboy Slim, Ed Sheeran, and Caroline Flack (to whom the film is dedicated).\r\n\r\nThe idea that a billionaire could be so cut off from workaday reality as to stage a Roman-themed birthday party on a Greek island may sound far too on the nose, too ridiculously hubristic to say anything of any worth, and too over-the-top to even function as satire. However, it's worth noting that McCreadie is based on Sir Philip Green, chairman of the Arcadia Group (which owns, amongst others, Dorothy Perkins, Miss Selfridge, Topman, Topshop, and Wallis), avoider of taxes, exploiter of the working-class, asset-stripper, and enemy of the #MeToo movement. Similarly, many of the details of McCreadie's ludicrous birthday are lifted verbatim from Green's very real 50th birthday celebrations in 2002 – when he flew 219 guests to Cyprus for a three-day toga party which featured live performances from Tom Jones and Rod Stewart (and, while we're on subject, the party for his 60th was even more lavish).\r\n\r\nMcCreadie, of course, is a hilariously despicable slimeball, a man who unironically feels hard done by when Syrian refugees show up on the (public) beach he's using for his birthday, and both Coogan and Blackley portray him as not only narcissistic and void of conscience, but as a completely classless philistine – whereas Nick, for example, can quote Shakespeare and recite Shelley, lofty symbols of Englishness both, McCreadie proudly gets his cultural know-how from BrainyQuote (unless he's quoting _Gladiator_, which he appears to know word-for-word). However, the important point is that for all his loathsomeness, McCreadie is a symbol for the system that gave rise to and sustains him. He and those like him didn't arise in a vacuum; he's simply the result of an economy that takes from the poor and gives to the rich. For all his crass hubristic excess, McCreadie is neither an aberrant individual nor is he a criminal – he's an especially vulgar product of the system. And, with the crushing defeat of Labour in the 2019 English general election, it seems he's the product of a system which the vast majority of people appear to support.\r\n\r\nThe film gets pretty serious towards the end, and before the closing credits, a series of title cards detail some of the facts and figures of global economic disparity, particularly concerning the vast gulf between those who make the clothes we wear and those who sell them to us. Originally, these cards named specific brands as especially guilty of exploiting sweatshop employees, pointing out, for example, that workers in Myanmar earn $3.60 a day making clothes for H&M, whilst owner Stefan Persson is worth $18 billion, and workers in Bangladesh earn $2.84 a day making clothes for Zara, whilst owner Amancio Ortega is worth $68 billion. However, Sony Pictures International, which financed the film with Film4, refused to allow Winterbottom to use these cards, with company head Laine Kline telling him, \"_we're worried about the potential damage to Sony's corporate relations with these brands_\". And so replacement cards were used, which feature much of the same information but without reference to any specific companies or people. So how do we know what the original cards said? Because Winterbottom, very much in the viciously sardonic spirit of the film, read them out on-stage after the world première in Toronto! Kline, who was in the audience, was far from impressed, which may account for the shoddy advertising campaign, with the film being released into theatres with virtually no market awareness. Whatever the case, Kline seems unaware of the irony of his actions – in relation to a film which accuses the rich of all manner of shenanigans to insulate and protect themselves and their fortunes, a massive corporate entity has exerted its authority to protect other massive corporate entities. It's like something McCreadie himself would do.\r\n\r\nAesthetically, the film employs a plethora of techniques, including non-linear editing, direct-to-camera addresses, YouTube videos to provide exposition, split-screen, fake news footage, and title cards. It's all very Guy Ritchie, busy and flashy, presumably to mirror McCreadie's own excess. However, the film is at its most effective when at its simplest, particularly in scenes involving the wonderful Gohil. Amanda's interactions with Nick provide the emotional core of the story, and there's nothing bombastic or ostentatious about their construction – it's all simple shot/counter-shot editing and blocking. And by far the film's best sequence, which comes towards the end, is another simple setup involving Amanda, McCreadie, and a third character who I won't name, as it would be a spoiler. With a terrifically emotive piece of music by Harry Escott (_Shame_; _The Selfish Giant_; _Journeyman_), this scene tells its story not through aesthetic construction or even through dialogue, but through the expression on Gohil's face. It's the moment during which Winterbottom drops all pretence of comedy and focuses on the more serious issues that have hovered at the fringes since the opening seconds.\r\n\r\nI've seen it said by some critics who disliked Greed that taking pot-shots at the super-rich is easy, which is undoubtedly true. But does that somehow imply we should stop doing so, that they're not a valid target for satire? Just because criticising such ilk is \"easy\", that doesn't mean such criticisms are invalid. That's like saying, \"_Nazis were evil and all, but they're an awfully easy target for criticism_\". Yes, they are. As they should be. Personally, my biggest problem with the film would be two underdeveloped subplots. The reality TV show subplot provides for some very funny individual moments, but it contributes nothing whatsoever to the main plot. Additionally, the fact that McCreadie and Samantha are still in love with one another never really goes anywhere, which is a shame, as it could have provided some much-needed character development for her and some shades of grey for him.\r\n\r\nSociety does not need billionaires. Capitalism would be just fine without billionaires. But, for better or worse, we live in an age where there are more billionaires than ever before and the gap between their wealth and the wealth of the poorest members of society is only growing wider. Equal parts funny and disturbing, _Greed_ is a comedy about the excess and disconnect of such people, but so too is it a cautionary tale, a reminder that just because we're removed from exploitation doesn't mean such exploitation isn't happening.", "created_at": "2020-03-03T03:17:41.320Z"}, {"movie_id": 567598, "review_id": "5ebde5e015a4a1001e9cb0a1", "rating": 5.0, "review_text": "'Greed' is a so-so comedy; I wouldn't say it's worth your time unless you're a fan of some of the actors. The comedy is surface-level fine; no one is bombing, but no one is succeeding. The film does stumble with its handling of sweatshops and the fashion industry, and that's more than enough to give this one a miss.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-greed-mockumentary-misses-both-comedy-and-social-commentary-beats", "created_at": "2020-05-15T00:44:16.908Z"}, {"movie_id": 567598, "review_id": "5f4d28bc140bad00328b4e89", "rating": 6.0, "review_text": "“Greed” is overstuffed with so much social commentary that its bursting at the seams. The film tries to tackle too many hot topics, including the selfishness and sins of the mega-rich, the excesses of the fashion industry, the exploitation of mistreated factory workers, and the plight of impoverished refugees. Its themes may be crowded, but the film is never boring.\r\n\r\nThe movie tells the fictional story of luxury fashion retail honcho Sir Richard McCreadie (Steve Coogan), an idiot narcissist billionaire who is an excellent villain for modern times. Sir Richard is planning a spectacular themed 60th birthday party on the Greek island of Mykonos, and price is no object when it comes to having proper silverware, a “who’s who” guest list of the hottest celebrities, the finest gourmet cuisines, and a hand-built replica of the Roman Colosseum, complete with a gladiator match featuring a live lion.\r\n\r\nThere’s a moral outrage that intensifies as this slightly satirical story turns darkly tragic, and the dialogue is crisp and witty as screenwriter (and director) Michael Winterbottom aims his pen squarely at the target of Western capitalism. But despite an extremely satisfying ending and the film’s heart being in the right place, “Greed” isn’t as hard-hitting as it could (or should) be. It feels far too real for that.", "created_at": "2020-08-31T16:43:40.130Z"}, {"movie_id": 567598, "review_id": "62421b1b0e5aba008fd0d97a", "rating": 5.0, "review_text": "It is probably best just to assess this satirical comedy on a superficial level; otherwise the hypocrisy is overwhelming. Steve Coogan plays a self made gaziliionaire who is organising a no expense spared celebrity 60th birthday party for himself on Mykonos. In cahoots with his ex-wife Isla Fisher and his mother Shirley Henderson we are exposed to the most vulgar and crass aspects of the mega-rich lifestyle in which they live whilst at the same time exploiting just about everyone that they come into contact with - regardless of gender, education or ethnicity. Jamie Blackley \"Young Richard\" takes what plaudits there are in this. He is expelled from his posh private school school for regularly fleecing the other pupils; next he is fleecing those in the London rag trade before setting up a discount store that sets the ball rolling for his future billion pound enterprise. Coogan is good as the odious and exploitative \"McCreadie\"; David Mitchell really wooden as his autobiographer \"Nick\" and we have a few scenes for Asa Butterfield as his slightly geeky son \"Finn\" but the rest of this has mis-information and double standards written all over it. The comedy is obvious; the constant parodies from \"Gladiator\" (quite why the lines spoken in that film by Richard Harris were being delivered by Coogan is an Australian accent was a bit puzzling) grate after a while and the ending just downright ridiculous. If it is attempting some sort of social commentary on how the wealthy get rich on the backs of others then it needed to be much better informed and make some attempt to reconcile the aspirations of rich and poor alike - as well as those of the ever-thrifty, something for nothing consumers living in countries of the \"west\" and their mind-numbingly incompetent legislators.", "created_at": "2022-03-28T20:31:23.999Z"}]