[{"movie_id": 641, "review_id": "557c9680c3a368632300242e", "rating": 9.0, "review_text": "Shattering expose of the fallible human condition.\r\n\r\nWhat to say about Darren Aronofsky's Requiem for a Dream that hasn't been said already? Without doubt it's a film, that in spite of its high standing on the main movie sites, polarises opinions. It's a film that in simple terms follows four people through their addictions until the shattering denouement, but the journey is made more bleak by offering tantalising snatches of hope, the dreams of the protags offered up as some sort of goals for the addicts to cling on to - only for the narrative to stick in its rusty serrated blade to draw the lifeblood from the hapless hopefuls.\r\n\r\nArononfsky brings a multitude of technical skills to the party that emphasise the emotional discord on show. Standard split-screening is married up with rapid cutting, isolated framing, close ups, long tracking and Snorricam, all of which is sound tracked by Clint Mansell's haunting musical composition. All told it's an assault on all the senses and terrifying with it, boosted no end by Aronofsky getting top performances from his cast of actors. Love it or hate it, it's a film that simply can't be ignored, unsparing cinema produced by a most gifted director. 9/10", "created_at": "2015-06-13T20:45:52.344Z"}, {"movie_id": 641, "review_id": "5f78d0a89a64350036a4e2c8", "rating": 9.0, "review_text": "Only my second viewing of this, last time probably was when it came out on DVD, and not one I'll re-watch anytime soon, but still a great drama featuring incredible performances, most notably Ellen Burstyn who was worthy of her Oscar nomination. Has some darkly wild moments and a swing in tones, guess giving viewers insights into the highs and lows of heroine use. Not entertaining in so much as fascinating film worth it for some of the visuals and acting. **4.5/5**", "created_at": "2020-10-03T19:27:36.155Z"}, {"movie_id": 641, "review_id": "600bad8dc86b3a003fbdcccd", "rating": 7.0, "review_text": "I've never been so afraid of a refrigerator.", "created_at": "2021-01-23T05:01:01.381Z"}, {"movie_id": 641, "review_id": "6578d1e8bbe1dd011b90c9a5", "rating": 9.0, "review_text": "Requiem for a Dream is a  psychological drama movie by Darren Aronofsky, based on a 1978 book of the same name by Hubert Selby (1928-2004) that passes in NY in the 70's era of drugs.\r\n\r\nThe book was written already with Hubert thinking about a movie and had a screenplay for it and approached Aronofsky with it in hands, and Darren rewrote the screen with the help of the writer plus directed the film, being his second official movie after Pi.\r\n\r\nWith a small cast of protagonists Ellen Burstyn (Sara Goldfarb) mother of Jared Leto (Harry Goldfarb), Jennifer Connelly as Marion Silver (Harry girlfriend) and Marlon Wayans as Tyrone C. Love (Harry's friend).\r\n\r\nIt passes in the four stations of one year of 70 to 80's in New York Coney Island district - Sara's son Harry is a drug addicted drop out jew student of high college that constantly sells his mother TV set to pay for various drug including heroin, crack and marihuana, aided by his friend Marlon. He has a, aspiring fashion student addicted as well and share his drugs with her.\r\n\r\nThe plot follows a drug enriched summer through the months each one reflecting the drugs effect from the use, high and withdraw with the seasons, involving also Sara as she is a lonely widow that lives watching shows on television about weighting loss and dreams to be in one. One day she receives a letter saying that she was selected to maybe star on one of those and after failing diet she tries to loose weight with prescribed drugs that induces to addiction as the body arrange itself with the dose. \r\n\r\nThis drama as most of Aronofsky's movie have a very different way of showing up the passing of time and the drugs, into a magnificent and frenetic way as I must say - I am an Aronofsky fan, and at least for me. he is into my top 10 directors/ writers list.\r\n\r\nThe acting of young Leto and Connelly in the start of career are superb and Ellen Burstyn won an Oscar for her performance. It isn't an easy movie to watch but it shows the way drugs act in a realistic way of euphoria in short bursts hip hop sequences and the sudden drastic effect of withdraw as it wrecks the life of the protagonists. Especially towards the end the movie is very heavy to watch, as expected especially at the start of the 2000's. \r\n\r\nSeveral cinematography techniques as split screen, timelapses, long shots and close-ups are used, and editing was strenuous\r\nusing as 4 times more sequences than an usual movie due to the frenetic nature of drug use. \r\n\r\nAs Aronofsky was into the start of his career I suspect he was not indicated to more Academy awards like editing, cinematography and original soundtrack (using string quartet arrangements of Kronos Quartet) written by Pulitzer Prize-winning composer David Lang.\r\n\r\nEven now, 20 years after the making it is an very enjoyable and a must see movie like the director works to understand how revolutionary it was at the time. It is as important to drug addiction as Kids was to Sex (never watched Trainspotting so I can't correlate). \r\n\r\nFor my an easy 9.5 out of 10.0 / A + and a masterpiece of traditional techniques that is a must see to any cinema lover.", "created_at": "2023-12-12T21:34:32.383Z"}]