[{"movie_id": 530915, "review_id": "5df0c1f60257640018582fd5", "rating": 9.0, "review_text": "I really wanted to give this film five stars, but there is a curious introspection that prevents me from calling it perfection. Nevertheless, ‘1917’ is a brilliant piece of art, and clearly a personal project for Sam Mendes. Blending groundbreaking technology with detailed production components, it's sure to entertain audiences and garner respect from critics for its execution. Just don’t say I didn’t warn you when the Oscar nominations come out.\r\n- Charlie David Page\r\n\r\nRead Charlie's full article...\r\nhttps://www.maketheswitch.com.au/article/review-1917-sam-mendes-personal-war-story", "created_at": "2019-12-11T10:16:22.494Z"}, {"movie_id": 530915, "review_id": "5e1e99815c071b0013630cce", "rating": null, "review_text": "Without a doubt, cinematically this is a visual tour de force. The one-shot approach becomes a distraction, at times, especially when one ponders \"how did they do that?\", but generally not enough to take away the wow factor.\r\n\r\nThe story, and dialogue, not to mention logic are the real problems that take this movie from great, to merely good.\r\n\r\nThe initial concept of sending two men on an imperitive mission to save 1600 men is ludicrous in itself, especially in a war where men were gassed and gunned down by the thousands. Sending only two of them into unknown situations, in no-man's-land was illogical.\r\n\r\nThen there was the fact the hero seems to never get shot by enemy soldiers, despite being in dead-duck situations. When he does get injured, his wounds seem to magically heal and disappear instantly. Director Sam Mendes must have never had the concussive effects of explosions explained to him, because while some fall from explosions, the heroes seem immune to physics.\r\n\r\nThe most ludicrous scene involves booby-trapped explosives, and a collapsed ton of rocks leaving not only no visible injuries, but no effects at all on clothing or hearing. But there was dust in the eyes.\r\n\r\nThere are many more scenes involving lack of logic, or credibility. \r\n\r\nOver-all, the movie is worth it for the cinematography, attention to detail, costumes and acting, but the trite story, and credibilty problems drag it down from what it should, and could have been.", "created_at": "2020-01-15T04:48:01.039Z"}, {"movie_id": 530915, "review_id": "5e2371c4eb09320016f817b6", "rating": 8.0, "review_text": "Finally yesterday I was able to experience 1917 and I ended up doing it at IMAX, something I didn't plan on, but after seeing it there, I can say this film deserves to be seen and heard in an IMAX room to remember why movies still need to be lived on a big screen.\r\n\r\nThe visual odyssey of Sam Mendes and Roger Deakins is an incredible journey. Yes, the story is very thin but that's something that made 1917 a somewhat different film\r\nIt's not a war epic, nor does it try to be one. It's kind of a lone wolf war story, though at the beginning it wasn't like that, and that's good because despite everything that happens, the film doesn't lose that sense of camaraderie at the task that remains after the loss.\r\n\r\n1917 is a story of survival and that although it could not be considered completely original, that's totally the least of its problems because after all the experience is just spectacular.\r\n\r\nI admit the film has certain rhythm dropouts that I didn't like, especially the scene where Schofield loses consciousness, but at that point we are given the extraordinary night sequence, so my discomfort ended up disappearing.\r\n\r\n1917 is not a perfect film, but it's a reminder of how wonderful is to enjoy a film as they should be, even if it's a film that deals with the horrors of war.\r\n\r\nThis is the kind of film that should be lived and experienced that way, otherwise it loses its resonance, so if you have the chance to see 1917 at a big screen do it.", "created_at": "2020-01-18T20:59:48.987Z"}, {"movie_id": 530915, "review_id": "5e28f6959638640019ab1d5b", "rating": 8.0, "review_text": "**_Although partly a technical showcase rather than a story, it's still a terrific Great War movie_**\r\n\r\n>_In the newspapers you read: \"Peacefully they rest on the spot where they have bled and suffered, while the guns roar over their graves, taking vengeance for their heroic death\". And it doesn't occur to anybody that the enemy is also firing; that the shells plunge into the hero's grave; that his bones are mingled with the filth which they scatter to the four winds – and that, after a few weeks, the morass closes over the last resting-place of the soldier._\r\n\r\n- Kanonier Gerhard Gürtler (Königlich Bayerisches 3. Feldartillerie-Regiment Prinz Leopold)\r\n\r\n>_Bent double, like old beggars under sacks,_\r\n\r\n>_Knock-kneed, coughing like hags, we cursed through sludge,_\r\n\r\n>_Till on the haunting flares we turned our backs,_\r\n\r\n>_And towards our distant rest began to trudge._\r\n\r\n>_Men marched asleep. Many had lost their boots,_\r\n\r\n>_But limped on, blood-shod. All went lame; all blind;_\r\n\r\n>_Drunk with fatigue; deaf even to the hoots_\r\n\r\n>_Of gas-shells dropping softly behind._\r\n\r\n- Wilfred Owen; \"Dulce et Decorum Est\" (1921)\r\n\r\n>_No tactical or strategic gain was made on the Somme front that was worth the cost in lives. Even had the British and French achieved their breakthrough on the Somme, the Germans had plenty of room to manoeuvre and, unlike the French at Verdun, no national interest in staying where they were. During the winter of 1916-17, the Germans simply withdrew to the Hindenburg Line, east of the Somme battlefield, and it all had to be done again._\r\n\r\n- Robin Neillands; _Attrition: The Great War on the Western Front – 1916_ (2001)\r\n\r\n>_In the Somme valley, the back of language broke. It could no longer carry its former meanings. World War I changed the life of words and images in art, radically and forever. It brought our culture into the age of mass-produced, industrialised death. This, at first, was indescribable._\r\n\r\n- Robert Hughes; _The Shock of the New_ (2004)\r\n\r\nMy paternal grandfather fought during the Great War. Corporal Edward J. Campbell was with the 9th Battalion of the Royal Dublin Fusiliers, 48th Brigade, 16th (Irish) Division and took part in the capture of Ginchy on September 9, 1916 during the Battle of the Somme. My dad was born in 1933, and in all the years that came afterwards – even when he himself joined the RAF – his father never spoke about those years.\r\n\r\nThe Great War broke men in ways the likes of which had never been seen before, and perhaps have never been seen since. It exposed men to psychological horrors inconceivable to most people today. The nature of trench warfare and the concomitant use of artillery on a scale beyond anything in human history did such things to men's minds that even thousands of those who returned never really left the battlefields. We've all seen \"Shell shocked soldier, 1916\", one of the most haunting photographs ever taken, and the picture it paints is a disturbingly vivid one. But what makes the Great War, the so-called \"war to end all wars\", so much worse than it had to be was that it pitted old school tactics against modern weaponry. Generals on both sides believed the war could be won, as others had been, by sending wave after wave of men \"over the top\" in an attempt to overwhelm enemy positions. However, such tactics failed to take into account advancements in weaponry, with combatants defending their trenches with miles of machine-gun emplacements and fields of landmines, reinforced with the war's most successful killer – endless artillery barrages. The technology had advanced. The tactics had not. Which led to the nine-month stalemate of the Battle of Verdun (February 21 to December 18, 1916), during which the Germans lost 143,000 men and the French lost 163,000. Which led to the first day of the Somme (July 1, 1916), when the British suffered nearly 20,000 loses in less than 12 hours. Which led to the unimaginable slaughter of the hell-come-to-Earth that was the Third Battle of Ypres, better known today as Passchendaele (July 31 to November 10, 1917), where at least 400,000 men died, maybe as many as twice that.\r\n\r\nEvery soul who fought in those battles is gone now. The last surviving combat veteran, Chief Petty Officer Claude Choules, who joined the Royal Navy in 1915, aged just 14, died at the age of 110 in 2011. And unlike conflicts such as World War II or Vietnam, The Great War has largely dropped from the popular consciousness. Not just the reasons why it was fought, but the conditions in which it was fought. Even celebrated films such as Lewis Milestone's _All Quiet on the Western Front_ (1930) or Stanley Kubrick's _Paths of Glory_ (1957) aren't all that well known. And that's one of the reasons that films like 1917 are important – they ensure we don't forget.\r\n\r\nWritten by Sam Mendes and Krysty Wilson-Cairns, _1917_ is very loosely based on stories told to Mendes by his grandfather Alfred Hubert Mendes, who was a front line messenger during the war, and who, at 5'4\", was able to use the low-lying No Man's Land mist as cover without having to stoop or crawl, and thus was much faster compared to other messengers. The film is directed by Mendes (_American Beauty_; _Revolutionary Road_; _Skyfall_), and unless you've been living under a rock, you'll know that it's done in such a way as to give the impression that it all takes place in two single shots (the marketing material says one shot, but it's two – there's a cut-to-black time-jump about midway through the film where no attempt is made to hide the transition). In reality, of course, there are a lot more than two shots (the longest single shot was just over 8 minutes), but the edits have been digitally 'hidden', much like Alejandro González Iñárritu's _Birdman or (The Unexpected Virtue of Ignorance)_ (2014) or Erik Poppe's _Utøya 22. Juli_ (2018). Working with legendary cinematographer Roger Deakins (_Kundun_; _No Country for Old Men_; _The Assassination of Jesse James by the Coward Robert Ford_; _The Reader_; _Blade Runner 2049_), Mendes wanted the film to be the most immersive war movie ever put on screen, with the story designed to take place in real-time so as to ensure the importance/relevance of the single-shot aesthetic. And although I have some issues with it, and I certainly don't think it's the greatest war movie ever made, by and large, I think Mendes has made an exceptional film, one in which form and content are unusually tightly matched, with the style extremely effective at delivering the story in a thematically justified manner.\r\n\r\nApril 6, 1917; the Western Front. Two young British Lance Corporals, Will Schofield (George MacKay), a veteran of the Somme, and the younger, more idealistic Tom Blake (Dean-Charles Chapman) are summoned to a meeting with General Erinmore (Colin Firth). Recently, German forces have fallen back, and Colonel Mackenzie (Benedict Cumberbatch) of the 2nd Battalion, Devonshire Regiment believes that if he attacks now, he will break the line and turn the tide of the war. However, he's unaware that the retreat is a tactical gambit – the Germans have fallen back to the heavily fortified Hindenburg Line and are lying in wait. With communication lines cut, Schofield and Blake, who has a brother in the 2nd, are given a simple but dangerous mission – to physically carry an order from Erinmore to Mackenzie calling off the following morning's attack, a mission which will involve them crossing into No Man's Land and traversing the Germans' former position. If they fail, 1,600 soldiers will be slaughtered. Mackenzie is six miles away. They have ten hours.\r\n\r\nSo, the film's big selling point is its aesthetic design. The use of the single-shot format is such a noticeable and idiosyncratic type of form that whenever it's used, it automatically places pressure on the content, which must justify why the film is shot this way, why it would lose something inherently thematic if shot conventionally. If the content can't do that, in other words, if the content can't justify the form, the form becomes gimmicky, drawing attention to itself. Think of, for example, Alfred Hitchcock's _Rope_ (1948), which was edited to look like one shot, or Sebastian Schipper's _Victoria_ (2015), which was legitimately one shot. Very little in either film justifies the stylistic design – shoot them conventionally and they're still broadly the same film thematically. Compare this with genuine one-shot films such as Mike Figgis's _Timecode_ (2000) or Alexander Sokurov's _Russkij Kovcheg_ (2002), and edited one-shot films such as Gustavo Hernández's _La casa muda_ (2010) or the aforementioned _Utøya 22. Juli_. Whether it's the spiralling nature of events in _Timecode_, the elegant cause-and-effect historical sweep of _Russkij Kovcheg_, or the real-time pressure and escalation of _La casa muda_ and _Utøya 22. Juli_ these films tie form to content in such a way that they become indistinguishable – form _is_ content, content _is_ form. And I think Mendes achieves like synergy.\r\n\r\nIs the one-shot effect distracting? At first, yes, it is a little, especially if you're playing the game of trying to spot where editor Lee Smith (_Master and Commander: The Far Side of the World_; _Elysium_; _Interstellar_) has hidden the transitions. But after sussing two edits in the first twenty minutes, I stopped looking, because I realised I was just pulling myself out of the film unnecessarily. In essence, once you go with the aesthetic on its own terms, you forget about trying to spot the edits and asking yourself, \"_how did they do that_\", instead of letting the cinematography do exactly what it's supposed to do – immerse you. This is a film that wants to try to convey what it was like to live and fight in those trenches, with Mendes stating, \"_I wanted people to understand how difficult it was for these men. And the nature of that is behind everything_\". And, it does about as good a job as any war film I can think of in evoking the psychical reality, if not necessarily the psychological (more on that in a moment).\r\n\r\nGenerally speaking, the majority of the film is shot in one of two ways – either the camera is behind Schofield and Blake, following their path, or it's in front of them, facing back towards them as they 'follow' its path. There are some minor deviations from this (a few drone shots, some side-on footage etc), but irrespective of that, the film never for one second leaves their presence. And because the two men are almost perpetually in motion, it means that the camera is almost perpetually in motion, lending not only a tremendous fluidity to the blocking, framing, and movement, but so too a natural motivation – if they're walking along a trench, we're walking along a trench; if they're moving stealthily through a bombed-out town, we're moving stealthily through a bombed-out town. Almost everything the camera does is because one or both of the protagonists are doing the same thing, further emphasising the correlation between form and content.\r\n\r\nThe opening scene serves as a superb introduction not just to the visual design, but to the reasons for employing that visual design and the effectiveness of doing so. The film starts with a shot of a daffodil field, before pulling back and revealing Schofield and Blake taking a break against a tree before being summoned to the meeting with Erinmore. They rouse themselves and begin walking, first past more resting soldiers, then a camp where food and laundry are being prepared, then down a ramp into the trenches, the bucolic opening moments giving way to barbed wire and dirt. Geographically, it's a short walk, but thematically, it covers considerable ground. In a film that's all about scale and scope, this sequence perfectly encapsulates one of the main thematic reasons behind the single-shot – to accurately convey the importance of geospatial relations. We see the tactile transition from Edenic to hellish because we're moving in real-time through the _milieu_ with the characters; we see the boundary between peace and war because the characters walk along that boundary. You shoot this opening sequence conventionally, and you undercut this sense considerably.\r\n\r\nAlong slightly more conventional lines, one also has to commend the work of production designer Dennis Gassner (_Bugsy_; _Waterworld_; _Into the Woods_). Every location is visually unique – from a German bunker to an abandoned farmhouse to the bombed-out remnants of Écoust-Saint-Mein, and every location feels authentic and lived in. His design of No Man's Land is especially laudable, not just in terms of the expected mess of barbed wire and debris, but in the use and positioning of dead bodies, dead animals, and semi-destroyed machinery, with the whole thing having an almost post-nuclear desolation feel. Indeed, the film's No Man's Land is designed thematically. Mendes has said, \"_the first World War starts with literally horses and carriages, and ends with tanks_\", and this is mirrored in Gassner's designs. When the men first crawl into No Man's Land, they immediately encounter a rotting fly-covered horse carcass. Gradually, however, the battlefield becomes more mechanised, until they eventually pass through a German artillery position.\r\n\r\nAlso in a slightly more conventional sense, one has to mention Deakins work during the nighttime scenes in Écoust-Saint-Mein. The entire village has been reduced to nothing but the shells of buildings, and as we pass through the town, the only source of light is from the flares arching through the sky, which create very hard shadows in constant motion. The whole thing is almost otherworldly, and as the garish light traverses the sky, it's as if the ground itself is in motion, almost liquid-like, with the protagonists desperately trying to time their movements to ensure they stay hidden in the constantly shifting shadows. It might be a little too aesthetically beautiful for a film aiming for such gritty realism, but for aspiring cinematographers, you won't find a better study in how to compose an image using light and shadow.\r\n\r\nThematically, by its very nature, _1917_ is far more focused on the micro than the macro – you might learn something about life on the front, but you'll learn nothing about the politics behind the conflict, or even a sense of who's winning. Partly because of this, the film avoids, for the most part, the overwrought patriotism found in so many American World War II movies, the kind of cartoonish jingoism that made Steven Spielberg's _Saving Private Ryan_ (1998) so obnoxious. Indeed, it's relatively unimportant which side the protagonists are even on – their mission could have come from any of the combatants. Their nationality is largely anonymous, which is not something you can usually say of a war film, but which does illustrate just how irrelevant lofty political issues were at ground level, with everyone simply trying to survive as best they can.\r\n\r\nOn the other hand, however, because the film is so tightly focused, you shouldn't expect too much psychological insight. If you're anticipating an existential treatise along the lines of Terrence Malick's _The Thin Red Line_ (1998), you'll be severely disappointed. Malick's masterpiece is, for my money, the greatest war picture ever made precisely because it subverts at every moment what a war picture is supposed to be. It's about the war within rather than the war without, about nature's indifference to humanity's self-destruction, about the damage war does not to the mind or the body, but the soul. _1917_ is nowhere near this kind of thematic complexity, it's not even playing the same game, but I would value its simple individualised insights above something like the empty temporal trickery of Christopher Nolan's _Dunkirk_ (2017), which leans far too heavily into the \"keep a stiff upper lip chaps\" style of British filmmaking for my liking.\r\n\r\nIn terms of problems. I've seen some critics argue that the one-shot structure is a gimmick which draws attention to itself, and thus, rather than being immersive actually has the opposite effect. I admit that the film does take a little getting used to, but you soon settle into its rhythms (or lack thereof). I would agree that the story is paper-thin, but that's pretty much by design. One criticism I did have, however, is how well-groomed Scholfield and Blake constantly are, each with a perfect set of teeth. One only need watch Peter Jackson's _They Shall Not Grow Old_ (2018) to see how unrealistic this is. Indeed, for most of the runtime, the duo look like they've just stepped out of the makeup trailer, and it's glaring enough on a couple of occasions to pull you out of things.\r\n\r\nAll things considered though, I thoroughly enjoyed _1917_. I thought the single-shot strategy worked exceptionally well, and even if the film is weak from a character/storyline/theme perspective, it didn't really matter when the form and content are this well matched. This could have become an empty technical exercise predicated on nothing, but Mendes hasn't allowed that to happen, and instead, it's a war film that does justice to its subject. The more one knows about the Great War, the more one realises that it was hell on Earth. _1917_ doesn't make us feel what that hell was like. Because no film, no art form, can do that. But it's a damn good approximation.", "created_at": "2020-01-23T01:27:49.293Z"}, {"movie_id": 530915, "review_id": "5e2c813e1685da0011e6f0bf", "rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nLet me just take a deep breath... Wait, one more... Uff, I have no idea how I survived this IMAX screening of 1917. Usually, I don't delve deep into technical stuff since most people don't know or don't care about these attributes, but it's impossible not to address Roger Deakins' cinematography. It's not the first time a film has been edited to appear as \"one shot\" (a continuous take), but it never fails to impress me.\r\n\r\nAlejandro G. Iñárritu's Birdman, Silent House starring Elizabeth Olsen, or the famous Rope from the one and only Alfred Hitchcock... all produce the same trick. Even Mr. Robot and The Haunting of Hill House have brought us two phenomenal \"one shot\" episodes, edited as well with the so-called \"stitches,\" meaning that the actual cuts are made to look invisible to the viewer, hence giving that feeling that it's all just one continuous take. Cuts are often applied when a random character is passing in front of the camera; when the latter \"pans\" (movement similar to a head-turn) over a wall or an object that occupies the whole screen; or when the characters are simply going through a dark area.\r\n\r\nSam Mendes, Roger Deakins, and Lee Smith (editor) all work together to deliver the most immersive war movie (probably) ever. Yes, it has a simple premise, and the main narrative is basic, but the remarkable technical achievement elevates this film so freaking much. Even if you don't know the slightest thing about filmmaking or how movies are made, it's impossible to watch this film and not think \"something feels different about this one.\" This is a movie meant to be watched at the biggest, best screen possible. Watching 1917 at home on a TV or a laptop is not going to work at all.\r\n\r\nThroughout the whole runtime, I felt like I was there with Schofield and Blake. It feels like we are a third soldier going with them on a vital mission to save thousands of lives. I believe 1917 is the best \"one shot\" film to date (I've been using the quote signs for a reason, don't mistake it for an actual one shot movie), with Birdman as a close second. If the latter deals with a lot more dialogue and acting, the former has dozens of nail-biting sequences featuring shootouts, explosions, and a lot of running/walking/swimming through mud, dead corpses, blood, and way too many nasty rats.\r\n\r\nI really have no words to describe Roger Deakins' cinematography. It's not merely a film, it's a whole experience. It's not just another cool technical achievement. It's the entire foundation of 1917, and the main reason why so many people are rushing to the theater. However, a lot of people are completely ignoring Lee Smith's work. Don't forget, this isn't an actual one shot movie. If it's been edited to look like one continuous take, and if it actually does appear to be a single take, then the editor should get as much recognition as everyone else. Yes, he doesn't have to work with thousands of cuts (I counted 14, but I'm sure there's more), but they still exist, and he has to make sure no one feels them. And he did so perfectly.\r\n\r\nMy last paragraph concerning the technical aspects has to go to Sam Mendes and Thomas Newman. As the director, Mendes is able to deliver precisely what he envisioned and seamlessly coordinate his actors. Not only has he directed my favorite Bond film (Skyfall), but he also offers one of my favorite war movies of all-time. As for Newman, I just wish that Joker had been released in another year because 1917's score is fantastic. Hildur Guðnadóttir is likely taking the Oscar for Best Original Score, but if Thomas Newman takes it, I'll still be delighted.\r\n\r\nA lot of comparisons are being made with Christopher Nolan's Dunkirk. They're similar films regarding the fact that their main goal is to provide the most immersive war experience. Story and character-wise, both movies don't really develop that much. Nolan's film is loved by most critics and audiences all around the world, but one common complaint about it is the lack of character building. I didn't mind that at all because the movie never actually tried to make their characters important. They were just soldiers caught in the worst of situations, similar to 1917. However, I do think the latter does a better job of making us care for the protagonists.\r\n\r\nGeorge MacKay and Dean-Charles Chapman's characters have small arcs, but they exist. In the beginning, Blake is the emotional-driven character, while Schofield seems to be the rational one. We, as the audience, care about the mission first, but as time goes by, we learn about their personal traits and motivations. By the end of the film, I was crying. Both play off of each other really well, but it's their dialogue that impresses me the most. What seems to be just a random talk while strolling through an open field of grass, it truly isn't. If it's not meaningful at the time, it's going to be. The acting is more physical than anything, and both deliver outstanding performances.\r\n\r\nI would say I love 1917 as much as I love Dunkirk. I might be tempted to choose the former due to the \"recency effect,\" but there's one small aspect that negatively affects both. Their replay value is not as high as other films since their technical achievements don't work as well on a regular TV in the comfort of our own home. You will never feel or understand that \"immersive experience\" that everyone talks about. You won't know what made people to be blown away. You won't love it as much as everyone else. So, please, do NOT miss 1917 in theaters!\r\n\r\nSam Mendes, Roger Deakins, and Lee Smith. Director, director of photography, editor. Three key filmmaking roles in the creation of one of the best WWI movies of all-time. Edited to look like one continuous shot, 1917 is a mind-blowing technical achievement, elevated by Deakins' always jaw-dropping cinematography, Thomas Newman emotionally powerful score, Mendes impeccable directing, and Smith's seamless editing. George MacKay and Dean-Charles Chapman deliver outstanding (physical) performances, but it's the astonishing filmmaking that steals the spotlight. Production design, costume design, sound, you name it. Everything is absolutely perfect. It's meant to be seen at the biggest screen near you since this is an incredibly immersive experience that you won't get at home. It's going straight into my Top10: Best Movies of 2019, and I hope you'll love it as much as I do.\r\n\r\nRating: A", "created_at": "2020-01-25T17:56:14.787Z"}, {"movie_id": 530915, "review_id": "5e4cb88a9b8616001167d037", "rating": 8.0, "review_text": "\"Director Sam Mendes employs distinctive but extraordinary shots in the first person during the two-hour footage, which makes the production work in many different ways. Although it sometimes results too shaky, it is thanks to George MacKay and Dean-Charles Chapman's performances that 1917 preserves both sombre but optimistic tones throughout the montage. In short, this is an exceptional approach to memorialise the hundredth anniversary of the end of the First World War\".\r\n\r\nWe are somewhere in France during the Trench Warfare [1915 - 1917] with a depleted British Army; the atmosphere, alongside with the dialogues, can define by itself how was life at the front: scarce water and food, despair between soldiers to go home, endless weapons and corpses scattered on the floor, and so forth. Corporals Blake and Schofield are told to attain a severe/impossible mission despite not having any reinforcements. Before achieving this goal in sending General MacKenzie [Bennedict Cumberbatch] the infamous fallback letter, both privates must penetrate the frightful No Man's Land and experience horrendous life-and-death encounters in many places. \r\n\r\nRegardless of the silent second half, the absence of preeminent performers and the woozy experience of watching the film in one sole perspective director Sam Mendes and executive producers deliver an eloquent portrayal about surprising facts of the four-year global conflict. For example, both soldiers are bewildered by the superiority of the German trenches in proportions and in quality considering that historically they were far better equipped than the Allied ones which allow the audience the opportunity of a lifetime to analyse the condition millions of innocent citizens were facing. The result improves with some accurate shots at landscapes, underground warfare channels, entire villages pulverised, etcetera. I must acknowledge the last fifteen minutes of the film; it has been a long time since I spotted such an imposing ending. Countless emotions appear regardless of having reached the climax. What a masterpiece ladies and gentlemen!\r\n\r\nWhat amazes me the most is that despite being a World War film, 1917 does not give the impression in duplicating the ordinary details of previous same-genre releases such as Hacksaw Ridge [2017]. Once Mr Gibson introduced a brief biography of Desmond Doss [the main character] he began recording some ultraviolent scenes as though you were spotting the most savage state of humankind. As an alternative, 1917 delivers some innovative procedures in creating a war film without increasing the brutal strength of instant classics as Saving Private Ryan. \r\n\r\nCongratulations!\r\n\r\n[80/100]", "created_at": "2020-02-19T04:24:42.716Z"}, {"movie_id": 530915, "review_id": "5e6be322cabfe4001311b881", "rating": 9.0, "review_text": "Very well made war-drama all in a one-shot like format. Performance from George MacKay who I guess if nothing else could follow in the footsteps of Tom Cruise for his all-out running ability. Joking aside, really enjoyed this film which manages to provide enough character development for me to care about his well being and task. Probably my favorite of 2019. **4.5/5**", "created_at": "2020-03-13T19:46:42.693Z"}, {"movie_id": 530915, "review_id": "5e7d575c6c74b95757cb3d01", "rating": 7.0, "review_text": "When it comes to impressive achievements in filmmaking, “1917” deserves to be near the top of the conversation. This war film, which unfolds in two hours of real time, is shot to appear as one continuous take. Thankfully, it is so much more than just a technical gimmick. The showiness eases up as the emotional weight of the story unfolds, but it’s still hard not to get stuck on the challenges and manner of the moviemaking rather than the characters that should be the focal point of the film.\r\n\r\nSet during the First World War, the story follows Schofield (George MacKay) and Blake (Dean-Charles Chapman), two young British soldiers who are given a seemingly impossible mission: deliver a message across hostile territory to the front lines. In a race against time, these men must deliver the information within a couple of hours if they want to stop 1,600 men, and one of the soldiers’ brothers, from walking straight into a deadly trap.\r\n\r\nThe plot is thin, and the characters even more so. Instead of learning more about Schofield and Blake, the showy filmmaking technique commands the spotlight over learning more interesting aspects of these soldiers. It’s more of an experiment in “look what I can do!” rather than compelling storytelling. The camera becomes more of a character than the actual characters.\r\n\r\nDoes this matter? Not really. Roger Deakins is a master cinematographer, and his technique here creates a fully immersive experience. Paired with director Sam Mendes, the two capture the trench warfare of WWI with clever camerawork that not only gives a real sense of the distance these men had to travel, but makes you feel trapped alongside them as fellow soldiers sharing the same journey. The intimate style of camerawork makes you feel as if you are right there in the trenches, on the battlefield, with these two young men. Since the film is made to feel like it was shot in real time, it becomes a psychological wartime thriller as time begins to run out.\r\n\r\n“1917” is a large scale spectacle that often overshadows its small scale story, but there’s no disputing that it is a grand achievement in filmmaking.", "created_at": "2020-03-27T01:31:08.946Z"}, {"movie_id": 530915, "review_id": "5e85da1398f1f10016aafb61", "rating": 9.0, "review_text": "I see that a lot is made of the technique they use to film this movie in one continuous shot, and it is very interesting, but I must confess I am not a student of film, merely a viewer. So you will find no critiques of the director or editor or that sort of technical detail. I like what I like.\r\n\r\nAnyway, I enjoyed this movie more than I expected I would. I am not big on war movies. The scenery seemed great to me, and though there were visually stunning scenes, they didn't try to pile on explosion after explosion to cater to that crowd. The two leads were at the same time heroes and regular guys. I could almost picture myself in their position. Moments of extreme courage and bravery under fire were balanced by totally justified panic and fear. There were also quieter moments here and there, breaks from the sometimes hard to bear tension. Finally, there was a plot twist that seems normal looking back at it, but it shocked me at the time. I will leave it at that and not risk giving anything away.\r\n\r\nSo while I probably won't watch it again anytime soon, I do recommend it, even to viewers like me, who aren't big on war movies. As a side note, one viewer warned others NOT to compare this movie to Saving Private Ryan. I guess he thought it doesn't compare with it. Maybe I should give that movie a second look.", "created_at": "2020-04-02T12:26:59.202Z"}, {"movie_id": 530915, "review_id": "5e959651c3c89100137feb63", "rating": 7.0, "review_text": "I think this film with very great shot. also the actors was very good.\r\nBut the story didn't appeal to me. haha", "created_at": "2020-04-14T10:54:09.068Z"}, {"movie_id": 530915, "review_id": "5eae0acd0c3ec80025cc3ff2", "rating": 7.0, "review_text": "Excellent original film. It truly sucks you in straight from the very first scene until the last. There's nothing predictable in this well thought out and very tense (soon to be) classic.", "created_at": "2020-05-03T00:05:33.995Z"}, {"movie_id": 530915, "review_id": "5f238dd1eea34d0039356a3f", "rating": 7.0, "review_text": "An incredible journey that will keep you on the edge of your seat, albeit without many surprises.", "created_at": "2020-07-31T03:19:45.339Z"}, {"movie_id": 530915, "review_id": "5f7d2d7b35c30a003573ed7c", "rating": 2.0, "review_text": "Beautifully shot. Music was superb. Premise interesting. Acting was good.\r\n\r\nBut I've never yelled at a characters complete incompetence as much as I did this one. The Schofield dolt just stumbles around in a stupor the whole time doing just about everything he can wrong and it's basically sheer luck more people didn't die because of this nitwit.  Schofield is annoying at first and over time he grows to real irritation.\r\n\r\nI can't express my true rage at this moron as the review would either be removed or filled with [explicative deleted] notations. \r\n\r\nAs beautiful as the camera work and music is in this film, it's not nearly good enough to bump this rating any higher for the rage that it caused in me for this character. Yet the cinematography and music were too good to let me give it the lowest rating.\r\n\r\nIt's a well done movie about a complete [explicative deleted].", "created_at": "2020-10-07T02:52:43.271Z"}, {"movie_id": 530915, "review_id": "61c7e8fb6f53e100821aeeaa", "rating": 8.0, "review_text": "_**A horrific tour through hell on earth during WW1**_\r\n\r\nAfter the curious German retreat to the Hindenburg Line during Operation Alberich, two British soldiers (George MacKay and Dean-Charles Chapman) are sent several miles into enemy territory to call off a doomed offensive. \r\n\r\nReleased in 2019, \"1917\" was inspired by stories told to director Sam Mendes by his paternal grandfather about his combat experiences. The film is known for the impressive effect of two continuous takes, which was accomplished thru long takes and cinematic wizardry.\r\n\r\nThe plot has similarities to “Saving Private Ryan,” albeit taking place in a period 27 years earlier. Of course with World War 1 you automatically think of films like “Paths of Glory,” “All Quiet on the Western Front” (1979) and “War Horse.” This is as good or better. It’s like a tour through the trenches and surrounding areas with all the shocking challenges thereof, like rotting corpses, rats, booby traps, aerial combat, sudden death and crumbling villages, mixed with brief moments of goodwill, irony, awe and even beauty. \r\n\r\nThe film runs 1 hour, 59 minutes, and was shot in England & Scotland. \r\n\r\nGRADE: A-", "created_at": "2021-12-26T04:00:59.364Z"}, {"movie_id": 530915, "review_id": "64623224e3fa2f0187b9383f", "rating": 10.0, "review_text": "1917 is on the of the best war films in cinema history.\r\n\r\nThe plot is very basic, but the script is so strong that the it really does not matter. It is a individual journey of our two characters with the focus on perseverance rather than large scale war spectacles. It is very intimate, which sets itself apart from other films in the genre.\r\n\r\nThe acting was incredible. Our two leads, George MacKay and Dean-Charles Chapman, have such amazing chemistry with a vast amount of emotional range. It had me verging on tears on more than one occasion. The cinematography was masterful. Sam Mendes is completely mental for shooting this film as a one take. I can not even imagine the pain staking process of shooting each scene to seamless transition into the next, it was spectacular. The scope is so large that it seems like it should have been an impossible task. The score is fantastic and blends itself nicely with the film.\r\n\r\nOverall, this one of the best films I have seen in a long time. It was super impressive on all front and will go down as simply a masterpiece.\r\n\r\nScore: 98%\r\nVerdict: Masterpiece", "created_at": "2023-05-15T13:22:44.419Z"}]