[{"movie_id": 2133, "review_id": "5575c744c3a368246a003d16", "rating": 9.0, "review_text": "The Perfect Storm, I just love it so much. \r\n\r\n\"The fog's just lifting, you throw off your bow line, you throw off your stern-you head out to South Chanel past Rocky Neck...Ten Pound Island, past Niles Pond where I skated as a kid-and you blow your air horn and throw a wave to the lighthouse keepers kid on Thatcher's Island - then the birds show up, black backs and herring gulls, big dump ducks - the sun hits you, head North, open up to 12, you're steaming now, the guys are busy, you're in charge - you know what? You're a god damn sword boat captain, is there anything better in the world?\" \r\n\r\nOrdinarily I would write a review that is fair minded and as honest as I can call it, something that hopefully would interest the readers either side of the fence. But here with The Perfect Storm I just want to write why I love this particular picture, and what a most divisive picture it has turned out to be. I'm aware of the complaints about the movie, even the ones from the family of the real Captain Billy Tyne {played by Alpha Male regular George Clooney}, but as an entertaining spectacle with huge slices of emotional fortitude, The Perfect Storm will forever be hitting my spots. \r\n\r\nThe character build up is just wonderful, people with things to prove, fractured and blossoming romances, loyalties on the line, grudges carried over from previous encounters, the lives of sea fishermen fully formed in the films first quarter. Then there is a sequence as George Clooney says the monologue that I have opened this review with, beautifully recited, but it's the emotion in Linda Greenlaw's face (Mary Elizabeth Mastrantonio) as she watches and listens to him speak it, just wonderful. Then the boys go out to see, heading off into dangerous waters to hopefully make a killing in the fish market, tensions run high, accidents happen, heroes are born and rivalries quickly overturned, but the boys must go further if they are to corner the market, the Grand Banks are evil at this time of year. \r\n\r\nA three pronged hostile weather front is heading their way, they are, as Linda tells Billy on the radio, heading into the belly of the monster, and what a monster it is. Here the makers excel, director Wolfgang Petersen, his cinematographer John Seale and his S/E maestro John Frazier do literally put me right there in a amongst the waves and derringdo bravado. Then it's the final couple of reels, the emotional mangler, even a spiritual coda that is hated by so many can't make me dislike the film any less, and I'll wager right here and now that as funeral eulogies go, few if any have been delivered with as much heartbreaking emotion as the one read by Mastrantonio here. All of which is backed by a truly involving score by James Horner, shades of Braveheart's emotional swirls in there. \r\n\r\nIt's a personal opinion you know, but The Perfect Storm is a magnificent film that I enjoy three times a year, every year, and nobody will ever be able to take that away from me. \r\n\r\n\"There's no goodbyes Christina, only love,\" damn straight! 9/10", "created_at": "2015-06-08T16:48:04.546Z"}, {"movie_id": 2133, "review_id": "5f4a83dda1a9ba00355a8ed3", "rating": 6.0, "review_text": "I recently watched this for the second time, many years after my initial viewing. I confess I didn't always give it my full attention, not just because I had seen it once but also because the plot isn't very subtle, and careful viewing isn't necessary. The dialogue is realistic and well done, but the characters seem a bit stereotypical. You have the grizzled captain whose skills and luck seem to be in decline, a gentle giant with an ex-wife and a kid, a young man desperately in love, the newcomer ready to pick a fight with one of the above and a ladies man who I think was creole, but I am not sure.\r\n\r\nSo the plot bumps along and the special effects of huge waves and wind works to build suspense, only partly successfully. There are subplots also: the meteorologists with their eyes widening as the perfect storm develops, a yacht crew of three and the Coast Guard rescuers who try to save them, and a female ship captain who in real life wrote the book all this is based on.\r\n\r\nThe film is entertaining enough, in its undemanding way, but I can safely say I don’t expect to watch it for a third time. There were a few cliche moments and moments of melodrama. But it is watchable, especially if it is your first time.", "created_at": "2020-08-29T16:35:41.079Z"}]