[{"movie_id": 68737, "review_id": "561a21cbc3a3681c2800202d", "rating": null, "review_text": "The mundane medieval movie ‘Seventh Son’ is indicative of the cinema wasteland that the beginning of a brand new movie season trudges in after the New Year arrives. In any event, ‘Seventh Son’ is in good company (or is that bad company?) with flaccid fare such as the sci-fi eyesore ‘Jupiter Ascending’ and the meatless melodrama ‘The Boy Next Door’ joining the parade of putrid pictures occupying the big screen at the same time. What is even more shockingly shoddy about ‘Seventh Son’s embarrassing presentation as a sluggish supernatural movie misstep is the inclusion of Oscar-winner Jeff Bridges (‘Crazy Heart’) and current Oscar-nominee Julianne Moore (for 2014’s ‘Still Alice’) saddled in director Sergei Bodrov’s (‘Mongol) period piece sci-fi sludge. Bridges’s gray-haired evil-bashing spook and Moore’s wicked witch may very well deserve to have their SAG cards revoked upon audiences sitting through this faceless fantasy of hocus-pocus.\r\n\r\n‘Seventh Son’ wastes no time in setting up its familiar, generic premise involving a mentor-trainee tandem in the wise and haggard spook Gregory (Bridges) and his youthful farmboy protege Thomas Ward (Ben Barnes), an apprentice learning the ropes in taming the evil-doers that dare to exist and persist. Get this…old Gregory is considered a laughingstock (in addition to appearing as a leading personality in this ludicrous narrative) for believing in the evil-minded forces that he warns about consistently. Well, Gregory’s warnings are not so humorous to the naysayers when the sinister witch Mother Malkin (Moore) makes her hostile presence known. Resembling ‘Maleficent’s gaudy twin sister in wardrobe, Mother Malkin escapes her confines to concentrate on two treacherous tasks at hand: seek revenge on the meddling geezer Gregory and, of course, to control the world under her devilish grasp. The sorcery sass Malkin means business and the desperate Gregory must contain her with the recruitment of the chosen Thomas.\r\n\r\nNaturally, Thomas comes with a unique yet confusing mythology attached to his backstory which explains Gregory’s undivided attention towards the young sword-wielding raw talent. It is revealed that the revered young-blood Thomas is the ‘seventh son’ from a lineage of seventh sons in his lineage. Thus, Thomas has the specialized aura to carry his own weight into battle as he will serve as an adequate fighting tool for Gregory and the cause to restore order for a doomed society not ready to deal with cutthroat Queen of Mean in Mother Malkin.\r\n\r\nSo we witness Thomas’ so-called training methods and the philosophical mantras that go along with his journey in the name of good versus evil. What would a stud-in-combat-mode be without a lovely lady as an incentive to complete his heroic sacrifices? In this case, Thomas develops a romance with his object of affection in half-witch Alice (Alicia Vikander) who may have some hidden relationship secrets of her own that may prove critical.\r\n\r\nBodrov’s wooden direction and screenwriters Charles Leavitt (‘Blood Diamonds’) and Steven Knight (‘Easter Promises’) present an amateurish and spotty script that does no favours at all for the rancid ‘Seventh Son’. Drowsy dialogue, disjointed storylines, hammy acting, tedious fight sequences, derivative-looking 3-D special effect flourishes, cornball sorcery ans swords swagger, spaced-out and unintentional amusing dragons and other convoluted creatures are all are on delusional display in this faulty fable that feels strung together in the aftermath of a drunken stupor originating at the local pub.\r\n\r\nIn this demonic dud, both Bridges (whose ‘Seventh’ role recalls the forgettable flop ‘R.I.P.D.’) and Moore are outrageously cast in this clumsy costumed drama and one has to wonder why these veteran performers would sign on the dotted line to appear in this medieval mess? Barnes follows suit as the touted apprentice but his Luke Skywalker-lite antics in ‘Seventh Son’ are dismissed almost instantly. Even the pronounced presence of Oscar-nominee Djimon Hounsou (‘Blood Diamonds’, ‘Gladiator’, ‘In America’) cannot give any animated muscle as he appears as Radu, a multiple blade-armed, sword-swinging warlock with stylish jazzy chain accessories. Only the supporting roles of Vikander’s bewitching beauty Alice and Olivia Williams’s Mam Ward (Thomas’ mother) come out of this vacuous venture looking mildly memorable and inviting.\r\n\r\n‘Seventh Son’ is based upon the Joseph Delaney books with a decent following in literary circles. The big screen adaptation of Delaney’s pages is meager to say the least. Clearly, there will be no heralded ‘Twilight’ trend beneath ‘Seventh Son’s cinematic wings and, if this statement is proven wrong, then perhaps those very same wings need a serious clipping.\r\n\r\nSeventh Son (2015)\r\n\r\nUniversal Pictures\r\n\r\n2 hrs.\r\n\r\nStarring: Jeff Bridges, Julianne Moore, Ben Barnes, Djimon Hounsou, Alicia Vikander and Olivia Williams\r\n\r\nDirected by: Sergei Bodrov\r\n\r\nGenre: Science Fiction and Fantasy/Medieval Melodrama/Supernatural Fable/Sorcery and Swords Saga\r\n\r\nCritic’s rating: * star (out of 4 stars)", "created_at": "2015-10-11T08:46:03.921Z"}, {"movie_id": 68737, "review_id": "5a92d7900e0a2616c3020376", "rating": 7.0, "review_text": "This is a good, solid fantasy adventure. It is not a “wow great” kind of movie but definitely enjoyable to watch, at least if you are a fan of fantasy, magic, dragons and such like.\n\nThe movie is based on a book which I have not read although I believe it is considered as a young adult book. The movie seems to reflect this in that it has a fairly simple, straightforward, adventure plot. This is a movie made to entertain with magic, adventure, a bit of humor and visual effects. Nothing more and nothing less.\n\nIn my opinion it does so fairly well. I do like Jeff Bridges in his role as a rather wacky hunter of evil witches who have fallen into a dark and uncaring attitude towards the world around him. Uncaring about everything except slaying of witches that is. Ben Barnes, portraying the apprentice and Seventh Son is unfortunately making a rather bland impression. Then Julianne Moore is definitely better as the evil witch.\n\nNo movie where fantasy, magic and dragons are among the main themes can be without special effects. So, not surprisingly, there are a fair amount of them in this movie. I think they are generally well made and complements the story well without being overdone.\n\nOn the whole I liked the movie. It is a simple but solid adventure story with just the right amount of a few humorous remarks, nice visual effects, a bit of romance and action.", "created_at": "2018-02-25T15:34:40.310Z"}]