[{"movie_id": 10066, "review_id": "5b4bd7f90e0a26453402e1f4", "rating": 7.0, "review_text": "Engrossing and imaginative modern Mystery/Horror with Elisha Cuthbert \r\n\r\nRELEASED IN 2005 and directed by Jaume Collet-Serra, \"House of Wax\" is a horror/slasher about six college students (4 dudes and 2 gals) who drive from Gainesville to Baton Rouge to attend a crucial football game. They end up camping in the woods somewhere off I-10 where some of the party discovers a mysterious town in the sticks that has a curious House of Wax. Horror and death ensue.\r\n\r\nThis is not a remake of the splendid 1953 Vincent Price cult flick of the same name. The only thing these two films have in common is their title, their genre, and the fact that they both involve a wax museum. It's therefore pointless to compare them as they are two totally different stories. Plot-wise, \"House of Wax\" is an obvious mixture of the original \"Texas Chainsaw Massacre\" (1974) and the 1953 film of the same name, along with elements of more modern flicks like “Wrong Turn” (2003) and torture porn.\r\n\r\nAlthough the first 12 minutes or so are unimpressive with too much annoying shaky cam, the story starts to capture your attention at the camp-out sequence. From there their encounter with a horrible stench, a local hick, and the mystery of the isolated town & wax museum gradually pulls you in. The fairly slow initial 50-minutes are a crucial character-building and mystery-developing foundation to the final horrific hour.\r\n\r\nThe major protagonist of the story is Carly, played by Elisha Cuthbert, who was only 22 during filming and never looked better with her curvy cuteness. The glamorous and infamous Paris Hilton also stars and does a commendable job, but Elisha basically blows her out of the water as far as all-around beauty goes.\r\n\r\nSpeaking of Ms. Hilton, in light of the ads to “Come see Paris Hilton die,” it’s no secret that her character does indeed buy the farm and, the way it happens, is pretty amusing. The film's worth checking out for this scene alone, especially if you despise her.\r\n\r\nThe picture was shot in Queensland, Australia, of all places, but it works alright as a stand-in for the Deep South, although I don’t recall any hills along I-10, as depicted in the background of the town. Speaking of the town, it doesn’t look like a Deep South town, but rather a contrived set. Nevertheless, the filmmaking is top-notch in all categories with the rest of the no-name cast doing a fine job. As a matter of fact, the six college kids are all rather likable; even Nick (Chad Michael Murray), Carly’s supposedly 'black sheep' twin, once he shows his true colors.\r\n\r\n\"House of Wax\" works fabulously for what it IS, a mystery/slasher flick. The unlikely story is played straight and serious by all involved; there's no silly \"comedic relief\" or camp to be seen. Everyone knows going in that this isn't going to be \"Gandhi.\" But if you're in the mood for an entertaining and imaginative mystery/horror picture, look no further. \"House of Wax\" has practically everything you’d want in such a film. Why do I describe it as imaginative? See the conclusion's spectacular melting wax museum and you'll understand; this is F/X at its finest.\r\n\r\nTHE MOVIE RUNS 1 hour, 48 minutes. WRITERS: Chad Hayes & Carey W. Hayes.\r\n\r\nGRADE: B+", "created_at": "2018-07-15T23:25:45.941Z"}, {"movie_id": 10066, "review_id": "60eb781c0e64af002f725157", "rating": 7.0, "review_text": "Better than expected remake from 2005 with some decent gore and the effects during the finale looks pretty good. The cast was alright, reminder Elisha Cuthbert's time starring in movies (courtesy of 24) but she was fine and even Paris Hilton wasn't... awful I suppose. Nothing I'd really revisit anytime soon but all in all found it to be entertaining. **3.5/5**", "created_at": "2021-07-11T23:00:44.963Z"}]