[{"movie_id": 14536, "review_id": "640f05fde18e3f07e95331f2", "rating": 5.0, "review_text": "I have watched several romantic comedies lately to clear them from my Netflix watch list. As I have said many times in my reviews, I like them because the wit, humor and yes romance, is something I strive to put into the novels I write. So I tend to rate rom-coms more gently than some genres that have different goals. \r\n\r\nHaving said all that, this is the only romantic comedy that has really disappointed me lately. Partly it is due to the utter stereotyping of the Minnesota way of speaking, even more extreme than Fargo had been. Plus the rather crass shoehorning of religion into the plot. Hey, I am an atheist, but the faith of one of the characters seemed to be a rather shallow way of providing - well I won’t say back story - just details about her I guess. \r\n\r\nBut mostly I felt let down by the writing. Makes sense I suppose as I dabble in writing myself. The effort seemed lazy in a way. The plot features a smooth, ambitious corporate city slicker coming to a backwater town to close a local plant or at least reduce the work force. Gee, we haven’t seen that before, have we? It is right up there with the chestnut of a local group putting on a play to raise money to save their beloved theater about to be torn down. \r\n\r\nThere also didn’t seem to be much chemistry between some of the characters, which sometimes can save a movie for me. And the ending, which I won’t describe, was dropped on us viewers by the time-honored method of a deus ex machine, a gift from the gods unsupported by plot lead-up after Lucy Hill disappeared from the story.\r\n\r\nIt is a wonder I am writing this at all, because I don’t write reviews of movies I don’t finish watching. A brief “I gave up after ten minutes — don’t bother!” Isn’t a review; it is letting off steam. Just rate it and don’t write a review, guys. But I stuck with this (though I admittedly was multi-tasking as I did so) because I really like Renée Zellweger. I still do, obviously, but maybe she should have left this role to a lesser actress. “Judy” this ain’t. There are funny bits and they all try, so maybe watch it with a group of friends and keep it on the back burner of your attention.", "created_at": "2023-03-13T11:16:13.410Z"}]