[{"movie_id": 2637, "review_id": "5b2965720e0a2659d40092bd", "rating": 9.0, "review_text": "***Haunting Mystery with Supernatural Elements – Reverent, Beautiful, Brilliant***\r\n\r\nRELEASED IN 2002 and directed by Mark Pellington, \"The Mothman Prophecies\" details some of the strange events that occurred in Point Pleasant, West Virginia, from November 15, 1966, to December 15, 1967 (13 months). The movie, however, transplants the events to the year 2001.\r\n\r\nPLOT: Richard Gere plays John Klein, a journalist for The Washington Post trying to come to grips with the sudden death of his wife, Mary (Debra Messing). He mysteriously shows up in Point Pleasant, West Virginia, where he develops a relationship with the sympathetic police sergeant, Connie (Laura Linney). Many of the town's residents have sighted an eerie mothman-like entity, similar to the one Mary saw before she died. A researcher (Alan Bates) believes that the ‘mothmen’ exist on a sphere beyond human comprehension and that they can foresee impending calamities. Is the ‘mothman’ sighted in Point Pleasant warning the citizens of one? If so, what is it?\r\n\r\nThis is not a monster movie or a slasher horror flick; if you want that see “Mothman” (2010), which is actually pretty good for a TV creature feature (and interestingly links the mothman to the unjust slaying of Cornstalk, aka Hokoleskwa, in 1777). “The Mothman Prophecies,” by contrast, is a supernatural/mystery story with cogent creepy mood. Every element skillfully works: acting, story, editing, score, cinematography, locations, effects, etc. Underneath the film’s eeriness there’s an undeniable reverent, beautiful quality while the ending is strangely touching.\r\n\r\nOne critic claimed that the mysteries presented in the story are not supposed to be figured out and, indeed, CANNOT be figured out. But this is untrue. The film is intricate and respects the intelligence of the viewer. Questions are raised with varying possibilities. The answers are there, but you may have to watch it a few times to discover them. I appreciate the fact that the director and writer refused to spell everything out for the viewer, even allowing room for complete misinterpretation. If the viewer wants answers s/he must have \"ears to hear\" and be willing to work for them.\r\n\r\nMy initial interpretation was that the ‘mothmen’ are good spiritual beings that are trying to help humanity by predicting great calamities but can be misunderstood because they are so far superior to humans. In a nutshell, my interpretation was that the mothman somehow brought Klein to Point Pleasant to meet and save the future replacement for his dead wife, who died due to a pre-existing condition that only the mothman knew about. This explanation obviously suggests that the mothmen are good in nature.\r\n\r\nI've come to see that this interpretation is false; a brilliantly implemented red herring.\r\n\r\nBOTTOM LINE: \"The Mothman Prophecies\" is a rare film that’s genuinely intriguing and filled with gems to mine, even if you’ve already seen it several times. It’s so artistic that it’s a pleasure to behold over and over.\r\n\r\nTHE FILM RUNS 1 hour, 59 minutes and was shot in Kittanning, Pennsylvania (substituting for Point Pleasant), Pittsburgh (the factory and city scenes, etc.) and other Western PA towns. WRITERS: Richard Hatem wrote the screenplay from John Keel’s book.\r\n\r\nGRADE: A\r\n\r\nINSIGHTS ABOUT THE MOTHMEN *** SPOILER ALERT *** (Don’t read until you view the movie).\r\n\r\nThe ‘mothmen’ are evil spirits or fallen angels (they're synonymous). This is clear when viewing eye-witness drawings of the creatures, which never show beautiful angel-like beings, but rather dark disturbing, obviously-malevolent winged-creatures. It’s the same thing with the actual appearances of the creature (freeze frame the images).\r\n\r\nA mothman CAUSED the auto accident that injured Debra Messing. Would a GOOD angelic being cause such a tragedy (regardless of the fact that she ultimately dies of a pre-existing problem)?\r\n\r\nThe bible calls Satan the \"prince of the power of the air;\" hence, his filthy underlings (demons) are spiritual and electro-magnetic in nature. They can thus speak through a phone that's not plugged in or perhaps manipulate a traffic light. They can mimic the voices of dead loved ones or even take human form, like Indrid Cold, Mary or the male nurse who insists that Mary's drawings are of \"angels\" and then mysteriously vanishes.\r\n\r\nThe researcher from Chicago reveals that the mothmen are from “hell” (the spiritual underworld that underpins the earth) and send out mixed messages to ruin people’s lives. They may seem to be benevolently warning humans but, at the same time, are obvious instigators of human suffering (the car crash, Gordon's job loss, insanity & ultimate demise and the researcher's loss of his family, career & respectable social life). Also, they refuse to reveal their true selves and intentions. They are highly skilled masqueraders.\r\n\r\nThe reclusive researcher also points out that they have been around for millennia and therefore see things 2-3 moves ahead of humans; they use this vantage point to manipulate, deceive and destroy. Since their M.O. is to “kill, steal and destroy,” they feed on death, destruction and torment and therefore venture to the places where great tragedies will transpire, like the Silver Bridge collapse.\r\n\r\nThe saved police woman at the end was number \"37,” historically a numerical symbol of The Christ, which shows that her submersion in the river and figurative resurrection is a type of the Anointed One. Yet she is still a victim in that her previous views that the mothmen are destructive and manipulative could now flip-flop into the deception that they are somehow agents of good. Of course we never find out if this happens because the tale potently ends with Klein and Connie in shock sitting in an ambulance just glad to be alive.\r\n\r\nThe film powerfully illustrates that humanity is caught in a cosmic war and that there are malevolent beings who purpose to ruin or destroy us. Failure to understand and tactically prepare can be fatal or lead to great suffering. The only true protection from these evil spiritual beings is reconciliation with the Creator through Jesus Christ's blood shield of atonement and utilizing the armor of light.", "created_at": "2018-06-19T20:20:02.018Z"}]