[{"movie_id": 82682, "review_id": "531c625ac3a3685c5d0065de", "rating": 6.5, "review_text": "Rat-a-tat-tat!\r\n\r\nGangster Squad  is directed by Ruben Fleischer and written by Will Beal. It stars Josh Brolin, Sean Penn, Ryan Gosling, Emma Stone, Nick Nolte, Anthony Mackie, Giovanni Ribisi, Robert Patrick and Michael Pena. Music is by Steve Jablonski and cinematography by Dion Beebee.\r\n\r\nLos Angeles is being brought to its knees by crime boss Mickey Cohen (Penn). In one of the darkened offices of the police department, a special squad of officers is being assembled. Given free licence to bring Cohen and his operations down by any means necessary, the Gangster Squad fight fir with fire.\r\n\r\nLoosely based on real life facts, Gangster Squad is a good old slice of machine gun etiquette. An all star cast get to play good guys and wise guys in The Untouchables tradition, even if that in itself can’t quite lift the film to the higher echelons of gangster movies past and present.\r\n\r\nThere’s absolutely nothing new here, it plays out as expected. Brolin and Gosling are the main smooth operators in the good guys camp, the former given the family man in danger sub-plot, the latter given the dangerous dame to fall in love with in the shapely form of Emma Stone, who as it happens is also dating Cohen!  hmm... \r\n\r\nOver in the wise guys department is Penn on full tilt sweary and hammy overdrive. It’s a very colourful portrayal, menacing and completely over the top. How the performance sits with you will greatly depend on how you find Penn as an actor when let loose on a cartoon characterisation.\r\n\r\nIt’s all very period pleasing, with a bustling late 40s L.A. hosting men with hats, trench coats and tommy-guns. Men who frequent the speakeasy bars as torch singers warble their stuff. There is nothing wrong with the production at all, except maybe when the dialogue veers to clunky. The action scenes are well crafted, loud, bloody and exciting, and the photography sparkles and the music soars.\r\n\r\nIf only the makers had put some thought into it, a bit of brains to go with the brawn. As a comic book type gangster piece, it works well on entertainment terms, elsewhere its lightweight and formula compliant ,  with the Ribisi, Patrick and Pena characters telegraphed a mile away.  So, quite some way away from the great The Untouchables  then, but better than Mullholland Falls. Make of that what you will. 6.5/10  ", "created_at": "2014-03-09T12:45:14.787Z"}]