[{"movie_id": 181812, "review_id": "5dfbc0ea26dac100145c1e4f", "rating": null, "review_text": "Well.. this was dull.\r\n\r\nLet me give you a little context to understand better how I felt during this movie. Firstly: I'm NOT a big Star Wars fan. I like the movies and see them as a \"good\" franchise, but I wouldn't put any of them on my personal top lists.\r\n\r\nI enjoy the art of the franchise way more than the story. I LOVE the music, the design of ships and the visual world building. I like some aspects of the overall story more than others of course, but none really come to mind when I think of what I like about the movies in general.\r\n\r\nThat being said, I felt \"The Force Awakens\" was really boring. Just a generic movie trying to do \"the Star Wars things\". It was fine but not in any way memorable to me.\r\n\r\n\"The Last Jedi\" on the other hand really tried ignoring the big \"Star Wars cult\" and therefore entertained me the most of all the 9 movies. I prefered the focus on using the \"Star Wars\" world to tell a story rather then to tell another \"Star Wars\"-version.\r\n\r\n\"The Rise of Skywalker\" now is at best as boring as \"The Force Awakens\" and very often a big punch in the face to everything I liked about \"The Last Jedi\". Obviously the higher ups at Disney decided to take notes on everything \"the fans\" disliked about the 8th movie and do some sort of \"damage control\" according to that feedback.\r\n\r\nThe movie hast way too much going on for reasons which are often non-existant or just plainly bad. Since the movie couldn't grab my focus I just happened to think more about the big plotholes and started nitpicking and sometimes even mocking the movie for certain decisions which I don't want to spoil here.\r\n\r\nIt's really a shame. I hope Disney will use the name in the future to do standalone movies of different genres, for example a racing movie in space would be great or a good action flick with one or two of the beloved characters.\r\n\r\nIf I had to give it a rating I would probably give the movie a 4-6/10. I only REALLY enjoyed one scene because I hoped for it to happen most of the movie, but that didn't save the rest.", "created_at": "2019-12-19T18:26:50.008Z"}, {"movie_id": 181812, "review_id": "5dfc767326dac100175d49c7", "rating": 9.0, "review_text": "Went to the first showing in town tonight.  I really enjoyed the film.  Although it leaned heavy on nostalgia, it should, since it is wrapping up 40 years.  I did not care for The Last Jedi, and was worried going in.  Will do a deeper dive after I have seen it a few times.", "created_at": "2019-12-20T07:21:23.162Z"}, {"movie_id": 181812, "review_id": "5dfcb04f65686e001390cd34", "rating": 3.0, "review_text": "It’s hard to write a review for this film without any major spoilers, so this might seem a little vague here and there. There will be very minor spoilers, primarily what’s revealed in the opening text crawl or the trailers, so not much, but if you want to go into this film completely virgin, stop here.\r\n\r\nThe film starts off with things already underway. A transmission has been sent out that contains the voice of Emperor Palpatine. Kylo Ren, now Supreme Leader of the First Order, goes to seek out Palpatine as a potential threat to his power. In the meantime, the Resistance is still in shambles after the events of “The Last Jedi,” and they are busy doing scouting missions and regrouping.\r\n\r\nAll of this is revealed in the opening crawl of the movie, which is where the problems begin. It violates a cardinal rule of storytelling: Show, don’t tell. It wouldn’t have taken much to have this done on screen in more dramatic and effective fashion. Instead, this has the effect of making it feel like we either missed something important or that we’re watching an entirely different movie with a different story. This makes things confusing. It doesn’t help that I was already thinking that J.J. Abrams probably needs to go back to Screenwriting 101 during the opening crawl. Not a good way to start.\r\n\r\nOther things happen during the course of the movie that make no sense. Why does Kylo Ren reforge his helmet? We never really find that out. He just does. The Knights of Ren do appear in this film finally. Who are they? If you’re expecting an answer of any kind, you’ll be disappointed. Why is there this strange connection between Rey and Kylo Ren? One of the mysteries of the Force, I suppose. Characters who we don’t know appear from nowhere having been significant to the goings on even though we’ve never seen them before. Other characters take bizarre and up to now not even hints at character arcs. It becomes a horrendously confusing mess.\r\n\r\nI liked some of the more controversial aspects of “The Last Jedi.” Rey being a nobody with no significant parentage? Great idea! The galaxy is a big place. Why does everyone have to be related? Well, this is adjusted slightly. I won’t go into details, but it was disappointing what they did, in my opinion. Leia’s story arc in this film is...weird. I’m going to allow that it’s due to the loss of Carrie Fisher and having to use archival footage (one scene that shows a young Luke and Leia using computer effects is freaky at best). But it’s off-putting and feels tacked on for convenience. It was nice to see Lando return, although even that felt more like throwing a bone to the fans. He could have potentially been replaced by any character with flying skills. Speaking of such, Wedge does make finally make an appearance, but it’s a blink-and-you’ll-miss-it moment.\r\n\r\nHere’s how I would sum it up spoiler-free: As I said, I liked “The Last Jedi” a lot, including parts that many didn’t like or found weird as I stated above, but at the same time it was not a problem-free movie for me. “The Rise of Skywalker” is the exact opposite. It definitely has some really cool moments, but feels so sloppy and makes so many storytelling mistakes that, on the whole, I have to say that it’s a bad movie. I’ve said this about just about everything I’ve seen come from J.J. Abrams, that he’s great at coming up with interesting imagery. He gets these pictures in his head of something that would be really interesting to see on film, like flashes one might remember from a dream. For example, there’s a great scene near the end that finally corrects what many consider a great injustice done in an earlier movie. But couching these images in a cohesive story is not his strong suit. In fact, he’s downright terrible at it. This problem seemed to be going in full force in “The Rise of Skywalker.”\r\n\r\nWere some of my complaints addressed in some expanded material? I don’t know, but even if they were it would still make it bad storytelling. Star Wars has always been fairly good about keeping things self-contained. Expanded material adds extra background to enhance the enjoyment of the main material, like adding seasoning, but shouldn’t be necessary to appreciate the meal.\r\n\r\nOverall, you need to see this movie to close out the Skywalker Saga, but that’s really the only reason. Don’t go into this expecting a good or even decent film, or for every question to be answered. Ultimately, it’s a disappointing end to Star Wars, and I say this as a Star Wars fan.", "created_at": "2019-12-20T11:28:15.974Z"}, {"movie_id": 181812, "review_id": "5dfed8b465686e0013949278", "rating": 6.0, "review_text": "When The Force Awakens was released the vast majority of fans liked it. They were practically watching a remake of A New Hope but it was enough for them. Although they never liked Rey. That damn feminist agenda right?\r\n\r\nThe Last Jedi took that from them, it got away from the formula and they went crazy.\r\nWho was that Rian Johnson and how he dare to change the characters that only they know how they should act?\r\n\r\nThey did not give them what they wanted and that annoyed them and it's ironic because many times they have complained about the saga and its direction and if something has become clear to me it's that the great majority only want the same, like in the original trilogy. And what does that mean? Fan service. And that's what Star Wars has become.\r\n\r\nYou don't believe me? Ask fans about the scene they liked the most about Rogue One.\r\nVader's scene. A fan service scene. \r\n\r\nAnd the fear of losing the ''fans'' forced Disney to undo what they were creating, they also threw Johnson and his film under the bus and they practically announced this new film like the one that came to fix the disaster. A shame and an insult to the director's work.\r\n\r\nRise of Skywalker in my opinion represents a setback and it doesn't matter that this is supposed to be the ending. It's a setback because they decided to play it safe and submit to the whims of the audience.\r\nWhile that does not translate into poor quality, it doesn't represent something worth mentioning either. \r\n\r\nStar Wars represents pure and good entertainment but when it lacks surprises and feels so safe and predictable it means that you're sacrificing any emotional resonance and when it comes to the end of the 9 episodes, that emotion is simply not there.\r\nThat shot of Rey looking at the two suns should have felt overwhelming and thrilling and I don't know about you but I didn't feel it and that was a huge letdown. \r\n\r\nAnd that's what separates this ending from Return of The Jedi and Revenge of the Sith, even though it was known what would happen in Episode III, despite the mistakes there was emotion, here was like finishing the business. \r\n\r\nI don't consider myself a die-hard fanatic of Star Wars but I do like the saga a lot, yet in order to survive, even of its toxic fandom, they have to dare to try new stuff and forget about the original trilogy because to live in the past is to die in the present and for the saga to have a future, looking forward is the only way. \r\n\r\nIt's a very well made and entertaining film and it was a decent ending for this trilogy but quite an underwhelming conclusion for the saga as a whole.\r\n\r\nAnd the Knights of Ren? What a fucking disappointment.", "created_at": "2019-12-22T02:45:08.172Z"}, {"movie_id": 181812, "review_id": "5e00e9a826dac10012644d3b", "rating": 5.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nIf you don’t know by now, I’m a massive Star Wars fan. I love the original trilogy, but the prequels… not so much. However, Disney’s sequel trilogy has delivered two of my favorite movies of the whole franchise, so its conclusion was obviously one of my most anticipated moments of the year. If that wasn’t enough to leave everyone excited, add the fact that it also means the end of the Skywalker Saga, and the pressure suddenly becomes 10x heavier. I went in with moderately high expectations, with not even a glimpse of any trailer or TV spot, just like I did with Avengers: Endgame. The latter surpassed my expectations and delivered a near-perfect conclusion to the Infinity Saga…\r\n\r\nThe Rise of Skywalker is a tremendous letdown. I won’t sugarcoat it. If someone told me at the beginning of the year that J.J. Abrams wouldn’t be able to offer a satisfying end to the nine-episode story, I would laugh like crazy. It disappointed me so much that I don’t even want to extend this review more than the usual. I know that a lot of people hated The Last Jedi, but for better or worse, that film exists. Rian Johnson’s decisions were made. Some people received them well, some didn’t. But all of us got to watch and experience his narrative.\r\n\r\nThere’s something called artistic integrity, which J.J. Abrams and Chris Terrio completely forgot about. The lack of respect for the saga’s previous installment is baffling. The structure-less screenplay is so unbelievably convoluted that it reaches a point where evident logical issues come into play. Major plot points occur due to some genuinely hard-to-believe events, and even the characters seem to have no path whatsoever. It’s entertainment for the sake of entertainment.\r\n\r\nOf course, there are a lot of visually jaw-dropping action sequences. The cinematography (Dan Mindel) is some of the best I’ve seen in the franchise and in this year. John Williams’ score is emotionally compelling, and it definitely elevates a lot of important moments, being a big source for the chills down my body. And yes, there are a bunch of epic scenes. However, throughout the whole runtime, the frustration was always there. Major threads and character backstories were answered in The Last Jedi, but The Rise of Skywalker feels more like another sequel to The Force Awakens than to Rian Johnson’s flick.\r\n\r\nIf there’s one undeniable aspect about this trilogy that this last movie proves is that there was no plan. No roadmap. No overall structure. Whether you love or hate each or every installment, this is indisputable. Disney screwed up this time. Creative freedom is essential to filmmakers, but the production team behind a franchise needs to have a well-organized structure. The simple fact that J.J. Abrams directed the first film, left and returned to do the third one, is already weird and uncommon by itself.\r\n\r\nBesides the lack of artistic integrity, there’s this feeling of constant disappointment throughout the movie. On several occasions, The Rise of Skywalker is so close to delivering a perfect sequence. A chill-inducing moment. An incredibly emotional scene. Almost every time, it fails at the last second, at the last line of dialogue, or at the last action movement. Some moments are still captivating, and they don’t lose that much impact. Nevertheless, some are totally destroyed by the most ridiculous, cringe-worthy choices I’ve witnessed in the saga.\r\n\r\nThe first act is devoid of any thought. Characters go to places to get something they need to another place so that in that place, they find something else that leads them into another place… It’s frenetic, out-of-control pacing. The desperation to set up so many different side stories in time is so prominent that it’s visible from another galaxy. From the second act on, things get a bit more clear, and in the third act, all the threads blend decently. It’s in the last 30 minutes that the resemblances to Avengers: Endgame come into play. The only difference is that it doesn’t have 1/10 of the emotional impact due to the questionable decisions I mentioned above.\r\n\r\nOnly one character got his arc complete without detours or significant changes: Kylo Ren. J.J. set him up, Rian Johnson continued his journey, and J.J. closed his arc pretty well. Every other character either got their arcs complete with major changes throughout, or they didn’t come close to finish their own story. There’s one exception, though, and that’s Carrie Fischer’s Leia. It would be extremely disrespectful and unfair for someone to criticize the filmmakers about her. They inserted her reasonably well in the scenes (please, if someone complains about visual effects, just get lost), and they did the absolute best they could under the known circumstances. I might be extremely disappointed, but I do have to send the team my congrats for closing her arc in the most dignified way possible.\r\n\r\nAs for everyone else… well, the cast has been outstanding from the very beginning. Adam Driver, I have no words for him. He’s so perfect as Kylo Ren that I even defend his character as a villain more layered and emotionally complex than Darth Vader. I love Daisy Ridley as Rey, and she does a phenomenal job in this last film, even when her dialogue doesn’t entirely suit her. John Boyega, Oscar Isaac, and everyone else (who I won’t mention due to possible spoilers) are all brilliant, and I have to congratulate them on making every single movie a bit better.\r\n\r\nI don’t know what more should I write. I have very mixed feelings about it. I love a lot of the epic moments, the film looks absolutely stunning, and the action sequences are genuinely jaw-dropping. However, I strongly disagree with some decisions made by J.J. Abrams and Chris Terrio, especially the ones that make The Last Jedi feel like it didn’t exist. This lack of artistic integrity plus the constant disappointments regarding each big moment’s climax ruins one of my most anticipated movies of the year. Despite the brilliant performances from the cast, only Kylo Ren got his arc complete without significant changes. The Force Awakens set up some mysterious questions. The Last Jedi answered them. The Rise of Skywalker… also answered them. It’s one of my biggest letdowns ever, but I’ll still save the Skywalker Saga close to my heart. Next time, just build a roadmap, Disney…\r\n\r\nRating: C", "created_at": "2019-12-23T16:22:00.396Z"}, {"movie_id": 181812, "review_id": "5e072a4feda4b700172b83b1", "rating": 4.0, "review_text": "5 reasons **you'll** love this movie:\r\n\r\n**You** can't spoil the plot to anyone who hasn't seen it, because it doesn't HAVE a plot.  Sure, stuff happens, and if you blab about it, you'll get asked \"Who did what? When? Why?\", and you won't be able to answer because you won't know either.\r\n\r\nIt validates **your** blind optimism over everyone else's cool deliberation, because our so-called heroes just blunder their way through every peril imaginable without any logic, strategy or preparedness, yet they come out unscathed for [reasons].  Often using guesswork, or was that \"The Force\"?\r\n\r\nNo need for **you** to remember any complicated story arcs, bothersome subtle clues or dramatic prophecy drops from throughout the series, because this final movie just makes up completely new stuff that you couldn't possibly have seen coming because it never existed before.\r\n\r\nIt's ridiculously easy to re-enact the movie at **your** next cosplay gathering, because the characterisations are so shallow and vapid that all you need to do is ad-lib the actors' lines, and you'll probably get a better script.\r\n\r\nAll that junk **you've** accumulated over the years will come in damn handy one day, just like it did for our so-called heroes.  They managed to have everything they need on hand.  So much so, that vitally important junk literally materialises right in front of them, and usually from places that makes you wonder why they never noticed it years ago.", "created_at": "2019-12-28T10:11:27.488Z"}, {"movie_id": 181812, "review_id": "5e07d6044c1d9a0013e29638", "rating": 9.0, "review_text": "This movie is really awesome. It took me two viewings to truly cement the way I truly feel about this film. But upon second viewing this film was not just an entertaining blast from start to finish but to be honest a perfect conclusion to the Skywalker story. The film traverses the stories of the previous films in order to bring all those stories together for a culmination that is truly satisfying. The cinematography and visual effects as usual are outstanding in the film but this film seems to have a unique feel that adds to the foreboding tone kept consistent throughout. Adam Driver and Daisy Ridley as Rey and Kylo truly shine in this film and are both giving their a - game and prove that they are both incredible actors and extremely emotionally flexible (particularly Ridley). The Arc of Kylo Ren is by far the highlight of this trilogy and in this film and the conclusion of said arc is immensely satisfying, Reys story also takes a surprising turn which I found immensely satisfying in hindsight. As a conclusion to my favourite series of all time I was left immensely pleased with the final sequence of the film which brings all of this lore together in a way I couldn’t predict to be this poignant. This film overall was a wonderful farewell to this saga that was so satisfying and enjoyable that I will look back on this saga with great nostalgia and adoration that I hope to show my children as a whole nine part saga and I am immensely honoured to have been part of this moment in pop culture and to get to view this conclusion is a truly wonderful thing for me. It’s with this i farewell the galaxy far far away with immense satisfaction.", "created_at": "2019-12-28T22:24:04.622Z"}, {"movie_id": 181812, "review_id": "5e09a1614b9bae0012d4857f", "rating": 7.0, "review_text": "This is some bullshit. You know it, I know it. _Rise of Skywalker_ is not just a bad movie contained within itself, it's also a **very** bad sequel to _Last Jedi_. But that didn't stop me from having a really great time at the cinema with _Episode IX_. Twice.\r\n\r\nOriginally I started writing my review for it by writing two lists, one of all the dumb crap I didn't like, and one of all the dumb crap I did like, but A) it contained a lot of spoilers, and B) there's a lot of lists of the dumb crap in _Rise of Skywalker_ out there already, so all I'll say is just this: The majority of complaints that people are making about _Rise of Skywalker_ are fair and accurate, and whether you are a _Star Wars_ fan or not, there is a very real chance you will not enjoy this movie. But between 2017 and 2019 I watched over 1500 movies, and I thought that this movie was one of the better ones.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2019-12-30T07:04:01.230Z"}, {"movie_id": 181812, "review_id": "5e13fed59020120015b96ddc", "rating": 7.0, "review_text": "**_I enjoyed it, but I did so with a sizeable asterisk_**\r\n\r\n>_I said to Rian, \"_Jedis don't give up. I mean even if he had a problem he would maybe take a year to try and regroup, but if he made a mistake he would try and right that wrong_.\" So right there we had a fundamental difference, but it's not my story anymore. It's somebody else's story, and Rian needed me to be a certain way to make the ending effective. That's the crux of my problem. Luke would never say that, I'm sorry – well in this version. See, I'm talking about the George Lucas_ Star Wars_. This is the next generation of_ Star Wars_, so I almost had to think of Luke as another character. Maybe he's Jake Skywalker. He's not my Luke Skywalker. But I had to do what Rian wanted me to do because it served the story. But I still haven't accepted it completely._\r\n\r\n- Mark Hamill; Official Press Tour for _Star Wars: The  Last Jedi_ (December 18, 2017)\r\n\r\n>The _Force Awakens_, _I think, was the beginning of something quite solid._ The  Last Jedi_, if I'm being honest, I'd say that was feeling a bit iffy for me. I didn't necessarily agree with a lot of the choices in that and that's something that I spoke to Mark [Hamill] a lot about and we had conversations about it._\r\n\r\n- John Boyega; \"John Boyega Is on His Own Hero's Journey\" (Isaac Rouse); _HyperBeast_ (December 8, 2019)\r\n\r\n>The Last Jedi _is full of surprises and subversion and all sorts of bold choices. On the other hand, it's a bit of a meta approach to the story. I don't think that people go to_ Star Wars _to be told, \"This doesn't matter.\"_\r\n\r\n- J.J. Abrams; \"Will _Star Wars_ Stick the Landing? J.J. Abrams Will Try\" (Dave Itzkoff); _The New York Times_ (December 11, 2019)\r\n\r\nRian Johnson's _Star Wars: The Last Jedi_ (2017) was a film which divided critics and audiences to an unusual degree – on Metacritic it has a critical score of 85/100 (the second-highest in the franchise), with 53 positive reviews against zero negative, but its audience score is only 4.4/10 (the lowest in the franchise), with around 3,000 positive reviews against nearly 4,500 negative. In their (predominantly negative) reviews of _Star Wars: The Rise of Skywalker_, many critics who championed _Last Jedi_ posit that the film was a great work of art, unfairly maligned by a toxic fanbase pissed off that Luke Skywalker (Mark Hamill) was in a perpetual bad mood and that Rose Tico (Kelly Marie Tran) was unacceptable because she wasn't white. And certainly, there was an element of that in the reaction some diehard fans had to the movie – the racist and sexist abuse that Tran took from such fans was shameful, and the very definition of toxicity. However, these critics essentially argue that if you didn't like _Last Jedi_, the _only_ possible explanation is that you're a racist, misogynistic, reactionary, right-wing Neanderthal – it certainly can't have anything to do with simply disliking the movie because you disliked the movie. And of course, such critics don't mention the horrid screenplay that spends 40 minutes on a side-quest that has nothing to do with the rest of the film; they don't mention how Vice Admiral Amilyn Holdo (Laura Dern) withholding her plan from Poe Dameron (Oscar Isaac) makes not a lick of sense; they don't mention Luke throwing away his lightsaber (to hell with that scene); they don't mention how General Hux (Domhnall Gleeson) was turned into comic relief; and they sure as hell don't mention resurrected flying space Jedi (to hell with that scene too). The fact is, the film is an absolute mess, and it has zero to do with skin colour or gender.\r\n\r\nAnd so, one must ask, is _Rise of Skywalker_ a course correction or a flat-out apology? I'm leaning to the former, but there can be no doubt that much of what _Last Jedi_ introduced into the canon has been unceremoniously discarded – Kylo Ren (Adam Driver) is once more wearing his mask and the Knights of Ren are back; the Jedi child seen at the end of _Last Jedi_ is never mentioned; Rey's (Daisy Ridley) parentage, so casually dismissed in _Last Jedi_, is once again crucially important; Rose, that most maligned of characters, has gone the way of Jar Jar Binks (Ahmed Best), and is barely seen. Indeed, _Rise_ is more of a sequel to J.J. Abrams's _Star Wars: The Force Awakens_ (2015) than it is to _Last Jedi_, one or two major plot points notwithstanding, and whilst _Last Jedi_ looked forward, clumsily introducing new concepts and themes to the franchise, _Rise_ follows _Force Awakens_ in doing the opposite – it looks back, and is chock-full of throwbacks and references to the previous films. And although I certainly enjoyed it as a spectacle (it looked and sounded exceptional in 3D IMAX), there's no doubt it's a deeply flawed piece of work. It's the kind of film that feels like it was created by a computer algorithm or a corporate committee trying to tick as many boxes as possible – rather than attempting something ambitious which fans _might_ not like, it's far more concerned with trying to please everyone without offending anyone. And this is only one of two impossible tasks it assigns itself.\r\n\r\nPicking up the story a few months after the events of _Last Jedi_, the war between the Resistance and the First Order is still raging. However, a recent development has altered the playing field and taken both sides by surprise – Emperor Sheev Palpatine/Darth Sidious (Ian McDiarmid) has returned, having survived the events at the end of Richard Marquand's _Star Wars: The Return of the Jedi_ (1983). Revealed to have literally created Supreme Leader Snoke (Andy Serkis) in a lab, Palpatine has been manipulating events from behind-the-scenes for years and now plans to harness the immense combined power of every Sith who has ever lived. As the film begins, Supreme Leader Kylo Ren, who assumed the mantle after he murdered Snoke in _Last Jedi_, is making his way to Palpatine's base on the 'hidden' planet Exegol, which can only be reached with the use of a powerful Sith Wayfinder, of which there are only two in existence. Seeing Palpatine as a threat to his leadership of the First Order, Ren is planning to kill him. However, rather than doing so, he watches in awe as Palpatine reveals a massive armada of hundreds of fearsomely powerful _Xyston_-class Star Destroyers. He then orders Ren to find and kill Rey. Meanwhile, with Luke dead, Rey is continuing her Jedi training under his sister, Leia Organa (a cobbled together 'performance' by Carrie Fisher, comprised of a combination of unused material from the previous films, body doubles, and CGI). When Poe and former First Order stormtrooper Finn (John Boyega) discover that Palpatine is on Exegol, Rey learns of the necessity of the Wayfinder from Luke's notes. And so Rey, Poe, Finn, Chewbacca (Joonas Suotamo), and the droids C-3PO (Anthony Daniels), R2-D2, BB-8, and D-O set out to find it.\r\n\r\n_Rise of Skywalker_ is directed by _Force Awakens_ director J.J. Abrams (_M:i:III_; _Super 8_; _Star Trek: Into Darkness_). Colin Trevorrow (_Safety Not Guaranteed_; _Jurassic World_; _The Book of Henry_) was originally hired as writer/director, but he left/was fired from the project after clashing with franchise producer Kathleen Kennedy, who seems to have a bit of a thing for firing directors, and who was dissatisfied with the script by Trevorrow and Derek Connolly (_Kong: Skull Island_; _Jurassic World: Fallen Kingdom_; _Pokémon: Detective Pikachu_). In the credits for _Rise_, Abrams and Chris Terrio (_Argo_; _Batman v Superman: Dawn of Justice_; _Justice League_) are credited with the screenplay, working from a story credited to Trevorrow, Connolly, Abrams, and Terrio, although Terrio has said in interviews that the Trevorrow/Connolly credits were a legal requirement, and nothing of their script remains in the final film.\r\n\r\nAnd this brief bit of background chaos serves to help illuminate what is probably the biggest problem with both this film and this new trilogy as a whole – lack of narrative through-lines. At no point during _Rise_, not for one second, did it ever feel like the culmination of a nine-film arc. Hell, it barely felt like the culmination of a three-film arc. As already mentioned, _Rise_ seems more like a sequel to _Force Awakens_ than it does to _Last Jedi_, but the problem runs deeper than that; not only is there a modest disconnect between the three films in the sequel trilogy, but there's a much more important and sizable disconnect between this trilogy and the previous two – George Lucas's _A New Hope_ (1977), Irvin Kershner's _The Empire Strikes Back_ (1980), and Marquand's _Return of the Jedi_ and the Lucas-directed prequel trilogy; _Episode I: The Phantom Menace_ (1999), _Episode II: Attack of the Clones_ (2002), and _Episode III: Revenge of the Sith_ (2005). \r\n\r\nLove them or hate them, the prequels do feel like they take place in the same narrative space as the originals; they not only form a coherent and logical trilogy in and of themselves, but (Midi-chlorian foolishness aside), they also form a coherent and logical six-film arc with the original trilogy. In short, the prequel trilogy has very strong and narratively organic connective tissue to the original trilogy. Lucas himself has spoken to this connective tissue, pointing out that when you watch the originals, it's Luke's story, but when you watch the six films, it's Anakin's story. When you factor in this third trilogy, however, despite Disney dubbing the nine films the \"_Skywalker Saga_\", the overarching story essentially becomes Palpatine's, as he's the only constant in all three trilogies (apart from C-3PO and R2-D2). However, whilst Palpatine's presence in the first two trilogies is integral, woven intricately into the fabric of everything that happens, his appearance here is…less so. This has the effect of making the nine-film sequence feel unbalanced, with the last three never really managing to feel like a valid continuation of the previous six. At best, they feel like a spin-off, with thematic connections and recurring characters occasionally shoehorned in to try to establish narrative continuity, but, by and large, they're their own thing – which is not how Disney has sold them at all. \r\n\r\nAll of which leaves _Rise_ with not one, but two impossible tasks – 1) to somehow conclude this trilogy in such a way that it also works as the satisfying closing chapter to the nine-film _Skywalker Saga_, and 2) to somehow conclude this trilogy despite having to abandon and retcon much of what the second film did.\r\n\r\nThe importance of this trilogy's disconnection from the others was brought into relief for me by something my uncle said when we were discussing _Rise_. He's a fall-down drunk who talks to trees and may be involved in a plan to resurrect Hitler as a gay sushi chef, but he has a very interesting perspective on the _Star Wars_ films. To paraphrase, he said that to him _Force Awakens_, _Last Jedi_, and _Rise_ never felt like _Episodes VII_, _VIII_, and _IX_ – rather they felt like _Episodes X_, _XI_, and _XII_, and the \"real\" _Episode VII_, _VIII_, and _IX_ were never made. This isn't him arguing that Lucas's ideas for the third trilogy (which were rejected by Disney) should have been used and would have been awesome – rather his point is more structural; this trilogy is built on a serious of major events which take place between _Return of the Jedi_ and _Force Awakens_, which we never got to see and which fundamentally divide this trilogy from the other two. Had we been made privy to these events, however, these last three films would have had a much easier task of integrating into and ending the twelve-film _Skywalker Saga_. I have to admit, it wasn't something that had occurred to me, but the tree to whom he pitched it really sold me on the idea when it told me over the phone, and it does make a lot of narrative sense – had this been the fourth trilogy rather than the third, its connection to the first six films would have been much more organic, the story much more contiguous, and the task of bringing the entire saga to a close considerably less daunting.\r\n\r\nOf course, a big question is whether or not Disney had a specific narrative plan going into this thing, with many arguing that the lack of coherence between the three films proves that they did not. But that seems somewhat unbelievable to me. Rather (and again, I have to credit my uncle with this), it's more likely that Abrams laid groundwork for a coherent three-film arc, but Rian Johnson was more concerned with making a Rian Johnson film than a _Star Wars_ film, and ignored (if not necessarily undermined) much of Abrams's preparatory work. This also feeds into the criticism that the first hour of _Rise_ is too plot-heavy and expositionary; which could be explained if he was essentially in a position of having to do two films' worth of work in one, because plot points that should have been emphasised in _Last Jedi_, to set up the events in _Rise_, simply weren't.\r\n\r\nThe big thing here is the return of Palpatine, which has been argued to be completely arbitrary, a desperate bit of fan service from a filmmaker trying to win back fans, and which doesn't make a whole lot of narrative sense. I can certainly sympathise with those sentiments, and I agree that his return negates Vader's sacrifice at the end of _Return of the Jedi_ and makes a mockery of the whole \"_restoring balance to the Force_\" prophecy in the prequel trilogy. However (and this is the final reference to my uncle), there were a number of hints in _Force Awakens_ (that I did not pick up on) that a big bad was pulling the strings and that that big bad was Palpatine. To explain any more would constitute spoilers for _Rise_, but there are videos on YouTube posted shortly after the release of _Force Awakens_ which speculate (correctly, it turns out) that Palpatine might be involved. Taken together, it's enough to convince me that his return wasn't as arbitrary as it may seem. And although the fact that it seems that way at all is still a major problem, that's more likely the fault of Johnson rather than Abrams.\r\n\r\nThere are some smaller issues with the film, however. For example, there are far too many shots of Rey staring off into the middle-distance as she senses something (usually connected to Ren). The film also tends to treat death less than reverentially; no less than six characters die, only to return in some form or another, which cheapens and undermines both the goals of the characters and the inherent risk in attempting to achieve those goals. The quartet of main characters also remain as insipid as they were in the previous two films – Rey never gets beyond the reluctant Jedi trying to wrap her head around everything; Finn never gets beyond the token good guy who used to be bad template; Poe never gets beyond Han Solo-lite; and Ren never gets beyond the moody emo who hates his parents and so is rebelling against them by hanging out with a questionable crowd of intergalactic fascists. As you do. The structure of the plot is also poor, far too repetitive, and relying too heavily on coincidence. The biggest problem is that the whole film is built around the Resistance trying to get to Exegol. To do so they need the Wayfinder, but to get that they need this other thing, but to find that they need to go here and speak to him, but to do that they need a mystical doohickey but to get that they have to…you get the picture. The whole film feels like a series of video game quests.\r\n\r\nSomething else that bothered me is a semi-spoiler, so skip this paragraph if you wish. Mimicking the scene in _A New Hope_ where the _Millennium Falcon_ swoops in to save Luke in the final battle, there's a shot towards the end of the film where a massive fleet of thousands of Resistance ships is revealed, led by Lando Calrissian (Billy Dee Williams). But where did such an armada come from? How was Lando able to assemble so many ships in such a short space of time (he has no more than a couple of days)? If such a fleet exists, why not use it before now? Visually, it's a spectacular shot, but the grandiosity is achieved by sacrificing logic.\r\n\r\nFor all that, however, I have to admit, I enjoyed _The Rise of Skywalker_ for the most part – it's a fine spectacle taken on its own terms, very loud, very over-the-top, and very entertaining. One thing that's come in for a lot in criticism is the number of callbacks to previous films. And there certainly is a lot, but, generally speaking, I thought they were fairly well-handled, logical enough and reasonably organic. For example, Palpatine tells Ren that some people consider Sith abilities to be \"unnatural\", which was exactly what Palpatine told Anakin (Hayden Christensen) in _Revenge of the Sith_; Poe and Finn are shown playing the holographic chess game on the _Falcon_; the turret gun on the _Falcon_ still has the old-school graphic readout as seen in New Hope; during her training, Rey uses the blast shield on her helmet whilst fighting a flying bot, another reference to _New Hope_; characters sink into quicksand in a scene reminiscent of the garbage compactor scene in _New Hope_; a character Force-lifts an X-Wing from a swamp just as we see Yoda doing in _Empire_; there's a scene of Palpatine and Rey watching a nearby space battle, just as Palpatine and Luke do in _Return of the Jedi_.\r\n\r\nAesthetically, as one would expect, everything looks and sounds great, particularly Palpatine's base on Exegol. Abrams and cinematographer Dan Mindel (_John Carter_; _The Amazing Spider-Man 2_; _Pacific Rim: Uprising_) shoot these scenes like it's a horror movie – deep chiaroscuro shadows, ominous caverns disappearing in the background, unnaturally powerful lightening flashing from above. This tone is helped immeasurably by the production design by Rick Carter (_Forrest Gump_; _A.I. Artificial Intelligence_; _Avatar_), which really sells the vast otherworldliness of the place. Equally important here is the sound design by David Acord (_Guardians of the Galaxy_; _Avengers: Age of Ultron_; _The Secret Life of Pets_), which features a constant chatter of unearthly and disembodied voices, like a thousand ghosts all whispering at once. \r\n\r\nThe whole thing has a dark vibe the likes of which we've never really seen in _Star Wars_, and the scenes here are probably the best in the film, from a craft perspective if nothing else. The scenes showing Rey and Ren speaking to one another via Force Dyad are also excellent. These scenes were easily the best part of _Last Jedi_, and they're just as good here, as we see the background of one character's location appearing behind the other character, with the backgrounds shifting from one to the other as the scenes play out. A lightsaber fight makes particularly good use of the Dyad, with events in one location having an unexpected effect on events in the other.\r\n\r\nSo, all things considered, although I enjoyed _The Rise of Skywalker_ and found it a vast improvement over _Last Jedi_, it never touches greatness. Everything feels workshopped and focus-grouped to within an inch of its life, and the spark of originality that was so prevalent in the original trilogy and less so in the prequels seems almost extinguished. It looks great, and it's both exciting and entertaining, but it's also safe and predictable in a way that none of the films were when Lucas was still in charge. And sure, you might say that fans rejected _Last Jedi_ because it took too many risks, and now they reject _Rise_ because it doesn't take enough, and there's probably some truth to that. But the fact is that the film never feels like a closing chapter, not because it looks like there'll be more chapters, rather because it never seems to know how to conclude the story with much in the way of satisfaction. I enjoyed it whilst I was watching it and it's a decent enough _Star Wars_ movie, with some terrific individual scenes. But as the final entry of a 42-year-old franchise (the most popular franchise in any medium in human history), the whole thing is, perhaps inevitably, a little disappointing.", "created_at": "2020-01-07T03:45:25.542Z"}, {"movie_id": 181812, "review_id": "5e2f275ac56d2d001a4e4868", "rating": 4.0, "review_text": "“Do it!”\r\n\r\nI’m surprised they added that in there despite all the memes.\r\n\r\nAnyway…\r\n\r\nA long time ago...four years to be distinct; the space opera ‘Star Wars’ returned to cinemas with ‘The Force Awakens', that brought back the bittersweet experience that fans have been craving for over 30 years. Well lets just say Christmas was magical that year. While I wasn’t quite as wowed as everyone else, but I still enjoyed it otherwise and I was interested where the story will go after J.J. Abrams left his “mystery box” of questions for another director to answer. How exciting and epic the next years will be.\r\n\r\nAnd then the sequel and two spin-offs happened. Well lets just say my interest for these new movies has completely evaporated. Sad times indeed. And no I don’t feel like I’m being overly negative in the heat this movie is receiving, because right now, at this very moment, my thoughts and overall feeling on this movie are genuine, and re-watching it isn’t going to safe it. I’m not disappointed or angry, because at this point I stopped caring.\r\n\r\n‘Rise of Skywalker’ is a factory made movie with no heart, no soul, and no magic. Words and phrases like: bold, epic, and satisfying - are not the type of words that I would describe this final chapter in the Skywalker saga. I can’t call something bold if it played things incredibly safe. Each movie exists just to shred up and apologize for what came before it.\r\n\r\nJ.J. Abrams can be hit or miss sometimes, but I must admit he had a difficult task to follow up on ‘Last Jedi’ and Rian Johnson undoing his mystery box questions. If that wasn’t bad enough, the death of Carrie Fisher also had a massive effect on the story, and including her into the movie, while respecting her legacy and giving her as much screen time with the limited deleted footage they have. Abrams sadly treads on familiar ground and doesn't really handle the originals (or even the prequels) with respect. This is literally a remake of ‘Return of The Jedi’.\r\n\r\nThe story in this movie is almost nonexistent. It’s so rushed that you can’t catch a breather amidst the chaos. Nothing flows naturally. Characters running around and jumping from location to location. I think the quick pace easily hides the poor writing and plot holes. I also thought the title crawl is a bit off and felt it was written by a Reddit user. From the moment the movie starts until it ends nothing makes a lick of sense.\r\n\r\nI think the biggest waste of opportunity is the character of Finn, because the potential of greatness was set up in ‘The Force Awakens’, and they didn’t do a single thing with it. I mean, a Stormtrooper who revolt against the corrupt and sinister empire, which is something we haven’t seen before. Heck, a long time ago he held a lightsaber. Unfortunately in this movie he’s a comedic buffoon that sweats and shouts a lot. What a waste of John Boyega’s talent. They did him dirty.\r\n\r\nI like Daisy Ridley, not so much on Rey. I don’t want to jump on any bandwagon here, but I don’t understand how someone can be so over powered and skillful at the force with barely any training. Whenever there is training it’s over before you know it. There was a point where I said to myself, “Who taught her to do that?”, or “how the hell did she do that?”. I really struggled to emotionally connect with Rey, because there’s nothing more dull than a character with no flaws or growth.\r\n\r\nThe strongest element throughout these three movies was Kylo Ren by the magnificent Adam Driver. This guy literally carried this series on his back. At least his character as an arc, and not just wasted potential. I actually connected with his inner conflict between the dark side and the light side.\r\n\r\nThe cinematography looks beautiful and absolutely striking. The visuals and music will always be great with these movies regardless on the actual movie.\r\n\r\nEmperor Palpatine is back...for some reason. The vague explanation of why he’s back made it clear to me that Disney had no plan from the start for these new movies. Still, Ian McDiarmid is fantastic as always. He oozes with evil and soaks up every wicked moment of it.\r\n\r\nThe awkward and ill-placed comedy from ‘Last Jedi’ is still present and it got worse and worse as it went along. With this being the finale, new characters still get introduce and get some development. Like, why are you introducing new characters now? Billy Dee Williams returns as the slick and classy Lando, but sadly doesn't really do much for the story. Richard E. Grant is great as the ruthless new commander of the First Oder with the small screen time he has. Dominic Monaghan, on the other hand, feels like an extra. Rose Tico has a smaller role this time around and her entire love triangle with Finn from ‘Last Jedi’ gets brush under the carpet. Kelly Marie Tran sure can’t catch a break.\r\n\r\nThe action sequences with the lightsaber fights and space battles were mostly forgettable. Even the scenes that stick to mind wasn’t that special. The camera fails to capture focal points with the grand scale lacking.\r\n\r\nI like how there’s a lesbian couple towards the end that’s on screen for about two seconds. So when the studio want to market the movie for China, they could easily edit out it to make it more “marketable”. How progressive Disney.\r\n\r\nOverall rating: An unsatisfying conclusion. At least ‘The Mandalorian’ is good.", "created_at": "2020-01-27T18:09:30.887Z"}, {"movie_id": 181812, "review_id": "5e75390b357c0000114e83aa", "rating": 5.0, "review_text": "Had its moments I guess, but the plot made very little sense and the blatant ways of trying to undo what Rian Johnson did, as bad as they were in The Last Jedi, just wreaked of desperation. Do have to chuckle at completely dropping the set up of a Finn/Rose/Rey love triangle, though in that case not such a bad thing.\r\n\r\nThe one consistent thing from this mess of a trilogy is Adam Driver, too bad he didn't get the proper material to make the most of it. Beyond him, nothing else really works, even the direction from Abrams felt old, besides, not a big fan of CGI vs CGI battles (like in Transformers), lacks a certain weight and thus suspense.\r\n\r\nFurther shame, now that the Skywalker Saga is done, as poorly made as the prequel trilogy was under the direction of George Lucas, even he wouldn't pass bringing Han (Ford), Leia (Fisher) and Luke (Hamill) together.\r\n\r\n**2.5/5**", "created_at": "2020-03-20T21:43:39.013Z"}, {"movie_id": 181812, "review_id": "5e7d5b0c13a320321727b9a2", "rating": 4.0, "review_text": "When it comes to “Star Wars,” being a fan comes first and a film critic comes second. I was four years old when I saw the original, and I’ve been a huge devotee of all things in the galaxy for forty plus years. This isn’t a review written by a disgruntled fan, as I have grown to love Rey, Poe, and BB-8 almost as much as Han Solo, Luke Skywalker, and R2-D2. But when a movie is so careless with its beloved characters both past and present, it’s something that can’t be ignored.\r\n\r\nThe Skywalker saga comes to its disappointing end in this (supposedly) final chapter. The recycled story is basic and mostly predictable, as the surviving Resistance rallies together to face the First Order for one final battle. So much is shoved into this movie that it feels like a pressure cooker that’s being forced to tell a too-rushed story. It becomes frustrating early on.\r\n\r\nI realize “Star Wars” is a touchy subject and fans will always be debating the films until the end of time, but “The Rise of Skywalker” is one of the more mediocre entries in the series. From the reveal of Rey’s (Daisy Ridley) origins to the head-scratching actions of Kylo Ren (Adam Driver) to the disappointing conclusions for Hux (Domhnall Gleeson), Finn (John Boyega), and Poe’s (Oscar Isaac) stories, this thing stinks to high heaven. Almost everyone does things that are totally out of character, events happen that make absolutely no sense within the Lucas-created universe, it seems like more questions are raised than are answered, and new rules of what the Jedi can and can’t do seem to be made up on the fly because they make for convenient story arcs.\r\n\r\nI’m not usually a literal filmgoer but this movie is so poorly plotted that its myriad problems are too abundant to ignore. Since this is a spoiler-free review I can’t divulge them here, but those who’ve seen the film will be able to name at least half of the dozen or so massive problems within seconds.\r\n\r\nParticularly shameful is the inexcusable way Rose (Kelly Marie Tran), who was a major character in “The Last Jedi,” is discarded like trash and relegated to a very minor background role in this film. Perhaps a defense could be constructed that she didn’t quite fit into this part of the journey, but I say hogwash. This is absolutely a decision that feels like it was done to appease angry internet fanboys who screamed and howled about Tran and her character behind the anonymity of their keyboards. Kowtowing to bullies is a colossal setback to the very themes that root the “Star Wars” franchise.\r\n\r\nFurther aggravating to life-long fans is the sparse emotional connection that stems from the film’s many fakeouts. There are zero consequences to the movie’s most shocking moments. It’s a crappy thing to do because it assures a near-complete loss of trust from your audience. For every gasp-inducing jolt and hold-for-tears touching moment, a sense of betrayal almost always follows.\r\n\r\nEven worse is the quality of the filmmaking. This movie is so poorly shot it’s shocking, and director J.J. Abrams, who did a terrific job with “The Force Awakens,” is again in the driver’s seat. Only this time instead of keeping an unflappable composure behind the wheel, he’s swerving in and out of traffic at such a high speed that he spins out of control and careens off the nearest cliff.\r\n\r\n“Rise of the Skywalker” is broadly entertaining, but it’s not a good movie. It’s the year’s biggest letdown.", "created_at": "2020-03-27T01:46:52.373Z"}, {"movie_id": 181812, "review_id": "5eb8bf2f0cb3350020d0f8e1", "rating": 1.0, "review_text": "Bad. Everytime i watched Star Wars, i regret. So much hype.", "created_at": "2020-05-11T02:57:51.336Z"}, {"movie_id": 181812, "review_id": "5f1491da1c6aa700377e4ea3", "rating": 1.0, "review_text": "This was painful to watch. Nothing works, it is almost like this movie was directed by someone who doesn't know the rules of this universe. Everybody is now force sensitive and random Jedi masters popping up here and there.\r\n\r\nA complete U turn from all the other movies and the direction they were taking and their logic. Lead by the most useless and lifeless cast ever, with a main character that contradict itself during the whole movie. Family isn't important but let me pick my family name because of my past...\r\nThis movie finished to bury this franchise for me and I will now stick to The Mandalorian and stories like Rogue One or Solo. What a waste.", "created_at": "2020-07-19T18:32:58.408Z"}, {"movie_id": 181812, "review_id": "601de429d4b9d9003f0ec69d", "rating": 7.0, "review_text": "Whilst still serviceable, <em>'Star Wars: The Rise of Skywalker'</em> disappointed me - it makes for a relatively limp finish to the sequel trilogy.\r\n\r\nThe plot is the biggest letdown. It's all over the place, it might have a good amount of action but the actual point of the film is uninteresting and feels like something we've seen before. The cast still do well amongst all that, but I can't say I'll remember a performance from this.\r\n\r\nWith that said, Daisy Ridley is the best thing about it. Adam Driver is fine, but his character doesn't interest me much at this point. John Boyega and Oscar Isaac felt underused, while Kelly Marie Tran is discarded almost completely. Richard E. Grant is a slight upgrade on Domhnall Gleeson, but not by much.\r\n\r\nA shorter run time may have helped this, instead it feels kinda bloated and without much reasoning to be so. I don't dislike it, it's still just about what I'd describe as good, but given it's part of <em>'Star Wars'</em> it should've been far greater - in my opinion, at least.", "created_at": "2021-02-06T00:34:49.481Z"}]