[{"movie_id": 246741, "review_id": "5787c15d92514131ca000ecf", "rating": 6.0, "review_text": "> The video document of the life of the vampires.\r\n\r\nA documentary style horror comedy based on the short film of the same name by the same directors. I would say it is an interview with the vampires in the Kiwi style. The film follows a group of vampires living in an old mansion and their everyday routine, including how they manage to get blood and confrontation with other mutants are documented.\r\n\r\nDefinitely a wonderful comedy, but feels like a mix of 'Dark Shadows' and 'Addams Family'. The title implies the nightlife of these creatures, especially adapting the modern way of lifestyle. So their exploration begins here for their video document. Being different is how much struggle is what the film focused. Threats from various quarters and getting over from every disastrous event is revealed.\r\n\r\nQuite an interesting vampire film with the awesome characters and of course the entire film was shot in the dark time. It is not a cliché, but just a spoof of the typical vampire theme. Cleverly written screenplay and direction with the well supported performances. Looks like many people had loved it, I'm slightly on the different side that I enjoyed watching it but did not like much. Because I have seen better film in the similar concept. So I still recommend it because it is worth a watch.\r\n\r\n6/10", "created_at": "2016-07-14T16:44:13.472Z"}, {"movie_id": 246741, "review_id": "58c16e769251411d7b00649b", "rating": 8.0, "review_text": "'What We Do In The Shadows' is an hilarious mockumentary film by the makers of 'Flight of the Conchords'. The movie is filed with brilliant homages and references to vampire films such as 'The Lost Boys', 'Twilight' and 'Let The Right One In'.\r\n\r\nThe directorial style is very similar to the hit TV show 'The Office' as it is able to create humour in the realism and personal interviews and monologues. This method also allows it to be genuinely scary at times such as when we meet the housemate inspired by 'Nosferatu'. The extreme and realistic gore also comes across as very brutal and juxtaposes the silly gags. \r\n\r\nThe actors are all very good. Dead pan. Great delivery.\r\n\r\n★★★★", "created_at": "2017-03-09T15:02:14.143Z"}, {"movie_id": 246741, "review_id": "62d5eeb5b6cff100504fc627", "rating": 10.0, "review_text": "Not the vampires we wanted but the vampires we needed.\r\nSay whatever about Taika Waititi, but he is a capable screen writer, director and comedian.\r\n\r\nIt is story about a bunch of vampires in a reality show and their interaction with the modern world, that made Waititi a famous director.", "created_at": "2022-07-18T23:37:25.187Z"}]