[{"movie_id": 73532, "review_id": "533ff0bc0e0a26361c001505", "rating": 6.0, "review_text": "Simple story, well and gently told in Kaurismäki's characteristic style.", "created_at": "2014-04-05T12:02:04.008Z"}, {"movie_id": 73532, "review_id": "5b8ac0a4c3a368520c01c75b", "rating": 5.0, "review_text": "In the 2011 production LE HAVRE, the Finnish auteur Aki Kaurismäki steps away from his usual Helsinki setting for the first in what will be a trilogy of films in Western European port cities. Always rooting for the underdogs, Kaurismäki this time concentrates not just on the disenfranchised urban lower class, but on a socioeconomic strata arguably lower than them: illegal immigrants. Middle-aged shoeshiner Marcel (André Wilms), who lives in a run-down neighbourhood with loving wife Arletty (Kati Outinen) meets Idrissa (Blondin Miguel), a child who has found his way from Gabon to France inside a shipping container. Marcel decides to shelter the boy and see him on to England, his intended destination, but detective Monet (Jean-Pierre Darroussin) is on their heels.\r\n\r\nIn spite of the French setting, this remains a very Finnish film in its sparse dialogue and deadpan humour. Kaurismäki yet again uses a very drab colour scheme and sets the film ostensibly in the present, but with cars, radios and rock music dating from the 1950s. Like nearly every film he has made, there is a musical performance by an oldies rock 'n' roll band, complete with pompadours and leather jackets. This is getting appallingly repetitive. Basically, if you've seen any two previous Kaurismäki films, then you'll find almost nothing new in the aesthetic and even the plot.\r\n\r\nThat said, this is a more life-affirming film than his last, the absolutely bleak LÄHIKAUPINGIN VALOT of 2006. Kaurismäki is clearly concerned with the plight of those who would escape sub-Saharan Africa by any means necessary, and this leads the viewer to reflection, but his exposé of detention centres and police harrassment becomes heavy-handed at times.", "created_at": "2018-09-01T16:39:00.053Z"}]