[{"movie_id": 10200, "review_id": "55c8ce7d9251415bad00161c", "rating": null, "review_text": "Terrible remake, original vastly superior", "created_at": "2015-08-10T16:17:01.924Z"}, {"movie_id": 10200, "review_id": "5ddf3f0bc51acd0013f285fe", "rating": 8.0, "review_text": "***Intriguing, Spiritual, Insightful, Moving***\r\n\r\n\"The Day the Earth Stood Still\" (2008) is an intriguing, powerful and even moving modern sci-fi blockbuster. I particularly like the symbolism: Klaatu=Christ, GORT=YaHWeH, as well as the numerous biblical references: Noah's Ark, the death plague, human beings trying to put God in a box literally, the sacrificial nature of agape love, etc. In other words, the film tackles subjects of great depth that every human being can relate to whatever their belief system. This itself separates it from the usual idiotic blockbuster fare.\r\n\r\nNow let me address some common criticisms (please see the film first before reading further due to **SPOILERS**): \r\n\r\nThe kid is initially quite annoying but this is understandable as he's an archetype for what humankind is: an annoying, untrusting, simpleminded child-race. His sudden change into \"maturity\" represents how humanity needs to \"grow-up.\" This helps make sense of the kid's repeated statements about killing Klaatu, which were magnified by the media's slander of Klaatu as a dangerous escaped convict. Klaatu's strange actions helped feed this negative mindset. As for the kid's dead father, the boy was only 9 years old and understood his father to be a soldier. Why wouldn't he have a mythical impression that he killed 'bad guys' for a living, likely with his bare hands? \r\n\r\nThe judgment of mass human destruction was already set for the earth after hundreds of years of observation, including an Asian scout who lived with humans for 70 years. Klaatu was sent to activate the judgment UNLESS he observed some clear indication that the harsh judgment wasn't necessary yet. Klaatu didn't change the original plan UNTIL very late in the story, which is why he stated to Helen that he wasn't sure if he could overturn it. Although Klaatu was the primary agent, he wasn’t necessarily alone. Gort was there and he was only partially robotic, as well as Mr. Wu. There were probably hundreds/thousands of other aliens involved in one way or another.\r\n\r\nThe military attacks because their modus operandi is to defend the nation, which was augmented by the destructive nature of humanity in general. \r\n\r\nWhen Bate's character finally decides to send Helen out to talk with Klaatu she was the government’s proverbial last hope. All other governmental attempts to prevent the judgment failed abysmally up to this point, not to mention the judgment of mass destruction was ALREADY well into motion. Other national leaders were concerned with saving their own.\r\n\r\nThe biggest sphere was the central command orb. Klaatu didn't possess the power to stop the swarm himself; he had to get to the central orb to attempt to stop the mass destruction. Even then, he wasn't sure if he could do it. In fact, it cost him dearly.\r\n\r\nThe alien swarm only destroyed humanity and all human imprints (like the stadium, the the installation and the semi); I saw no evidence of the swarms destroying trees or animal life. The animal ark-orbs were obviously precautionary in nature; in other words, the aliens knew there would be collateral damage due to the nature of the swarms so they snatched away all manner of animal life as a precaution.\r\n\r\nKlaatu made it quite clear what he was doing: saving the earth by destroying humanity and their intrinsic bent toward destruction. The way he put it was: If humanity lives the earth will die, but if humanity dies the earth will live.\r\n\r\nThe Aliens are powerful, but it's inaccurate to call them careless. They monitored the planet for centuries and their decision was carefully decided.\r\n\r\nTo write-off humanity's destructive bent as \"minor-league carelessness\" is shallow and un-enlightened, as well as wholly inaccurate.\r\n\r\nThe aliens' actions had nothing to do with \"might makes right\" but everything to do with saving a planet from the infection that would wholly destroy it (people) if they failed to act. Their celestial judgment was that the cancer HAD to be cut out and time was of the essence.\r\n\r\nReally, the only \"detestable characters\" are the government as a whole, which is displayed as a cold machine. Helen (Jennifer Connelly) is a character of beauty, reverence and wisdom while the professor plays humanity's wise intercessor. Kathy Bates' character is unlikable because she represents the government and comes off as an arrogant machine-like biyatch. After she's completely humbled, however, she changes her tune. Meanwhile the kid is only 9 years old and lost both of his biological parents; cut him some slack. Besides, he also changes his tune and Klaatu takes on the role of his spiritual father. How can you NOT feel for Jacob when he falls on his face at his dad's grave? \r\n\r\nSo none of the common gripes hold water. The insane bashing of the film is simply the result of an unjust critical feeding frenzy. If people would disregard the monkey-see-monkey-do panning and view the film with an open mind they might actually enjoy it and possibly discover something worthwhile.\r\n\r\nThe film runs 1 hour, 43 minutes.\r\n\r\nGRADE: A-", "created_at": "2019-11-28T03:29:15.009Z"}]