[{"movie_id": 472451, "review_id": "5b90166ac3a368344c000f13", "rating": null, "review_text": "Yet another anticipated film from an actor-turned-director is Boy Erased, the work of Golden Globe nominee Joel Edgerton, who wrote and stars in the film.\r\n\r\nThe flick follows the recently outed son of a Baptist preacher, Jared (Lucas Hedges), after he’s forced to partake in the church’s gay conversion program. Based on the critically acclaimed memoir by Garrard Conley, Boy Erased features an all-star cast which, in addition to Hedges and Edgerton, boasts Oscar winners Nicole Kidman and Russell Crowe", "created_at": "2018-09-05T17:46:18.182Z"}, {"movie_id": 472451, "review_id": "5d31b1802f8d095259d6d5b8", "rating": 5.0, "review_text": "**_Clearly comes from a place of respect, but it's emotionally unengaging and rather dull_**\r\n\r\n> _Congress should oppose any effort to put gay and lesbian relationships on an equal legal status with heterosexual marriage. Congress should oppose any effort to recognize homosexual's_ [sic] _as a \"discreet_ [sic] _and insular minority\" entitled to the protection of anti-discrimination laws similar to those extended to women and ethnic minorities. Congress should support the reauthorization of the Ryan White Care Act only after completion of an audit to ensure that federal dollars were no longer_ _being given to organizations that celebrate and encourage the types of behaviors that facilitate the spreading of the HIV virus. Resources should be directed toward those institutions which provide assistance to those seeking to change their sexual behavior._\r\n\r\n– Mike Pence (current Vice President of the United States); Campaign statement when running for Congress, 2001\r\n\r\n_Boy Erased_ is one of those films it seems almost churlish to criticise for its formal aspects, given that it obviously comes from a place of deep respect, has genuinely laudable intentions (albeit with one eye on award season), and says something undeniably important and just. Written and directed by Joel Edgerton (who also stars and produces), the film is based on Garrard Conley's _Boy Erased: A Memoir of Identity, Faith, and Family_ (2016), the true story of his experiences with conversation therapy in Arkansas in 2004. In a political climate where progressive thinking seems to be backsliding more and more, given the regressive beliefs of many of those in power, one should celebrate a film which highlights the barbaric concept of enforcing heteronormative social mores by way of psychological, and often physical, abuse. However, simply because a film has good intentions, it doesn't necessarily follow that it's a good film, and _Boy Erased_ is such an example; a film whose aims can be praised, but whose flaws cannot be ignored. Whereas Desiree Akhavan's recent _The Miseducation of Cameron Post_ approached similar subject matter from a perspective of irreverence and satire, _Boy Erased_ is far more sincere. And because of its self-seriousness and its insistence on keeping the audience emotionally distanced from the characters, it remains underwhelming, never getting anywhere near the kind of emotional highs and lows one might anticipate from such inherently sensitive material. It's a topical and morally laudable film, unquestionably. One wishes it were simply better than it is.\r\n\r\nSet in 2004, the film begins as 19-year-old Jared Eamons (Lucas Hedges) attends his first day at Love in Action, a conversion therapy program in Arkansas. The son of Southern Baptist preacher and car salesman Marshall (Russell Crowe) and his wife Nancy (Nicole Kidman), Jared is initially looking forward to the program, keen to be purged of his homosexual impulses. Run by Victor Sykes (Edgerton), the program is based on the concept that homosexuality is a choice influenced by poor parenting and moral abnormalities in a person's extended family, and thus Sykes has students draw a family tree indicating such things as drug or alcohol addiction, use of pornography, criminal convictions etc. Students must also sign a waiver declaring that they won't speak with anyone about what occurs during therapy. Other students include Jon (Xavier Dolan), who is so fanatically devoted to conversion, he refuses to even touch other men, although he turns up every day with fresh bruises; Gary (Troye Sivan), who has made peace with his homosexuality, and plans to pretend to be straight until he can leave; and Cameron (Britton Sear), a timid aspiring footballer. Meanwhile, Nancy rents a nearby motel room where she and Jared will stay for the duration of the program. However, Jared soon learns from Jon and Gary that there is no specific end-point for the therapy, and if he fails to convince Sykes that he is straight, he may be required to move onto the campus full-time. The backstory of how he came to be signed up to the program then unfolds achronologically, intercutting his increasingly unsettling time at Love in Action with such incidents as his awkward first sexual encounter with his ex-girlfriend, Chloe (Madelyn Cline); his first homosexual experience at college, with his running-partner, Henry (Joe Alwyn); a non-sexual relationship with a fellow college student, Xavier (Théodore Pellerin); how his parents found out about his homosexuality; and Marshall's decision, taken in consultation with two church elders, to send Jared to therapy.\r\n\r\nI'm a heterosexual male from a country where conversion therapy isn't really a thing; there is only one conversion therapy program in Ireland, and, as of January 2019, a bill to outlaw such therapy is passing through the Oireachtas. Given my very limited exposure to the subject, I was more than a little surprised to learn that in the US, only 15 states (plus Washington, DC) have legislated against the practice, and in the remaining 35, it's perfectly legal. To be honest, I can't even get my head around the fact that some people won't accept homosexuality amongst their family or friends, so the concept of parents knowingly exposing their children to psychological abuse so as to \"pray away the gay\", and doing so within the scope of the law, is completely beyond the realm of comprehension. That such things still happen in a modern so-called civilised western society is both deeply disturbing and incredibly upsetting, and it is this world into which _Boy Erased_ offers a window.\r\n\r\nOnce Jared is installed at Love in Action, it isn't long before Sykes begins to preach \"_you cannot be born homosexual. It's a choice_\" and \"_God will not love you the way that you are_\". At the same time, the students are tutored in \"_masculine_\" physicality (don't cross your legs when seated, don't slouch, always shake hands firmly), discouraged from anything that deviates from heteronormative behaviour (Jared has pages from a notebook of short stories torn out and discarded), and advised on what not to read (when Sykes learns Jared's college course includes such titles as Oscar Wilde's _The Picture of Dorian Gray_ (1890) and Vladimir Nabokov's _Lolita_ (1955), he suggests that Jared shouldn't return to his studies, committing instead to Love in Action full-time).\r\n\r\nHowever, the film is not confined to the program, also offering an examination of some of the attitudes of fundamentalist religiosity toward sexuality. Significantly, when Marshall learns that Jared is planning on spending the night with Chloe, he is quite proud of his son, although both Marshall and Nancy already assume that Jared and Chloe will be getting married in the not-too-distant future. Although the film admirably resists the urge to vilify Marshall or Nancy, even Love in Action itself, Edgerton is unequivocal in condemning a system that compartmentalises anything with which it disagrees as \"_taboo_\", thereby retarding any kind of discussion. Love in Action is predicated on making young people feel guilty regarding the \"sin\" of their sexual practices and/or impulses, whilst at the same time reinforcing the infallibility of church doctrine. This instils a deep-rooted sense of torment for young men and women who are already confused about what they are feeling - if a person's predilections are directly in contradistinction to church dogma, then such predilections must obviously be immoral and against God; the irreconcilability of innate homosexual desire with the fact that such homosexuality is a sin.\r\n\r\nThe film opens with voiceover narration over home video footage of Jared as a baby, immediately setting him up as the focal character, and inculcating us into his world. Indeed, Jared appears in every scene, although, strangely, voiceover is never employed again, rendering this initial use stylistically isolated. Visually, the film is drab and unimaginative, but deliberately so. This blandness may initially seem disappointing, given that Edgerton's 2015 directorial debut, _The Gift_, was visually impressive. However, in _Boy Erased_ the design is intended to mirror the interior of Love in Action - a place of functionality over aesthetic nuance, a place where neutralising colours are used to enforce reserve and restraint at the expense of vitality. If anything, Edgerton is too successful with this mirroring, as the insipidness of the Love in Action scenes often bleeds into the scenes outside the program. Had Edgerton, cinematographer Eduard Grau (_A Single Man_; _Buried_; _Suite Française_), and production designer Chad Keith (_Take Shelter_; _Midnight Special_; _Leave No Trace_) showed a little more _panache_ when depicting the outside world, such scenes would have been far more thematically impactful, as their visual differentiation would have served the central tenets of the film.\r\n\r\nIn terms of the acting, as Jared, Lucas Hedges has a difficult task, playing a character that becomes increasingly withdrawn and emotionally shut down as the film progresses. From the very beginning, Jared is somewhat distant, making it difficult to determine if his muted emotions are part of Hedges's performance or a weakness in that performance. For example, is his inherent lack of fear a component of the character, or is Hedges simply not tapping into the necessary emotions? That this might be the case can be seen if one compares his performance to that of Xavier Dolan as Jon, who exudes desperation and existential panic every second he's on screen. Of course, Jared is very much a passive character, with only one notable example of him asserting his own agency and breaking through the emotional paralysis which has stifled the character (and the actor). When this scene does come, it's quite powerful, with Hedges playing it in such a way as to suggest the release of long-gestating pressure. On the other hand, in a scene where he screams and throws rocks at a glass-encased picture of a male model, the performance comes across as a performance and doesn't ring emotionally true. As a whole, I felt that Hedges played Jared pretty much identically to how he played Patrick in Kenneth Lonergan's _Manchester by the Sea_ (2016).\r\n\r\nKidman plays Nancy as a woman who very much subscribes to the notion that the man is the head of the household, accepting Marshall's decision to send Jared to therapy without openly questioning him. However, it's obvious from the start that she's not entirely comfortable. Later, as she starts to learn some of what is going on behind the closed doors of Love in Action, her attitude becomes more and more adversarial. She has a particularly good scene where she finally persuades Jared to allow her to read Love in Action's manifesto, and is equal parts shocked by the content and amused by the spelling mistakes (she finds one particular reference to \"_Almighty Dog_\" especially funny and especially worrying). Kidman plays the scene with a mixture of horror, amusement, and a desire to step in and protect her child, and she modulates these conflicting emotions perfectly.\r\n\r\nAs for Marshall, instead of him being the token villain of the piece, Crowe plays him as fundamentally conflicted. He loves his son deeply and is devastated by what has happened, so he never goes the clichéd route of condemning him from the pulpit and casting him into eternal hellfire. Marshall genuinely wants to help Jared, and even more so, he wants to understand, but is prevented from doing so by a lifetime of faith and his absolute conviction of his own moral certitude. Despite the character's flaws, Crowe's quiet and restrained performance elicits a degree of sympathy for a man who is clearly out of his depth, unable to overcome the indoctrination which is now making a relationship with his son an impossibility. As Sykes, Edgerton gives an almost robotic performance, playing the character as a regimental fundamentalist. A man without any peripheral vision in terms of morality and devotion to God, he is the kind of person who not only refuses to accept opinions that are in contradistinction to his own, but who is unable to even get his head around the fact that such opinions exist at all.\r\n\r\nHowever, despite the strong performances from both Kidman and Crowe, the film fails to depict the texture and nuances of the family dynamic. All three family members are, to a certain extent, types rather than fully fleshed out individuals. Along the same lines, none of the Love in Action students are granted any kind of arc or personality beyond that of the archetype they represent. Jon, Gary, and Cameron are all sketches of characters we've seen time and again in this kind of pseudo-prison narrative, and the film often falls back on generic tropes - hypocritical authority figures; a sadistic authority figure who is abusive beyond the parameters of the program (played by Flea from the Red Hot Chili Peppers); the \"inmate\" on the verge of complete psychological breakdown (think Pyle (Vincent D'Onofrio) from Stanley Kubrick's _Full Metal Jacket_); the focal character resisting the mandates of the institution (think McMurphy (Jack Nicholson) in Miloš Forman's _One Flew Over the Cuckoo's Nest_ or Dufresne (Tim Robbins) in Frank Darabont's _The Shawshank Redemption_). Regarding Sykes, a postscript describing his own sexual preference casts his character in a completely different light, and would have made for fascinating material had it been incorporated into the narrative. Granted, this is Jared's story, not Sykes's, but that doesn't change the fact that more information on his background (especially given what the postscript reveals) would have been very welcome.\r\n\r\nIt's also somewhat problematic that the only homosexual sexual activity depicted in the film is a rape. It's a powerful scene in and of itself, brilliantly shot in a single static take which forces the viewer to watch what is happening unmediated by editing or blocking. However, it's unsettling that Edgerton never shows us any consensual and pleasurable homosexual content. True, the film is not about sexual activity, so to only show one scene of such activity is fair enough in theory. But it remains problematic that the only time we see a homosexual character acting on their impulses is a rape scene. What is one supposed to take from that? Presumably, the scene is supposed to balance against the scene where Jared spends the night with Xavier without becoming physical. However, this scene is given far less time than the rape, and the character who rapes Jared is given far more characterisation than Xavier, creating a noticeable imbalance.\r\n\r\nAnother problem is that, as a whole, it's an extremely cold film, remaining always distanced, either unwilling or unable to really get into the fear and psychological trauma inflicted upon the attendees of programs such as Love in Action. Perhaps Edgerton was trying to avoid exploitative or manipulative emotion, but whatever the case, he has made a film that is itself emotionless, undercutting the harrowing story it tells by always keeping the audience one or two steps removed. Jared, in particular, is never depicted with anything resembling emotional specificity. We never feel his torment or loneliness, with his character depicted only to the extent necessary to drive the plot, and far too distanced for him to emotionally impact the audience.\r\n\r\n_Boy Erased_ is a laudable film dealing with an important subject, but it's also quite a poor film, with a disjointed narrative and paper-thin characters, redeemed only by fine performances from Kidman and Crowe. The biggest problem is that it insists on pushing the audience away, presenting the story clinically rather than emotionally, a dispassionate reportage rather than an angry denunciation. Edgerton's even-handedness is to be commended, as is his refusal to cast the parents, or even Love in Action itself, as the villains, and his avoidance of emotional manipulation is praiseworthy up to a point. However, there comes a moment in the film where you realise that you're as close to these characters as you're going to get, yet they have still only been summarised. The film will probably go on to be an important document in the ongoing attempt to eradicate this cruel practice. It will probably open the eyes of a lot of people who didn't know much about this subject. It is well-intentioned, and comes from a place of compassion and respect. It's just not an especially good film.", "created_at": "2019-07-19T12:03:12.474Z"}]