[{"movie_id": 833339, "review_id": "6358011befd3c2007e3d3985", "rating": 7.0, "review_text": "_Speak No Evil_ is an eerily realistic horror film that created incredible tension with the simplest interactions. Each incident escalates beyond comfortability leaving the family with the option of politeness or confrontation, with them choosing the former the entire movie. The scenes create a sense of awkwardness, where the audience is begging the family to remove themselves from the situation, but they remain. This is positive and a negative for the film. These choices the family make kept me engaged to see what happens next. But at the same time, it was incredibly frustrating to see baffling character choices be the vehicle for the plot. Despite that fact, the tension is built and remains throughout the runtime. Even though this movie had periods where it was quite slow, they never stayed for long without another problem being added to the list. I enjoyed it, but there are pacing problems that restricted me from being fulling ingulfed in the film.\r\n\r\n**Score:** _70%_ |\r\n**Verdict:** _Good_", "created_at": "2022-10-25T15:30:35.146Z"}, {"movie_id": 833339, "review_id": "6417f624e741460086726616", "rating": 10.0, "review_text": "First of all, let me say that I don't rate movies based on happy ending or bad ending. I rate them by their impact. If movie had an impact on you, if it affected you, this means movie was strong and achieved its goal, doesn't matter if it's a positive or negative impact. And Based on my criteria, this movie is 10/10! This movie actually traumatized me. I have seen a lot of horror movies, but this one affected me a lot, because unlike those paranormal movies about demons, devil and etc, this one is realistic, which means this what happened in this movie, might be happening in real somewhere. And when we - viewers watch movies, we feel for main characters and what I felt for them in this movie was very big pain. It left me very angry and whole night I had last scenes in my mind when I was lying in bed, because I was imagining what if I was in their place... I won't give you a spoiler, but be warned, if you're sensitive person and if you decide to watch it, it will traumatize you. It's a masterpiece, but with a very sad and bad ending.", "created_at": "2023-03-20T05:59:01.008Z"}]