[{"movie_id": 459151, "review_id": "61cb326f37b3a9004db2bee7", "rating": 3.0, "review_text": "I found the original Boss Baby really good. Great actually. Unfortunately this one was quite a disappointing.\r\n\r\nYes, there are a fair number of funny scenes and gags splattered around the movie. The chase sequences in the beginning of the movie are quite hilarious actually.\r\n\r\nThe story however is pretty lame. The original had a decent story. Yes it was a bit outlandish but at least it was a nice family story. This one is nothing of the kind. The basic premise of the story is just silly and the way it is done has pretty much turned it into a education-and-competition-is-bad piece.\r\n\r\nThis father which is one of the main characters are generally behaving like a moron and when, in the middle of the action, he just wanders of like a bloody zombie to watch his daughter instead of pulling the bloody switch that would have saved everything then I lost whatever hope I might have had of liking this movie.\r\n\r\nAlso, after that there was a repeated splattering of woke rubbish about how bad adults are, global warming nonsense and so on and so forth. Sure, those images came from the so called bad guy but any one with common sense knows that they were really there to push the message. I find it really despicable when woke story writers cannot keep their agenda out of children and family movies.\r\n\r\nAs I wrote at the beginning, quite a disappointment.", "created_at": "2021-12-28T15:51:11.102Z"}, {"movie_id": 459151, "review_id": "6598f99f6e938a0259cd76c7", "rating": 6.0, "review_text": "Ok, so I am definitely not the demographic here but I actually found the dynamic quite fun for a while. Following on from the first film (2017) we find that brothers \"Tim\" and \"Ted\" have moved on with their lives. The latter is now a successful financier, the former stays at home looking after his own children. It's only when his younger daughter starts to show that she has inherited some of the family business skills that the adventure starts to hot up and the brothers, under the fearless and determined \"Tina\", start their own new familial enterprise that's not about making money, but about combatting an evil and malevolent competitor! I'm not really quite sure who this film is for. Youngsters wouldn't get the thrust of the narrative nor the humour and older kids would probably be put off by the slightly uncomfortable to watch baby imagery, but the story does well enough once it gets started and though twenty minutes too long, this is no worse than many of the later Dreamworks animations that came off the production line. You'll never remember it afterwards!", "created_at": "2024-01-06T06:56:31.187Z"}]