[{"movie_id": 76600, "review_id": "639c14af0752880093558e1c", "rating": 6.0, "review_text": "**Avatar: The Way of Water follows in its predecessor’s footsteps with stunning effects and a mediocre story.**\r\n\r\nIt’s a James Cameron film, so it’s impressive. The special effects, camerawork, world-building, and action were all off the charts. But Avatar: The Way of Water struggles like its predecessor in the story and character development departments. In fact, the story of The Way of Water is almost identical to the first Avatar. Instead of humans learning to be Na’vi and then fighting Stephen slang, a family of forest Na’vi learns to be ocean Na’vi and then fight Stephen Lang. But the new movie also focuses on a group of annoying teens that constantly get themselves in trouble and peril over and over again throughout the much too long 3+ hour runtime and sidelining better, more established characters. All the strengths and weaknesses of the first movie are back in this one, with the bonus of being compared to the original at every turn. It really is a visual feast and special effects masterpiece, but just like the first Avatar, that’s all it is.", "created_at": "2022-12-16T06:48:15.541Z"}, {"movie_id": 76600, "review_id": "639d91262f3b1700ba032aa1", "rating": 7.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/avatar-the-way-of-water-spoiler-free-review\r\n\r\n\"Avatar: The Way of Water clearly sets itself apart from other blockbusters, building on 13 years of preparation to deliver a memorable CINEMA experience by the one and only James Cameron.\r\n\r\nA visually, technically breathtaking adventure, particularly in the truly stunning underwater sequences. Score (Simon Franglen) remains epic, and the genuine dynamics between the characters of the Sully family lead the viewer to strongly, emotionally invest in them - the performances of the cast, namely Zoe Saldaña, are vital for the film's success.\r\n\r\nToo bad the recycled, generic narrative doesn't keep up with the creativity, dedication, and innovation levels allocated to the technical elements. Underwhelming to the point of making the three-hour runtime feel heavier than it should, but for fans of the original - which remains supreme - it's far from ruining one of the year's must-see theater experiences.\"\r\n\r\nRating: B+", "created_at": "2022-12-17T09:51:34.972Z"}, {"movie_id": 76600, "review_id": "639e3ba5f12cf400a072efc6", "rating": 8.0, "review_text": "An exciting return to Pandora: the world of Na&#39;vi. One of the best movies, like 2009&#39;s Avatar, to see in 3D! The characters seem to come out of the screen and it seems to witness the events firsthand. The world of Na&#39;vi has changed and is once again in danger. Man is the cause of evil as in reality. We are destroying our planet that used to be our Pandora. Pandora is our home, we are Pandora. The houses of the Na&#39;vi look like the tents of the American Indians, for me this is no coincidence and recalls the genocide of the American Indians. In my opinion it is a good sequel that deals with very relevant themes such as love, family and mourning. The initial water monologue which then returns towards the end is very poetic and universal! Emotional film that in some parts makes you cry. I recommend viewing in 3D for those who have already seen the previous film and were fascinated by that amazing world and the protagonist&#39;s love and life story.", "created_at": "2022-12-17T21:59:01.040Z"}, {"movie_id": 76600, "review_id": "63a004878ddc3414aa020acf", "rating": 10.0, "review_text": "**My rating: 10/10**\r\nWhy? I rate any movie based on a few things. Warning! Potential Spoilers.\r\n\r\n**1. Story**. Is the story compelling, does it stick in your mind after the movie, haunting you like a ghost, forcing you to think about it and even your own life? Does it have any positive messages aka moral of the story.\r\n\r\nThe story of The Way of Water is indeed compelling. The Conflict is multifaceted. Family conflict, Human-Na'vi conflict, Tribal Conflict and most importantly, personal conflict, aka identity conflict. The identity conflict is mostly fuelled by outcast feeling. There are a lot of people including Jake who at some point feel like they don't belong. I believe most people feel this way at some point in life, you don’t need to be in the protected minority groups for you to feel like an outcast. And while we may not be accepted for who we are, defining who are begins with ourselves first. Our world is full of people who want to be identified in one way or another. But have they identified themselves first? Just remember, most people feel discriminated for one reason or another in life. Religion, gender, skin colour, country, body size or smartness in school, political affiliation. Nobody gets love all round all times. Know who you are and don’t fuss to much about it. Learn a losson from Spider (Miles Socorro).\r\n\r\n**2. Characters**. Are there likeable characters you can get attached to? Characters you remember later, characters that inspire. Characters that grow.\r\nSpidey is a new character, and he has a great story to tell. Jake has changed a lot too and for good reason. People undergo a lot of transformation in life. You can’t be what Don Williams calls a Rake and Ramblin’ Man your entire life. I read an article review complaining how Jake tucked his tail and ran. That review completely missed the point. Jakes decision may not have been the right one, but put in his situation, it is a decision that a lot of people would make. \r\n\r\n**3. Acting**. Is the acting good? Is it realistic enough to be believable to a point you forget the people are just acting? I was more than impressed by Neytiri’s “gone nuts” scene. I felt her pain, and in that instance, I was nuts too. I honestly forgot this was just a movie. Actors can make you cry, and that is just how it should be. You forget that it is just an act, no need to cry. I also read an article that complained about the dialogue of the teenagers. I don’t know what the reviewer expected. Philosophy from teens? Their conversation is believable enough for their age.\r\n\r\n**4. Everything tied together**. A good story told by good and believable characters needs a setup. Something to tie them together into a bundle.  Avatar ties everything together with wonderful visuals. I don’t need to say more.", "created_at": "2022-12-19T06:28:23.198Z"}, {"movie_id": 76600, "review_id": "63a255febe6d8800a2c3791a", "rating": 4.0, "review_text": "State-of-the-art special effects, revolutionary underwater cameras, and the resurrection of what is otherwise a mostly forgotten movie theater format can’t hide the fact that _Avatar: The Way of Water_ is basically the same movie as the original with more blue people (some are slightly green now!) that get on your last nerve. The emotion in the film feels forced and the story is like swapping a blue thread for a green one as it threads the same, withered fabric from 2009. This is a special effects extravaganza with nauseating results that only partially impresses and mostly succumbs to being its own biggest fanatic.\r\n\r\n**Full review:** https://boundingintocomics.com/2022/12/19/avatar-the-way-of-water-review-mo-navi-mo-problems/", "created_at": "2022-12-21T00:40:30.029Z"}, {"movie_id": 76600, "review_id": "63a25601d8e2250eb8bfa370", "rating": 4.0, "review_text": "State-of-the-art special effects, revolutionary underwater cameras, and the resurrection of what is otherwise a mostly forgotten movie theater format can’t hide the fact that _Avatar: The Way of Water_ is basically the same movie as the original with more blue people (some are slightly green now!) that get on your last nerve. The emotion in the film feels forced and the story is like swapping a blue thread for a green one as it threads the same, withered fabric from 2009. This is a special effects extravaganza with nauseating results that only partially impresses and mostly succumbs to being its own biggest fanatic.\r\n\r\n**Full review:** https://boundingintocomics.com/2022/12/19/avatar-the-way-of-water-review-mo-navi-mo-problems/", "created_at": "2022-12-21T00:40:33.889Z"}, {"movie_id": 76600, "review_id": "63a25604be6d88008cb15033", "rating": 4.0, "review_text": "State-of-the-art special effects, revolutionary underwater cameras, and the resurrection of what is otherwise a mostly forgotten movie theater format can’t hide the fact that _Avatar: The Way of Water_ is basically the same movie as the original with more blue people (some are slightly green now!) that get on your last nerve. The emotion in the film feels forced and the story is like swapping a blue thread for a green one as it threads the same, withered fabric from 2009. This is a special effects extravaganza with nauseating results that only partially impresses and mostly succumbs to being its own biggest fanatic.\r\n\r\n**Full review:** https://boundingintocomics.com/2022/12/19/avatar-the-way-of-water-review-mo-navi-mo-problems/", "created_at": "2022-12-21T00:40:36.825Z"}, {"movie_id": 76600, "review_id": "63a4468228d7fe00bf98947f", "rating": 8.0, "review_text": "No matter what you say about the story, you can't deny the fact that **James Cameron** managed to make eyes drool for 3hrs and 20mins. A movie that's meant to be watched on the biggest screen!.", "created_at": "2022-12-22T11:58:59.038Z"}, {"movie_id": 76600, "review_id": "63a68437d55c3d00a7f58b04", "rating": 7.0, "review_text": "Well we ought not to have expected \"Jake\" (Sam Worthington) and \"Neytiri\" (Zoe Saldana) to have let the grass grow during the intervening years since we were first introduced to the idyllic world of \"Pandora\". Now with four children and their human friend \"Spider\" (Jack Champion - remember Johnny Sheffield?), they are living life to the full. Until, that is, one night they see a new star in the sky. Star? Well, no - it's the ships announcing the return of the human beings, this time even more bent on the conquest of their planet now that the Earth is finally on it's knees. Armed to the hilt with the latest technology and weaponry, and commanded by the essence of the departed \"Col. Quaritch\" - who also now leads a squad of Na'vi-esque avatars of his own - things look ominous for the \"Sully\" family. Realising that they are front and centre for their persecutors, they relocate to (saddle themselves on) a remote, water-based community where they hope, rather unrealistically, to be able to sit it out... This is undoubtedly a beautiful piece of cinema to watch. 3D and IMAX with a classily crafted score from Simon Franglen and a message that trumpets the cruciality of the symbiotic relationships between all creatures that live on a world where co-operation and understanding are vital to the survival of all. Thing is, though, that all of that glorious cinematography starts to get just a bit repetitive after about an hour and the middle portion of this really does drag. Indeed, were this to have been a long \"Blue Planet\" style documentary alerting us to the dangers of mankind's rampant abuse of resources with scant regard to the implications for any other species, then I would have enjoyed it better in three parts with Sir David Attenborough's mellifluous narration. It isn't though, and the story is stretched so terribly thinly that - sorry, sacrilege I know - I was actually bored a bit. It does pick up for the last forty minutes or so as the denouement provides for loads of action-packed pyrotechnics but to be honest, I had sort of lost interest by that point. Certainly, it is a great looking film that offers us food for thought, but as a story - I thought it weak, predictable and at times it does just a little too much of it's own recycling. Indeed - had their children actually done what they were told in the first place, there might not have been much of a story at all! Essential on a big screen.", "created_at": "2022-12-24T04:46:47.345Z"}, {"movie_id": 76600, "review_id": "63ab63ae1f748b008a50e7d7", "rating": null, "review_text": "Amazing effects and a stunning story.", "created_at": "2022-12-27T21:29:18.231Z"}, {"movie_id": 76600, "review_id": "63b8911393bd69008a62d643", "rating": null, "review_text": "Avatar: The Way of Water is a visual spectacle from start to finish. The scenery, cinematography, and CGI constantly had a smile on my face, but is it enough to carry the film?\r\n\r\nWhile the previous entry had its fair share of story-related problems, the sequel corrects most of my issues and delivers a heartfelt family story. The main improvement from the first entry is character development. I had a genuine emotional connection with the Sully family and was invested in their safety. These feelings created some genuine tension when any of the family members were in danger, I felt my body tense up as I waited to see what the conflict's conclusion would be, which is a gigantic improvement from the first film where I could not care less who died or survived.\r\n\r\nThe return of Stephan Lang as Colonel Miles Quaritch brought the overly campy villain back to the screen in a bad way. Quaritch is a caricature of a \"villain\" where his actions and attitude are evil for the sake of being the bad guy. His anger toward Jake Sully does seem a little bit more believable hear as his previous self was murdered by him, but the over-the-top theatrics are just too much for me.\r\n\r\nAnother aspect of the story that did not feel right to me was the children constantly disobeying their parents for the sake of plot progression. Countless times, Jake Sully's kids would do the opposite of what they were told, leaving them in a vulnerable state to be captured. This danger forced Jake Sully to constantly expose himself and help draw the threat ever closer to his family. The moments that result are great as we get to see the dichotomy between Jake being a father and his militaristic background. This is at the heart of the story and worked for me.\r\n\r\nI was surprised to see how well-paced the film was despite its over three-hour runtime. There are some pretty slow parts, specifically the second act, but the visuals and the character journeys that happen during these parts are so interesting that they didn't impact me negatively; I was just happy to see new and beautiful aspects of Pandora.\r\n\r\nThe performances were fantastic throughout. It is a testament to both the actors/actresses and also the technology that can display such complex emotions and visual nuances on entirely CGI creatures. Sigourney Weaver was a highlight with Kiri, who was at the forefront of the entire film. To be completely honest, I did not even know she was played by Weaver; the mix between her performance and voice modulation created a compelling 14-year-old girl that was a huge part of the story. Sam Worthington was incredible and Zoe Saldana was perfect. Saldana does so much acting with her facial expressions as Ney'tirl, which is on display during many emotional scenes her character goes through. She was a bit sidelined during this film, but when she was on screen, she was impactful.\r\n\r\nAvatar has some incredibly heavy themes at play. One of the strongest and most relevant messages was anti-poaching. I mention this because there was such a hard scene in this movie that had me on the verge of tears. It was something I'd never seen in the film; it was both beautiful in the brutality it displayed and the emotional response of the Na'vi.\r\n\r\nOverall, this movie is deserving of the hype and needs to be seen on the biggest screen available. James Cameron delivered on the 13 years build-up to the sequel and has gotten me excited for the three sequels planned for the next decade.\r\n\r\nScore: 88%\r\nVerdict: Excellent", "created_at": "2023-01-06T21:22:27.215Z"}, {"movie_id": 76600, "review_id": "63c5f85b60b58d007ee45a7f", "rating": null, "review_text": "Audio was superb. Video was great, but it the 60fps takes some getting used to. Story was awesome!", "created_at": "2023-01-17T01:22:35.583Z"}, {"movie_id": 76600, "review_id": "63c9caaa03f0b600b91d8f1a", "rating": 10.0, "review_text": "I really enjoyed Avatar: The way of water! It's a great second part to Avatar, getting back into the fight, setting a new environment and it actually left me even more thinking, of how we just destroy our earth and how bad humans can get. It is a long movie, but I enjoyed it so much, I didn't care. So, I would really say: watch it, it is worth it, especially when you watch the first part before, to get back into the mood!", "created_at": "2023-01-19T22:56:42.068Z"}, {"movie_id": 76600, "review_id": "63defd4c9974ee0b737015be", "rating": 6.0, "review_text": "I rate this 6 out of 10. One of those points is for the special effects and another is because I watched it in 3D IMAX. That means that the rest of it was worth 4 stars. Not that it was actually that bad but the plot was thinner than the first one which wasn't particularly thick to start with. Entertaining enough but I wouldn't recommend it unless you see it in 3D IMAX in which case it's a fantastic feast for the senses. The fact that it didn't feel three hours must also a good sign.", "created_at": "2023-02-05T00:50:20.655Z"}, {"movie_id": 76600, "review_id": "64226b2fc7a7e000c2b528d7", "rating": 4.0, "review_text": "Fluffy woke nonsense, minus anything that remotely resembles a story. That was my one and only impression of Avatar: The Way of Water. \r\n\r\nDripping with simpering woke cliches, a missing in action script, the only compensation offered is enough special effects \"eye candy\", to give you diabetes.\r\n\r\nIn summary, vacuous fair, I simply couldn't watch till the end. At a stretch, it might have worked for children but the violence and overall treatment, doesn't lend itself to a more junior viewers.", "created_at": "2023-03-28T04:21:03.714Z"}, {"movie_id": 76600, "review_id": "6425c29a6905fb00bd09649a", "rating": 9.0, "review_text": "Like, how am I supposed to watch movies that take place on earth now?? \r\n\r\nNow that I’ve seen Avatar the way of water… it feels a bit… strange. I expected to be overwhelmed but the scale and scope of the film, I expected to have a good headache. But none of that happened. I have a very different feeling… I feel… Proud. Proud knowing that my faith in this film payed off. Proud that this film was indeed epic. Its not a perfect movie and I do have my flaws. But this film gave me about everything I could ask for when it comes to a movie going experience, this deserves to make serious money at the box. James Cameron said in his interviews that he is the ONLY person that could direct an avatar film, and the internets response was “James… Chill”, here’s the thing, he was right. I cannot imagine another director doing something like this. Everything you love from Cameron is here, Terminator 2, Titanic, etc. \r\nThis was the best looking movie I’ve ever seen.. and no other film will match this in the future that isn’t an Avatar sequel. The VFX on the characters and creatures was perfect, no problems whatsoever. Sometimes some landscapes might have looked a little off, but the worst looking shot in this movie still looks better then almost every other CGI heavy action film. The underwater sequences  was awe inspiring, I could’ve watched the underwater sequences in this film forever. the amount of work put into the underwater sequences definitely paid off. At first I wasn’t so sure about 48fps, during the first 20 or so minutes, I thought I would be detracted the whole time, but I wasn’t, I adjusted about half an hour in, and was completely emerged into a film like I never have before. \r\nThe action in this movie was insane, the action was always at and 11 out of 10. You felt the scale, the weight, the stakes. \r\nLike I said, this wasn’t a perfect film. When the movie started, I was so sure about how I would feel about this movie. It starts voiceover heavy and with lots of quick cuts as if a lot has been cut from the film within the opening, Im sure there will be an extended cut to this, and I’m curious if it will add to it. The dialogue in the first film was the best, and this film does have stronger dialogue. But there are still a couple scenes where it did feel a little off, but it was mostly with the younger characters. As it wasn’t Constant, it was just like a line here to there every 20 minutes or so. While, I did say that the opening needed a little more to it, there are chucks in the middle that didn’t need to be there, and was just there to be eye candy, but it wasn’t really a big issue with me, Cause it was some of the best eye candy ever put on film.\r\nI’m tired of people complaining about the story to these avatar films, it feels like people put the plot to these movies on a unrealistic standard. The plot here is basic, and yeah, it might feel a little to basic at Times. But I don't really think it was something worth mentioning critically. \r\nOverall, this was a perfectly crafted film with a pretty good script, that provided a theater experience I’ll never forget.\r\n\r\n9.3/10", "created_at": "2023-03-30T17:10:50.673Z"}, {"movie_id": 76600, "review_id": "6492c6c565e0a20125f9f9a1", "rating": null, "review_text": "James Cameron's Avatar is an extraordinary cinematic achievement that redefines storytelling and visual effects. Its visually stunning world, thought-provoking narrative, and exceptional performances create an immersive and unforgettable experience. A must-watch for anyone seeking a transformative journey beyond imagination.", "created_at": "2023-06-21T09:45:41.126Z"}, {"movie_id": 76600, "review_id": "64c14f9d097c490100d1c5da", "rating": 7.0, "review_text": "Avatar 2 or Avatar: The Way of the Water came out on 4K Blu-ray a couple of weeks ago so me and the kids finally got around to watch it last weekend. I rarely go to the cinemas nowadays. It’s just too much hassle and way to expensive for four people. But there’s also no way I watch a big movie like Avatar on streaming with their over-compressed images and mediocre sound. Yeah, yeah, I know they claim Dolby Atmos and all that but they use almost one tenth the bit-rate for the video compared to 4K Blu-ray and push the Atmos over a lossy Dolby Digital stream.\r\n\r\nAnyway, enough rambling. Avatar: The Way of the Water was better than I feared it would be. I was really worried that it would turn out to be a preachy woke turd. Especially with some of the comments Cameron has made lately.\r\n\r\nSure, it was pretty much a repeat of the first one with the companies bad, humans bad an all that kind of story but at least that was about it. There was not really any of the usual preaching, finger pointing and general woke force feeding that has been way too common from Hollywood lately.\r\n\r\nThe main enjoyment of this movie is really the imagery, the scenery, the fantastic creatures and all that. It is a visually very beautiful movie.\r\n\r\nThe second part of the enjoyment comes from some quite enjoyable action sequences, especially towards the end of the movie.\r\n\r\nThe story is not much to write home about though. It is pretty standard, unimaginative story fairly full of the usual Hollywood lazy-ass unplausible shit. The idea that humanity in the future would go to another planet and start to hunt down the wildlife, behave like some conquistadors and literally strip the planet is fairly ludicrous from the start of course.\r\n\r\nThe story is not so much about the main characters, or at least what I expected to be the main characters, but more about the kids. I was expecting it to be about the Na’vi kicking the invaders’ asses…again, but unfortunately the movie takes a different track rather early on.\r\n\r\nAfter that it is more of a coming of age story about their kids who, also unfortunately, behaves like the usual Hollywood teenagers in not listening to their parents and generally behaving recklessly. This part of the movie would have been really, really, boring if it was not for the beautiful scenery.\r\n\r\nThen there was this idea of an intelligent species, supposedly more intelligent than humans, being not only pacifists but refuses to defend themselves in any way while literally being exterminated. That kind of stupid shit only exists in the mind of a Hollywood writer. They also conveniently looked like whales so the script writer could push some bad-humans-catching-whales stereotypes.\r\n\r\nAnd why did they have to drag back the main the main asshole from the first movie? It just felt lazy and did not add to my enjoyment of the movie.\r\n\r\nStill, the bottom line is that I did enjoy the movie, even though it was over three hours long which felt a little bit dragged out. It is in no way this super blockbuster that some people seem to think though. At least not as far as I am concerned.", "created_at": "2023-07-26T16:53:49.944Z"}, {"movie_id": 76600, "review_id": "659455fc6aa8e061abec77ef", "rating": 4.0, "review_text": "Like star wars, this brand is now more of a religion than a movie. Prophesied to produce canonical content for the next several decades, this patronizing franchise could hundred years from now be shaped into some sort of holy text. Like the marvel movies, this cartoon for adults reduces all symbolism and metaphor to platitudes and manipulative emotional arguments. You can tell this is quasi religious also by the way the fan-base reacts with tantrums when one would insist that the content they like is mindless bullshit. Go ahead and call RoboCop the same thing, ill just laugh to myself and be like, whatever, idiot. Because like zizek says, only a nonbeliever can believe.", "created_at": "2024-01-02T18:29:16.228Z"}]