[{"movie_id": 13090, "review_id": "58ac4fbac3a3684a0a014337", "rating": 10.0, "review_text": "The first thing that went through my head the second Sunshine Cleaning ended, was 'I could have gone on watching for at least another hour'. Not just because it ended a little abruptly, but mostly because I so thoroughly enjoyed this film, that I was seriously disappointed when it was over. It's like that book that's so compelling that you just want to inhale every word, but dread to actually finish.\r\n\r\nSunshine Cleaning is about two sisters, who, driven by dire financial straits, decide to start \"a biohazard removal/crime scene clean-up service\", cleaning up the houses of people who died gruesome deaths. The premise is fairly simple, but executed in a very lovely, heart-warming way, half tragedy – half comedy. Because of course, this film is not only about cleaning up other people's mess, but also about cleaning up some of their own baggage along the way, especially when the sisters are confronted with the memory of a death akin to what is now their daily business. Somewhere in between all this they have to deal with their eccentric father, the elder sister's peculiar son, love, loss, failure and a glimmer of hope. Reading this back now I realise this actually sounds really cheesy and sentimental, but I would have hated it if it was. Trust me.\r\n\r\nAmy Adams plays Rose, the eldest of the two, and Emily Blunt plays Norah, the rebellious younger sister. Rarely have I seen such great chemistry and energy between a leading pair. These two women make it seem like they've been working together for years, and physically they're a perfect match too, they actually look they could be sisters. Rose is obviously the mature, sensible one, whereas Norah just kind of takes things as they come, not worrying and not taking responsibility for her life. Though they seem to be bound not so much by kinship, but rather by a mutual fate and childhood hardship that has left its mark on both of them, although they deal with it very differently. Rose tries desperately to build a better life for herself and her son, but rarely finds any luck on her path. Norah just wings it and refuses to grow up.\r\n\r\nBoth Amy Adams and Emily Blunt prove to have great star quality and talent, and I think I can now officially call myself a fan of both. They are raw and real, one is sweet and the other is sour, without overacting anything. Alan Arkin is great as their dad. Eccentric, bitter yet loving, idealistic and seemingly in a mild state of denial. He plays pretty much the same character as in that other (great!) film of Sunshine Cleaning's producers, Little Miss Sunshine, where he also played the grumpy granddad. This type of role seems to be custom-made for him. Another great part is played by professional chameleon Clifton Collins, Jr. He plays Winston, the owner of a cleaning supplies shop, and he turns out to be that small shimmer of good luck that Rose so desperately needs. Actually, everyone in this film is so perfectly cast that it almost seems like this is a real family, in a real situation. It just doesn't feel contrived in any way, despite the lack of originality and obvious pitfalls where the story could have easily crashed and burned into a wasteland of melodrama and false sentiment. But like I mentioned earlier, this doesn't happen at any point. Usually when a film is on the borderline of becoming a total cliché, and yet works out successfully, it is because of one or maybe two factors. However, with Sunshine Cleaning, it's all of them. Cast, screenplay, dialogue, direction, camera work, production, just everything is wonderful. I'm actually running out of superlatives to describe this film.\r\n\r\nI'm inclined to give this film 10 stars, however there is just one small thing that kind of failed in my opinion and that's the ending. Nothing wrong with it story-wise, it just ended so abruptly that it feels like they literally ran out of tape. It actually kind of threw me off. But... oh, what the heck, this film deserves 10 stars, easily.\r\n\r\nIn conclusion, Sunshine Cleaning is just a beautifully crafted story about falling (hard) and getting back up on your feet again. It has a real indie-feel to it, it's basically just a pretty little art house gem. Funny thing – while I'm writing this, 4 Non Blondes' \"What's Up\" is playing in the background, and it feels strangely appropriate to the feeling of this film. So if you want to know what to expect of Sunshine Cleaning, listen to that song, it really captures the essence of the story. \r\n\r\nI can't think of much more to say to sell this film, all I can do is strongly recommend Sunshine Cleaning to pretty much anyone and everyone. It's wonderful.\r\n_(May 2012)_", "created_at": "2017-02-21T14:33:30.233Z"}]