[{"movie_id": 591, "review_id": "5d6c63ff0e4fc81ce0d9373d", "rating": 7.0, "review_text": "Each breath you take is a sin. No shadow will be safe again, for you will be hunted by angels.\r\n\r\nThe Da Vinci Code is directed by Ron Howard and adapted to screenplay by Akiva Goldsman from the novel of the same name written by Dan Brown. It stars Tom Hanks, Audrey Tautou, Ian McKellen, Paul Bettany, Jean Reno, Alfred Molina and Jürgen Prochnow. Music is scored by Hans Zimmer and cinematography by Salvatore Totino.\r\n\r\nWhen a man is murdered inside the Louvre, his body is found to be surrounded by cryptic messages. The police call in American symbology expert Robert Langdon (Hanks) to decode the clues. When he is joined by Parisian cryptologist Sophie Neveu (Tautou), it quickly becomes apparent that nothing is as it first seems and a mystery begins to unravel that could shake Christianity to its very core.\r\n\r\nExtended Cut (Blu-ray) Version Viewed.\r\n\r\nI haven't read the book! And I love treasure hunt/clue chasing movies! So I came to Ron Howard's hugely successful film (over $600 million in worldwide profit) bereft of literary pressure and with only a modicum of genre expectation. Perhaps this is why I'm apparently only in a small percentage of film lovers who really enjoyed the film? In spite of those gargantuan financial figures.\r\n\r\nUltimately it's very safe film making, with a director and cast guaranteeing professionalism, but it weaves a magical mystery tour full of cryptic clues, secret organisations and cover ups. Yes, there is a good deal of corn thrown in as well, which inevitably stops the adaptation from being hyper intelligent. There's also an understanding on my part as to why many feel it's just too talky, but was the film ever going to be unfurled as an action movie blockbuster for the popcorn munching crowd, like National Treasure et al?\r\n\r\nIt is a clever conspiracy thriller full of twists and turns with a outlandish revelation at the finale. It's also very appropriately performed by the cast (serio brooding and fret), and when McKellen joins the fray after an hour of film it has a little class as well, while Zimmer's score is a majestic blending of choir, strings and synths. I maintain that the film didn't deserve the critical whacking it got, but again I say I had a blank canvas going in for my first viewing. \r\n\r\nI wasn't sold to it because of controversy or had a saliva tinged mouth having worshipped at the altar of Dan Brown, I expected exactly what I got. A flawed but ever so intriguing adult mystery thriller, and not even Hanks' hair stopped me having a great time with the movie. 7/10", "created_at": "2019-09-02T00:36:15.964Z"}, {"movie_id": 591, "review_id": "60f394f3e8a3e10046c35fa0", "rating": 6.0, "review_text": "Writing this review might be considered an act of vanity. Until recently I was among the very few who hadn’t seen The Da Vinci Code, or even read the book. But now I have done so — watch the movie, that is. I still have no plans to read the book. But is there anyone left out there who might benefit from a review?\r\n\r\nMostly I thought the movie was rather silly. Oh, I know that the book was researched about as well as your average documentary, and that the plot is intricate and suitably complex for a thriller. Like a spy thriller, it develops that the two heroes can never be sure who they can trust. In fact, the short answer seems to be “No one!” There are plenty of plot twists, reverses and surprising  revelations, some nifty but others that are utterly predictable. But it lost some of its credibility for me near the beginning when the female lead drove her car at a high rate of speed in reverse in and around traffic, faster than most drivers could manage driving forward. Really?\r\n\r\nThere is a lot of action in the movie, but it lacks the exuberance and humor of a classic like Raiders of the Lost Ark. I guess religion is a serious business.", "created_at": "2021-07-18T02:41:55.434Z"}]