[{"movie_id": 316727, "review_id": "579d03ea9251411b360085fd", "rating": null, "review_text": "A SCREEN ZEALOTS REVIEW www.screenzealots.com\r\n\r\nWhereas most franchises are characterized by sequels that degrade in quality over time, “The Purge” is one that continues to improve. The first movie was a good premise in search of a story. The second in the series, “The Purge: Anarchy” was a marked improvement, and “The Purge: Election Year” is clearly the best one yet.\r\n\r\nIn case you’ve been hiding under a rock, the concept behind these movies is simple: the government of America fell after mass unrest and crime eventually led to revolution, and out of the rubble a new party rose. They call themselves “The New Founding Fathers” party and they have discovered a way to dramatically decrease crime and placate the populace: for one 12 hour time span each year, all crime — including murder — is legal. This annual bloodbath is known as (wait for it) “the Purge.”\r\n\r\nIn this newest installment, the annual Purge has been in place for two decades. When she was younger, Senator Charlie Roan (Elizabeth Mitchell) was forced to watch as her entire family was murdered in front of her during the Purge. Having survived the horrors of the Purge, the Senator is running for President on an anti-Purge platform that is gaining popularity. Threatened by Senator Mitchell, the New Founding Fathers use the Purge as an opportunity to wipe out their competition by sending a squad of assassins to hunt her down. Protected only by her head of security, Leo Barnes (Frank Grillo, reprising his role from “The Purge: Anarchy”), the Senator must go on the run to survive the night.\r\n\r\nIn “The Purge: Election Year,” the annual bloodbath is used as a platform to talk about the growing tension between the haves and the have-nots. Because they lack the financial means to protect themselves, the poor are disproportionately victimized during the Purge. In this world, legalized murder is a way for the wealthy and political elite to ensure a placated populace and control the poor. When the victimized start to realize that they are pawns in a game played by the privileged, they start to fight back… by any means necessary.\r\n\r\nThe elite in this world are typified by ultra-conservative hypocrites who are quick to subvert religion and re-shape their displayed and false piety to advance their own agenda. Murder tourism is encouraged, and the powerful are quick to espouse the wisdom of permissive gun laws. Sound familiar at all?\r\n\r\nMy chief criticism of the movie is that it got perhaps a little too heavy-handed in its messaging at times, and the horror aspects of the story suffered as a result. At times, the film more closely resembles an action movie than a horror flick, which is a little disappointing for a franchise that excels in displaying inventive — if horrific — kills. Those kills are the moments that stay with you the longest and the ones that keep you up at night. The imagery that we do get is powerful, but it becomes increasingly scarce as the movie progresses.\r\n\r\nWhile it’s not a perfect movie, “The Purge: Election Year” is that rare horror movie that is both entertaining and has something interesting to say. Whether or not you agree with its politics, it’s an interesting vehicle to use for a message that has resonance in our current culture. I just fear that the message will be lost on most.\r\n\r\n**A SCREEN ZEALOTS REVIEW www.screenzealots.com**", "created_at": "2016-07-30T19:45:46.115Z"}, {"movie_id": 316727, "review_id": "5a39170192514103362017a1", "rating": null, "review_text": "WONDERFUL", "created_at": "2017-12-19T13:41:21.574Z"}, {"movie_id": 316727, "review_id": "5bb859fa9251410a21005faf", "rating": 6.0, "review_text": "The best **looking** movie of the _Purge_ franchise, and I was happy to see Frank Grillo returning, but still a definitive step down from its predecessor, _Anarchy_.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2018-10-06T06:45:14.752Z"}]