[{"movie_id": 11523, "review_id": "5fb2f38d735205004218d09b", "rating": 4.0, "review_text": "Empty watch, probably won't watch again, and can't recommend.\r\n\r\nOn the surface this is about women dressing pretty and serving men, and Gwenyth Paltrow and Christina Applegate are good at this, but...I really had to look hard to see that the movie had more to offer than \"little person, little dreams\".\r\n\r\nDon't get me wrong, it's fine to have simple dreams, and the romanticism of Paris is great for \"small town\" folk aspirations, but the movie leans on it pretty heavy for comedy purposes.\r\n\r\nIf you peel back a couple of layers, there is a great metaphor for woman empowerment and being able to reach their goals through hard work and networking, but it is really subtle.\r\n\r\nIt also doesn't help it be more enjoyable.  Sure, it's sweet and charming, but it's also underwhelming.  There are probably better movies involving flight attendants, but there are certainly better movies out there to watch.", "created_at": "2020-11-16T21:47:57.933Z"}, {"movie_id": 11523, "review_id": "6444f0ba058224363b324a2a", "rating": null, "review_text": "**Background to this review**\r\n\r\nMy review here.... I confess it was prompted by the review given by Kamurai (which was the first review given on this movie on The Movie Data Base).\r\n\r\nAlso by way of background, I came to watch this movie because of who is in it. Specifically Gwyneth Paltrow, who I first came across in 'Sliding Doors' (1998), Christina Applegate, who I first came across in 'Married... With Children' (1987-1997), Kelly Preston, who I first came across in 'Jerry Maguire' (1996) and Mike Myers, who I first came across in the 'Austin Powers movies' (1997, 1999, 2002).\r\n\r\nTo a lesser extent Candice Bergen who I first came across in 'Murphy Brown' (1988-1998, 2018). I later watched 'Gandhi' (1982) and discovered that Candice Bergen had an important role towards the end of it.\r\n\r\nI wanted to see a movie in which these actors had moved on to. That is what brought me to 'View From the Top' (2003).\r\n\r\n**The actual review**\r\n\r\nFirst of all, I think the first reviewer description of \"little person, little dreams\" (quotes by them) is... how to say this... betrays a lack of empathy. The Gwyneth Paltrow central character is actually a big person in terms of inner drive and ambition. The only things which are little are her circumstances and the mind of those around her.\r\n\r\nI believe there is a subtext to this movie. I am conscious of the fact that the writer is male and that the director is male. The subtext is feminism. Okay, here we go... I shall 'dive in' to this difficult and oft-times divisive topic. What I write is something I have only come across once in my life, by what a musician said at the end of a live concert i.e. many years ago now.\r\n\r\nFemale rights are human rights. Feminism is not only about women, but about humanity as a whole. In terms of this movie, the viewer has an option to see each character as a person - rather than a female person or a male person.\r\n\r\nAfter watching it, I heard that Gwyneth Paltrow described it as \"the worst movie ever\". I think a mistake was made that the characters were seen as being either male or female. Well.. not so much a mistake.. just that the movie does not **have** to be seen in this way.\r\n\r\nWho cares what gender/sex this character is or that character is? To take a step back a moment, half my ancestors were female and half were male - and I am fine with that. We are people. Here a preciously short time. Feminism is not about women.. or highlighting women.. about sexism in favour of women.. it is about the exact opposite of all this: making one's anatomy or gender irrelevant.\r\n\r\nI take an additional step back. Yes, I know that males (of which I am **one**) have monopolised positions in some employment circles and monopolised leadership positions. That it has been going on for centuries... nay... millennia. This **is** tragic and totally unfair. The reason for this is that sexism is dehumanising. I shall leave it at that. I know that it is a hot and highly sensitive topic.\r\n\r\nBack to the specifics of this movie. It is not a complex movie. I agree with the first reviewer on that score. It is however fun.  I did not like how favourably capitalism was portrayed - but it did stop short of 'kowtowing' to capitalism. It has a human element to it. What I mean by that is that it is humane. Each character is portrayed as a human being. It makes no distinction between whether someone is male or female, homosexual or heterosexual and so on and so forth. Or if it did make these distinctions then... well... I shall go out on a limb and say that it was inadvertent.\r\n\r\nIn short, it was an entertaining watch. Nothing to write home about. Something well acted and there to enjoy. I do not recommend watching it nor letting it go by the wayside. I write this review to share a different perspective to what is already on 'The Movie Data Base (TMDB)'. I know for myself that it has been a long time coming to watch a movie which is safe and I can just enjoy. I appreciated it.\r\n\r\nI also appreciate your time and attention in reading me here.", "created_at": "2023-04-23T08:47:54.056Z"}]