[{"movie_id": 382322, "review_id": "57ab3aa992514110e400232c", "rating": null, "review_text": "Not even the voice acting could save this movie. Check out my full review here.\r\n\r\nhttp://www.hweird1reviews.com/allreviews/the-killing-joke-movie-review", "created_at": "2016-08-10T14:31:05.525Z"}, {"movie_id": 382322, "review_id": "57c93ed7c3a3687ca90000fa", "rating": 5.0, "review_text": "Shares the few weaknesses of the short comic it is based on, but adds a bunch of its own new weaknesses to try and get it up to a theatrical runtime and justify its cinema release.\r\n\r\nI think part of the reason the reception for _The Killing Joke_ has been so overwhelmingly negative is that the expectations were so high going in. But that wasn't without cause. It sees the long awaited return of both Kevin Conroy and Mark Hamill to their famed DC roles, and the comic it's based on is widely regarded as one of the better stories ever published by the company. And of these lofty expectations, _The Killing Joke_ falls short.\r\n\r\nHamill is great, and Kevin Conroy usually is as well. There are a couple of occasions that the latter slipped though. I don't know if he's rusty or just didn't care, but his voice performance is not 100%. The story essentially meets that of its source material, but rather than expand the existing story, they chose to awkwardly force an entirely different one in beforehand, to the point that this is essentially two episodes of two different shows, rather than a single cohesive movie.\r\n\r\n_The Killing Joke_ is a little gross and is not the return to form for DC Animation that we all had hoped it would be, but the final sequence is fantastic and I don't know that the movie overall deserves quite as much vitriol as it has had.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2016-09-02T08:56:55.708Z"}, {"movie_id": 382322, "review_id": "5f2d390d596a910034fb47ad", "rating": 4.0, "review_text": "The first 30 minutes was wasted with Barbara being so annoying! I just didn't see why that whole bit was thrown in when the movie itself is meant to center on the Joker.\r\n\r\nEven with Mark Hamill's final bow out as the iconic villain couldn't save the film. Still, at least that joke at the end was a little amusing!\r\n\r\nOther than that, they could've done better with the story.", "created_at": "2020-08-07T11:20:45.365Z"}, {"movie_id": 382322, "review_id": "63bf7c6cdf857c008140d5b0", "rating": 10.0, "review_text": "OK, so I'll admit I was expecting something closer to the graphic novel, and I was pretty disappointed that it only really loosely followed something that was epicly brilliant as the comic.\r\n\r\nHowever, I'm not a stickler for total accuracy.\r\n\r\nAnd, really it is better than most of the other Batman movies, it does manage to tell a good story and reveal some of the Joker's ever-changing and never consistent backstory, even if it does gloss over a lot of it.\r\n\r\nIn the end, especially in this current era it's a reminder of how great comic books used to be and how great they could be again if they only started telling actual stories once more.", "created_at": "2023-01-12T03:20:12.672Z"}]