[{"movie_id": 539537, "review_id": "5e458dbedb8a0000179b3137", "rating": 1.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nFirst of all, no, I have no knowledge of the TV series this film is based upon, and after watching Jeff Wadlow's adaptation, I'm definitely not watching anything related to this story. I always follow this principle: the two pillars of any movie are its story and characters. It doesn't matter if everything else is absolutely perfect. If the two central pieces fail to convince the audience, then the whole movie falls to the ground. Sometimes, there are some crumbles that remain intact. Very rarely, there's a big segment that has no scratches whatsoever, which can help the film to survive and, even more rarely, actually make it \"okay\".\r\n\r\nFantasy Island has two little crumbles named Portia Doubleday (Sloane) and Maggie Q (Gwen), who deliver good performances, especially the former who everyone knows from one of the best TV shows of all-time, Mr. Robot. Everything else is completely destroyed. The Grudge still has a couple of redeeming moments, but Fantasy Island is undoubtedly the worst movie of the year, so far. The before-mentioned two pillars are built with the most annoying, cliche characters, as well as a ridiculous narrative that ultimately brings the whole thing down.\r\n\r\nThe third act possesses some of the most nonsensical, irrational, and illogical plot twists I've ever witnessed. This is 2020's version of Serenity, also a movie with an absurd twist that only turns the film even worse than what it was. The big difference between the two plot twists is that Serenity's was predictable from the get-go. Fantasy Island's last twenty minutes are profoundly unexpected because no sane soul would have thought of such a baffling narrative decision.\r\n\r\nThe best way to describe the twist without spoiling a thing (and I won't) is through the editing. During the exposition-heavy revelation, the editing is so awkwardly choppy that it made me think it was all fake. I genuinely thought the plot twist was a false sequence. When I realized it wasn't, I simply laughed like a maniac because I couldn't believe someone thought this made logical sense. Usually, a plot twist carries some sort of build-up, even if it's literally a couple of minutes before the explicit revelation.\r\n\r\nThis one just happens. Without any preparation, a character just shows up on the screen and begins explaining everything. It simply doesn't make any logical sense. It generates so many incongruencies with the whole story that I lost count of the plot holes I was able to point out. The film starts with establishing a few rules, only for an hour later to ignore or change them completely. A particular character acts a certain way without any plausible reason as to why. If the screenplay wasn't messy and confusing enough, the characters are also horribly-written.\r\n\r\nI never enjoy writing that an actor failed to do its job, but Ryan Hansen (JD Weaver) is the weak link of the cast, even if every single script is dreadful. Even the casting doesn't make sense: Michael Peña as a dramatic Mr. Roarke? A character supposed to be serious and mysterious? It's Michael Peña! I don't want to insinuate that he can only do comedy, but making him the villain (if I can call him that) is another addition to the list of questionable production decisions. Lucy Hale (Melanie) is fine as the protagonist, but it all comes down to the lazy, unimaginative scripts. Everything is so unbelievably messy that I don't even have any sort of technical remarks... Maybe that the beginning of the film and the actual concept look interesting. That's the only compliment I can think of: it wasn't a bad idea (different fantasies, different genres, it could have been a fun mix of styles).\r\n\r\nFantasy Island is undoubtedly the worst film of the year until now. Consider it 2020's version of last year's Serenity, but with a third act's plot twist that is so unexpected, everyone will have their jaws on the floor due to how nonsensical it is. The story wasn't close to being decent until the revelation, and it only turned into something a lot worse after it. Dozens of incongruencies and massive plot holes are generated due to the ridiculous attempt at a Shyamalan-like twist. If the absurd narrative decisions aren't enough, the horrible character scripts don't help the not-that-great acting, with the exception of Portia Doubleday and Maggie Q, the only good aspects of the whole movie. In the end, the two pillars of any movie (story and characters) are a total failure, making everything else fall apart with no possible salvation.\r\n\r\nRating: F", "created_at": "2020-02-13T17:56:14.851Z"}, {"movie_id": 539537, "review_id": "5e949496ccb15f001371204a", "rating": 3.0, "review_text": "> _**Review on Horror Focus_**\r\n\r\nBlumhouse is a strange one to predict when it comes to pumping out quality horror films. Jason Blum cleverly orchestrates a plethora of films on a tight-string budget, allowing some breathing space in the (un)likely case that one of his films is a flop. Normally, this is not the case as Blumhouse is prone to releasing the odd PG-13 horror movie every now and again, and strapping that age restriction on any horror already racks in the doe.\r\n\r\nThis, however, has no accounting for taste, as fans like myself can often be left puzzled by the fodder that is pumped out of the Blumhouse canon a few times a year. With quite the eclectic resume of films under its belt, we were treated to the likes of Halloween, Get Out and debatably The Purge, and with the brilliant The Invisible Man coming out so recently, it's truly baffling how a film like Fantasy Island is also the product of the same company.\r\n\r\nNo production company or director is perfect, as we are often exposed to some atrocious pieces of work from our most-trusted filmmakers (with the exception of Jordan Peele duh!). Blumhouse is not to be excluded as it isn't uncommon for them to pump out at least one absolute stinker a year, films that could easily go down as some of the worst the genre has to offer. Blumhouse itself is largely successful overall, and very rarely releases an all-out disaster; but if you see that dreaded brand stapled onto the start of a film title ie. Blumhouse's Truth or Dare, and Blumhouse's Fantasy Island, know that what you're about to endure will be 100 minutes of mind-numbing torture.\r\n\r\nImage result for fantasy island\r\n\r\nLet's make one thing crystal clear, Fantasy Island is camp as tits. The problem here however is that it doesn't realise, which is ridiculous given its boistrous bravado. What we have is a half-baked, often muddled experience that is so oblivious to its own unique charm and goofiness that such comments end up becoming a serious negative. If Fantasy Island capitalised on its own brand of silly then this would be an entirely more enjoyable experience from that alone, but instead it takes itself far too seriously and often gets lost in its own waffle.\r\n\r\nSome elements here are promising, with the overall plot being somewhat intriguing, but its the sheer execution and over-crammed production halts any above average element from being anything more than ill-conceived and inept. The biggest problem lies in the fact that it never knows what it is, nor understand what it's trying to be. It never fully lands on being a jumpy scare-centric horror, nor does it fully execute its trippy Midsommar-esque sci-fi rife that it tries so desperately to juggle.\r\n\r\nFantasy Island is first and foremost a generically dull experience, one that feels like three extremely underwhelming scripts stitches together like the knock-off Leatherface mask. The final product is actually quite puzzling, one that has a troubled time trying to establish its own identity which inevitably leaks out onto its viewer, resulting in a nonsensical, head-scratchingly hollow experience that is as dense as it is naff.\r\n\r\n VERDICT \r\nWord to the wise; like Truth or Dare, if Blumhouse attach their name onto the front of a film title like they're Clive Barker, save yourself time and avoid it. This is one getaway you definitely want to cancel", "created_at": "2020-04-13T16:34:30.088Z"}, {"movie_id": 539537, "review_id": "5ea666dfec45520021413ef5", "rating": 6.0, "review_text": "'Fantasy Island' is a surprisingly fun, undemanding, slickly-filmed diversion that will keep its target audience entertained.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-fantasy-island-a-suprisingly-fun-horror-tinged-adventure", "created_at": "2020-04-27T05:00:15.240Z"}, {"movie_id": 539537, "review_id": "5f60f6c3069f0e00359e9ca6", "rating": 5.0, "review_text": "Decent watch at best, could watch again, but probably won't, and can't sincerely recommend.\r\n\r\nI had to watch this twice to make sure I followed what happened, I thought it was because I was really tired the first time, but nope, it made about as much sense the second time.\r\n\r\nA lot of this is just the writing.  I don't know what is with writers and mysterious islands (I'm looking at you, \"Lost\"), but it makes them crazy: just because ANYTHING could happen, doesn't mean it needs to.  The problem with \"Lost\" is that they were actively reacting to viewer reactions, trying extremely hard to produce episodes that didn't match predictions (allegedly keeping the audience guessing), but that just makes disjointed story lines that wildly diverge for no reason.  This movie is basically that happening all in one go.\r\n\r\nThe reason that the audience can draw lines is because a pattern is established by the written story, diverging breaks that pattern; it does not enhance it.\r\n\r\nThis movie keeps some movie mystery clues in there, but there is a LOT of wild diverges and acting within acting here that I can't elaborate on without spoiling it (it's the one \"great\" thing about this movie, so I won't).  There is a high quality way of writing that involves red herrings and proper misdirection, but this is not it.  The end result looks the same, until you review what happened and realize that the first was based off the information given and the second is based off of arbitrary writing decisions.\r\n\r\nThe mystery of the island itself interferes with the traditional mystery aspect as well.  Even in ghost mysteries there are rules to follow.  When there aren't any rules left, you can't predict and the story actually gets boring if not frustrating.\r\n\r\nI am not saying this movie is without worth, but I am going to say that I feel bad for Lucy Hale as she's definitely the best of this movie.", "created_at": "2020-09-15T17:15:47.743Z"}]