[{"movie_id": 242582, "review_id": "54d1f9a79251411b6b00233e", "rating": null, "review_text": "**Survival of the Batsh!t Craziest**\r\n\r\nHere we have a sociopath for the digital age. A _Taxi Driver_ for the early 21st Century. Louis Bloom might have been born yesterday, just before taking an online course in Small Business Management, the new way to self-educate, without the petty annoyances of human contact and interaction. Every basic lesson he absorbed is put to the test with the obsessive solitary singular purpose of succeeding. Jake Gyllenhaal immerses himself in the role with psychotic stupor. He speaks with the same forward-plotting conviction whether tossing about obvious clichés or revealing something brilliant. The perfect entrepreneur. A maniacal detached idiot savant on a ruthless predatory mission. Morality and the legal system are minor roadblocks to dodge, riddles to resolve, sentiments to overcome. His brand of narcissistic psychosis is a genetic mutation that insures the survival of the species. Like an Aryan bulldozer, he cripples and kills the weak, exploiting the flaws in humanity, cannibalizing the limits of civilization, and capitalizing on each opportunity every step of the way, all for his own personal gain. All while intuiting which backs to scratch and/or stab and when. The perfect entrepreneur. The quintessential post-9/11 movie hero. Where Travis Bickle sought to take down corruption to rescue the innocent, Louis Bloom does the opposite, preying on the fallen and severing the social codes and mores that bind us for his own solitary success. American Exceptionalism. Nightcrawler is nanoeconomics in its purest, most wicked and vicious form. I'm sure some may see it not so much as a comment on what ails us but as an inspiration to venture out from, and Bloom as a persistent determined role model to imitate. How-to-Succeed-in Business-Without-Feeling. Humanity is merely a construct that can be subjugated, an apparatus to dismantle, a child's toy for the child that wants it all.", "created_at": "2015-02-04T10:51:19.752Z"}, {"movie_id": 242582, "review_id": "58c16ea49251411d5d0062ee", "rating": 8.0, "review_text": "'Nightcrawler' is a neo noir thriller starring a very impressive (and thin) Jake Gyllenhaal which cleverly satirises the media industry's obsession with horror and violence.\r\n\r\nThe poster's correlation with Nicolas Winding Refn's 'Drive' is a very clear choice because they are very similar in how they're made in terms of themes and even soundtrack. The film is also very similar to Martin Scorsese's 'Taxi Driver' and David Fincher's 'Seven' as the cinematography is very bleak and dark.\r\n\r\nThe story is disturbingly gripping as the audience view Lou Bloom's rise as an amateur journalist who seems to do anything to get the best footage of horrific crime scenes. What's more shocking are the news channels that purchase his work claiming \"if it bleeds, it leads!\".\r\n\r\nJake Gyllenhaal is brilliant in the starring role as he seems creepy but also powerful and shrewd.\r\n\r\n★★★★", "created_at": "2017-03-09T15:03:00.494Z"}, {"movie_id": 242582, "review_id": "590944ce9251411cde00461b", "rating": null, "review_text": "I find it truly amazing that Jake Gyllenhaal did not win nor was even nominated for an Oscar for this stunning performance as Louis Bloom. Makes me wonder how much of who gets nominated and who wins rides on insider politics and not on merit. Or how many Oscar noms and wins are \"gifts\" in the respect that either an actor has a catalog of wonderful performances and has never won (Henry Fonda comes to mind for \"On Golden Pond\")or the effort put into as role somehow makes it an Oscar winning performance (Leo DiCaprio in \"The Revenant\").\r\n\r\nGyllenhaal becomes his character; a feral, single minded, means justify the end \"bottom feeder\" catering to the worst in humanity - our seemingly built in need to view others pain. He sees nothing at all wrong with what he does or how he goes about it. Easily he is most believable sociopath I have seen on film. In a performance marked by many stand out moments perhaps the most galvanizing one is not an action sequence but a quiet moment (before a storm) where he tells an employee that \"Maybe my problem isn't that I don't understand people, but that I don't like them.\"\r\n\r\nHow his work was over looked for an Oscar is beyond what good acting warrants and indeed must fall within the machinery of Hollywood backroom politics. Going by IMDb, he was nominated for outstanding acting by just about every other award given in entertainment except the Academy. Maybe perhaps his Lou Bloom was too good and looking at this work, for Hollywood, was like looking into the darkest darkness; understanding the reflection they saw in it was themselves.", "created_at": "2017-05-03T02:47:42.733Z"}, {"movie_id": 242582, "review_id": "5c43988f0e0a266d6bd1c44a", "rating": 9.0, "review_text": "That's my job, that's what I do, I'd like to think if you're seeing me you're having the worst day of your life. \r\n\r\nQuite a debut from director and writer Dan Gilroy, Nightcrawler stars Jake Gyllenhall as Louis Bloom, a low level Los Angles thief desperate for work. Stumbling upon an accident he is introduced to the world of video news filming, opening his eyes to the money that can be made out of real life crime. Muscling his way onto the scene, it's not long before Louis blurs the line between the rights and wrongs of the occupation. \r\n\r\nWe here have our eyes opened to the world of the nightcrawlers (genuine people), and it's a murky one. Gilroy enjoys multi genre blending, splicing bits of horror thriller conventions with satirical barbs pointed at the television based media. Bloom is a frightening character, a sociopath that easily manoeuvres his way around this shifty world, and Gyllenhaal superbly brings him to life. Gaunt (Gyllenhaal lost a lot of weight for the part) with hollow eyes, and spouting management monologues he has learned off of the internet, Bloom only see human misery as a way of making money. Not that TV station editor Nina Romina (Renee Russo) is that much of a better person, and the relationship between the two is troublesome yet dynamic thanks to the excellent script.\r\n\r\nThe look of the picture needed to be atmospherically tight to the thematics at work, and thankfully that is the case. Predominantly set at night, it's all darkness and shadows that in turn are mixed with neon lighted cityscapes and dimmed lamplights. Bloom is at home here, the surroundings match his bents, he has found his calling to a side of the City of Angels which has a fascinating car crash kind of believability to it. The key to it all is that Gilroy and Gyllenhaal rope us viewers in to the point we can't look away, even as Bloom gets worse, morally bankrupt, we are right there with him looking trough his cameras.   \r\n\r\nThe relationship between Bloom and his sole employee, Rick (Riz Ahmed) is a little undernourished, but it's a minor complaint. For this is a sharp piece of film making, gloomy of course, but thrilling and deliciously troubling into the bargain. 9/10", "created_at": "2019-01-19T21:37:19.063Z"}, {"movie_id": 242582, "review_id": "5c43aaa29251412bfadc9ebd", "rating": 9.0, "review_text": "That's my job, that's what I do, I'd like to think if you're seeing me you're having the worst day of your life.\r\n\r\nQuite a debut from director and writer Dan Gilroy, Nightcrawler stars Jake Gyllenhall as Louis Bloom, a low level Los Angles thief desperate for work. Stumbling upon an accident he is introduced to the world of video news filming, opening his eyes to the money that can be made out of real life crime. Muscling his way onto the scene, it's not long before Louis blurs the line between the rights and wrongs of the occupation.\r\n\r\nWe here have our eyes opened to the world of the nightcrawlers (genuine people), and it's a murky one. Gilroy enjoys multi genre blending, splicing bits of horror thriller conventions with satirical barbs pointed at the television based media. Bloom is a frightening character, a sociopath that easily manoeuvres his way around this shifty world, and Gyllenhaal superbly brings him to life. Gaunt (Gyllenhaal lost a lot of weight for the part) with hollow eyes, and spouting management monologues he has learned off of the internet, Bloom only see human misery as a way of making money. Not that TV station editor Nina Romina (Renee Russo) is that much of a better person, and the relationship between the two is troublesome yet dynamic thanks to the excellent script.\r\n\r\nThe look of the picture needed to be atmospherically tight to the thematics at work, and thankfully that is the case. Predominantly set at night, it's all darkness and shadows that in turn are mixed with neon lighted cityscapes and dimmed lamplights. Bloom is at home here, the surroundings match his bents, he has found his calling to a side of the City of Angels which has a fascinating car crash kind of believability to it. The key to it all is that Gilroy and Gyllenhaal rope us viewers in to the point we can't look away, even as Bloom gets worse, morally bankrupt, we are right there with him looking trough his cameras.\r\n\r\nThe relationship between Bloom and his sole employee, Rick (Riz Ahmed) is a little undernourished, but it's a minor complaint. For this is a sharp piece of film making, gloomy of course, but stylish with it, it's also thrilling and deliciously troubling into the bargain. 9/10", "created_at": "2019-01-19T22:54:26.591Z"}, {"movie_id": 242582, "review_id": "62cda958481382004f991f5d", "rating": 10.0, "review_text": "_Nightcrawler_ shows the dark and sadistic rise of an underground freelance video producer that left me on the edge of my seat in disbelief throughout the entire film.\r\n\r\nThe film begins following Lou Bloom, a man down on his luck during economic turmoil trying to find his way in the world. The whole first act really builds his sense of helplessness and drive to help lift himself out of his financial hardship. This drive is built upon throughout the entire story as with each step Bloom’s morals and societal lines drift farther and farther from the norms. The entire theme of the story really resonates with common day America, as you are told to work hard and pave a path for yourself no matter the cost to those around you. Dan Gilroy did an outstanding job with the direction and writing of the entire film. The unsettling nature of dialogue and characters actions/motivations is incredibly eerie as it is indicative of society today. Each scene feels real as if it is a retelling of true events. I believed every second of Lou Bloom as a character, and that is largely due to Jake Gyllenhall’s best performance to date.\r\n\r\nGyllenhall does such an excellent job of putting on this outcast persona. As a loner, he spends most of his time learning on the internet and due to that he does not really understand the nuances of everyday life. This is done tremendously well as every line delivered by Gyllenhall is so sharp and awkward, but the source of the words is tremendously powerful. The sense of emotion displayed by the lead is fantastic as well, he swings from being incredibly upset to quickly turning into a calm put together businessman. It demonstrates Bloom’s extreme passion for this work as his emotions blind him to not only his speech but slowly morality. Every aspect of Gyllenhall’s performance was incredibly visceral and every bit deserving of an Oscar. I touched a lot on the main lead here, but the supporting cast was all around spectacular. Rene Russo and Riz Ahmed did excellent jobs in their parts. They were able to mirror the audience's reactions to the unhinged nature that is Lou Bloom, this aspect really resonated with me.\r\n\r\nOverall, _Nightcrawler_ was one of the best movies I have seen in a long time. It was able to capture me in the world and had me completely engaged with the story Gilroy was attempting to deliver. The film ends with a bang and has left me thinking about it hours after viewing.\r\n\r\n\r\n**Grade:** _97%_\r\n\r\n**Verdict:** _Masterpiece_", "created_at": "2022-07-12T17:03:20.917Z"}]