[{"movie_id": 419430, "review_id": "58ad891ac3a3682fa000584a", "rating": null, "review_text": "Horror and comedy have blended well since around the beginning of film for one key reason: the release that both allow from the audience. The building set-up is not unlike the quiet before the jump scare. Both utilize equations of timing to provoke an unconscious reaction. Because of these similarities, the horror-comedy is a well-tapped genre, especially in the last couple decades of works aiming their trajectory at the cult DVD bin. So it takes a particular level of skill to mine new ground in the territory, particularly from a first time director. What makes Jordan Peele’s Get Out so engaging, frightening and hysterical is that he knows exactly when to play the material straight; which it turns out is most of the time. <a href=\"http://www.cutprintfilm.com/reviews/get-out/\" rel=\"nofollow\">Full review </a>", "created_at": "2017-02-22T12:50:34.813Z"}, {"movie_id": 419430, "review_id": "58b11ab99251415b290065a1", "rating": 10.0, "review_text": "~ NO SPOILERS ~\r\nThis is an extremely impressive film from Peele. Its smart and knows it-- teasing you along the way of what is to unfold at the film's climax.\r\n\r\nThe main character is a photographer goes to visit his GF's house and all-white family. Things are not as they appear at first glance, and as the film progresses it becomes even more disturbingly obvious that the family is hiding a secret. As time goes on, cracks begin to form in the sticky sweet facade of pleasantness surrounding the home. Beyond this I can't spoil it, but the third act of this film is very satisfying. I don't think there was any part of this film that overstayed its welcome or felt weak. \r\n\r\nThe acting performances overall are superb, the cinematography is excellent, and the lighting is also well done. \r\n\r\nPlease go see this movie if you are into horror/comedy, its worth supporting.", "created_at": "2017-02-25T05:48:41.373Z"}, {"movie_id": 419430, "review_id": "58bcdfbc925141607304705f", "rating": 9.0, "review_text": "**Opening Remarks**\r\n\r\nI went out to see this film armed only with the snippets I watched in the form of television commercials and YouTube ads. The film had a very interesting look and  that really caught my attention. I noticed that the film focused primarily on race, which seemed like an interesting concept for a horror/psychological thriller. I also saw that Jordan Peele (of \"Key and Peele\" fame) was the director of the film and I was thrown completely off about what type of movie I was going to get.\r\n\r\n**First Impressions**\r\n\r\nTo start off, this film is gorgeous and this presents itself fairly early into the film. Gorgeous quality, gorgeous scenery, gorgeous people. Added with the minimal soundtrack, the film seems very open. Many horror movies try to go for a claustrophobic approach, while \"Get Out\" uses its spacious atmosphere to bring out the unnerving fear of the unknown.\r\n\r\n**Going Smoothly**\r\n\r\nOther than a few moments of \"How exactly is this scientifically possible?,\" you do not have to suspend your belief too often throughout the film. \"Get Out\" has an easy to follow, coherent story line that is aided by its pacing. Honestly, this is some of the best pacing have seen a modern horror film in a long time. Every sequence in this film seems to take the same amount of time and keeps the film moving along at a brisk pace. Every scene is refreshing and contains a new bit of information, instead of lingering on unimportant details. Every sequence is shot with purpose.\r\n\r\n**Getting to Know the Cast**\r\n\r\nThe acting in this movie is very well done. The interactions between characters seemed genuine and characters reacted to situations in appropriate manners. This isn't your average horror movie where the characters make stupid decisions to continue the plot; it all seems very organic. The characters act in a manner that you really connect with and do things that you could see yourself doing in these situations.\r\n\r\n**Further Considerations**\r\n\r\nAs I mentioned earlier, the film was directed by Jordan Peele, who has almost exclusively worked in comedy. As a fan of \"Key and Peele\" skits and their major film, \"Keanu,\" I thought I had this film figured out before going to see it. With its subject matter about race, I figured this movie would be more of a joke than it was a straight-up horror film. And while the film is a very witty satire on race relations in America and features some very humorous dialogue and situations, the film drives the horrors of racism to the furthest point. The humor stems mostly from the absurdity of the films premise.\r\n\r\n**That Ending**\r\n\r\nI do not have any major complaints about the movie. It didn't drag on, it mimicked reality, and gave me some very uneasy feelings, which is a plus for a horror film. The only problem I have with the film is the ending. It wraps itself up way too quickly and throws everything at you all at once. Luckily, the ending does resolve itself and doesn't leave any glaring loose ends. The film does end a bit too abruptly for my taste and it would have been nice to see what happens afterwards.\r\n\r\n**Closing**\r\n\r\nI would recommend this film to anybody looking for a different horror experience. It is tasteful and tame compared to other films, but it certainly doesn't distract from its purpose.", "created_at": "2017-03-06T04:04:12.793Z"}, {"movie_id": 419430, "review_id": "593bb88ac3a3680f7b00a5ec", "rating": 7.0, "review_text": "Perhaps it was the months of hype-related-preamble I had before getting the chance to see _Get Out_ that caused me to be not entirely blown away by it, or maybe it just doesn't resonate with me the same way it did with its audience at large.\r\n\r\nEither way, I was still very impressed with Jordan Peele's directorial debut. It's a great combination of freaky and funny, as well as realist and absurdist. Not to mention, how wholly original it is. There are some pretty  deep lapses in logic that had me scratching my head, but overall, it's a more than solid piece and I am very keen to see where Peele is headed next.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2017-06-10T09:14:50.451Z"}, {"movie_id": 419430, "review_id": "597e0859c3a36853dd017e97", "rating": 7.0, "review_text": "**Now you're in the sunken place!**\r\n\r\nNot all the directional debut sees this kind of welcome from the audience. Yeah, Jordan Peele had written and directed it. It is similar to the 90s style mystery-thrillers. Definitely must see for the 90s, 80s guys. It kind of looked like a black comedy, but I guess that's not they had preferred. Especially that teacup scenes and some of the close up shots, that freaks, yet very funny.\r\n\r\nWell, this is the story of an interracial romance. When Chris decides to meet his girlfriend's white family, living outskirt of her hometown, all goes as planned. But he was not sure how her parents take it, that he's a black. Now everything has settled, but his visit started to take a strange turn after a series of weird events. What it is and how he overcomes it is the remaining tale.\r\n\r\nThe casting was amazing. The story was suspenseful. You would feel you can predict the scenes, but not that easy and when twist happens, you will realise it was simple as that. This is a hit film now, but if it was 20 years ago, surely would have gotten a cult classic status. And yes it is, thinking the future.\r\n\r\nWhen this got out and its pre release, I thought it would disappear without any trace. It is rare a recognition a film like this to get to having a second string cast, debutante director and being a low cost film. I got entertained thoroughly as it delivered as promised. But I think some people are overjoyed and praising it like crazy. That's true if you are not a film fanatic, otherwise it is one of those decent films. Surely not to be missed. One of the best of this year.\r\n\r\n_7/10_", "created_at": "2017-07-30T16:24:57.627Z"}, {"movie_id": 419430, "review_id": "5c6096690e0a267de694ca46", "rating": 7.0, "review_text": "The hypnotism aspect changed the tone of the film, even though something menacing was expected all along. The end shriveled into routine gore and gun violence. The racial implications may make some feel guilty. Good enough overall but also overrated. Ms. Williams may be more than another NBC 'talent', time will tell.", "created_at": "2019-02-10T21:23:53.835Z"}, {"movie_id": 419430, "review_id": "62e85f751ad93b0061542a8f", "rating": 10.0, "review_text": "I loved this movie. I can’t express how happy and excited this movie made me for reasons I’ll talk about here…\r\n\r\nMost haven't seen, but this is what I was talking about yesterday with my review on Brightburn (on Letterboxd). It was a horror movie with a good idea bad bad execution with no plot or character development to help us care about the characters. Get Out is the perfect mix of horror, character development, and plot.\r\n\r\nHorror - I was thoroughly creeped out in the beginning and it slowly built up over time which I loved. It didn’t go for cheap scares, it built up the suspense over time that made the ending so scary. I was 100% sure Chris was going to die or be mind controlled by the end.\r\n\r\nCharacter development - I loved the character development in the movie and I’ll tell you why. It helps us care so much about these characters. I really wanted Chris to be safe and I was on the edge of my seat to see him get out. I loved the TSA cop and how funny he was without ruining the mood of the film. I wanted to see the slaves get set free even though they ended up killing themselse. And I was honestly sad to see the girlfriend turn out to be evil. It just emotionally attached me to the movie and it made the movie 10x better for it.\r\n\r\nPlot - I loved the plot because of the fact it surprised me and didn’t give me what i expected. I was expecting the movie to turn out bad for the main character but it turned out to be good. I didn’t see any way for Chris to escape but he did using interesting ways I didn’t think of. I loved the ending with the TSA Cop pulling up instead of a racist one. Twists like that just made the movie fun. Overall I like how it built a great story that really carried the movie.", "created_at": "2022-08-01T23:19:17.871Z"}, {"movie_id": 419430, "review_id": "63a0a9ae8ddc3414969c614d", "rating": 9.0, "review_text": "**An excellent film, which deserves our attention.**\r\n\r\nI saw this movie yesterday. I've been thinking about it for a while, and yesterday I took the opportunity to do so. I already had a notion that it was a very successful film, and that it was successful at the box office and with specialized critics. For a horror movie, that's pretty good stuff. For my part, I think it's a good film, well above average. It's a tense film, that works well with the environment... and yes, it has scary moments. Nominated for Best Film, Best Actor and Best Original Screenplay, it won an Oscar in the latter category.\r\n\r\nThe script works, mostly, on the issue of more educated racism, maintained and cultivated by the white elites of some North American circles where, without harassing blacks, they are seen as “rare birds” in the environment where they are. Afterwards, the film departs from this base to something denser and darker: the protagonist begins to realize that the people in that family act strangely, and that the black people who are there seem to be automatons. It's worth seeing what happens next...\r\n\r\nThis film seeks, in every way, to escape the stigma of American terror: the scares that, due to the action of the effects, make us jump in our seats. Seeking to give us more, he works a lot with the environment, and the tension gradually builds up as our sympathy for the main character grows. And that's the strong point of the film, and what makes it different, on the positive side. Jordan Peele did a very competent job directing, and showed that he understands horror and can give the genre a breath of fresh air. And this becomes even more relevant if we consider an aspect already highlighted by many people: he was a complete novice when he directed the film.\r\n\r\nRegarding the performances, I think it's fair to value Daniel Kaluuya's performance, more than committed and tense. He was really very good and if the film works so well, in part, it is due to this very competent actor. Allison Williams also leaves a good performance. I especially liked Catherine Keener's work. She does a very small job, appears for a short time in the film, but is very impactful.\r\n\r\nDespite not being a big budget film, I think I knew how to make the best use of every coin and prove that a good film doesn't really need to be expensive to make. The cinematography is very good, it is within the standard of current films, but it does its job very well. The sets and costumes don't stand out much either, although we have to highlight some quality notes, such as the clothes of some characters and, very in particular, the room where one of the characters ends up imprisoned. The visual and sound effects are good, and are used with intelligence and care. The soundtrack does, without imposing itself, a competent and discreet job.", "created_at": "2022-12-19T18:13:02.806Z"}, {"movie_id": 419430, "review_id": "63c6f7456b5fc200a04105ec", "rating": 1.0, "review_text": "Man all you fans are going to be embarrassed once racism is bad again... remember back in the day where we were supposed to judge people by the content of their character and not the color of their skin?  That attitude is going to come back, in many cases it never died, and even though the faux progressives are pushing to judge people by their skin color... yeah, people are going to just not be racist.\r\n\r\nThis is incredibly racist.  It makes a few points.  \r\n\r\n1) it is anti-miscegenation, the movie is very much against interracial relationships.\r\n\r\n2) The movie suggests (like all of his movies) that all white people are not only racist but evil.\r\n\r\n3) Deep down all white people want to be Black, the reverse of that joke in Chasing Amy.\r\n\r\nAnd it sort of rolls with that through the duration of the film, the messaging is clear, and what is probably why it has so much praise behind it, it hits the most important political mark: \"All white people are evil, they are the source of all evil, they need to be punished for it.\"\r\n\r\nSo of course it's \"intelligent\" anything that blatantly racist is going to be called \"intelligent\" today.", "created_at": "2023-01-17T19:30:13.947Z"}]