[{"movie_id": 660120, "review_id": "624abb40d9f4a6004f591371", "rating": 7.0, "review_text": "Told by way of a cleverly accumulating, chapterised, style this tells the tale of the restless \"Julie\" (Renate Reinsve) who having drifted, as many do, into a mundane and routine life with her loving boyfriend, decides that life has to be for the living and so sets off on a few life-adventures. I wonder if we are supposed to pick which of the men she aligns with over the following four years? They are different, they tick boxes with her, but maybe the whole point is that one size doesn't fit all and the perfection, or maybe just the satisfaction, she seeks is idealistic and naive. She tries her hand at most things in the search for a sense of fulfilment - but can that ever be truly reached if you have an restive nature? The acting is strong and very natural. As the twelve episodes develop, we see a distinct (if not necessarily positive) development in her character. Her boyfriends, the successful \"Ansel\" (Anders Danielsen Lie) and the handsome but flighty \"Elvind\" (Herbert Nordrum) gel well together on screen. Their character traits are explored by each other and by us simultaneously. We have to make our own judgements about their behaviour, too. When is cheating, well, not cheating? What is cheating? Nobody really knows what is going to happen - or, indeed, what anyone actually wants to happen! The ending let's it down a bit - a little melodrama that I found a little too convenient rather than touching; but all told this is an excellent observation of modern life and the choices and green devils it offers us all. Well worth a watch.", "created_at": "2022-04-04T09:32:48.156Z"}, {"movie_id": 660120, "review_id": "631abcca43d9b100819a745f", "rating": 9.0, "review_text": "A very creative take of that missing generation Y, put together brilliantly by Joaquim Trier. It may be my new favorite of his films. The really great acting by Renate Reinsve and Anders Danielsen Lie were significant to the success of this film.", "created_at": "2022-09-09T04:10:50.662Z"}]