[{"movie_id": 842675, "review_id": "63e4c6b565686e00b50ed832", "rating": 6.0, "review_text": "Now then, it's best - I think - to just accept that there is very, very, little plausible science to this save-the-planet movie. The format, and the story, have oft been done by Hollywood before so it's not top of the originality tree either - but it's still quite a watchable and well produced story of a group of Chinese trainees who must raise their game when they find themselves trying to save the infrastructure being built to help save the planet from terrorists. It's extremely perilous for them, their enemy is sophisticated and well entrenched. When the moon becomes unstable, it again falls to them to stop it crashing into the Earth before a carefully placed series of thousands of engines around the globe can be activated to propel us all out of danger and off to a new orbit around Alpha Centauri. The acting talents and the dialogue are really neither here nor there, but the visual effects - especially at the start - are effective and the pace of the film is as times entertaining as this dedicated team - and others from around the world - must unite to thwart the unseen enemy and rescue mankind before it's all too late. It really does need shortening though. It could lose an hour and - tightened up - have a much more focussed and impactful storyline that would hold the attention just as well as any Western equivalents. It does need a big screen to get the best from the creativity of the visuals but students of physics (astro or otherwise) may blush at some of it!", "created_at": "2023-02-09T10:11:01.987Z"}, {"movie_id": 842675, "review_id": "643a3fa08d22fc04badea506", "rating": 4.0, "review_text": "The Wandering Earth II or the \"wandering script\", as I call it, does nothing to improve upon a proposition that failed to work, the first time around.\r\n\r\nIts alright to create a space saga but trying to cram the whole thing down the audiences throat in two sittings, is simply too much to ask. My wife, who is Chinese, became exasperated about half an hour in and I don't blame her. \r\n\r\nThere are simply too many disparate things going on at once, for this film  to present anything, even a highly switched on viewer, like my economist other half, can reasonably follow. \r\n\r\nWhat you are left with, is what amounts to mini films, that feel like little like extended trailers, cobbled together over an lengthy time line, that become so diffuse, as to loose the potential to represent any semblance of a comprehensible \"whole\". \r\n\r\nGraphics are admittedly amazing, as are some of the sci fi conceptualisations. Acting's mostly pretty decent, too. That said, what are these elements without clarity of storytelling?\r\n\r\nIn summary, best described as an overly ambitious, ill considered \"sci fi, hot mess\" that's clearly had a lot of time and money invested in it. If this had been broken down into smaller, bite sized films with less crammed in, I think it could have worked, a lot better.", "created_at": "2023-04-15T06:09:36.977Z"}]