[{"movie_id": 244786, "review_id": "54c82e03c3a36870ba000a3d", "rating": null, "review_text": "DISGUSTING NONSENSE...\r\n\r\n*** This review may contain spoilers ***\r\n\r\nI find it very sad that so many people - including so-called professional reviewers - have rated this crap so highly. I did not walk out (although I was greatly tempted to do so) but saw it to the end. A total waste of time.\r\n\r\nHere's what might spoil it for you, should you believe the BS that's being spread around this stinking pile of excrement: It could have actually been OK if it hadn't been so laughably impossibly ridiculous. Perhaps if it had been set in the fifties or the forties when people had much less developed consciousness of human rights? But even so... \r\n\r\nI suppose the moral/lesson we are supposed to learn is... if you can't warp your students enough by abuse to force them to become great musicians then it is perfectly alright to discard or destroy them in the attempt. \r\n\r\nThis glorified tyrant and bully can himself only produce music at a grade one level and so because he cannot 'do' he 'teaches?'\r\n\r\nHe does not teach, he does not inspire; he withholds approval, negatively reinforces and rules by fear, and is feared rather than respected. I would have a difficult time to point to a single (pedagogical) scene in the film that had any merit whatsoever or was worth watching for any reason. Maybe I should say that its evident popularity may be evidence that we are truly living in the end times... ha! \r\n\r\nSee the film if you want to be current, but please decide for yourself from watching it and don't believe the hype about its 'genius' or 'brilliance.' It is not either of those things; it's a poorly written, sad joke. \r\n\r\nI would expect that those people who rate it so highly A) want to seem cool because 'it's about jazz' B) have never actually been in a teacher/student situation and therefore, can only imagine how its done C) see all the other positive reviews and so must follow the herd D) don't really know their ass from their elbow or E) thought the the actor had truly grown because in Spiderman he only yell, but it THIS one, he throws chairs.... or F) all of the above.\r\n\r\nSave your money or see something uplifting instead rather than this horseshit.", "created_at": "2015-01-28T00:32:03.188Z"}, {"movie_id": 244786, "review_id": "56ab260cc3a3681c54001f8a", "rating": 9.0, "review_text": "Fantastic movie with a good cast with an impressive Miles Teller and a yet even more impressive J.K. Simmons. Decent script, great directing, selection of the repertoire and performances.\r\n\r\nJust sit down, get a good audio system and enjoy one of the best movies of the 2010s.", "created_at": "2016-01-29T08:42:52.869Z"}, {"movie_id": 244786, "review_id": "58b352d5c3a368525400c173", "rating": 5.0, "review_text": "J K Simmons won an Oscar for Best Supporting Actor for his mean, bullying monster. Jazz teacher Terence Fletcher who abhors the words 'good job.'\r\n\r\nFletcher tells a tale about Charlie Parker and how doing a good job was not enough for him. Good job means mediocrity.\r\n\r\nYet Fletcher is a mediocre educator and his college seems not to have noticed this. Instead of being an inspiration his students fear him. He is a nasty tyrant and an incident from his past comes back to haunt him.\r\n\r\nMiles Teller plays Andrew Neiman the put upon jazz drummer in the Shaffer Conservatory in New York. Neiman is eager to impress Fletcher but nothing he can do is good enough and withstands all the effluent Fletcher throws at him until one day he snaps.\r\n\r\nDamien Chazelle unleashed an unethical monster in Fletcher with Neiman providing the film's heart but I am not convinced that this is a good film. The rest of the students in the class are silent to the abuse taking place right in front of them. They are young adults, not kids and they do nothing about it.", "created_at": "2017-02-26T22:12:37.085Z"}, {"movie_id": 244786, "review_id": "58c14edac3a368265b009826", "rating": 9.0, "review_text": "When I sat down to watch this film, I didn't know what to expect. I am not usually a fan of films about musicians but this was a brilliant and tense masterpiece. The story is of a very ambitious boy named Andrew (played by Miles Teller) who is a music student in New York. He aspires to be noticed by a prestigious music teacher named Fletcher (played by J.K. Simmons). As his wish starts becoming a reality, he realises the brutality of this teacher who continually pushes him with questionable methods. Damien Chazelle's direction is almost of a tense boxing or war action drama in that it constantly uses the music of the drumming to build the tension whilst using violent and sharp editing whilst the jazz band play.\r\n\r\nChazelle's screenplay is very well written. It is filled with humour, tension and heartbreak. The way in which Fletcher switches during Andrew's first lesson is expertly done. Fletcher relentlessly insults Andrew in a very shocking way which really creates a huge sense of sympathy for Andrew's character as he struggles to respond. The insulting dialogue is very similar to Stanley Kubrick's 'Full Metal Jacket' in that it is both humourous and disturbingly distressing.\r\n\r\nThe performances in this film are remarkable. Miles Teller is a relative newcomer but takes to this character with so much depth and understanding. The drumming scenes look like incredible and torturous workouts and Teller really shows the pain and agony his character is going through to reach his dream. The chemistry between the two central characters is flawless. J.K. Simmons is perfect as the abusive music teacher. Simmons manages to combine Fletcher's distinguished persona with his terrifying unpredictability. Simmons reminds me of his character in Valve's 'Portal 2' in which he continuously spouts insults at the player in a darkly hilarious way.\r\n\r\nOverall, 'Whiplash' is a fascinating study of passion, ambition and love. The film asks questions about the morality of getting one's dreams and the acceptable methods of acquiring them. Full of amazing performances all around, and created with such intensity and spirit, my final rating for this film is 4.5 stars.\r\n\r\n★★★★½", "created_at": "2017-03-09T12:47:22.897Z"}, {"movie_id": 244786, "review_id": "5e2f2a96326c1900121c0682", "rating": 10.0, "review_text": "\"There are no two words in the English language more harmful than good job\".\r\n\r\nWhiplash follows are main character Andrew Neyman who is a young jazz drummer, single-minded in his pursuit to rise to the top of his elite east coast music conservatory. Plagued by the failed writing career of his father, Andrew hungers day and night to become one of the greats. Terence Fletcher, an instructor equally known for his teaching talents as for his terrifying methods, leads the top jazz ensemble in the school. Fletcher discovers Andrew and transfers the aspiring drummer into his band, forever changing the young man's life.\r\n\r\nOK let me just start off with this. You had no idea how much I was really looking forward to Whiplash. This was on my movies to check out list, because I heard nothing but positive things from this movie and I heard a lot of people described this film has the \"Full Metal Jacket\" but with no war or guns, but with music and well... drums. I think Whiplash and \"Birdman\" was the two movies I wanted to see before making my best movies of the year list, because who knows they might make the list. I haven't seen \"Birdman\" yet but will do soon, but I finally had the chance to see Whiplash and my god this movie was just so spectacularly flawless in many ways. Whiplash is the best move of 2014.\r\n\r\nJ.K. Simmons in this movie probably pulls of the best performance in his career. Every word that came out of his mouth didn't feel like he was reading from the script then act it out. I felt every angry punch of words that came out of him, because it was so real. I didn't see J.K. Simmons just playing a movie character in this movie, no he was the freaking Fletcher.\r\n\r\nNow let's talk about Terence Fletcher: The best way to describe Fletcher to those who haven't seen the film yet, well his like Sgt. Hartman from \"Full Metal Jacket\". When he's on screen your locked on and he's also the kind of person that would be somebody's worse nightmare to have for a boss. This guy doesn't just like music, he breaths music and he wants his band to do perfect. His opinion and his look on music is another thing why I didn't flat out just hated him, I actually understood him. He made a very good point about how people will comment on you act and say \"You did a good job\", and yes I did use the words \"you did a great job\", in my past reviews but now I'm never going to use it ever again after this movie.\r\n\r\nMiles Teller was another stand out performances in this movie, and just like \"Foxcatacher\" where Channing Tatum was so over looked by his performance, well Miles Teller has proved himself to be more then a teen in a movie that will be forgotten and so would he, but no Miles Teller played this character so brilliantly he could become the next big thing. Now his character in this movie has the love of the true art of music and you can see that he wants to tell people his love for music, but when the harsh life of reality comes crashing into him it's truly heartbreaking to see his struggle and effort just not being good enough. Teller played this character so realistic and so brilliantly flawless.\r\n\r\nThe directing and the writing in this was just....perfect. Damien Chazelle gave this movie style and passion to tell a story about two strong music buffs battling out and he freaking nailed it.\r\n\r\nThis movie also had probably the best finale that I've seen in years. My nails were digging into the seat. I didn't dare to look away not for one moment, not for one second. I was simply locked on and when it was over... I'm kidding you I actually clapped towards the end of this movie. Now the biggest cliche that I always hear from critics when their talk about a different movies and their use words like \"You will clap at the end\", but you don't, or \"You will feel inspired after the film\", and I you don't. But Whiplash actually did make me feel inspirited towards the end and made me clap. It's message of not giving up and the dream that you been chancing for isn't just going to come to you. Movies like Pride, freedom Writers and all that such never ever give me that inspiring feeling inside of me, until I watched this movie.\r\n\r\nOverall rating: Whiplash is a movie that everybody needs to see. This isn't just a popcorn movie where you come and put you legs up and laugh a couple of times, no this movie reaches out to people out there that have the same problems that these character's have, with their passion of what their what to do in life get's over shadowed by something you don't want to do and this movie get's it right. So go and see if you have the chance.", "created_at": "2020-01-27T18:23:18.593Z"}, {"movie_id": 244786, "review_id": "6379b9782efe4e009b102161", "rating": 8.0, "review_text": "**Whiplash grips its audience from start to finish with a remarkable awe-inspiring performance by J. K. Simmons.**\r\n\r\nBRUTAL! Whiplash is a savage film with mind-blowing career-defining performances, interesting storytelling, and palpable oppressive anxiety. J. K. Simmons didn’t deserve an Oscar for this movie… he deserved all the Oscars. I was in awe of the intensity and cruelty Simmons unleashed throughout the film while peppering in moments of vulnerability that keep the audience guessing if he is a clever mentor or a manipulative abuser. I love how the film ends, leaving that very question open-ended. I didn’t enjoy the volume of language, and obviously, the subject matter of the movie wasn’t a fun focus, but the mastery of the performances, cinematography, and storytelling establish Whiplash as a true Oscar-worthy film.", "created_at": "2022-11-20T05:22:00.719Z"}, {"movie_id": 244786, "review_id": "64a013298c0a48011e1c349c", "rating": 10.0, "review_text": "It is less than what is described as a wonderful piece of art consisting of music, artistic performance, directing and photography. It's one of my favorite movies. This piece of art inspired me", "created_at": "2023-07-01T11:51:05.168Z"}, {"movie_id": 244786, "review_id": "6596f51b5cc11d776e7d30d9", "rating": 7.0, "review_text": "Pretty intense drumming movie. I think it's about the pursuit of perfection and maybe something about fathers. Really great finale. Fingers bleeding. Put this ham on your face!", "created_at": "2024-01-04T18:12:43.593Z"}]