[{"movie_id": 206487, "review_id": "5622f00d92514163d5000e97", "rating": null, "review_text": "Robert Heinlein’s classic short story ‘All You Zombies’ gets the big screen treatment as the basis for the Science Fiction time travel thriller ‘Predestination’, a notably imaginative film noir that craftily elevates the genre into an alluring confection. Australian cinematic siblings the Spierig Brothers (as in Michael and Peter) dutifully direct and adapt Heinlein’s Science Fiction material into a twisty tale of search and suspense. It was reported that Heinlein wrote his intriguing narrative in one single day back in the late 1950s. Well, whatever the case is behind such speculation, it is clear that ‘Predestination’ is a competent and compelling time travel vehicle that deserves its inevitable comparison to the likes of Rian Johnon’s solid and involving 2012 inventive spectacle ‘Looper’. \r\n\r\nThe Spierig Brothers and ‘Predestination’ lead Ethan Hawke (Oscar-nominated for ‘Training Day’ and ‘Boyhood’) collaborate once again as they bring together a surreal movie experience detailing with the agenda of a Temporal Agent going undercover as a barkeep known as The Bartender (Hawke) in an attempt to thwart criminal activities before they turn into actual crimes. It is worth noting that the Spierigs have coveted the zombies/vampires sensationalism in their earlier films (‘Undead’ and ‘Daybreakers’) but curiously side-swipe any references to these creatures in ‘Predestination’ despite the aforementioned ‘All You Zombies’ blueprint for inspiration. Perhaps this is a wise revelation as the Spierigs are allowed to concentrate on the ponderous SF aspects of human adventure within the varied dimensions of time, place and space.\r\n\r\nThe daring exposition gels both creatively and caustically because of the macabre mission being undertaken by the Bartender and feminine targeted scriber ‘The Unmarried Mother’ (as portrayed by Aussie actress Sarah Snook, ‘Jessabelle’). The agent Bartender is represented by a shadowy and roguish governmental outfit blessed with the ability to fight crime through time-traveling tactics. Unfortunately, the rough edges in preventing crime-ridden hedonism through time travel accessibility has not always been a smooth transition for the Agency. Also, it does not help that the constant policing corruption has spiraled out of control thus adding more pressure to the Agency to perform its watchdog duties tackling sinister plots.\r\n\r\nThere are revolving elements that shape ‘Predestination’ to become this enigmatic, head-scratching puzzle where the sense of encountering warped worlds are wondrous yet unsettling and weird. The Bartender (already a victimized and distressed pawn in the nefarious dealings of the id-70s New York City’s elusive and crazed Fizzle Bomber) soon encounters a stranger betting him that he (or ‘she’ in certain cases) can provide the most outlandish story that he has ever heard to date. Soon the boastful stranger (Snook), a ‘True Confessions’ columnist for the written piece ‘The Unmarried Mother’, will figure into the Bartender’s predestined existence in more ways than one.\r\n\r\n‘Predestination’ is a complicated SF sideshow that touched upon some unconventional fodder that range from timely commentary pertaining to violence to topical issues of sexuality. The film skillfully presents the frailties of suspicion, apprehension and uncertainty within the tangled and playful web of time travel management. With all the nifty under-sized flashy special effects and Science Fiction trickery aside, ‘Predestination’ sparkles in large part to its committed and calculating performances by Hawke and Snook as the psychological bait that guides the audience into the transfixing insanity that persists within the confines of the storylines. In particular, Snook’s ‘Mother’ is called upon to offer a complex characterization of an individual (both female and male genders) and take us into the nostalgic timelines of the past and present while conveying shades of toughness, vulnerability and mystique. She has a sordid backstory that unfolds and adds to the tormented trials and tribulations with the obsession of catching the scheming Fizzle Bomber. In a convincing supporting role, Noah Taylor’s Mr. Robertson is instrumental in the development of Snook’s triple identity crisis as Jane/John/’Mother’.\r\n\r\nThere certainly is an old-fashioned, spellbinding vibe about ‘Predestination’ that propels the Spierigs’ trippy time-traveling spectacle to its climatic ambitions. The low-key production values are surprisingly engaging but overall the telling proof of acting, directing, writing and imagination seems to be a winning formula in conception. Of course, the other filmmaking strokes involving the crisp cinematography, soothing score and vibrant set designs further compliments this punchy actioner.\r\n\r\nDark, moody and visibly challenging, 'Predestination’ gleefully plots and twists its way into a hearty submission of inspired Science Fiction contemplation. After all, time does not stand still for anybody especially in the realm of Australian noir SF sensibilities.\r\n\r\nPredestination (2014)\r\n\r\nSony Pictures Worldwide Acquisitions\r\n\r\n1 hr.  37 mins.\r\n\r\nStarring: Ethan Hawke, Sarah Snook and Noah Taylor\r\n\r\nDirected by: Michael and Peter Spierig\r\n\r\nRated: R\r\n\r\nGenre: Science Fiction/Time Travel thriller/Sci-Fi crime caper\r\n\r\nCritic’s rating: *** stars (out of four stars)", "created_at": "2015-10-18T01:04:13.961Z"}, {"movie_id": 206487, "review_id": "573799f1c3a3682ae9000587", "rating": 8.0, "review_text": "The one thing that this job has taught me is that truth is stranger than fiction.\r\n\r\nOut of Australia, Predestination is directed by Michael Spierig and Peter Spierig (who also scores the music). The Spierig's also adapt the screenplay from Robert A. Heinlein's story \"All You Zombies\". It stars Ethan Hawke, Sarah Snook, Noah Taylor, Christopher Kirby and Madeleine West. Ben Nott is the cinematographer. \r\n\r\nIf we throw up a simple synopsis for this pic, it's about a time travelling agent who goes back in time to stop a killer known as \"The Fizzle Bomber\" - whilst helping a trans-gender man who has just told him a fascinating and emotionally wrought story. But simple is not a word readily associated with the Spierig's deliriously complicated mind meld of a movie. \r\n\r\nThe first half of film is the story being relayed by Snook to Hawke, and then the film spirals into a world of temporal loops and frazzled paradoxes. This demands the utmost attention from the viewer, a piece guaranteed to have you asking tricky questions, and also likely to have you rewinding some scenes for clarity - like I did!\r\n\r\nThis is not an actioner, this is very cerebral and sedate in tone, adult science fiction that's as audacious as it is clever. Snook is quite simply outstanding, the various layers she gives to her characterisations grip with intensity and emotional heart tugs. Hawke once again is reassuringly great - in that how he doesn't need to overact, he recognises the tone needed here, whilst knowing it's wise to let his co-star take the main stage.\r\n\r\nThematically the story blends its dizzying thoughts about time and its impact on the human race, with that of our basic human condition, that of identity. This is a very rewarding production for those who wont be popping off to make a cup of coffee during the viewing, it's hoped that in time this will garner more fans and be seen as something of a sci-fi gem. 8/10", "created_at": "2016-05-14T21:34:41.469Z"}, {"movie_id": 206487, "review_id": "5899b6bbc3a368426600434b", "rating": 10.0, "review_text": "**Rare excellent story - you cannot predict whatsoever**\r\n\r\nWhen's the last time you saw a film and could not even come close to predicting the ending.\r\n\r\nWhen's the last time after you saw a film you had to call up your best friends and tell them they have to see this.\r\n\r\nWhen's the last time you had a guest over and asked if they wanted to see a seriously twisted film - you couldn't resist that a near stranger would miss the chance to see this.\r\n\r\nIf you're in the mood for a mind luck (ie. if fish = lish ^_^) you will not want to pass this up.\r\n\r\nWay way fun.\r\n\r\nCan be watched - and seriously enjoyed - multiple times --> no small feat these days.", "created_at": "2017-02-07T11:59:55.928Z"}, {"movie_id": 206487, "review_id": "59f2856e9251416aaf03f53d", "rating": 7.0, "review_text": "Never forget that time travel is real.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2017-10-27T01:01:34.951Z"}, {"movie_id": 206487, "review_id": "5c4815869251410e0a52e0f4", "rating": 10.0, "review_text": "This is a film based on the short story by Robert A Heinlein called All You Zombies. It's a fantastic film with a portrayal of paradoxes and the extent to which they can become convoluted if Time Travel was possible. And when I say Time Travel, I mean with the ability to interfere with the past and future, and not just witness. It's a tough movie to get your head around so be prepared to go back and watch it again. The cast is fantastic. _Ethan Hawke_ delivers as always. But we need to talk about _Sarah Snook_ - man she can act! She's the heart of the film and brings together the first half of the film so convincingly. It's rare that a film based on Time Travel is made without ugly holes in the plot. Predestination is one of those rare ones which is complete in its beginning and end.", "created_at": "2019-01-23T07:19:34.106Z"}, {"movie_id": 206487, "review_id": "5e21dad62811a10013a238fe", "rating": 7.0, "review_text": "Predestination foreordained its paradoxical nature and exploited it with individuality. “Which came first: the chicken or the egg?”. An evolutionary question, now the setup for many punchlines, that has transcended time itself. The causality dilemma that considers both cause and effect. Infinite regression. Unsolvable. What really shapes a person’s biological anatomy or their metaphorical soul? Evolutionary diversity at birth or the nurturing of our surrounding environment? The aforementioned philosophical paradox is one which The Spierig Brothers held closely to the central plot that, on the surface may befuddle even the most avid sci-fi viewers, but dig somewhat deeper and find that the temporal trajectory is bursting with thematic representation. A time traveller is sent back to 1970s New York to prevent a terrorist, known only as the “Fizzle Bomber”, from murdering thousands.\r\n\r\nTo mention certain plot strands, even touching upon their delicate coating, would be to spoil this ingeniously creative film. Therefore, as a precaution, I will not discuss the second half. Including the paradoxical plot twists of conception and death. This is a mind-bending sci-fi tale that purely excels when focussing on the human elements of its characters. Forget about the jarring tonal shift from exquisitely detailed flashback narration to sudden sci-fi extravaganza. Put aside the occasional heavy hand-holding (although justified for the dense concept) that unimaginatively explains the limitations of temporal shifting. Exclude the multitude of entrancing twists that seemingly allow the narrative to crumble towards its inevitable conclusion.\r\n\r\nPredestination works best when it’s exploring the human condition. The drive that constitutes our soul. And a central focal point, but not the sole purpose, of the story is Jane’s gender reassignment into becoming John. A “woman” valued as intersex. Internalised male organs as well as female. Despite raising transgender issues and justifiably exploring the emotional conflict of such a scenario, it’s never treated as unfamiliar territory. Much like the film in its entirety, it garners an identity. Enhancing accessibility by turning an irrelevant piece of fiction into a relevant transcendental concept. Snook gave an arousing performance of someone undergoing such a procedure. Harnessing female and male acting qualities and nudging them subtly through her performance.\r\n\r\nReturning to the preliminary question though, the eternally talented Hawke offers this dilemma to the prognosticating Snook, who simply replies “The Rooster”. And yet whilst it was a humorous retort, it maps out the ingenious narrative cohesion that The Spierig Brothers moulded. That intimidating evolutionary deliverance, providing a cathartic allure of inevitability. They masqueraded causality through a simple life story told vividly within the confinements of a cigarette infused bar. Strangely, much like with other labyrinthine features, the second viewing allowed me to sniff out breadcrumbs more clearly. The hidden clues that the Brothers had deliberately positioned to reach the predetermined final destination. Extraordinarily clever.\r\n\r\nThe minuscule runtime should’ve been extended to better build the narrative foundations from the weight of all the mind-blowing twists, but The Spierig Brothers defied genre expectations by pushing a time-orientated story to its limits. The conventional boundaries of storytelling now extended indefinitely, addressing common time travel related issues and exploiting them ingeniously. Intelligence prevails once again.", "created_at": "2020-01-17T16:03:34.804Z"}, {"movie_id": 206487, "review_id": "64a19bdbd5191f00c506edb7", "rating": 9.0, "review_text": "This movie is quite beautiful to look at, especially the opening sequence, with a very noir aesthetic which really grabbed my attention. The huge exposition dump in the bar early on utterly kills the pace the beginning sets you up to expect. But by the end of the movie, it's obvious that couldn't be avoided. A bit of a mind-bender, and although a little predictable very imaginative and absorbing.", "created_at": "2023-07-02T15:46:35.959Z"}]