[{"movie_id": 481084, "review_id": "5dbc0322d2c0c100161f5d55", "rating": 5.0, "review_text": "This movie is yet another bland, boring animated kids film. It isn’t terribly insulting to the Addams legacy because it feels so far removed from it. Its plot is just a mess, and has very forced messages of being yourself that come out of left field in the film's climax - and of course, we can’t just have the Addams theme song, we have to have the urban gangster version of it by adding Snoop Dogg. Don’t waste your time; just show your kids the 90s films.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-addams-family-theyre-all-together-boring-the-addams-family", "created_at": "2019-11-01T10:04:18.137Z"}, {"movie_id": 481084, "review_id": "5e21455dbfeb8b0011cda662", "rating": 5.0, "review_text": "Probably the worst _Addams Family_ adaptation, of the ones that I've seen. When I say worst, I don't mean least faithful to the source material, I just mean, the one I personally enjoyed the least. There was still some stuff to like though, and I think if this animated version got a sequel I'd be willing to give it a chance.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2020-01-17T05:25:49.370Z"}, {"movie_id": 481084, "review_id": "5f6bec20d55e4d00356fb0e1", "rating": 3.0, "review_text": "Bad watch, won't watch again, and can't recommend.\r\n\r\nI like the Addams Family, conceptually, and I enjoy the live action movies, but this seems maximize everything I dislike about the Addams Family and minimize all the things I do like.  And even then, the movie is widely inconsistent.  It basically does whatever it wants whenever it wants without regard to the established rules.\r\n\r\nThis was something that the previous iterations did with some finesse, they always left some mystery to what the rules were, but it never contradicted itself.\r\n\r\nThe aesthetic alone feels pretty grating, and they use it as an excuse to do things that don't make any sense to facilitate the gags, but it again eludes what makes the Addams Family special, that it is weird and crazy things happening in reality.\r\n\r\nWhile I do like the attempt to modernize the movie, it ruins some great potential to extend the universe and create new characters in the next generation of things: something more movies need to do.\r\n\r\nOverall, this movie is just irritating, it has some basic structure to it, but the content is just dull.", "created_at": "2020-09-24T00:45:20.665Z"}, {"movie_id": 481084, "review_id": "5f733f0ffea0d7003604067e", "rating": 6.0, "review_text": "This somewhat new version of The Addams Family actually stay with the classic black and white version that was tv show. However they are modernized for the new viewers (mainly kids) to enjoy this. It doesn’t get overly weird or macabre to be full on Addams and even take some subtle nods from the tv show and comic strips.\r\n\r\nIt was an amusing animation but some fans might not warm up to this movie.", "created_at": "2020-09-29T14:05:03.724Z"}]