[{"movie_id": 50014, "review_id": "52e1be3419c2955eeb06f295", "rating": 9.0, "review_text": "Great setting, cast, story and performances. A must to be seen.", "created_at": "2014-01-24T01:13:24.227Z"}, {"movie_id": 50014, "review_id": "58ac50f49251415900014d1d", "rating": 8.0, "review_text": "I just watched The Help, almost immediately after finishing the book. Now, when comparing The Film to The Book it was based on (generally speaking), one major rule of thumb almost always applies: The Book is better. The Help is no exception.\r\n\r\nAccordingly, with the novel still so fresh in the back of my mind, separating my mind from the book in order to enjoy the film was an almost impossible task. No matter how hard you try, you just can't quit comparing the two, nitpicking every detail and being frustrated with everything they changed. Nevertheless, I was still able to enjoy the film for what it was, though I am glad that I possessed full knowledge of the actual story.\r\n\r\nThe Help tells the story of black domestic servants in 1960's Jackson, Mississippi. It focuses on white Miss Eugenia 'Skeeter' Phelan, and her efforts to give a voice to black maids by writing their stories from their perspective and thus giving them an opportunity to be heard for the first time in their lives. Among the black women, Aibileen and Minny are the two key characters.\r\n\r\nSo let's just get the \"bad\" stuff out of the way. One of the elements in the novel that I enjoyed the most was the incredibly delicate bond of trust and understanding that builds up (over an extensive period of time) between Aibileen and Skeeter. It really does take Skeeter a long time before she finally wins Aibileen over and convinces her to share her deepest feelings with a white woman. In the film, this process felt rather rushed, like Aibileen just woke up the next morning and decided to do it. What bothers me about this is not just the fact that (oh, cliché) it was \"better\" in the book, but mostly because the film forgets to underline WHY it took so long. Not only is it much more clearly explained in writing that these black women face an incredible danger in divulging their true feelings about the white women they work for, the film also fails to capture the palpable tension and sense of urgency of the book. These women aren't just risking their jobs, they are risking their lives, AND the lives of their loved ones. They're in danger just for being seen talking to a white lady. I found this to be a rather big flaw of the film.\r\n\r\nThe film also lacks a lot of the character development I was hoping for. Quite a few character changes were made, so that in the film they all just kind of appear out of nowhere, and more or less seem to go about their business without – again – the big \"why\" of it all. One of the most underexposed characters was a woman named Celia Foote, who is a poor white trash girl who married way out of her league – and because of it, has to face the constant disgrace and condescension from the other stuck-up, \"sophisticated\" white ladies. Celia is just the sweetest, loveliest person in the entire story, and her relationship with her maid Minny is heart warming. The fact that they barely included this in the film is a real shame.\r\n\r\nOK – if I keep comparing the film to the book, this review will never reach its end. Obviously, there is a lot more I could (and certainly want to) say, but it's not really relevant to the effectiveness of this review. So, moving on.\r\n\r\nAt least they got the actors right! Each and every one of them was cast spot-on to their character. Emma Stone is wonderful as Skeeter –capturing her youthful daring and naiveté perfectly. There's also something about her voice and attitude that make it clear that this girl is different from her snooty bridge club peers. Viola Davis is the perfect Aibileen – all I kept thinking was, damn, she should have gotten that Oscar. Her performance is very moving and heartfelt. Octavia Spencer did actually win an Oscar for her role as Minny, and it was well deserved. She is exactly as I imagined Minny to be – sassy, smart-mouthed and with an attitude that could render any white woman speechless, even if it means losing her job a dozen times. Celia Foote is played by Jessica Chastain, and I fear I'm at risk of doubling over in superlatives to describe how perfect she was, so I'll just leave it at this.\r\n\r\nThe Evil Witch in this story is Hilly Holbrook, played by Bryce Dallas Howard. I'm not sure how big of a compliment it is to say that she is very good at playing a snide, cunning racist – so let's just say she is a very good actress. Another actress worth mentioning is Allison Janney, who plays the role of Skeeter's mother. Though she is not quite like I imagined her the way she was in the book (there we go again...), I always enjoy her performances very much and this one's no exception. Oh, and Sissy Spacek plays Hilly's mother, and she is a delight to watch. I got the feeling that the director extended her role to a little more than what it was in the book, just to give her more screen time. I don't blame him.\r\n\r\nOverall, the film is properly paced and reasonably well-constructed, though some creative liberties are taken here and there considering the timeline. In comparison to the book, it is a little disappointing, but I can't think of a single book-to-film adaptation where this wasn't the case.\r\n\r\nI still rate The Help 8 out of 10, because I think it is an important story to be told and the performances are stellar, but if you have a little more patience, I strongly recommend reading the book instead.\r\n_(March 2013)_", "created_at": "2017-02-21T14:38:44.487Z"}, {"movie_id": 50014, "review_id": "5f78ad9b3e2ec80035ca5fa0", "rating": 8.0, "review_text": "Great watch, probably won't watch again, and can recommend.\r\n\r\nTo be fair, you should watch this prepared for what it is: \r\na racial suffrage movie.\r\n\r\nThat means that it is filled with racism and unfair strife, and stupid jerks of the elite class that are under the impression that they can still buy and sell people because they do.\r\n\r\nThis is a fantastic movie, but it is a heavy, serious story, and the humor in it barely makes it more palatable in that regard.\r\n\r\nThe cast is filled with great actresses who give excellent performances, the script is well written, and the production value is great.\r\n\r\nIt isn't going to provide a level of escapism from worldly problems, but I don't have to like a movie to recognize its greatness.", "created_at": "2020-10-03T16:58:03.408Z"}]