[{"movie_id": 346672, "review_id": "5844cd0392514167640100cf", "rating": 4.0, "review_text": "Visually has a lot of the things _Underworld_ is known for, but in terms of quality? Well if you liked _Awakening_, you'll like this. Because they're basically the same film. I for one liked neither.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2016-12-05T02:12:19.508Z"}, {"movie_id": 346672, "review_id": "586235ddc3a3681a6f03cca1", "rating": null, "review_text": "Some things will never change within the tedious and surprisingly long-running sci-fi/horror saga **Underworld** film franchise. The vampires will still feature sharp fangs that can pierce a hardened leather sofa with one bite and the werewolves will be hairier than the local women’s wig shop. Of course the curvaceous heroine of this Gothic gumball machine of a flick–_Love & Friendship’s_ Kate Beckinsale–will predictably wear leather-clad attire that will cling to her shapely body tighter than a preschooler hanging on to his mother’s leg because he is scared to enter the classroom for the very first time. What also is expected not to change anytime soon is the sluggish intrigue, overblown supernatural creatures acting more obnoxious than your drunk Uncle Jake wearing a bra at the family cookout and Beckinsale’s womanly warrior Selene acting as the badass bloodsucking babe out to mediate the conflicting forces that persist. Yes folks…you heard correctly that this is the fifth installment of the **Underworld**  universe that sits there and makes its presence known with all the force and feisty relevance of unwanted luggage left at the airport.\r\n\r\nFirst-time feature director Anna Foerster (from TV’s “Outlander”) takes a crack at instilling some frolicking freshness in the turgid, cheesy **Underworld: Blood Wars**–a banal B-movie confection that Dracula would refuse to acknowledge even if there was a free showing at the local blood bank. Relentlessly flat, unimaginative and woefully recycled, **Blood Wars** offers nothing inviting or challenging for its aforementioned fifth time around the block and should have resisted the need to go beyond its 2003 Len Wiseman-directed release nearly fourteen years ago. Nevertheless, the devoted fanboys gave battleground beauty Beckinsale a theatrical movie gig (along with the rising popularity of the vampires/werewolves craze in cinema) that has lasted for an impressive long time as inexplicable as that sounds. However, lasting power does not necessarily mean a hill of beans with the one-note notion of a former orphaned vampire gal transforming into a beastly butt-kicking wrecking ball as the fatal feuding between the Lycans (a.k.a. “lycanthrope” or werewolves) and vampires escalates to a new level of chaos. Sure, Selene is not exactly as convincingly clever or calculating as Aliens’ Ripley (then again who is, right?) but she certainly is cut out of the same generic cloth as _Resident Evil’s_ Alice (for which pre-dates the **Underworld** experience as well as offering a longer string of sequels).\r\n\r\nFoerster assures that **Underworld: Blood Wars** wastes no time in getting to the punchy antics of its silly-minded action sequences–some mired in empty-headed fun while other takes are needlessly monotonous. Screenwriters Cory Goodman and Kyle Ward stock up on the fluffy cliches of this toothless tease of a frivolous fable as the thin plot flies every which way more than Beckinsale’s golden locks during a heated scuffle. Sophomoric dialogue, formulaic confrontations and the dullness of opposing fierce factions set aside **Blood Wars** does make reasonable usage of its lethal leather-wearing lass Selene/Beckinsale in eye-rolling combat and the CGI visuals are engaging when not looking choppy in some instances. The fact that Selene has to negotiate some compromise for either side does introduce some slight sense of tension amid the roguish warfare and Beckinsale sells this quite accordingly to a certain degree. However, **Blood Wars** will definitely serve as comfort junk food for those legions of followers that have familiarized themselves with Selene’s jolting journey as she maneuvers through the manic mess that involves her blood-thirsty species taking on the hellish hairballs that are the defiant Lycans.\r\n\r\nFor first-time **Underworld** viewers or the casual crowd they will witness an under-cooked, ridiculously trite terror tale of an actioner that is sure to leave **Blood Wars** as nothing more than a false sense of second-hand stimulation. A generic exercise in the making, Foerster’s brooding bombshell in Beckinsale’s Selene is serviceable for a fifth go-around but that is really not saying too much given that the material never seems to revolve her from some of  her past misadventures through the four previous **Underworld** entries. The supporting players–such as Charles Dance’s elder vampire Thomas, Theo James’s David (the male Selene perhaps?), Lara Pulver’s Semira and Tobias Menzies’s Marius–are accomplished performers in their own right but they add little atmosphere to the hackneyed hedonism that toils within this supernatural stupor.\r\n\r\nNo need to put the stake through the heart of these returning vampires and werewolves because they have proven time in and time out over again that the sultry Selene and her creature feature bickering buddies are not budging anytime soon after almost fifteen years of conjuring up surreal nonsense. Kinda makes you consider putting a stake through your own chest, huh?\r\n\r\n**Underworld: Blood Wars** (2017)\r\n\r\nLakeshore Entertainment\r\n\r\n1 hr. 31 mins.\r\n\r\nStarring: Kate Beckinsale, Theo James, Charles Dance, Tobias Menzies, Lara Pulver, James Faulkner, Clementine Nicholson, Peter Andersson\r\n\r\nDirected by: Anna Foerster\r\n\r\nMPAA Rating: R\r\n\r\nGenre: Sci-Fi/Horror/Action & Adventure/Fantasy\r\n\r\nCritic’s rating: * 1/2 stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** (2016)", "created_at": "2016-12-27T09:35:25.980Z"}, {"movie_id": 346672, "review_id": "58a50ff7925141654b001c5e", "rating": 5.0, "review_text": "You know what to expect by now.\r\n\r\nThis series has been going on so long now that this movie almost comes across as a throwback, since it's still drenched in all the post-MATRIX visual cliches.\r\n\r\nBeckinsale is as remarkably photogenic as ever, but the camera never lingers on her face for more than about two seconds. The running time is as tight as her costume, and it feels rushed.\r\n\r\nWe have a few decent fight scenes but the gunplay is just a mush of noise with very little in the way of cool choreography.\r\n\r\nStill, there's fun to be had watching the gore and all the scenery-chewing that's going on.", "created_at": "2017-02-16T02:35:35.792Z"}, {"movie_id": 346672, "review_id": "591f10359251414a57032e1c", "rating": 5.0, "review_text": "This franchise was a thing back then when the Matrix phenomenon was at force but now a days they should let it rest, otherwise a cluster of nonsense, much like the Resident Evil movie franchise, it is sure to become. \r\n\r\nIn other words the movie ain't that bad but this entry is just franchise milking at this point.\r\n\r\nI wouldn't mind if it would be made a video game franchise though.", "created_at": "2017-05-19T15:33:09.600Z"}, {"movie_id": 346672, "review_id": "595614989251416914035101", "rating": 8.0, "review_text": "I think it is fairly safe to say that if you did not like any of the other installments in the Underworld movie series then you will not like this one.\r\n\r\nAs usual with these kind of movies it is one where you preferably switch of most higher brain functions before watching and just sit down and enjoy the show. The movie is certainly not a masterpiece when it comes to story and script. Actually the script is, at times, fairly crappy. There are for example a sequence were the Lycans are attacking the stronghold castle of the Vampires and the script writer taught it was a good idea to just let them drive straight into the center of the castle and breach the door before they got challenged. What the f…?\r\n\r\nOn the whole the script is a typical Hollywood B-movie concoction that holds little merit. If this would have been the first movie in the series I think there would never had been a series made at all.\r\n\r\nSo why did I like it then? Well, even if the script is nothing to write home about it is not a total disaster and it serves as an excuse to provide 90 minutes of good entertaining Vampire vs Lycan action. Plain and simple.\r\n\r\nOf course Kate Beckinsale is a good reason for liking the movie as well. Her moving around in her intimidating (and good looking) skintight clothes slashing up Lycans in various creative ways makes up for some of the not so stellar script. I probably pissed of a bunch of feminists there but it is not really like a care about that.\r\n\r\nThe action and the CGI is reasonably well done and another reason to like the movie. Actually, come to think about it, Kate Beckinsale, the action and the CGI is pretty much the reasons I liked this movie.\r\n\r\nThey could have selected a more charismatic bad guy though. For most of the movie I felt Marcus was bland and even a bit dull.\r\n\r\nIt is not the best movie in the series but it does not exactly shame the series either. For me, I have to rate my enjoyment of it as above average compared to movies in general.", "created_at": "2017-06-30T09:06:32.938Z"}, {"movie_id": 346672, "review_id": "59976854925141403a001efe", "rating": 4.0, "review_text": "**The mission Eve has begun!**\r\n\r\nLike any guys from before the 90s, I was too a big fan of Beckinsale. There's no one can match her beauty, even to her age of today. That does not mean all her films are good. She has stopped doing good films a while ago. Every time when her films get released, I was hoping for her comeback like the old days, either a pure drama or an action film. No, not this film. It is what, the fifth in the franchise and the feature film debut for the directress of the television series.\r\n\r\nAs always, worth watching for Kate. The story continued, and it focused on the remaining vampires fighting for their survival against their arch-rival, Lycans. That's where the Selene caught between. But this time, it was about looking for her daughter, Eve, who holds the key to the future of these immortals. So the action begins where everybody clashes, racing towards their destination.\r\n\r\nThe first three were the good ones. This and the previous ones were downgraded the decent series. The makers are already working on the sixth. Definitely not expected, after seeing this particular film. But I hope it comes back to the original course with good story, actions, graphics and all. This was simply based on one liner, and the rest of the film leaned towards the stunt sequences. Okay to watch once, but I'm not sure worth of spending 90 minutes for it. So if you want to, then it is good to keep update to follow when the time comes to try the next ones.\r\n\r\n_4/10_", "created_at": "2017-08-18T22:21:08.032Z"}, {"movie_id": 346672, "review_id": "59bdc9dc925141350b01e440", "rating": 4.0, "review_text": "Kate Beckinsale is back as Selene in Underworld:Blood Wars. Director Anna Foerster helpfully recaps the Underworld franchise, useful as they are in main forgettable films apart from the vision of Beckinsale in skin tight black leather.\r\n\r\nBlood Wars also gives us a lovely vision of Lara Pulver's treacherous vampire Semira in a dress that is just about held up by tape on her breasts.\r\n\r\nThe Lycans led by new leader Marius are slaughtering vampires are on the brink of victory. Marius pursues Selene as he needs her daughter's blood. \r\n\r\nSelene meanwhile has tried to make amends with the vampire elders with the help of David and his father but soon finds herself betrayed.\r\n\r\nThe plot is rather silly and illogical, the action is at least fast and furious, the CGI is a little cheap looking.", "created_at": "2017-09-17T01:03:24.503Z"}, {"movie_id": 346672, "review_id": "62cc9366fad8e9004fab993b", "rating": 5.0, "review_text": "Unashamedly, I really quite enjoyed the first two films in this franchise. The next two were poor and poorer still, and this one really is the nadir. Kate Beckinsale reprises her role as the rogue outcast \"Selene\", only this time she must ally with the swarthy \"David\" (Theo James) who is the son of vampire supremo \"Thomas\" (Charles Dance). Thing is, the ambitious \"Semira\" (Lara Pulver) and her militant toyboy \"Varga\" (Bradley James) have other plans for their coven - and in the face of the resurgent and emboldened Lycan \"Marius\" (Tobias Menzies) the battle lines are drawn for some internecine plotting, backstabbing and all out war. To be fair, it doesn't hang around and Anna Foerster doesn't let the black leather-clad Miss Beckinsale keep her feet on the ground for long (or very often) but that's really the snag. There isn't really much of a story and what there is is all gummed up by some really lacklustre efforts from pretty much all concerned. It misses the simple dynamic of the earlier iterations that featured a smaller, tighter cast with a much more entertaining and menacing story. It does pick up a little at the end, but I think this was just one too many for the characters and it misses Scott Speedman - and that's not a thing you read every day!", "created_at": "2022-07-11T21:17:26.061Z"}]