[{"movie_id": 310593, "review_id": "5661a5aa925141790600776e", "rating": 8.0, "review_text": "> The youthfulness ever presence, despite the living matter nears to cease.\r\n\r\nHalf a year ago the first look poster of this movie's stirred everyone including myself. Not seen such kind of posters for even movies like 'Blue is the Warmest colour' and 'Nymphomaniac I & II'. It is obvious the director of the Oscar, Golden Globe and BAFTA winner for the movie 'The Great Beauty' delivered another similar ordinary concept about extraordinary fictional personalities. And the way of their life, especially when they meet the difficulties at some point of their lives.\r\n\r\nFrom all, the casting of Michael Caine caught my interest on this. This is another wonderful movie with the hard work of the fine cast and the crew. There is a good chance for the movie in the upcoming Oscar and other prestigious awards node in a couple of categories, including for the Caine's performance. Because it looks like made for awards, rather breaking records at the box office.\r\n\r\nWhatever the topic of the movie is, 'love' stands at the centre of the web. Human affections for each others, losing someone you love and at a same time falling for another. All about passing through 'love' in the life and in which, how strong is our grip on it to carry along with us to the end of the life was illustrated pretty compelling way.\r\n\r\nThe theme was bold, and everything shown was realistic. But it also makes some illusions to brief the other side of reality. For instance, a Buddhist monk who demonstrates his peaceful achievement, a fat man kicking a tennis ball high in the air et cetera, all these are the youthfulness of who are no more youths, citing as a desire for beyond their limits which is obviously what the title implies.\r\n\r\nI won't expect everyone like the movie as I did, because it is not made for everyone. But you could try it and then decide your thought on this film. That is one of the way the movies like this can work for the people who are choosy sometimes.\r\n\r\n8/10", "created_at": "2015-12-04T14:39:38.484Z"}]