[{"movie_id": 312669, "review_id": "579d03ba9251411b360085ea", "rating": null, "review_text": "A SCREEN ZEALOTS REVIEW www.screenzealots.com\r\n\r\nIn the latest indie to set itself out as an ‘intelligent’ alternative to the classic formulaic rom-com, “Maggie’s Plan” aims high, makes a strong effort, but sadly fails. It feels like another one of Woody Allen’s more cleverless films, one that has decent enough writing but struggles to elicit any genuine laughs.(This film is written and directed by Rebecca Miller, adapted from the original Karen Rinaldi story).\r\n\r\nEveryone’s favorite quirky hipster actress, Greta Gerwig, is perfectly cast at the titular character. Her charming demeanor works and plays well off of Ethan Hawke, who turns in one of his best performances as a professor of ficto-critical anthropology (if you find his title hysterically funny then you, my friend, are the target audience for this movie), and Julianne Moore (as a brilliant yet cold Columbia professor). The cast gives it their all; too bad these actors don’t have a better script to work with.\r\n\r\nThis messy and uneven film can’t seem to make up its mind regarding the overall tone. It’s part screwball comedy, part hipster philosophy and part family dramedy. There’s a huge emphasis on a toddler (the admittedly cute Ida Rohatyn) that was lost on me as a non-parent. I think the kid stuff is just too much and is completely unnecessary to the story.\r\n\r\nMaya Rudolph and Bill Hader are wasted in unremarkable supporting roles; their characters are never developed and seem to exist solely for a few punchlines (that aren’t very funny). There’s only a shell of a plot and not much ever happens in relation to it. The film is just a bunch of talking and a string of cute incidents that are all (sort of) related to Maggie’s big plan. The film is very strained and the big “twist” ending is something that only a true moron couldn’t see coming from a mile away.\r\n\r\n**A SCREEN ZEALOTS REVIEW www.screenzealots.com**\r\n\r\nI didn’t hate this movie but I also can’t figure out who in the world to recommend it to. Maybe it would make a decent rental if you’re a fan of Gerwig or Hawke.", "created_at": "2016-07-30T19:44:58.712Z"}, {"movie_id": 312669, "review_id": "57ed85f59251414c920003ab", "rating": 7.0, "review_text": "**Returning a product to the previous owner!**\r\n\r\nKind of a refreshing romance-drama on the cheating/divorce theme. Written and directed by Rebecca Miller. A great comeback after the six years of gap, but not a masterstroke. The casting was very impressive, particularly it was Greta Gerwig's typical film. I mean, if you enjoy watching her films, then you would do the same for it. On the other hand, her signature performance kind of bored to me. I mean all her film character was kind of easy-go-lucky soft-touch and comedic girl, I want her to try the different roles and genres. Maybe that's the reason many people had turned it down. Ethan Hawke and Julianne Moore were in the decent supporting roles, but everybody shared enough screen to call its their film too and delivered some good lines.\r\n\r\nI had a good time with it, because it was better than I anticipated. The story was good and its entire narration they have developed it finely. Unfortunately, it is an R film, otherwise it could have been a film for all. Kind of it reminds us the Woody Allen's style of presentation. Because you know even in the tough times for film characters, they calm and coolly deals it. So that makes it is a stress free film, especially if you just had a bad day, it might help you cool down. But don't expect the loud laughs in the comedy parts, then you should not opt it.\r\n\r\nThe overall film is worth a watch, but don't believe those who are saying it is too bad. It might be bad for them, though definitely not bad to bash it top to bottom. The critics thumbed it up, and if you welcome decent films, then go for it and decide yourself. The film has lots of good qualities, but this could be the last film of Greta I'll be watching if she does not appear in a distinct role in her next, because like I said I already bored of her in the same old. Finally, I feel I want to suggest it, but not to everybody, particularly not the youngster, the grown ups might like it better.\r\n\r\n_7/10_", "created_at": "2016-09-29T21:21:57.388Z"}]