[{"movie_id": 43933, "review_id": "53184c6ec3a3685c3d001134", "rating": 6.0, "review_text": "Story that is so down to earth in spite of talking about alien creatures that you think it could really happen ... only, it is not thrilling and gets boring at some point.\r\nThe two main characters, though, are very well played by McNairy and Able.", "created_at": "2014-03-06T10:22:38.881Z"}, {"movie_id": 43933, "review_id": "5e8a42499979d20019ed0999", "rating": 8.0, "review_text": "I enjoyed this film. There, I said it. I have watched it twice and will again at a future time. I see it more as suspense rather than as an action thriller, the difference Hitchcock explained between a bomb going off and the tension of wondering if it is going to go off. A bulging muscled hero or a bulging cleavaged heroine wouldn't have improved it in my eyes.\r\n\r\nThis is a different sort of alien invasion movie. In fact, it almost feels to me like the invaders dropped in on the planet like drunken tourists and now find they aren't able to fit in or leave but are instead stuck in one bar fight after another. Hmm, okay, that metaphor doesn't quite work, but it feels to me that they aren't here to conquer but rather to try to live their lives.\r\n\r\nI liked how the connection between the two leads gradually grew stronger after what appeared to be dislike, or at least disinterest. And I have to wonder if the title of the film shares its obvious meaning with a shadow allusion to the monsters within us.\r\n\r\nI read somewhere that there is no way monsters built like these could walk upright as they are shown doing. But - they are.  I can overlook a lapse in science when the movie is good.  I am not sure I believe multiple universes Are possible, but a lot of renown physicists do, so there is a fine line between speculative friction and unrealistic plots. What I am saying is that science isn’t my first priority in science fiction. I really enjoy time travel stories, even though most of them don’t bother with making time travel seem feasible. So yes, I liked this film, and you can too if you let yourself", "created_at": "2020-04-05T20:40:41.752Z"}]