[{"movie_id": 68722, "review_id": "5144e38f760ee332d015f2b7", "rating": null, "review_text": "Modern self-indulgent rubbish. Too long. I gained nothing from watching this. It's nicely photographed, but that is a given in the 21st century. The acting is fine, but this is a review of the movie as a whole. Don't waste your time.", "created_at": "2013-03-16T21:26:39.481Z"}, {"movie_id": 68722, "review_id": "64717dfea199a60133279813", "rating": 5.0, "review_text": "**It's a film for a fairly narrow audience and is very slow paced... too slow.**\r\n\r\nHonestly, I expected more from this movie. A certain strong dramatic spark that really justified the time spent watching it. Unfortunately, it seems the only motivation for seeing the film is its criticism of the Church of Scientology, a criticism that, if you read a little about the church and pay attention, is not even implied.\r\n\r\nPaul Thomas Anderson is a respected director, especially after the films “Magnolia” and “There Will Be Blood”. I'm not going to discuss that, not least because he's not a director I'm comfortable with (I think, counting this one, I've only seen two of his films). What matters is this film, and here, the director did a good job. It probably not the best of his career, there are very debatable options especially in terms of editing and rhythm, but it's enough.\r\n\r\nThe cast's work is even better. Joaquin Phoenix gives us an impeccable, intense and very dramatic work, even if it is totally surpassed by the charisma of Philip Seymour Hoffman, a totally accurate choice for the character, who required not only charisma but also leadership, affirmation and authority. The actor, who left us suddenly and quite prematurely, was rightly nominated for an Oscar here. Laura Dern and Amy Adams ensure the main presences in the feminine, and they do it safely, even if in a more discreet way.\r\n\r\nOn a technical level, the film has some very good points and others not so well developed: if on the one hand we have an excellent collection of sets and costumes, a good recreation of historical periods and places, an excellent cinematography and an enviable filming work, we also have a badly done edition, incapable of giving the film greater drama and some rhythm. I don't know if that was on purpose or not, what I do know is that the movie is disgustingly slow, dull and boring, with tons of lamely written dialogue and a lot of wasted time in between. I was left with the feeling that it would have been perfectly possible, in editing, to cut about half an hour of film without rigorously altering the meaning or running the risk of ruining the story.\r\n\r\nAnd talking about editing invariably leads us to talking about the script. I am not and have never been a member of the Church of Scientology, so I feel free to see a film that openly criticizes it, and also a film that criticizes it more covertly, as is the case. What the film makes clear is the weight of a great leader's charisma for the growth of a cult, but that was something that seemed clear enough to me. There are also some passages in which the film suggests that Scientology (like the “Cause”) is a great hoax, but this is also apparently consensual among the common public, and is based to some extent on testimonies from former members of the church. Regardless, it is not a film that is capable of attracting the masses to cinema, it is a topic for a niche of people already interested in it and not for the general public. And that doomed the film to a tremendous financial failure, considering the capital the production spent on it.", "created_at": "2023-05-27T03:50:22.808Z"}]