[{"movie_id": 536437, "review_id": "645139f2e16e5a015db48688", "rating": 6.0, "review_text": "This movie is an attempt to create the new \"Inception\", and whether if you liked that movie or not is good indicative of if you will like this one.\r\nThe plot follows a detective who had his child kidnapped four years ago. He starts to work in a multi-bank roberry case and soon it gets clear the thief has hypnotic powers. Additionally, his missing daughter seems to have some relation to the case. Although the detective has some natural resistance to mind manipulation, the reality is wrapped between so many layers of illusions that it is hard to know what and who is real.\r\nThe writers do a good job in building the plot in a way it's very hard to predict the plot twists. The acting is good. I just felt the movie went too deep on the plot twists to a point that most that is shown throughout the movie has no importance. Good movie although, but I would be surprised if it becomes a movie that will forever be remembered.", "created_at": "2023-05-02T16:27:30.356Z"}, {"movie_id": 536437, "review_id": "64648944d05a0300e2f4ec84", "rating": 5.0, "review_text": "MORE SPOILER-FREE MINI REVIEWS @ https://www.msbreviews.com/movie-reviews/mini-reviews-2023-edition\r\n\r\n\"Hypnotic carries the narrative potential to become a mind-bending film packed with jaw-dropping twists and incredibly captivating storytelling. Unfortunately, despite some interesting moments and an excellent cast, Robert Rodriguez and Max Borenstein deliver a messily edited, extremely confusing mishmash of ideas not as clever as the filmmakers try to make them out to be. I don't remember the last movie that had such a brutal amount of lazy exposition to explain every plot point or character development moment. A complete disappointment.\"\r\n\r\nRating: C", "created_at": "2023-05-17T07:59:00.809Z"}, {"movie_id": 536437, "review_id": "647688c912c604011f65ee84", "rating": 5.0, "review_text": "Hypnotic failed to \"mesmerise\" this viewer. \r\n\r\nA disjointed story, weak characterisations and mediocre action, are my not so enduring impressions, of this film. \r\n\r\nIn short, this is forgettable cinematic fare, that's predominantly driven by exposition and little else. Using a big name actor, like Ben Affleck, for me at least, wont fix this films shortcomings. \r\n\r\nNot sure too, why characters in the latter part of the film are dressed like car rental agents (oh well...)?\r\n\r\nIn summary, superficially watchable but instantly forgettable, action fare.", "created_at": "2023-05-30T23:37:45.738Z"}, {"movie_id": 536437, "review_id": "64784a83076ce800a821ffef", "rating": 6.0, "review_text": "You know, for the first half hour of this, I thought it was just a remake of \"The Mummy\" (1999). \"Danny\" (Ben Affleck) and \"Diana\" (Alice Braga) are racing around trying to find his daughter who appears to have been kidnapped by \"Dellrayne\" (William Fichtner). The latter man is able to use his \"Imhotep\" mind-controlling powers to bend people to his will, and so can turn his friends and the mob into a baying crowd. Well what gradually unravels before us now is a rather lacklustre drama that explains that there are people amongst us known as \"hypnotics\". These beings, of varying strength, can manipulate those around them (with or without light-sabres) and it appears that his daughter could end up being their equivalent of a superhuman. Poor \"Danny\" has no idea whom he can trust or just quite what is going on, he just knows that he must ensure his child doesn't fall into their hands. This leads us, rather willingly for me by now, into the third phase of the story that really does kill any semblance of originality with our intrepid hero just one step ahead of a pursuing army of heavily armed holiday camp employees. The visual effects are adequate, but the rest of this is just derivate and the story tries to be too complicated for it's own good. It will do fine on the telly at Christmas but that's about it, I'm afraid.", "created_at": "2023-06-01T07:36:35.947Z"}]