[{"movie_id": 345938, "review_id": "592e2c4592514130d60032ed", "rating": 10.0, "review_text": "This movie was beautiful. I laughed, I cried. For all of you out there who either believe in God or question his existence please watch this movie. It will definitely renew your faith", "created_at": "2017-05-31T02:36:53.654Z"}, {"movie_id": 345938, "review_id": "59dbe8819251412514066a74", "rating": 3.0, "review_text": "**If forgiving is that easily convincible, then welcome to the crime world!**\r\n\r\nA novel based film. A religious themed film. It has a message, BUT could be a bad message for today's world. Because how the event was dealt with the story only encourages the crime, in reality. Wise people can say philosophically, morally, but not means every words practically applicable. The common people would get affected more. Other than that, I have no grudge on anything. If it has been just a fantasy and an entertaining film, excluding that Christian thing, I would have liked it better.\r\n\r\nIt was more like another 'What Dreams May Come', but less visual spectacular. On the other hand, there was an uneasiness in the development of what happened in the early stage of the story. They did not go for the detail, from the crime perspective, hence that mysterious event holds the key which we don't know exactly what happened to judge anything out of the film. So that part reminds 'The Lovely Bones'.\r\n\r\nThe story of a father whose little girl mysteriously disappeared on a camping trip. Now the struggling father to cope with the incident gets an invitation to meet the creators. His journey to the other side of the world, where he goes through a series of unexpected tests, and at the end, how his character changes are told in those remaining parts.\r\n\r\nWorthington, Spencer, everybody was good. But the story is what I did not like. Like it was aimed for Christians only. But I believe not every Christian would agree with this story. I felt it was an unnecessary film. If it was fun like 'Bruce Almighty', the whole world would have enjoyed it. Too serious and very not acceptable message led this film to fall. No, it is not worth a watch for people with the open mind, unless this is what you were looking for.\r\n\r\n_3/10_", "created_at": "2017-10-09T21:22:09.142Z"}, {"movie_id": 345938, "review_id": "655feeedefe37c011d2ac606", "rating": 4.0, "review_text": "As a person who doesn't believe in any sort of gods, somehow, I watched this movie.\r\nAnd I have to say that I almost regretted immediately the wasted time. But not fully, and here is why.\r\n\r\nDisclaimer: I haven't read the novel; whatever I say pertains only to the movie. \r\nPlease, do not refer to the book. This is not a review of the novel.\r\n\r\nFrom the perspective of artistic value, the movie is pointless for a non-religious person.\r\n\r\nThe main point of the whole movie can be described as:\r\n\"You must forgive, no matter what happens. There is the god's plan for everything and everybody. You must believe\"\r\n\r\nAnd my first and last question, \"Why?\" remained without an answer.\r\n\r\nAnd perhaps, for some people, this sounds like a relief — a consolation to keep moving forward \r\nand live without regret for their actions and the things that happened to them and their loved ones,\r\nno matter how bad those things were.\r\n\r\nBut I refuse to accept this kind of life stance.\r\nI refuse to believe that our lives are already planned by someone or something else, and we cannot change anything.\r\nI refuse to believe that we don't choose and take responsibility for our actions.\r\nThis conception deprives us of freedom because someone has already decided for us.\r\nAnd it is always so easy to say that something happened because of \"God works in mysterious ways\" and unfortunately, many people choose this way.\r\n\r\n\r\nBut I also have to admit that this movie gave me a really good understanding of how religion works in the world.\r\nHow churches and other religious structures try to exploit people's weaknesses.\r\nThanks for that.\r\n\r\n\r\nIf you already agree with my position and find nothing new here, \r\nI recommend not watching this movie and pass by", "created_at": "2023-11-24T00:31:41.919Z"}]