[{"movie_id": 72331, "review_id": "59425a5ec3a3686c40009ca6", "rating": 7.0, "review_text": "I was somewhat prepared to be disappointed by this movie due to its rather bizarre title and story but to my enjoyment I wasn’t. I found it to be a quite enjoyable movie. \r\n\r\nThe story is somewhat bizarre indeed, but then what would you expect when Tim Burton has stuck his fingers into the production? The blurb about the film is also not exactly correct. The 16th president doesn’t discover that vampires are planning to take over the United States. It’s more on the line that he enters politics and actually becomes the 16th President because of the vampires. The story also manages to, more or less, blame the slave trade on the vampires. After all, slaves would make a nice food source for plantation-owning vampires wouldn’t it? As I said, the story is indeed somewhat bizarre. \r\n\r\nThe film as a whole is quite enjoyable though. Well, I guess you have to like vampire/action movies in order to find it enjoyable but then, why else would you want to see this movie in the first place? There’s enough action to keep the film going most of the time. If anything, maybe the training parts were a bit rushed and too short. The action is quite well done, reasonably blood-splattering, and fun to watch. \r\n\r\nThe axe-swinging Abraham Lincoln is a cool twist instead of the usual wooden stake, cross swinging or dart throwing vampire hunters that we’re used to see. He must be bloody, as in unnaturally, strong to be able swing around that axe the way he does but what the heck, it’s a vampire movie after all, so one should perhaps not nit-pick on such things. \r\n\r\nThere’s a scene near the end of the film where a train is about to crash down into a ravine since the bridge, that the vampires have set on fire, is about to collapse. That’s scene was a bit silly and overly unrealistic. There’s also a fairly big whoops in the make-up department where Abraham and his friend Joshua clearly has aged a lot towards the end of the movie, which you would expect, but his wife and his friend Will seems not to have aged at all. How that managed to slip through is somewhat unbelievable.", "created_at": "2017-06-15T09:58:54.727Z"}, {"movie_id": 72331, "review_id": "5b48a7750e0a267ad0015fcd", "rating": 7.0, "review_text": "Joyously Bonkers!\r\n\r\nIt is what it is, a nutty premise made in nutty fashion, but for the undemanding horror fan there's a good time to be had here. Action choreography is of a very good standard, as is, perhaps surprisingly, the CGI. The history aspects of the story, one Abraham Lincoln's accent into justifiable legendary status, are of course a mixture of the based on fact and chaotic popcorn, but it's always interesting, exciting and bloody!\r\n\r\nI imagine most horror fans have seen it by now, but if like me you are late to it, and like me you go in with low expectation levels, you could well find yourself having a blast and not hating yourself in the morning . All that and Rufus Sewell looks suspiciously like Adam Ant! 7/10", "created_at": "2018-07-13T13:21:57.966Z"}, {"movie_id": 72331, "review_id": "5c8cd8989251410fed9e6cd0", "rating": 3.0, "review_text": "My expectations were pretty low, but I somehow actually ended up liking it even less than I thought I might. The big setpieces seem to be what _Abraham Lincoln: Vampire Hunter_ is all about, and they are **so bad**. Just abysmal.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2019-03-16T11:06:00.799Z"}]