[{"movie_id": 4512, "review_id": "540b58ddc3a36879a8001d06", "rating": 10.0, "review_text": "Perfection.\r\n\r\nI think I will just come right out and say it from the off, this is a masterpiece, a truly spell binding, mesmerising tour de force that seeps class from every pore. I have often found myself cringing and turning my back on those who use in film debate the tired old defence of \"it's not for everyone\", but here I find I have no choice because this picture is purely for those enamoured with poetic beauty and precision film making at its highest. Those in search of an all action gun toting western need not apply, in fact those merely after popcorn fodder to while away an evening viewing should steer well clear. Andrew Dominik's second directorial effort is a character and dialogue driven piece of work, its thematic heart swirling with intelligence and elegiac beauty.\r\n\r\nThe story centrers around the final days of notorious outlaw Jesse James, and how one of his young disciples came to murder him on April 3rd 1882. Using Ron Hansen's novel as its source, it also fills in the gaps as to what became of the murderer Robert Ford as regards the subsequent aftermath of killing the infamous Jesse James. The film is dealing with issues all to prevalent in modern day society, we are witnessing perhaps the first instance of celebrity status gone berserker, we see how the press glamorise the nasty piece of work that was Jesse James, turning him into some sort of quintessential noble outlaw. We observe a stalking menace yearning to be like his hero, a young and impressionable fellow who's hurtling towards infamy completely oblivious of the pitfalls and irony of it all.\r\n\r\nStructually the film is perfect, and to me the film defines the old saying of art on the silver screen. The performances of the lead actors are incredible, Brad Pitt gives a career high as Jesse James, all teetering villainy yet perfectly befitting the prince charming outlaw persona so gleefully built up by the press. Sam Rockwell is Charley Ford, and here he proves that movie big wigs really need to start giving the guy some more dramatic roles to get his teeth in to. Yet as good as Pitt & Rockwell are, both men are left trailing in the wake of Casey Affleck's performance as Robert Ford, childish emotion fused with flecks of dark undercurrents as Affleck layers a perfect show. How the academy chose to ignore this performance should be seen as an act of treason against American cinema.\r\n\r\nFew films have left me open mouthed in admiration at the quality on show, but shot after shot, frame after frame, this really is as gorgeous as it comes. Roger Deakins photography sublimely pleasing the eyes at every edit, be it lush rolling hills cloaked in snow, or shadowy figures appearing like ghosts from locomotive smoke, with Deakins firmly cementing his reputation as a master of his craft. The score from Nick Cave & Warren Ellis perfectly captures the ambiance and texture of the piece, with Cave himself bagging a cameo performance as a bar room busker. It's incredible to think that this is only director Andrew Dominik's second feature film, following on from the hugely enjoyable Chopper in 2000, it is now evident that New Zealand can lay claim to producing a talent that if all goes to plan, will go on to become a director to rank up with the best of them.\r\n\r\nAs it is, and just right now, The Assassination Of Jesse James By The Coward Robert Ford should be filed along side Vertigo as a member of that club that only admits the greatest American films of all time, and that be even if it was directed by a Kiwi, wink wink America.\r\n\r\nMasterpiece. 10/10", "created_at": "2014-09-06T18:56:29.904Z"}]