[{"movie_id": 329981, "review_id": "58ca97709251415d9100c92a", "rating": 6.0, "review_text": "**Not the trainwreck I had imagine it would be after reading nothing but bad reviews about it.**\r\n\r\nNo it doesn't do anything new, and no it's not as intense as it could have been and yes it's a bit like a Lifetime movie of the week.\r\n\r\nBut it was still very much watchable, the cinematography was pretty slick and the acting was alright for the more part (even if Oliver Platt kinda phoned in his performance).\r\n\r\nThey should have made the ending a little more intense to really bring home the bacon, but overall it was better than I expected it to be (even if I wouldn't necessarily go out recommending it to people, I wouldn't recommend people not to watch it either).", "created_at": "2017-03-16T13:47:28.403Z"}, {"movie_id": 329981, "review_id": "59288a469251413b4103e6a2", "rating": 4.0, "review_text": "**A good cast and a potential thriller, but...**\r\n\r\nAt first, it looked fine. Well initiated by giving out a proper reason to develop what comes later. But that later part was the biggest let down. It becomes so cliché and because of that I lost interest. Otherwise, it is could have been a decent one with all the good actors. Also the location was good, a perfect setting for the storyline. But not noticeable when the narration enters the second half, mainly because of thriller takes over.\r\n\r\nIt is the story of a psychologist who recently lost her husband in a car crash, but ended up taking care of step-son after he became mentally and physically incapable. When the life was in the routine, suddenly something bad happens where her young patient goes missing. Following the event, she begins to experience what others won't believe her. But what comes later is more shocker, a twist in the tale takes us the conclusion.\r\n\r\nAs the title and its genre suggest, it remained truth to that, but there is no innovation in storytelling. Most of the people would easily predict most of the parts if not the entire film. The casting was the advantage and they all were good, including the kid from 'Room' and Naomi. Even though it is rated very low everywhere, as well as by me, kind of entertaining, which means watchable till the end than cut it out in the middle. Not a film to recommend, but if you choose it to watch, I won't say don't.\r\n\r\n_4/10_", "created_at": "2017-05-26T20:04:22.856Z"}, {"movie_id": 329981, "review_id": "63fe559c7a4ee700b916d7f4", "rating": 3.0, "review_text": "**An attempt at horror that doesn't yield more than a few jumps out of a chair.**\r\n\r\nFor as long as there has been horror cinema, we have seen several films where the great element of terror is loneliness. With humans being as social an animal as we are, being confined (and we've seen this in the pandemic) can really be a form of slow torture, and things get worse if we associate loneliness with isolation. Being alone, in a place isolated from everything, like a cabin in the forest or a country house, can be ideal for relaxing, for a weekend, but few people adapt to living like this. Of course, there are people who prefer it... but they are exceptions.\r\n\r\nThis film's script is just another one that takes solitude and isolation to turn it into a painfully frightening experience (or at least, that was the intention). Here we have a child psychologist who seems to have been forced to suspend a good part of her work in order to be able to take care of a teenage stepson who became quadriplegic after a car accident, which he inadvertently caused in the middle of a fight, and in which his father died. She does, however, keep a patient, a deaf child who appears at her house at night, alone, in a blizzard, and who disappears into the surrounding forest. After several searches, the authorities begin to believe that the boy did not survive. At the same time, she begins to see him around the house, and to believe that she's being haunted.\r\n\r\nThis summary is enough for us to see that we are not looking at anything particularly original, and that much of this has already been done, better and more competently, in productions with a larger budget. Even so, and without ever being really scary, the film plays well with the theme and with the usual “jumps” that North American horror uses exhaustively. Farren Blackburn only loses for not being able to create a more effective suspense by investing more in the film's introduction and character development before launching the horror. There are films where we feel that the director wasted too much time introducing and presenting the story and characters… but this film makes the exact opposite mistake, and does not allow the audience time to sympathize with anyone. There is still a lot of material about dreams, or about nightmares, but none of it is really carried forward.\r\n\r\nNaomi Watts is the movie's big star, and I really can't understand how she ended up here. Will she have read the script before taking this job? Is she going through a less good phase of her professional career? What matters is this: she is one of the few salvific elements that keeps this movie from being a total waste of time. The actress is a great professional and, as always, committed herself to her work, but she doesn't have the material to match, a skilful director or strong colleagues to take her to a more refined level. Steven Portman and Oliver Platt don't have the time and opportunity to show value.\r\n\r\nTechnically, the film doesn't have any major problems, but it doesn't have anything that gives it flavor either. It's like eating white rice without anything to go with it: we eat it, but it's not a dish that satisfies us, and obviously we don't like it, no matter how good it is.", "created_at": "2023-02-28T19:27:24.096Z"}]