[{"movie_id": 767, "review_id": "5d5c8577a3d02700150aeb17", "rating": 6.0, "review_text": "Hormones over excitement as part six is merely an appetiser to the double billed closure to come.\r\n\r\nDeath Eaters are running amok as Dumbledore has an important task for Harry and Voldermort has one for Draco; all set to the backdrop of raging adolescent hormones. While Harry also acquires a rather helpful book written by the mysterious Half-Blood Prince.\r\n\r\nPotter 6 is not as dark as the pre-release chattings suggested it would be. Yes there's the usual dark moments, including a shattering turn of events that sets it up nicely for the finale, but this instalment is mostly fun, gentle and even sexy. Harry, Ron & Hermione are more under threat from their own adolescent urges than they are from the swirl of a Death Eater or the appearance of one young & creepy Tom Riddle. This of course makes for good viewing to most of us who have grown with the characters, with the principal young actors having nicely grown into said characters. But can it sustain a two and half hour running time? No it can't is the ass numbingly honest answer. There's some quality set-pieces including Quiddich (for a change) and a swamp attack by the Death Eaters, but by and large it's talky and breezy in equal measure.\r\n\r\nA filler Potter movie then, one that is far breezier than expected. Good but not great, but as a set up for the epic conclusion it hits all the right buttons. 6/10", "created_at": "2019-08-20T23:42:47.482Z"}, {"movie_id": 767, "review_id": "5d5c87cdc4904800127cadff", "rating": 6.0, "review_text": "The seventh installment, the appetiser.\r\n\r\nAs the ultimate wizarding battle between good and evil draws ever closer, Harry, Hermione and Ron bunk off from Hogwarts to go search for the \"Horcruxes\" with which to halt the ever stronger Voldermort and his army, on the way they learn the importance of the Deathly Hallows artifacts.\r\n\r\nSo this is the one that sees the comfort confines of Hogwarts left behind as our intrepid trio of best pals hit the mountains and forests in search of the tools to stop old snake face in his tracks. In what is ultimately a chase/escape movie, one where the characters have to fight not only a number of challenges that come their way, but also their new found in-fighting capabilities, Deathly Hallows 1 wonderfully dangles the carrot for the final series entry to come. But the overriding thoughts you come away with from it is that firstly it's not really that much fun, and secondly that it shouldn't have been a stand alone movie. Too much of it plods where exposition and padding strains to get the film through its near two and half hour running time. Without the hustle and bustle of Hogwarts, and the myriad of characters that reside within, film struggles to escape the over reliance on just three central characters and a ream of MacGuffins. While some of the comedy and tender moments fall flat because tone is firmly pitched at dark clouds a gathering. However, where it does reward is with the action sequences, with David Yates once again proving he's a considerable talent when it comes to directing such passages.\r\n\r\nNew additions to the cast list feature Rhys Ifans, Peter Mulan and Bill Nighy, all welcome, and all sadly underused. As is the return of some older characters from earlier series entries (do you remember John Hurt was in the first film?!). While the thread involving the Ministry of Magic, and its nasty transformation into a Nazi like call for non-magical folk ethnic cleansing, is supremely adult and hits the nerves as it should do. Of the three principal young adult actors, it's still Emma Watson leading the way on ability, but alongside her, Radcliffe and Grint have earned our love and respect over the years for having to carry the weight of such expectation that has come with these roles. Fact is, is that now, having grown up with them and their characters for over ten years, we surely can accept them for not being multi ranged child actors. They have had to embody one character each for a decade, the range as such is the naturalism of aging through childhood like they have. Job done!\r\n\r\nTension is high and the magical moments engage big time, but the draggy nature of the beast makes this a film purely working as an appetiser to something sure to be far bigger and better. 6/10", "created_at": "2019-08-20T23:52:45.111Z"}, {"movie_id": 767, "review_id": "5f3389d6ef8b320038135f7f", "rating": 6.0, "review_text": "Has the quality direction of _Order of the Phoenix_ but manages to separate itself from that movie by having a script that isn't shit. \r\n\r\nFinal rating:★★★ - I liked it. Would personally recommend you give it a go.", "created_at": "2020-08-12T06:19:02.831Z"}, {"movie_id": 767, "review_id": "63b8909ef04d0100ae57fef4", "rating": 8.0, "review_text": "Harry Potter and the Half-Blood Prince may be the most mature film of the franchise with fantastic character development, but at the cost of action and a somewhat slow pace.\r\n\r\nThe beginning of the film suffers from what a lot of these films do where the audience is taken from location to location, without any explanation as to why. It is difficult to follow at times, but it's a sacrifice that unfortunately has to be made when adapting a long novel into a feature-length film. Despite this film being the slowest of the series, it does a tremendous amount of leg work setting up the epic conclusion. From the introduction of the Horcruxes to the multiple scenes of Voldemort's past, the audience gets a ton of background information revealing details from the previous film that creates a more coherent story structure.\r\n\r\nHalf-Blood Prince has a more focused return to Hogwarts and the class aspect which I enjoyed. Jim Broadbent's Professor Horace was a great addition and his connection with Potter is so seamless, with some aid from the Half-Blood Prince's textbook. Not only does Harry have great chemistry with Professor Horace, but his relationship with Dumbledore blossoms, and his reverence for the headmaster is captivating. It was great to see these two finally working together and trusting each other. Previously Harry would always hold information or Dumbledore would tell Harry to never mind, but finally, they get on the same page, and it was great to see.\r\n\r\nThis connection aids tremendously in the final scenes of the film. The trials that these two characters are put through are immense, but Harry's trust in Dumbledore is shown in a very uncomfortable scene of Dumbledore forcing down a poison of some sort. This struggle crescendos into an incredibly impactful finale with Dumbledore, unfortunately, dying at the hands of Snape. There were some fantastic character moments between Snape and Malfoy, and the light inside both of them is hinted at in this final scene. Dumbledore's death is felt, not only by the students of Hogwarts but by the audience as well. This is one of the more effective deaths in the series due to the audience's time with the character, as opposed to the death of Sirius Black in the previous film.\r\n\r\nOverall, this movie is slow and can drag on a bit. But there are some great character moments and plot developments that make this a fantastic beginning of the end for the series.\r\n\r\nScore: 84%\r\nVerdict Great", "created_at": "2023-01-06T21:20:30.704Z"}]