[{"movie_id": 29427, "review_id": "5d9c3ba46b5fc20029d81001", "rating": 8.0, "review_text": "Boo-yah, indeed.\r\n\r\nDirected by Breck Eisner and written by Scott Kosar & Ray Wright, The Crazies (2010) is a remake of the 1973 film directed by George A. Romero. It stars Timothy Olyphant, Rhada Mitchell and Joe Anderson. The plot sees a toxic spillage make its way into a small American town's water system and turns some of the locals into marauding maniacs.\r\n\r\nEisner's movie is that rare old thing these days, that of the horror remake that greatly improves upon the original. That might annoy some Romero purists, but the truth is, is that his original film really isn't that great to begin with. Thus it's ripe for a remake, whilst acknowledging that a certain weariness creeps into our thoughts at the seemingly never ending line of horror remakes getting churned out by a Hollywood running out of ideas. Hell I will even venture that we have seen all this before, nothing in this \"Crazies\" will have the horror faithful rushing out to tell their buddies about some overtly cranial splendour piece they have just watched, but this is a very effective horror piece, taut and tense at times, at others sick and splendidly disgusting. Eisner may not be a \"Craven\", or for sure no \"Romero\", but he executes the material with gusto and shows a knack for knowing how to make the material work.\r\n\r\nThe film is structured over three parts. Character formations in the little town of the delightfully small Americana sounding Ogden Marsh, which leads into the infected going doolally. Then it's the army attempting to get things under control. Lastly it's the the fall out as our brave survivors, erm, try to survive and make sense of what is happening. Eisner and his writers even get away with not fleshing out the principal characters. We know Olyphant's Sheriff is a toughie, and that his pregnant wife, Mitchell, is equally resourceful, while the deputy played by the film's standout performer, Joe Anderson, we know is loyal and sharp with a rifle. Who cares about flesh on these bones, let the crazies after them and see how they cope. Where the writers score plus points is with the portrait of a world losing its humanity. The sick are rounded up and contained, nobody cares enough to try and help them, while those sent to restore order, to protect the people, are as dangerous as those bleeding from the eyes and ears. There's madness everywhere.\r\n\r\nWith memorable blood pumping scenes, bona fide suspense and metaphorical smarts in the writing, this is one damn fine remake shocker. 7.5/10", "created_at": "2019-10-08T07:32:52.531Z"}, {"movie_id": 29427, "review_id": "5eb94419bbe1dd00208411ba", "rating": 7.0, "review_text": "I didn’t have much expectations for this film, other than thinking it would be a low budget, easygoing horror film. How wrong I was! Not only it is a decent horror film but also scary at times. Yeah, it certainly is not a 10 out of 10 horror film, for sure, but it’s certainly worth watching.\r\n\r\nWould I watch it again? Yeah! Would I make my friends watch it? Absolutely!", "created_at": "2020-05-11T12:24:57.695Z"}, {"movie_id": 29427, "review_id": "5f2234005b2f4700365505e3", "rating": 8.0, "review_text": "Great watch, will watch again, and do recommend.\r\n\r\nI have no idea how I went 10 years without seeing this one.\r\n\r\nIt shows you my frame of mind when this was the most uplifting thing of my day.\r\n\r\nThis is a great survivalist movie: an unknown infection occurs in a small rural town, and the government is closing in to secure and \"decontaminate\" the area.  And get nothing wrong, \"our\" government will contain, secure, and then protect, in that order.\r\n\r\nTimothy Olyphant and Radha Mitchell kill in this, they're great start to finish.  Joe Anderson does steal the show a few times though, really embodying the spirit of a rage filled person.  Danielle Panabaker is the reason this got on my radar at all, but she is sort of \"emotional teen girl\", and I feel she's too big an actor for that, so it wasn't my favorite part.\r\n\r\nThe writing is well done, in a progressive manner that makes me think that we really missed out on a \"The Crazies\" videogame.  The thing that makes this the infection more interesting than the average rabid / zombie movie, is that these infected are still \"smart\".  Now they're uncontrollably driven to kill, but they can do it by car / rifle / coordinated attack, and even an overwhelming mob.  Hell they can even set traps.\r\n\r\nSo you're basically fighting insane people on PCP.  The infection effect seems to differ based on how inclined you are to kill people.  There were a couple that managed to hide until they came across someone they had motivation to kill before infection.  Some people are just confused, like they don't understand why they're doing what they're doing.  Others \"round up da' boys\" and go a hooting and hollering.  The range of behaviors keep you on your toes.\r\n\r\nOn top of the infected, you have the military cleansing the area who (in theory) are still in their right mind, and no idea what is the infection vector.\r\n\r\nI really enjoyed this, it did remind me of \"Mom and Dad\" which has a similar infection, but the psychological motivations are much clearer and have a very nice built in complexity.", "created_at": "2020-07-30T02:44:16.915Z"}, {"movie_id": 29427, "review_id": "630a639d65c26c00825564fb", "rating": 9.0, "review_text": "**Breck Eisner directs one of the eeriest, most suspenseful, and exceptional zombie thrillers that stand out in the horde of zombie plagues.**\r\n\r\nThe Crazies isn’t a typical zombie film as the infected don’t become mindless shamblers. Instead, these kind farmers and mild-mannered townspeople become emotionless and murderous killers using whatever weapons they can find to expedite the slaughter. The suspense starts slow in the early minutes of the film but consistently builds to a fevered anxiety as the military attempts to quarantine the outbreak trapping the survivors inside with the crazed infected. Timothy Olyphant’s performance as the local sheriff trying to keep his family alive against a town of former friends and neighbors turned insane murderers is outstanding and genuine. The Crazies cast does an excellent job building buy-in and investment in their characters, making the audience actually care when one meets their brutal fate. This film is a striking and vicious thriller that belongs at the top of any zombie list.", "created_at": "2022-08-27T18:34:05.109Z"}]