[{"movie_id": 76649, "review_id": "53afbdccc3a3682eee004841", "rating": 6.0, "review_text": "For being a Hollywood attempt at ancient, non-American, drama this is a decent enough piece of entertainment. Unfortunately, as is too often the case when Hollywood tries to make these kind of movies these days, it is also underdeveloped, shallow and somewhat cheesy.\r\n\r\nThe movie have a decent enough cast and I have to say that their performances are generally good. At least as good as the script allows for. The story is pretty straightforward. Young slave is forced to become a gladiator and he is good at it. Beautiful woman enters the scene and Amor gets to work. Bad guy enters the scene and does what bad guys usually does to screw things up. It is a simple story which allows much freedom and which of course is spiced up quite a lot by being set against the backdrop of an exploding volcano.\r\n\r\nHowever, the movie could have done a lot more with the story. Even though the special effects are miles more advanced than movies like Ben-Hur with Charlton Heston or works by Cecil B. DeMille it somehow fails to achieve the same impression of awe and grandeur. If you cut out the volcano a lot of the scenes felt just ordinary somehow.\r\n\r\nWell, it is still a decent enough piece of entertainment. I quite liked the character of Atticus and the gladiator parts are not bad. Some of the volcano effects are reasonably impressive as well. However, why is it that Hollywood producers and directors totally lack any form of knowledge of the subjects they use in their movies? You take an exploding volcano, which in itself should be enough, and then all of a sudden you throw in a tsunami wave which movies towards the volcano. What the f…? That is just so ignorant. I do not expect historical accuracy of a movie like this but Christ, you do not have to slap the faces of the thinking part of the audience like this. The scenes where the ships were coming floating through the streets of Pompeii was also the worst special effects of the movie, regardless of the ridiculousness of the entire tsunami thing.\r\n\r\nThe end? Well, anyone who has read a few of my reviews knows that I am a sucker for happy endings so you can probably guess that I am not overly happy about this one. I guess one have to say that, at least, it was realistic though given that, once the eruption had started, there would be little way to get away from the volcano by any means available at that time.", "created_at": "2014-06-29T07:18:36.562Z"}]