[{"movie_id": 462, "review_id": "55b33897925141788b003e49", "rating": 8.0, "review_text": "For the first time in my life, I got people respecting me. Please, don't ask me to give it up.\r\n\r\nThe film is based on a real case and is about real people so to that ends it is obviously simple in structure, and nagging away as you watch it is the fact that the ending is never in doubt, it \"is\" all too predictable. However, what made Erin Brockovich the success it was is that the title character is not only interesting but also, importantly, intriguing. A foul mouthed hard bitten, twice divorced mother of three has to fight her corner just to get an honest days pay. It's a fabulous story backed up by a simply incredible performance from Julia Roberts. Here Roberts has let her hair down, puts on a push up bra and a short skirt, she is clearly enjoying the freedom of the role, and the results are real effective.\r\n\r\nI have no doubt that working alongside Albert Finney helped Roberts no ends, but it is her show all the way, and she alone masks over what really is an ordinary film, there is nothing we haven't seen before here, it's just a more modern take on the good versus evil corporate company scenario. It's steadily directed by Steven Soderbergh, emotional scenes are not overstretched to treacle point, and all in all it's good solid story telling. Repeat viewings prove to dilute the uplift factor of the finale, but Roberts' performance certainly holds firm for evermore.\r\n\r\n8/10 for the film, 10/10 for Roberts' ballsy show. If only we could have had more of these performances from her.", "created_at": "2015-07-25T07:19:51.450Z"}, {"movie_id": 462, "review_id": "5f90cea27646fd00332a0924", "rating": 8.0, "review_text": "Very good film. Julia Roberts is terrific.\r\n\r\nIt may go on for 10-15 minutes too long, but even so <em>'Erin Brockovich'</em> is a fascinating biographical film. The dialogue is pretty sharp, there are a few good lines in there for Roberts. She herself is terrific here, I enjoyed her whole performance.\r\n\r\nAway from Roberts, you have Albert Finney and Aaron Eckhart involved, as well as a few minor roles for recognisable faces from television - namely Michael Harney and Wade Williams. Finney and Eckhart are more than decent, but Roberts is most definitely the one that keeps the film moving forward.\r\n\r\nWell worth a watch.", "created_at": "2020-10-22T00:13:22.298Z"}, {"movie_id": 462, "review_id": "64c941280cb33500ac2b81ba", "rating": 6.0, "review_text": "Not that bad of a movie. Honestly there's all kind of plants around the world that pollute a lot of different things that are harmful to us. I wish they would have had trial in this movie and make them sweat. Would have been nice to see.", "created_at": "2023-08-01T17:30:16.085Z"}]