[{"movie_id": 10050, "review_id": "6467be072bcf67011bf2a205", "rating": 7.0, "review_text": "**_Snappy comedy revolving around a Shakespearian high school play_**\r\n\r\nA senior (Ben Foster) loses his childhood sweetheart (Melissa Sagemiller) and so joins the school play to win her back despite his lack of theatrical talent. The play is a musical version of Shakespeare's A Midsummer Night's Dream in which the teen has to deal with the hyper drama teacher (Martin Short) as he gets to know his best friend’s sister (Kirsten Dunst). \r\n\r\n\"Get Over It” (2001) is an energetic and innovative teen comedy with good camaraderie and the unique scenario of a Shakespearian play marked by that updated 60's-type aesthetic of the period. The amusing lines, mostly by Short’s character, are so rapid-fire you’ll have to see the movie a second or third time just to get ’em all. I also appreciate the ‘cool’ edge minus the over-the-top sleaze of flicks like the (puke-inducing) “American Pie” series.\r\n\r\nMila Kunis is also on hand in a peripheral role, but she never did anything for me, nor did Dunst or Sagemiller, but they’re all winsome enough. And Jeanie Calleja is notable as the assistant of the drama teacher, Jessica; plus there are some females on the fringes worth a mention. Speaking of which, statuesque Kylie Bax appears in an amusing side role and Carmen Electra has a bit part. \r\n\r\nOn the masculine side of things, Short pretty much carries the movie with his over-the-top charisma. Moreover, Colin Hanks and Sisqó are likable as the protagonist’s best friends while Shane West is effective as the arrogant rival.\r\n\r\nRemember the high school play in “Dead Poets Society”? Now imagine if the entire movie revolved around that with a wildly witty tone and fast pacing. That’s this movie. It took me a while to catch a grip with its uniqueness but, once I did, I savored it.\r\n\r\nThe film runs 1 hour, 26 minutes, and was shot in Ontario at Mississauga (Port Credit) and nearby Toronto.\r\n\r\nGRADE: B", "created_at": "2023-05-19T18:20:55.332Z"}]