[{"movie_id": 6145, "review_id": "590b2cb59251414fa8014b0b", "rating": 9.0, "review_text": "**Gripping!!**\r\n\r\n*** This review may contain spoilers ***\r\n\r\nSome of you may find (or I should say try to) faults in this gripping courtroom drama but for the rest this movie is a lovely, more than just about courtroom, dual between the ever talented Anthony Hopkins and the not just about looks Ryan Gosling.The chemistry between the two is really difficult to not feel right from the first time in the courtroom where the Hannibal Lecterish Crawford gestures Beachum to adjust his bow tie.It is amazing how the movie grips you despite knowing the fact right from the start who is the killer.Though Crawford is too smart to be believable, the way its played it doesn't raise the slightest of doubt in your mind about its actual existence.Beachum's urge to put the devilish Crawford behind bars for trying to kill his wife and then getting away with it can be seen greatly in the scene in the hospital when Beachum tries to stop Crawford from pulling the plug of his wife's ventilator.The only thing i found missing was the almost lifeless, short lived, romantic relation of Crawford and Nikki Gardner(Rosamund Pike who looks stunning in the movie).Maybe it wouldn't have helped the movie's plot in any way except Crawford's asking for a favor from Gardner's dad later in the movie that's why they didn't put too much efforts to make them a couple.In all a great courtroom, psychological, thrilling, drama with great acting.And i'd better not forget to mention David Strathairn's portrayal of DA Lobruto which was too good and I'd have loved to see more of him... Don't miss this one if you like an intriguing courtroom drama!!", "created_at": "2017-05-04T13:29:25.089Z"}, {"movie_id": 6145, "review_id": "5ee147702dda89001f76c122", "rating": null, "review_text": "This is my kind of film. Suspense throughout, mystery till the very end... I could write a long review about the film but I realise it wouldn't be that different to what others have already said about it, so my only criticism goes to Anthony Hopkins.\r\n\r\nI enjoy watching Anthony Hopkins. I really do. He is a brilliant actor and deserves all the credit he gets. However, his acting seems rather repetitive. He is always assigned to play the role of a man who is highly intelligent, mysterious, always a man of wisdom. Yes, this makes him an interesting character to watch, but we have seen it so many times. The funny thing though this never gets boring. So, I guess, hats off to him for his ability to make us watch the same character over and over again.\r\n\r\nWould I watch this film again? Well, I guess so, only if it was on the telly and there is nothing else to watch it. Would I make my friends watch it? Possibly.", "created_at": "2020-06-10T20:49:52.259Z"}]