[{"movie_id": 399173, "review_id": "597e0c199251415dba01a0b8", "rating": 6.0, "review_text": "**The story of how a hitman became hitgirl!**\r\n\r\nActually, it was a much better film than what I've heard of it. What could you expect from a B movie? This was a much better film for its small budget with a decent cast. The storyline seems okay, but Michelle Rodriguez is the one who made it possible. Yeah, it was like created for her to play the main role and she excelled. The filmmaking was quite compromised when the initial part of her character was played by herself. Because of particularly her height, but decently convinces us with all the rest of the makeovers.\r\n\r\nThe film was about an assassin, who after encountering some wrong men, discovers later that he'd went through gender reassignment surgery. Now raged with anger, he begins his hunt whoever behind it, especially finding the reason for. With a small romance and action sequences, the film comes to an end. Before giving it a try, you must understand that it is not the film you should expect to be a masterpiece. It tried its best to narrate a decent story, as well as you get your entertainment along. So it is not a must see, but still worth a watch.\r\n\r\n_6/10_", "created_at": "2017-07-30T16:40:57.691Z"}, {"movie_id": 399173, "review_id": "5981e812c3a3680d0e014d10", "rating": 5.0, "review_text": "A risky movie to make, people on both ends of the political spectrum are going to have things to say about _The_ _Assignment_ without ever having seen it, of that I have no doubt. But personally, and trying to put all that aside, _The_ _Assignment_ is actually halfway decent. It uses a couple of tropes I don't enjoy, for instance it has not one but two separate point of view framing devices, and I got the distinct impression that Sigourney Weaver was only there for maybe one full day of shooting, but I still was able to engage in the story, which was certainly one I hadn't seen on screen before.\r\n\r\nBetween this and _Inconceivable_ I'm having a great month for film titles that are super inappropriate puns.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2017-08-02T14:56:18.372Z"}, {"movie_id": 399173, "review_id": "5a5746639251417aa903336f", "rating": 3.0, "review_text": "Boring--which is the worst thing that a B-movie can be. Points only for Michelle Rodriguez's prosthetic penis, her natural titties, and Sigourney Weaver's cinematic debasement via thriller cliches. This fauxploitation film doesn't even have the guts to do exploitation right.", "created_at": "2018-01-11T11:11:31.473Z"}, {"movie_id": 399173, "review_id": "6495058ad5ffcb00ffe80f06", "rating": 4.0, "review_text": "Big thumbs down.\r\n\r\nI truly wanted to enjoy <em>'The Assignment'</em> due to Michelle Rodriguez's involvement, but man it is unfortunately a pretty cruddy flick.  Rodriguez herself is the film's only noteworthy positive, but only just to be honest - she isn't given much to work with. The premise has potential, though its execution here leaves a lot to be desired.\r\n\r\nEverything onscreen involving the characters of Sigourney Weaver and Tony Shalhoub bored me tremendously, every time it's just the filmmakers trying to come out looking smart - the dialogue, which is poor overall, is particularly bad for those two. The editing is also awful, the phoney comic book bits are weak and the transitions a very amateur-ish.\r\n\r\nThis 2016 release also has an annoying habit of telling us every single location that a scene takes place, why I do not know - and if you are going to, choose a different font. I know that's an odd thing to mention, but they chose a TV police procedual-esque font, which doesn't fit with the aforementioned attempt at the comic book schtick.\r\n\r\nThis should've been fun. Sadly, it is anything but.", "created_at": "2023-06-23T02:38:02.077Z"}]