[{"movie_id": 298312, "review_id": "56e6f9109251417ea200135d", "rating": 6.0, "review_text": "> You a film prodigy? You know, I used to be a pretty good actor.\r\n\r\nYou can see here the desperate Shyamalan Attempt to get back to his old glory days. But in the last ten years he's not able to reach a decent success. Losing truth with big league actors and production house, so ended up doing movies with teens in his previous 3. So this one as well about two young siblings who goes to meet their grandparents from the rural. After the smooth first day the grandparents' unusual behaviour begin to scare the kids. In an attempt to find the truth, what follows is a twist in the tale.\r\n\r\nPG13 rated 'found footage' horror-thriller. But the story might be either real or fiction that never explains, because the boy in the movie wanted to do a project. Not that scary except in a couple of scenes. A better story, but the movie was okay type. The entire film revolves around four characters, but the two kids led from the front with their excellent act. It faired well at the box office, but honestly, I was slightly disappointed with everything from it.\r\n\r\nShyamalan is better than this, but he had a few chances to prove it that did not work out well as everyone expected. It's only a matter of time to give an unexpected hit and turnover in his career, that's what I'm looking for, but looks like not any time soon. I think this film was better than his recent ones that delivers within its limit, so I consider it is a one time watch film and nothing else.\r\n\r\n6/10", "created_at": "2016-03-14T17:46:56.594Z"}, {"movie_id": 298312, "review_id": "588391b2925141045700afea", "rating": 7.0, "review_text": "A grand time of things at the grandparents place?\r\n\r\nThe Visit is written and directed by M. Night Shyamalan. It stars Olivia DeJonge, Ed Oxenbould, Deanna Dunagan, Peter McRobbie and Kathryn Hahn. \r\n\r\nBecca and Tyler have never met their grandparents, their mother left that family home in acrimonious circumstances. Now the kids are off to spend a few days with them - and get far more than they bargained for. \r\n\r\nIf you ask some people then they will say that Shyamalan never had form to begin with, so to them this doesn't warrant being called some sort of return to form, what it does do is find him on sound footings. Veering away from big budgets and adopting a low-fi approach, this very much has him back in the spooky zone. \r\n\r\nIt's all very nutty of course, the premise and the (very good) reveal are hardly genre defining, but the unease is palpable, the mystery element strong and there's a bunch of genuinely freaky scenes. The last third is almost delirious as the story goes through its bad dream fairy tale throes, and the small cast are excellent, with Syamalan once again showing how good he works with young actors. \r\n\r\nA good honest chiller that isn't purporting to be anything other than that. 7/10", "created_at": "2017-01-21T16:52:02.098Z"}, {"movie_id": 298312, "review_id": "6463aa63dbbb4200e22e66d0", "rating": 6.0, "review_text": "The Visit had a lot of potential, but unfortunately, it falls flat due to the many drawbacks that are constantly present in M. Night Shyamalan's films. However, where this movie excels is with the fantastically paced tension. Shyamalan incorporates a mix of found footage elements with a bit of Paranormal Activity, creating something that is pretty unique and sinister. This film was one of the more terrifying experiences I have had in quite some time, and I was constantly on the edge of my seat, especially in the night segments. I am sure it helped that I was watching this on a laptop, at night, with headphones on.\r\n\r\nThe story itself is actually pretty unique. The creepy nature of the grandparents is unsettling but also incredibly grounded. They seem almost possessed at times, and the reveal at the end just makes the entire movie all the more frightening. Shyamalan does a decent job with the found footage elements, although it is nothing groundbreaking.\r\n\r\nHowever, where this movie really begins to falter is with the screenplay and acting. Now, I do not put as much blame on the actors due to the horrendous dialogue that was written for them. This dialogue is so rigid and inorganic, making every interaction feel as though it was written by an alien trying to mask as a human being. This really messed with the pacing of the film and made certain parts of it very difficult to watch.\r\n\r\nOverall, I give a lot of props for the creativity and the unsettling feeling it created in me, but Shyamalan definitely missed an opportunity to create a very special film. With a more polished screenplay and better acting, this movie could have been truly exceptional. Nonetheless, it is still worth watching for the unique and scary story that it tells.\r\n\r\nScore: 65% 👍\r\nVerdict: Decent", "created_at": "2023-05-16T16:08:03.861Z"}]