[{"movie_id": 565310, "review_id": "5dcbcf66cc277c0017dfe3c9", "rating": 8.0, "review_text": "When a Chinese family finds out that the family’s matriarch is dying of lung cancer, complications arise. In Chinese culture, there is a saying that when you get cancer, you die. This actually boils down to the belief that it’s not the cancer that leads to the person’s death, but rather the fear of dying. As such, the family orchestrates an elaborate ruse to get everyone together for a wedding, but in reality the gathering is for everyone to be able to say goodbye to the grandmother without actually letting her know the truth.\r\n\r\nIt’s a fascinating premise and based on a true story (or based on an actual lie, as the film puts it). Showing aspects of Chinese culture we rarely get to see, the film takes us on a journey to China as we see modern life and urban development. How accurate it really is, I can’t attest to, and there are times that it feels like there should be more or that something is more complex and we’re being given the fortune cookie version, so to speak. The film does steer clear of politics, so that is not a factor here.\r\n\r\nThis is a beautiful film not just through visual aesthetics but also on a character level. We see how each character faces the impending death of the grandmother differently, such as the daughter-in-law being very matter of fact about it while her husband (the grandmother’s son) is being torn up inside, all while the wise and experienced grandmother continues to dispense advice, oblivious to her diagnosis. It details the variety of relationships we can develop in our life as no two relationships are the same, but they all still love each other despite some distance between certain relatives. There’s something that, despite the comedic premise (it’s sort of a comedy that’s not particularly funny), is very grounded and very real. I couldn’t help but see some of my own relationships reflected on the screen.\r\n\r\nBeautiful, heartbreaking, and at the same time somewhat hopeful, “The Farewell” comes highly recommended.", "created_at": "2019-11-13T09:39:50.305Z"}, {"movie_id": 565310, "review_id": "5e3aac9a0c2710001375954d", "rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nLulu Wang shares an emotional part of her personal life by delivering a beautiful, heartfelt story about her grandmother. Even though The Farewell sticks the landing perfectly, not all of the second act’s storylines captivated me, especially the whole wedding narrative. However, Awkwafina offers a fantastic performance, as well as the rest of the cast. Alex Weston’s score elevates a lot of moments, and the drama-comedy balance is on-point.\r\n\r\nRating: B+", "created_at": "2020-02-05T11:52:58.318Z"}, {"movie_id": 565310, "review_id": "609b5de88dbc33002997a56a", "rating": 8.0, "review_text": "This movie is described as a comedy-drama and it is. But I didn’t have many laugh out loud moments. The humor is situational mainly: the writers work up to those moments that make you smile, either because you remember a similar moment in your life, or else because you can’t imagine a similar moment.\r\n\r\nAs happens so often, the story is based on real events. I saw where one review title said it is heartbreaking, but I didn’t see that at all. The movie is fairly uplifting in that it shows the strengths of a family that values all of its members, particularly the very old, whose wisdom and experience aren’t as well received in many American families.\r\n\r\nWhen I think about it, nothing definitive seems to happen in the film: no crisis, no climax of action, but this lack of great drama didn’t detract from enjoying the movie. It is all about the journey, not the destination. Enjoy the trip.", "created_at": "2021-05-12T04:47:36.170Z"}]