[{"movie_id": 12437, "review_id": "561766329251412af8001bc0", "rating": 6.5, "review_text": "I should have crushed you under my heel the day you were born.\r\n\r\nUnderworld: Rise of the Lycans is the prequel to the previous two Underworld films. It tells the story about what led to the werewolf/vampire feud, with bloody energetic results.\r\n\r\nIn core essence this is Braveheart/Spartacus, only in CGI laden horror/action form. Michael Sheen buffs up into Karl Urban, who as Lucian (bad ass Lycan) leads his species to a bloody revolt, and Kate Beckinsale has made way narratively for Rhona Mitra, who sexes things up. The action is pulse raising and the Gothic designs and atmospherics are first rate, while the battle royale finale is fit to crown any genre film of its type. \r\n\r\nProblems are evident, though. The constant flow of CGI blood becomes irritating after a while, and Bill Nighy (in spite of being a franchise regular) is still looking miscast! But it has proved to be a series with hairy legs and fangs that refuses to die, a popcorn munchers dream. So enjoy the spectacle and the screenplay homages, and I'll have a bag of tortilla chips and a choc ice please. 6.5/10", "created_at": "2015-10-09T07:01:06.400Z"}, {"movie_id": 12437, "review_id": "59570ab39251412b31076baf", "rating": 10.0, "review_text": "No idea why the rating for this flick is hovering just above 50\"%.  As far as prequels go this one is brilliant.  The first movie left a lot of gaps in the story, where did Lucian come from, what started the war, how did he get to be the lover of the King's daughter in the first place.  While there is a lot of epic battles with the gore that goes with, this movie is easily the best movie in the franchise, which is minor heresy on my part since Kate Beckinsale is the quintessential vampire in my book.  Rhona Mitra throws down hard as the rebellious daughter of the King, and her haughtiness and disdain are completely believable to the point we think that Lucian's love for her is unrequited.  I can't go into it any more without spoiling the movie but if Evolution let you down a bit, Rise of the Lycans will restore you faith in the franchise.", "created_at": "2017-07-01T02:36:35.063Z"}]