[{"movie_id": 2757, "review_id": "5f1d72c30e597b00343c03fc", "rating": 5.0, "review_text": "I'm reacting the way the world does to movies about making movies about making movies. I mean come on, Charlie Kaufman, some of us have work in the morning, damn.\r\n\r\n_Final rating:★★½ - Not quite for me, but I definitely get the appeal._", "created_at": "2020-07-26T12:10:43.708Z"}, {"movie_id": 2757, "review_id": "625d2fdff10a1a31c1f0df0a", "rating": 7.0, "review_text": "When you watch some of Nicolas Cage's more recent stuff you do wonder how on earth he ever became a star in the first place. Well, this is one of the films that reminds us why. He is a struggling screenwriter (\"Charlie\") charged with adapting a novel about orchids written by \"Susan Orlean\" (Meryl Streep). Mental block would be putting it mildly - he simply has no idea how to make it work for \"Valerie\" (easily one of the less abstruse roles played by Tilda Swinton). Moreover, he is constantly hassled by his twin brother \"Donald\" who is writing his own story - one that his sibling thinks is riddled with flaws and inconsistencies. The book he must adapt centres around the activities of \"Laroche\" (Chris Cooper) who had a habit of going with his Seminole pals to remove rare plants from a nature reserve. Illegal? Well not if you know your way around the Floridian penal code, and the ensuing court case is what entices \"New Yorker\" reporter \"Orlean\" to write his story. Initially sceptical of her rather uncouth subject matter - not helped by his missing front teeth, she discovers there is much more to the man and his provision of a green powder soon helps her to relax! What now ensues nicely marries the threads of the storylines as both Cage characters, an excellently enigmatic Cooper, and the unfulfilled Miss Streep find themselves gradually drawn together for an admittedly pretty far-fetched denouement (pronounce denooeymont). Cage plays the two characters with considerable skill; he juggles his characters' frustrations with his writing, his love life, his brother and his own reluctance to meet the author engagingly and at times he can make you squirm in your seat a bit. There is plenty of humour, and the all but two hours just flies by. If nothing else, it does make you appreciate just how difficult is is to turn a novel into a film - and might explain why so few people are actually any good at it!", "created_at": "2022-04-18T09:31:11.249Z"}]