[{"movie_id": 2655, "review_id": "55a05863925141296e00029c", "rating": 7.0, "review_text": "You're not yourself today are you?\r\n\r\nClaire and Norman Spencer's marriage starts to fall apart when she believes there is a ghost in the house. Things gather apace when Claire is convinced that the spirit is trying to tell her something. Something that could be too close to home for comfort.\r\n\r\nRobert Zemeckis does Hitchcock? Well yes, the influence is obvious, unashamedly so. But the trouble with that, is having the maestro as a benchmark renders all other modern day attempts as folly. However, casting aside that gargantuan issue, What Lies Beneath is an effective creeper come thriller that boasts star credentials.\r\n\r\nDirected by Zemeckis, formed from an idea by Steven Spielberg (from the story by Sarah Kernochan) and starring Harrison Ford and Michelle Pfeiffer as the fragmenting Spencer's. That's a pretty tidy bunch from which to launch your movie. What follows is a mixture of genuine unease and mystery, red herrings and standard boo jump moments, all of which almost gets lost on a saggy middle section as Zemeckis plays Hitchcock one too many times and loses sight of the supernatural heart of the piece, not helped by Clark Gregg's meandering script I might add. None the less, the picture gets pulled around for the finale as the spooky combines with thriller to produce some quality edge of the seat stuff. But it's only then that you totally realise that the makers here have tried to cram too much in to one film. In eagerness to manipulate the audience for the fine ending (though you probably will have it worked out at the half way point) the film just ends up as being confused as to what it mostly wanted to be.\r\n\r\nPfeiffer is excellent and looks stunning and Ford gives it gusto when the script allows. Support comes from Diana Scarwid, Joe Morton, Miranda Otto and James Remar. The house is suitably eerie with its waterside setting and Alan Silvestri's score is perfectly in tune with the creepy elements of the piece. It's a fine enough film in its own right, regardless of the Hitchcockian homages. It's just that it should have been a far better horror picture than it turned out to be. 7/10", "created_at": "2015-07-10T23:42:27.317Z"}, {"movie_id": 2655, "review_id": "5e025e0e75110d0018dae407", "rating": 6.0, "review_text": "***Ghostly happenings in northern Vermont with Ford & Pfeiffer***\r\n\r\nA couple living on Lake Champlain (Harrison Ford & Michelle Pfeiffer) face the empty nest syndrome as the wife experiences increasingly spectral happenings. Diana Scarwid, James Remar and Miranda Otto have peripheral roles. \r\n\r\n\"What Lies Beneath\" (2000) is a Hitchcockian drama/mystery with a bit o’ horror. It starts by borrowing from \"Rear Window\" (1954), but thankfully veers from there. At a little past the hour mark I was starting to get restless. The story was progressing too slowly with too many doors inexplicably opening. I suppose it didn’t help that Pfeiffer doesn’t trip my trigger, although she’s serviceable (I wouldn’t say I DON’T like her); and Harrison’s character seems unjustifiably gruff and impatient. \r\n\r\nHowever, the Upstate Vermont/ New York locations are fabulous and a mysterious mood is effectively established. The way things pan out is unexpected, unless you saw the trailer first, which outrageously spoils it. The concluding F/X sequence is beautiful in a ghostly way and satisfyingly brings closure. What didn’t make sense earlier is elucidated. At the end of the day, the movie’s underwhelming, but not altogether unworthy if you’re in the mode for a flick of this sort.    \r\n  \r\nThe film runs 2 hours, 10 minutes, and was shot in the Lake Champlain region of Vermont/New York (Burlington, D.A.R. State Park, Waterbury & Westport) with other stuff done in Southern Cal (Los Angeles, Playa Vista & Culver City).\r\n\r\nGRADE: C+/B-", "created_at": "2019-12-24T18:50:54.605Z"}, {"movie_id": 2655, "review_id": "60a3e35851e6ab00407872fb", "rating": 6.0, "review_text": "Not a great film, but two things that made it bearable:\r\n\r\n1) Directed by Robert Zemeckis\r\n\r\n2) I watched it in a hotel room", "created_at": "2021-05-18T15:55:04.778Z"}, {"movie_id": 2655, "review_id": "624b1f08d9f4a600985d7491", "rating": 6.0, "review_text": "\"Claire\" (Michelle Pfeiffer) and \"Norman\" (Harrison Ford) are an happily married couple with a lovely lakeside home. It turns out that she has only recently survived a nasty car crash, and so when she starts complaining about some inexplicable things happening in their home, \"Norman\" suggests that she see a therapist to try to alleviate here ever increasing paranoia. Her friend \"Jody\" (Diana Scarwid) uses a ouija board and soon \"Claire\" is convinced that the empty house next door is being haunted - but why? Who is the paranormal woman she hears and sees, and what has is to do with her and her family? Robert Zemekis starts this off quite tensely, the imagery is scary and effective. The lack of gory or silly special effects gives it a chill that for the first hour, or so, works fairly well. Sadly, though, it runs out of steam and the storyline just loses it's way. The last half hour has more endings than you can shake a stick at, and when it does finally conclude I felt the whole thing was pretty far-fetched and unsatisfactory. Ford just isn't really at the races here - he was/is much better with roles that allow him to demonstrate his considerable charisma and personality. With no such opportunity here, his character is just flat - at times too earnest, at others just implausible. The title suggests much more that this mid-range horror thriller delivers.", "created_at": "2022-04-04T16:38:32.875Z"}]