[{"movie_id": 524348, "review_id": "5dca165f6c0e4f00153d653c", "rating": 7.0, "review_text": "‘The Report’ essentially boils down to the truth and morality versus the administrative state, and a country not living up to its ideals. With America more polarised than ever, this film couldn’t be more timely.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-report-truth-and-idealism-versus-the-administrative-state", "created_at": "2019-11-12T02:18:07.907Z"}, {"movie_id": 524348, "review_id": "5de9d5383faba00015183b17", "rating": 8.0, "review_text": "**_Probably too rooted in the theatrical tradition for some, but it does an exceptional job of compacting a massive amount of info into a comprehensible form_**\r\n\r\n>_Strongly urge that any speculative language as to the legality of given activities or, more precisely, judgment calls as to their legality vis-à-vis operational guidelines for this activity agreed upon and vetted at the most senior levels of the Agency, be refrained from in written traffic (email or cable traffic). Such language is not helpful._\r\n\r\n- Jose Rodriguez, Director of the Counterterrorism Center, responding to CIA headquarters being informed by CIA personnel stationed at \"Detention Site Green\" in Thailand that the application of \"Enhanced Interrogation Techniques\" was \"_approaching the legal limit_\" (email sent, April 12, 2002)\r\n\r\n>_1. The CIA's use of its Enhanced Interrogation Techniques was not an effective means of acquiring intelligence or gaining cooperation from detainees._\r\n\r\n>_2. The CIA's justification for the use of its Enhanced Interrogation Techniques rested on inaccurate claims of their effectiveness._\r\n\r\n>_3. The interrogations of CIA detainees were brutal and far worse than the CIA represented to policymakers and others._\r\n\r\n>_4. The conditions of confinement for CIA detainees were harsher than the CIA had represented to policymakers and others._\r\n\r\n>_5. The CIA repeatedly provided inaccurate information to the Department of Justice, impeding a proper legal analysis of the CIA's Detention and Interrogation Program._\r\n\r\n>_6. The CIA has actively avoided or impeded congressional oversight of the program._\r\n\r\n>_7. The CIA impeded effective White House oversight and decision-making._\r\n\r\n>_8. The CIA's operation and management of the program complicated, and in some cases impeded, the national security missions of other Executive Branch agencies._\r\n\r\n>_9. The CIA impeded oversight by the CIA's Office of Inspector General._\r\n\r\n>[...]\r\n\r\n>_16. The CIA failed to adequately evaluate the effectiveness of its Enhanced Interrogation Techniques._\r\n\r\n>_17. The CIA rarely reprimanded or held personnel accountable for serious or significant violations, inappropriate activities, and systematic and individual management failures._\r\n\r\n>_18. The CIA marginalised and ignored numerous internal critiques, criticisms, and objections, concerning the operation and management of the CIA's Detention and Interrogation Program._\r\n\r\n>_19. The CIA's Detention and Interrogation Program was inherently unsustainable and had effectively ended by 2006 due to unauthorised press disclosures, reduced cooperation from other nations, and legal and oversight concerns._\r\n\r\n>_20. The CIA's Detention and Interrogation Program damaged the United States' standing in the world, and resulted in other significant monetary and non-monetary costs._\r\n\r\n- _Report of the Senate Select Committee on Intelligence: Committee Study of the Central Intelligence Agency's Detention and Interrogation Program_ (December 9, 2014)\r\n\r\n>_This study is bigger than the actions of the CIA. It's really about American values and morals. It's about the Constitution, the Bill of Rights, our rule of law. These values exist regardless of the circumstances in which we find ourselves. They exist in peacetime and in wartime. And if we cast aside these values when convenient, we have failed to live by the very precepts that make our nation a great one. There is a reason why we carry the banner of a great and just nation. So we submit this Study on behalf of the committee, to the public, in the belief that it will stand the test of time. And with it, the Report will carry the message \"never again.\"_\r\n\r\n- Senator Dianne Feinstein (D-CA), Chair of the Senate Select Committee on Intelligence, addressing the Senate (December 9, 2014)\r\n\r\n>_The CIA called the Detention Program a \"crucial pillar of US counterterrorism efforts, aiding intelligence and law enforcement operations to capture additional terrorists, helping to thwart terrorist plots, and advancing our analysis of the al Qa'ida target.\" We agree. We have no doubt that the CIA's Detention Program saved lives and played a vital role in weakening al-Qa'ida while the Program was in operation. When asked about the value of detainee information and whether he missed the intelligence from it, one senior CIA operator told members, \"I miss it every day.\" We understand why._\r\n\r\n- _Report of the Senate Select Committee on Intelligence: Committee Study of the Central Intelligence Agency's Detention and Interrogation Program – Minority Views of Vice Chairman Chambliss, joined by Senators Burr, Risch, Coats, Rubio, and Coburn_ (December 9, 2014)\r\n\r\nAnyone who has read even a little history knows that as a method of extracting useful intel, torture doesn't work. It didn't work for the Spanish Inquisition, it didn't work in Salem, it didn't work in Vietnam, it didn't work during the 800 years of English occupation or the War of Independence here in Ireland. It has never worked and it never will, a fact known since at least the 17th century (although the Ancient Romans also had their suspicions).\r\n\r\nWritten and directed by Scott Z. Burns, _The Report_ tells the story of the Senate Select Committee on Intelligence's $40m, five-year investigation into the CIA's illegal use of torture in the years after 9/11, and the subsequent attempts to cover it up. From 2002-2008, the Detention and Interrogation Program (to give it its official title), saw the CIA employing \"Enhanced Interrogation Techniques\" (EIT), at a cost of $80m to the American taxpayer, with detainees held in secret locations around the world (known as \"black sites\"). Completed in 2012, the Committee's findings were detailed in the 6,700-page _Report of the Senate Select Committee on Intelligence: Committee Study of the Central Intelligence Agency's Detention and Interrogation Program_, which remains classified, although a heavily redacted 525-page Executive Summary was published in 2014. What the film does exceptionally well is to condense this vast quantity of information down into a relatively easy-to-digest narrative (to give you an idea of the scale we're talking about here, the complete _Report_ has over 35,000 footnotes, and is based on over 6.5 million pages of classified material). More of a procedural drama than a political thriller, _The Report_ could do with a little emotion, and there's no denying that it's very, very talky, perhaps to the extent of being more suited to the stage than the screen. However, irrespective of this, it's a brilliantly acted, unflinching, and insightful look at one of the most shameful moments in US history.\r\n\r\nThe film opens in 2012 as Daniel J. Jones (Adam Driver), a Senate investigator and the primary author of the recently completed _Report_, is meeting with his (fictional) lawyer Cyrus Clifford (Corey Stoll). When Clifford asks him, \"_so, you did steal the document?_\", Jones is quick to reply, \"_I did not steal it. I relocated it._\" The film then cuts to 2007, when Senator Dianne Feinstein (Annette Benning), Chair of the Senate Committee on Rules and Administration, appoints Jones to the investigation into the CIA's 2005 destruction of videotapes showing the interrogation of al-Qaeda suspects Abu Zubaydah (Zuhdi Boueri) and Abd al-Rahim al-Nashiri at a CIA black site in Thailand (known as \"Detention Site Green\") in 2002. After the investigation concludes in 2008, finding that the CIA had destroyed 92 videotapes, Feinstein launches a larger investigation into the Agency's general conduct when interrogating suspected terrorists. Jones is appointed head of a bipartisan six-person team (three Democrats, three Republicans), operating out of a tiny windowless office in an offsite CIA building, to which even the Director of the Agency has no access. The rest of the film takes us (often achronologically) from the commencement of the investigation in early 2009 to Jones's meeting with Clifford in 2012, and on up to the fight to have the _Report_ made public in 2013/2014, with both the CIA and the Obama Administration throwing up multiple obstacles.\r\n\r\nAlong the way we're introduced to a plethora of characters, embodied by an exceptional cast with not a weak link amongst them – there's John Brennan (the always superb Ted Levine), Acting Director of the National Counterterrorism Center (2004-2005), Deputy Assistant to the President for Homeland Security and Counterterrorism (2005-2013), Director of the CIA (2013-2017); Bernadette (an excellent Maura Tierney playing against type) a thinly-veiled fictionalisation of Gina Haspel, Base Chief at Detention Site Green (2002-2004), Deputy Director of the CIA (2017-2018), Director of the CIA (2018-); Denis McDonough (Jon Hamm), Senior Foreign Policy Adviser to Senator Tom Daschle (D-SD) (1999-2004), Legislative Director for Senator Ken Salazar (D-CO) (2004-2007), Acting Senior Foreign Policy Advisor to Senator Barack Obama (D-IL) (2007-2008), Deputy National Security Advisor (2010-2013), White House Chief of Staff (2013-2017); Marcy Morris (Linda Powell), Feinstein's PA; Caroline D. Krauss (Jennifer Morrison), General Counsel of the CIA (2013-2017); Thomas Eastman (Michael C. Hall), CIA counsel (2013-2017); Alice (Sarah Goldberg), one of Jones's investigative team; Raymond Nathan (Tim Blake Nelson), a fictional composite representing the members of the CIA's Office of Medical Services stationed at Detention Site Green, who raised early concerns about EIT; James Mitchell (Douglas Hodge) and Bruce Jessen (T. Ryder Smith), the psychologists who developed and implemented the program; Senator Mark Udall (D-CO) (Scott Shepherd), a member of the Intelligence Committee; Ali Soufan (Fajer Al-Kaisi), an FBI agent assigned to the Bureau's Osama bin Laden unit, \"I-49\", and who was initially interrogating Zubaydah, until the CIA took over; an unnamed _New York Times_ reporter (Matthew Rhys), to whom Jones considers leaking classified material; George Tenet (Dominic Fumusa), Director of the CIA (1996-2004); Senator Saxby Chambliss (R-GA) (Guy Boyd), the ranking Republican on the Intelligence Committee; Cofer Black (Ian Blackman), Director of the Counterterrorism Center (1999-2002), Coordinator for Counterterrorism (2002-2004); Jose Rodriguez (Carlos Gómez), Director of the Counterterrorism Center (2002-2004), Director of the National Clandestine Service (2004-2007); John A. Rizzo (Joseph Siravo), Deputy Counsel for the CIA (2001-2010); and Khalid Sheikh Mohammed (Ratnesh Dubey), a high-ranking member of al-Qaeda and the main architect of 9/11.\r\n\r\nYou may notice that there are several crossover characters with _The Looming Tower_ and _Vice_ (both 2018). Although _The Report_ doesn't repeat anything specifically depicted elsewhere, it does cover some of the same general narrative ground – so, for example, Dick Cheney and George W. Bush are central characters in _Vice_, and although neither make an appearance in _The Report_, they hover constantly on the margins, like puppet masters hidden from sight but everywhere apparent. Similarly, Ali Soufan, who appears in two scenes here, is a central character in _The Looming Tower_, which focuses on the pre-9/11 conflict between the CIA and the FBI. It's also worth mentioning that, as with both _The Looming Tower_ and _Vice_, _The Report_ is very much a left-centric narrative, especially in terms of its depiction of EIT and how the CIA lied and falsified data, misrepresenting the effectiveness of the program. \r\n\r\nTaking this into consideration, the film is unquestionably angry. We're all familiar, of course, with Dilawar, the innocent Afghan taxi-driver who was tortured to death by the US Army at Bagram Collection Point in 2002. But whereas that incident resulted in criminal trials (albeit without much in the way of convictions), the torture meted out by the CIA had no such consequences. Indeed, many of the most significant players received promotions (one even became the Agency's director), something about which the film displays significant indignation. It's also made very clear that had Soufan been allowed to continue building a rapport with Zubaydah (the first detainee subjected to EIT), it would have resulted in far more useful intelligence than the CIA was able to get from him (which was precisely nothing). However, that kind of interrogation takes time and requires patience, and the CIA is shown as having neither.\r\n\r\nThe depiction of Mitchell and Jessen is particularly condemning (we know from the get-go that Mitchell is a dick because he refers to himself in the third-person). If the film has any villains, it's these two; snake-oil salesmen with psychology degrees but no experience of actual interrogations and no data whatsoever to back up their claims that torture works (because no such data exists). Indeed, this element of the film was deeply personal to Burns, both of whose parents are psychologists. As he explains to PBS, he found it abhorrent that \"_people had figured out a way to weaponise psychology_\", which he believes is a tool that \"_exists to help people_\". Employing techniques such as the abdominal slap, the attention grasp, cramped confinement, dietary manipulation, the facial hold, the facial slap/insult slap, forced nudity, forced shaving, rectal hydration, sleep deprivation, stress positions, wall standing, walling, waterboarding, and water dousing, Mitchell and Jessen are shown as enjoying the experience of hurting these people – their justification for doing so (that such interrogation will save lives) exposed as utterly fabricated. At one point, Jones reports to Feinstein that Khalid Sheikh Mohammed had been waterboarded 183 times without any results, prompting her to ask, \"_if it works, why did they need to do it 183 times?_\" Why indeed.\r\n\r\nThe film makes no bones about just how ineffective EIT actually was, and how full of crap Mitchell and Jessen were, despite Republicans such as Saxby Chambliss (R-GA), Richard Burn (R-NC), Jim Risch (R-ID), Dan Coats (R-IN), Marco Rubio (R-FL), and Tom Coburn (R-OK) maintaining that it saved lives and rejecting the findings in the Report. In this sense, the audience is made privy to all the useful and accurate information gleaned from EIT – nothing, zero, nada, no thing, not even one thing. As per the _Panetta Review_ (2009), the CIA's _own_ classified internal inquiry, the findings of which were controversially made public by Udall during an Intelligence Committee hearing in 2013 (a terrific scene in the film), not a single piece of solid intel was ever extracted from any detainee in the program. Indeed, the contrary was true – EIT led to detainees shutting down or providing false information, or information they knew the CIA already possessed. As Jones states, \"_all they did was make it impossible to prosecute mass murderers._\"\r\n\r\nAlso emphasised is the CIA's attempts to make EIT legal, with the so-called Torture Memos cropping up a few times. A set of legal documents drawn up by Deputy Assistant Attorney General John Yoo and signed off by Assistant Attorney General Jay Bybee in 2002, the Memos essentially tried to provide legal justification for EIT, but were so flawed that the head of the Office of Legal Counsel, Jack Goldsmith, had withdrawn them by 2004. Perhaps the most significant rationale in the Memos is that the program can only be legal if it resulted in \"_unique, otherwise unavailable_\" intelligence. Or, as Bernadette says in the film, \"_it's only legal if it works_\", thus creating an illogical self-sustaining circular justification that has no basis in law. With this in mind, the film depicts the CIA as hedging their bets – people won't care how the information was obtained if such information leads to the capture or death of bin Laden (which it didn't – the CIA was first made aware of bin Laden's courier, Abu Ahmed al-Kuwaiti, by a detainee interrogated by another government via standard techniques).\r\n\r\nThematically, although the film examines multiple politically charged themes, for the most part, its thematic concerns are understated. For example, the Republicans who oppose the Report are shown as adopting a stance of \"_admit nothing, deny everything, make counter accusations_\" (a phrase coined by bastion of morality and honour, Roger Stone). The filmmakers, of course, had no idea that their movie would be in cinemas concurrently with a House Intelligence Committee impeachment inquiry into the actions of the current president, Donald Trump. However, it's impossible to ignore the similarities between the Republican position in 2012 and the tactics used today by Trump and his enablers/apologists – Republicans refused to admit anything regarding torture/Trump seems pathologically incapable of admitting wrongdoing; Republicans swore up and down that the CIA's activities were justifiable/Trump urges us all to \"_read the transcript_\"; of his \"_perfect call_\"; Republicans accused Democrats of undermining national security/Trump has accused pretty much every Democrat in the country of something or other. This parallel is never explicitly addressed, but it's right there for those willing to see it. It's also important insofar as one of the film's most salient themes is that the CIA's flagrant disregard for the rule of law, the Constitution, and basic human rights must never be allowed to happen again. This is not to suggest that Trump has sanctioned torture (although at this point, would it surprise anyone if he had), rather to illustrate how quickly we forget the lessons of yesterday.\r\n\r\nAlthough it's mentioned on several occasions that Jones's team and the _Report_ itself must avoid partisan politics, like so many aspects of life in the US, the investigation and debate regarding publication split along partisan lines; Democrats accepted the findings in the _Report_ and wanted it made public, Republicans dismissed the _Report_ and argued against publication (although one has to wonder that if everything in the Report was untrue, why would they be against publication). Of course, this isn't true across the board – the Intelligence Committee voted to publish the Executive Summary by a vote of 9-6; the eight Democrats and Olympia Snowe (R-ME) against the six Republicans. John McCain (R-AZ) was a member of the Committee _ex officio_, and so didn't have a vote, but he made it known he agreed with the Democrats and Snowe. On the other hand, neither Obama nor Secretary of State John Kerry were overjoyed about releasing even a redacted version, and McDonagh wanted far more redactions than were ultimately used. Also in service of a balanced depiction, the film makes sure to reference Feinstein's disdain for Edward Snowden and whistle-blowers in general – as righteous as her involvement with the _Report_ may be, she remains a part of the establishment that necessitated the _Report_ in the first place. It's to the film's credit that it doesn't shy away from such opinions, thus avoiding a glib and overly neat dichotomy of Democrats=good/Republicans=bad.\r\n\r\nDespite its importance, however, I can't see _The Report_ packing them in at the multiplex. For one, it's exceptionally talky. In fact, it's pretty much wall-to-wall talking, except for the scenes depicting EIT itself. I would argue that this simply positions the film in the theatrical tradition, but I can certainly understand people regarding it as one step removed from an audio recording of the actual _Report_. There's also a distinct lack of emotion – every time Jones begins to emote, somebody shuts him down, reminding him that he must be objective. Along the same lines, there's no character development – we learn nothing about who Jones is when he's not working on the _Report_. Similarly, everyone else is depicted only in terms of their involvement or connection with EIT and the _Report_; we never see where they live, we never see family members, we're not made privy to who they are as people. This is by design of course, with Burns wanting to focus on the facts and nothing more, but again, I can understand people finding it unsatisfactory. All of this results in an exceptionally dry and sterile film that leans entirely on its procedural elements, with Burns gambling that this structuring will stimulate the requisite indignation, thus his shunning of pathos and relatability.\r\n\r\n_The Report_ is a straightforward and restrained film, with not a hint of any aesthetic gymnastics. Burns matches the form to the content, and his focus on the facts is razor-sharp and unwavering. Depicting how EIT shamed the nation, turned each individual who was tortured into a powerful jihadist recruitment tool, and betrayed the very values that were supposedly being fought for in the first place, the film excoriates both the Bush administration for letting it happen and the Obama administration for its reluctance to make the _Report_ public. It's not exactly exciting in a traditional sense, but it sure is compelling; a story that's infuriating insofar as it actually happened, horrifying insofar as, given the clown currently in the Oval Office, it could easily happen again.", "created_at": "2019-12-06T04:12:40.545Z"}, {"movie_id": 524348, "review_id": "5e0a04051684f700189d0cc5", "rating": 7.0, "review_text": "I love watching true stories when they’re able to tell what actually happened in a compelling way. Scott Z. Burns offers the uncomfortable truth about CIA’s denial of using inefficient torture methods, and has Adam Driver proving once again why he’s such an acclaimed actor. Restricted by the genre’s cliches and formulaic issues, The Report is still an important film that mainly Americans should sit down and watch.\r\n\r\nRating: B", "created_at": "2019-12-30T14:04:53.542Z"}]