[{"movie_id": 466622, "review_id": "5ea661886d1bb2001da552b9", "rating": 4.0, "review_text": "Instead, 'The Rhythm Section' is a middling but serviceable time-waster that would be instantly forgettable... if it didn't currently hold the box-office title for worst opening weekend of all-time, that is.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-rhythm-section-watchable-but-completely-unmemorable-espionage-thrills", "created_at": "2020-04-27T04:37:28.718Z"}, {"movie_id": 466622, "review_id": "5eb444f4f3e0df001e2b97de", "rating": 4.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nProduced by the same company that works on the James Bond films, The Rhythm Section went through tough production issues. Blake Lively injured herself on set, consequently delaying the movie until the end of 2019, and then again to the well-known \"trash month\", so obviously, my expectations were quite low. It's the first time I watch a feature film directed by Reed Morano, as well as Mark Burnell, who makes his debut as a screenwriter. As usual, the only thing I knew about the movie was its synopsis and crew, but I also caught the overwhelmingly negative feedback from critics and audiences alike...\r\n\r\nWhile its flaws are undeniable (and I'll get there), I don't find Reed Morano's film to be worthy of belonging in January with so many worse movies. Sean Bobbitt's cinematography is a technical standout, by delivering two fantastic one-take action sequences (one of which is edited to feel like one take), and some wide shots look genuinely stunning. I always love when a film is set in actual cities or remote locations since these offer a realistic atmosphere, and given the right treatment in post-production, the tone can be better controlled by the environment surrounding the characters.\r\n\r\nThe cast is also really good. Blake Lively delivers one of the best performances of her career, definitely the most somber one. Her character is constantly placed in challenging situations, physically and emotionally. Blake incorporates Stephanie's state of mind seamlessly, carrying the narrative forward even when the latter fails to captivate the viewer. Jude Law is Jude Law, and Sterling K. Brown offers a notable display as well. However, the positives end here.\r\n\r\nStory-wise, The Rhythm Section lacks creativity and uniqueness. Besides being way too straightforward and predictable for an action-drama with a central mystery, it's edited (Joan Sobel) in such an uncommon manner that makes the movie feel incredibly tiresome. Tons of moments are drawn out for extra seconds or even minutes. Almost every scene weirdly goes on for far too long. There's no new information to transmit to the viewer, nothing is happening... The whole film is edited like this, consequently ending with almost fifteen/twenty minutes of nothing. Also, some dialogue scenes are intercut with something that's going to happen after that particular conversation, which is confusing in the sense that the viewer doesn't know where the focus is supposed to be on.\r\n\r\nThen, the actual narrative raises tons of logical questions. I hate to be \"that guy\" who nitpicks character decisions or plot points like CinemaSins (even though this channel makes so for comedy purposes), but this movie really makes the viewer wonder \"how/why the hell is she able to do this?!\" Stephanie is trained to be an agent, and while a specific part of her training is straight-up impossible, I believe that the character possesses the required skills. My issue is that she barely uses anything that she learned: she continuously runs away from everyone and everything and she gets other innocent people dead in her partially failed missions.\r\n\r\nIn addition to her, there are other characters with either unclear motivations or questionable lifestyles, having in mind that this film deals with secret intelligence, terrorism, and stuff that very few people have access to or knowledge of. The score also feels extremely awkward. Similar to the editing issue, the song selection doesn't fit the dark, depressing tone that the movie carries. Sometimes, Stephanie is about to go on a serious mission, and upbeat pop music is playing... Why?\r\n\r\nAll in all, The Rhythm Section isn't as awful as most January films, it certainly doesn't deserve the record of the worst opening weekend of all-time, but it still carries tons of issues. The editing (Joan Sobel) is weirdly unconventional, drawing out scenes for extra seconds or even minutes where absolutely nothing happens and intercutting dialogue sequences with unnecessary flashbacks or flashforwards. Reed Morano isn't able to bring creativity or anything remotely original to her movie, and Mark Burnell writes a predictable screenplay packed with questionable plot points and logical issues, not helping the already dull pacing. Steve Mazzaro's score doesn't fit the tone of the film, but Sean Bobbitt's cinematography delivers a couple of surprising action sequences and some neat wide shots. The cast is really good, and if not for an outstanding Blake Lively, this movie would have been a lot worse.\r\n\r\nRating: C-", "created_at": "2020-05-07T17:27:16.503Z"}, {"movie_id": 466622, "review_id": "5eb84b48b7d3520022e6e087", "rating": 6.0, "review_text": "Decent enough thriller that's not terribly memorable but I did like Blake Lively in the lead and some of the action/stunts were alright, including the car chase sequence done in a one-shot like take. More or less another time-waster but maybe in a couple of years, willing to revisit. **3.0/5**", "created_at": "2020-05-10T18:43:20.009Z"}]