[{"movie_id": 570670, "review_id": "5e54c720a76ac50016a85750", "rating": 6.0, "review_text": "While 'The Invisible Man' isn't perfect, it is (like 'Upgrade') a thoughtful take on the genre, cleverly using on- and off-screen space and delivering each big scare like an effectively-timed punchline.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-invisible-man-paranoia-gaslighting-and-spookiness", "created_at": "2020-02-25T07:05:04.724Z"}, {"movie_id": 570670, "review_id": "5e5e6a7787e63e001a75dc1b", "rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nAs you should know by now, I avoid trailers at all costs, especially for highly anticipated movies. I'm careful enough already, but once I heard the massive complaints about the trailer for The Invisible Man, I made sure to not even listen to it, let alone see something from it. My expectations got higher as the release date approached, and the overwhelmingly positive reactions reached my attention, so obviously, I couldn't help but get excited. I love The Handmaid's Tale, and I always thought it was a matter of time until Elisabeth Moss brought her phenomenal acting skills to the big screen. She just needed a big film to do it...\r\n\r\nAnd this is the one. Elisabeth's performance is yet another horror display for The Academy to ignore when the year comes to a close. In comparison to Hereditary's Toni Colette or Us' Lupita Nyong' o, I admit that I would give an Oscar to one of these two over Moss. However, this is one of the main issues I have when people compare things from different years: it's extremely unfair and a bit irrational. Something \"great\" in a specific year can be just \"okay\" in the next one. It depends on each year's quality regarding movies and their cast's performances.\r\n\r\nIf Moss truly ends up delivering the best interpretation of the year, she should receive recognition independently of other year's injustices. With that said, based on my experience, I firmly believe Elisabeth Moss should be one of the contenders for the respective category during the awards season. I'm not saying she should be nominated or not, I'm saying that she should be one to think of when it's time to fill the ballot with the nominees. She is relentlessly exceptional during the whole runtime. There isn't a single moment where she drops her level. Impressive!\r\n\r\nRegarding the story, it's probably the best adaptation of The Invisible Man to the actual world that they could have done. Of all the meaningful and sensitive real-world themes, Leigh Whannell chose the very best to insert in his film. Domestic violence and abuse is a tremendously serious topic, and Whannell addresses it perfectly. It's a remarkably clever screenplay, with tons of tiny little details that relate in some shape or form to the real-life situations a lot of people (women AND men, let's not pretend this is an exclusively female problem) go through.\r\n\r\nIt's one of the best horror movies I've seen lately when it comes to creating a suspenseful, scary environment, mostly based on something that feels incredibly realistic. Taking the sci-fi aspect of, well, dealing with an invisible person, the menacing silence and haunting score work as well as they do because I'm able to feel the protagonist's fear. Stefan Duscio's cinematography is one of the main reasons why this film is filled with so much efficient suspense. The camera constantly pauses on one side of the room the character's in, lingering on for some seconds, creating a certain doubt if something's moving or if someone's there.\r\n\r\nThis point-of-view (POV) shot works exceptionally well for the whole movie. Being able to see what the main character is seeing, it's also possible to think what she's thinking and feel what she's feeling. That awkward, frustrating, unnerving, uneasy feeling that something's not right. Then, Whannell proves he knows his film's own weaknesses. When it starts to lose a bit of its entertainment value, and when the audience begins to get used to the long, suspenseful sequences (of which probably half, nothing happens), he hits the narrative with an unexpected, shocking turn of events in the most jaw-dropping way possible.\r\n\r\nThis particular decision got the blood heavily pumping again, and it delivered the energy I needed to be at the edge of my seat until the very end. However, the ending is a tad underwhelming, and maybe a bit over-the-top concerning some character's decisions. I can't really get into spoiler territory, so I'll just write I don't really think that the last scene is very coherent with everything the movie showed until that point. Even though I understand and respect this narrative decision, I don't believe its message is the one the film wanted to transmit. Good performances from the rest of the cast, a few character's decisions are a bit hard to believe, but I don't want to be nitpicky.\r\n\r\nIn the end, The Invisible Man deserves all the hype it's been getting. Leigh Whannell crafted a genuinely scary and extremely suspenseful horror movie, based on a traumatic real-life situation that a lot of people, unfortunately, go through. Elisabeth Moss delivers an emotionally powerful performance, demonstrating all of her impressive acting abilities which are probably going to be ignored when the awards season comes around (the usual horror genre bias). Incredibly well-written, intelligent screenplay, supported by some terrific camera work by Stefan Duscio. The haunting score from Benjamin Wallfisch is also a standout, especially when it chooses to be completely silent. I'm not a fan of the slightly incoherent ending since some character/narrative decisions seem hard to believe, and the final message didn't really have the meaning it should. Nevertheless, it's one of the best films of the year so far, so don't miss it!\r\n\r\nRating: A-", "created_at": "2020-03-03T14:32:23.263Z"}, {"movie_id": 570670, "review_id": "5e6c52b6a9b9a400149f732d", "rating": 4.0, "review_text": "**_Starts brilliantly but ultimately undermines itself with plot contrivances and genre foolishness_**\r\n\r\n>_I went over the heads of the things a man reckons desirable. No doubt invisibility made it possible to get them, but it made it impossible to enjoy them when they are got._\r\n\r\n- H.G. Wells; _The Invisible Man_ (1897)\r\n\r\nH.G. Wells's original _The Invisible Man_ (1897) suggests that rather than something as powerful as invisibility being used for the betterment of mankind, it would instead be used to fulfil private desires, ultimately leading to the moral corruption of otherwise good men. In probably the best cinematic adaptation, Paul Verhoeven's _Hollow Man_ (2000), this is taken much further, with the suggestion that the results of invisibility would be nothing less than sexual violence, evil, and madness. However, despite the centrality of this theme in the core story, reframing the template as a modern tale of domestic abuse and PTSD, as happens in this latest adaptation, is a fascinating idea. Reorienting the narrative so it no longer focuses on the male scientist but on a female victim of his machinations creates the potential for some timely #MeToo social commentary, particularly as it relates to issues of not believing women who accuse powerful men of gaslighting. But potential only gets you so far, and what could have been a really insightful film eventually proves itself relatively incapable of using issues of domestic abuse as anything other than plot points to get from one predictable scare to the next. It tries to have its cake and eat it – it wants to be an allegory for the problems women face leaving abusive relationships but it also wants to be an effective monster movie. And, ultimately, it ends up as neither.\r\n\r\nThe film begins as Cecilia Kass (Elisabeth Moss) is putting into motion a plan to leave her domineering and abusive boyfriend, Adrian Griffin (Oliver Jackson-Cohen), a wealthy pioneer in optics. Having drugged him, she leaves their high-tech home in the middle of the night and is picked up nearby by her sister Emily (Harriet Dyer), who takes her to stay with their childhood friend, James Lanier (Aldis Hodge), a policeman living with his daughter Sydney (Storm Reid). Although assured that Adrian can't find her, Cecilia is clearly suffering from agoraphobia and paranoia. That is until Adrian commits suicide. Contacted by his brother Tom (Michael Dorman), who's handling his estate, Cecilia learns that Adrian has left her $5 million. However, despite her best efforts to move on, she just can't shake the feeling that Adrian is still around, watching her, sometimes even in the same room as her. And the surer she becomes that he's not dead, the more everyone else becomes worried about her mental well-being.\r\n\r\nWritten and directed by Leigh Whannell (co-creator of the _Saw_ franchise and creator of the _Insidious_ franchise), this latest adaptation of Wells's original is not actually about the invisible man. Indeed, short of a background shot of him lying in bed, a shot showing only his torso as he runs through a forest, and a close-up of his hand, actor Oliver Jackson-Cohen doesn't even appear on screen prior to his apparent suicide. Adrian is not only the invisible man of the plot, so too is his character ideologically invisible. Which makes its own statement, and it's a statement worth making – men like him don't need to be present to continue to cause harm; years of abuse will carry on their work even if they're no longer around. In this sense, at least initially, the film is more concerned with the fear Adrian has instilled in Cecilia; in the early stages, Cecilia's main enemy isn't Adrian so much her inability to move on from him. Along the same lines, the film looks at issues of how women who accuse powerful men of gaslighting are often ignored or openly disbelieved. It is, of course, allegorical insofar as Cecilia isn't claiming that Adrian is just gaslighting her, she's claiming that he's literally turned himself invisible to drive her insane, but some of the best allegory works by exaggeration, and/or rendering something abstract as something more tangible.\r\n\r\nAesthetically, the film looks terrific. Designed by Alex Holmes (_Wish You Were Here_; _The Babadook_; _The Nightingale_), Adrian's house is a modernist maze of glass, mirrors, sliding panels, and open space, and the ultra-high-tech nerve centre from which he controls his kingdom is one of the film's only overt nods to science fiction (aside from the whole invisibility thing, of course). The real aesthetic strength, however, is the cinematography by Stefan Duscio (_Jungle_; _Upgrade_; _Judy & Punch_), into which is built Cecilia's paranoia. For example, countless scenes involve the camera panning away from her, moving across the room, showing us nothing at all, and then panning back. Ordinarily, this would be textbook unmotivated camera movement, but here it conveys how Cecelia fears there may be something in the corner to which we panned. And now, thanks to that camera pan, so do we. There are also many shots which in another film would be awful framing; isolating Cecilia in the frame and filling up so much of the screen's real-estate with empty negative space. Except, again, in this film, such negative space has an ominousness not applicable to regular thrillers. In this way, Whannell can instil fear and dread simply by pointing the camera at an empty room without the need for any FX, VFX, makeup, elaborate props etc (which no doubt played a significant role in keeping the budget down to a minuscule $7 million). And I'd be remiss if I didn't mention Moss's performance, which is excellent, especially given that so much of it is her on her own reacting to nothing whatsoever, having to communicate confusion, fear, anger etc through little more than her expression.\r\n\r\nBefore talking about why I didn't like the film, however, I want to reiterate that I honestly can't say how much I admire the idea to reconstitute the genre template as a story about domestic violence. And it's an especially timely reconstitution, coming as it does in the era of #MeToo, when so many powerful men, once considered invisible in everything but name, able to perpetrate their crimes with impunity, have been revealed as the monsters they are. So I have no problem with the ideological paradigm shift. My problem is with the execution. \r\n\r\nFor one thing, we know from the get-go that Cecilia isn't imagining things, that Adrian faked his suicide and is now stalking her whilst invisible. This isn't a twist, and the film makes no attempt to hide it. Granted, this is kind of unavoidable given how well-known the property is, but had the film allowed for even a little bit of ambiguity, it could have done wonders for emotional complexity, turning a story about invisibility into a story possibly about mental collapse. This would have effectively placed the audience in the same position as the other characters, doubting Cecilia's state of mind, which would, in turn, have enhanced the potency of the socio-political allegory. Another thing that bothered me is that in a film so focused on surveillance and privacy, there are several scenes where if there is even one functioning CCTV camera, the movie ends. A pivotal scene in a restaurant is an especially egregious example of this – one grainy image from a camera, and Cecilia can prove she's not going nuts and the whole plot unravels. Also, if you were so convinced that you were being stalked by someone invisible, might it not occur to you to invest in a pair of IR glasses for a few hundred bucks on Amazon? Just a thought.\r\n\r\nHowever, my biggest problem is that what starts as a fascinating study of the lasting ramifications of domestic violence ultimately descends into genre stupidity, with a ridiculously over-the-top final act that says nothing of interest about anything. True, _Hollow Man_ has a pretty over-the-top final act too, but _Hollow Man_ never saw itself as anything other than a schlocky genre affair, whereas _The Invisible Man_ clearly does. The fact that Whannell ultimately undermines himself in this way, deploying such important themes merely to get him to the gory _dénouement_, is especially frustrating insofar as he genuinely did originally seem to have some interesting things to say. Tied to this is that Adrian is introduced as such an abhorrent character from the start; he's essentially a comic book villain, void of nuance or subtlety. Domestic abusers aren't monotone evil-doers, otherwise everyone would see through then. Oftentimes, they're very charming on the surface, and any film claiming to be a serious examination of this topic would make room to address this.\r\n\r\nAlthough _The Invisible Man_ was very well reviewed and a huge box-office hit, it left me disappointed and frustrated. Initially positioning itself as an insightful allegory for the difficulty victims of domestic abuse have in moving on with their lives even after the abuser is gone, it eventually privileges genre beats and cheap thrills over emotional complexity. Which is a huge shame and a massively missed opportunity.", "created_at": "2020-03-14T03:42:46.486Z"}, {"movie_id": 570670, "review_id": "5e7d5b6cf794ad0015ef2d2d", "rating": 7.0, "review_text": "It seems that you can teach an old dog new tricks, at least when it comes to classic Universal monster movies. Writer / director Leigh Whannell‘s suspenseful reboot and reimagining of “The Invisible Man” is smart, well-acted, and full of thrills. It’s a surprisingly fresh take on dated source material.\r\n\r\nCecilia (Elisabeth Moss) is trapped in a violent, controlling relationship with her wealthy scientist husband Adrian (Oliver Jackson-Cohen). After drugging him one night, the terrified woman escapes and disappears, hiding at a policeman friend’s (Aldis Hodge) house. Overcome with loneliness, Adrian commits suicide — but Cecilia suspects his death is a hoax. After a series of creepy coincidences that eventually turn lethal, Cecilia’s sanity begins to unravel as she tries desperately to prove she’s being haunted and hunted by an invisible force that happens to be her departed ex.\r\n\r\nBy telling the story from the woman’s point of view, Whannell has given the film a contemporary feminist spin that makes it all the more haunting and effective. It’s scary because the details of mental abuse by a partner feels so real, as the manipulation and controlling behavior feeds Cecilia’s paranoia. It’s one of the more chilling horror films (or rather, monster movies) that’s come along in quite a while.\r\n\r\nMoss makes her performance look effortless as she wrestles with an empty corner of a room or throws punches into the air. Casting a talented actor in the lead role makes all the difference and prevents this from becoming just another hokey Blumhouse production.\r\n\r\nAlthough serious themes like domestic abuse and mental illness are tackled in an honest way, “The Invisible Man” is so entertaining because it achieves the right mix of terror and female empowerment.", "created_at": "2020-03-27T01:48:28.543Z"}, {"movie_id": 570670, "review_id": "5e81ea3b9a643500184e26ab", "rating": 2.0, "review_text": "If you want to watch this, don't. If you want to watch an 'invisible man' movie, watch the original 'The Hollow Man'. I actually had to rewatch 'The Hollow Man' just to wash my eyes after this. The manlet of a woman in this movie that they call an actress is 100 times worse than Rhona Mitha's performance in 'The Hollow Man'.", "created_at": "2020-03-30T12:46:51.985Z"}, {"movie_id": 570670, "review_id": "5e94951d2cde980014c5e95c", "rating": 8.0, "review_text": "> **_Review on Horror Focus_**\r\n\r\nDirector Leigh Whannell had a crisp and clear vision when adapting this classic Universal monster The Invisible Man, into a modern re-telling that taps into the relevantly dark dangers of a domestic relationship, exploring such a theme with the upmost intensity and craft. This is a classic horror tale adapted with a contemporary twist, focusing more on the psychological mayhem we're forced to endure, much like our protagonist Cecilia, who's tormented in chilling manners. Already within 2020 this is the sleeper-hit of the year, one that on paper looks a lot more naff than what we are actually presented with.\r\n\r\nMoss is the core of the movie here, playing as the heartbeat of the entire duration. Through Whannell and Moss' talent combined we are forced to endure emotional and brutal intensity, throwing its audiences and main protagonist through nerve-wrecking intensity, tapping into the fear of the unseen that worked so well with the likes of It Follows. \r\n\r\nMoss' performance as Cecilia is superb, as her portrayal of unhinged woman broken from domestic abuse is both unsettling and devastating, already leading to one of strongest female lead performances of the year so far. Whilst the portrayal of constant angst is unforgettable, it's her balanced likability that keeps Cecilia so fascinating, without the character ever compromising her morals or intelligence. A character like this is refreshing to see, especially when they ultimately get their moment to redeems themselves, which she absolutely does.\r\n\r\nImage result for the invisible man 2020\r\nThe most successful element of The Invisible Man is undoubtately the chilling, ice-cold intensity, delivering an unshakable tautness that will have your cage rattles until the closing credits. Whannell's lever use of cinematography with large concrete open spaces and a washed-out colour palette enhances the presence of the Invisible Man himself, allowing paranoia and angst to trickle through bit by bit until it reaches an un-palpable level of tension. Even though we can't see him, his presence is truly unsettling, and once we do, like a bucket of paint to the face, we are then treated to more than a few effective jump scares. Less is more, and The Invisible Man surely capitalises on this, rinsing its novelty for everything its got, for maximum fear factor.\r\n\r\nBehind this creepy facade is an intelligent thriller, that after the half-way mark begins to toy with the narratives origins, often hoodwinking the audience until credits role. There is flare to Whannell's direction here, as some of the themes being juggled around here could very easily have resulted in a cheesy and half-baked result, which to my surprise wasn't the case. In fact, the entire film and premise could have so easily been a disaster, and on paper shouldn't really hold up. To my surprise and probably yours, it's way more effective and haunting than I ever would have given it credit for.\r\n\r\nWith a runtime of nearly two hours, it's surprising how The Invisible Man never feels like it's dragging, nor does it ever let up on the tension. In fact, the movie progressively get more and more unhinged and intense as the movie goes on, and only until the very end do we ever get a second to settle or breathe.\r\n\r\nThis is what great horror movie experiences are about, and like every great horror experience it is easy to forgive and forget its mishaps. Moss' depiction of Cecilia is fantastic, there is no denying that, however it's perhaps the character itself who could have benefited slightly from more depth. More details on exactly what she would have endured or more clarity in her mental decay could have packed a stronger emotional punch overall. In saying this, when we witness her ultimate and long overdue redemption, it is superbly satisfying. Ask the girls who cheered in the audience, they'll agree with me.\r\n\r\n\r\nVERDICT\r\nWelcome to the horror sleeper-hit of 2020. The Invisible Man delivers unpalatable tension like no other, also boasting a stellar cast with slick delivery. Universal Monsters have never looked so good.", "created_at": "2020-04-13T16:36:45.130Z"}, {"movie_id": 570670, "review_id": "5eae02800b7316001c3ebd15", "rating": 1.0, "review_text": "This is a film that tries to be smart and clearly isn't. It has more holes than a colander containing Swiss cheese being held by Christ. This film thinks it's so edgy when it couldn't be further from it. It's a low budget, badly acted, dire attempt to contemporise a classic story. Do yourself a favour and don't bother.", "created_at": "2020-05-02T23:30:08.834Z"}, {"movie_id": 570670, "review_id": "5edc2126726fb1002087412d", "rating": 7.0, "review_text": "Well made horror-thriller that takes the classic version updated for today with not only the effects but violence, which was very effective. A little predictable in some respects but ultimately entertaining and features a good performance by Elisabeth Moss. Going the more lower budget with Universal's \"monster\" remakes the best route, hopefully they learned their lesson from blunders of The Mummy. **3.75/5**", "created_at": "2020-06-06T23:05:10.866Z"}, {"movie_id": 570670, "review_id": "5f011b3bd0b434003367212b", "rating": 4.0, "review_text": "My ten word review:\r\n\r\n_Unoriginal. Nothing here you haven't seen a hundred times before._\r\n\r\nClick here for a video version: https://youtu.be/rCeL3WAvuCs", "created_at": "2020-07-05T00:13:47.304Z"}, {"movie_id": 570670, "review_id": "5f0423a9d2b2090038a52220", "rating": null, "review_text": "Nice suspense thriller.", "created_at": "2020-07-07T07:26:33.130Z"}, {"movie_id": 570670, "review_id": "5f6a89dde627190039ff969b", "rating": 8.0, "review_text": "Great watch, will watch again, and do recommend.\r\n\r\nThis really is a \"what if\" they extended the scenes from \"Hollow Man\" where Kevin Bacon gets into the public and starts messing with people.\r\n\r\nI am starting to worry about Elisabeth Moss though, she seems to be type-casting into all these heavy handed dramatic roles, or maybe that's just how she acts. She's certainly good enough to pull it off, so it's not a downside of the movie, it's just part of a note that this movie is very much a slow-burn suspense.  On the premise alone, the first 2 acts are going to be that way as it is established that she is / isn't crazy and there is an invisible man stalking and sabotaging her.\r\n\r\nMy biggest problem with the movie is that there has never been a more plausible and clearly reasoned explanation for the events, to include camera footage and dead bodies, than she has in this story.  If someone finalized a version of a wearable inviso-suit, then this is exactly the type of nonsense they're going to get up to, especially if no one knows about it.\r\n\r\nIt is a little irritating how they handle him once he's been exposed as well.  Mostly it's because of the premise that no one believes her, but you'd think people had seen a ghost movie, or would have a clever idea.\r\n\r\nIf the movie sounds good to you at all, then I really think you'll enjoy it.", "created_at": "2020-09-22T23:33:49.682Z"}, {"movie_id": 570670, "review_id": "5f8fbbedfed597003748e331", "rating": 8.0, "review_text": "An excellent adaption of the Universal classic. Wholly original, modernized, and thrilling, building off writer/director Leigh Whannell's fantastic science fiction debut Upgrade.", "created_at": "2020-10-21T04:41:17.764Z"}, {"movie_id": 570670, "review_id": "63097e4cb042280082eac68e", "rating": 8.0, "review_text": "**The Invisible Man tells a story we have seen too many times in a fresh, terrifying, and ASTOUNDING way!**\r\n\r\nBlumhouse's reimagining of The Invisible Man is PURE BRILLIANCE as it tells of a woman surviving a dangerously abusive relationship only to question if she had truly escaped. Paranoia and anxiety saturate every moment of The Invisible Man. Elizabeth Moss's performance of terrified but strong Cecelia makes the Invisible Man believable and all the more chilling. Director Leigh Whannell comes fresh off of the extraordinary Upgrade (2018) to deliver another unique and innovative horror must-see. Blumhouse is the clear powerhouse of horror films, and The Invisible Man is one of their best.", "created_at": "2022-08-27T02:15:40.700Z"}, {"movie_id": 570670, "review_id": "646234c9ef8b3200fe7e0471", "rating": 7.0, "review_text": "The Invisible Man, directed by Leigh Whannell, delivers a solid story with many twists and turns that keep the audience guessing. While the pacing is slow and the final reveal lacks a bit of punch, the film has a decent amount of suspense that keeps the tension high.\r\n\r\nThe acting in the film is fantastic all around, with Elisabeth Moss delivering a brilliant performance as the lead character, conveying fear and helplessness in a way that is both honest and heartbreaking. Aldis Hodge also delivers a standout performance, bringing a calm but intensely serious attitude to his role that creates a sense of trust not only with Moss’s character but with the audience as well. Storm Reid also surprises with a performance that adds a sense of lightheartedness to an otherwise dark and depressing screenplay.\r\n\r\nLeigh Whannell's direction is stellar, with some really creative imagery that explores the unique concept of invisibility. The scene in the mental hospital stands out as a highlight, with brutal action and sharp camera angles that keep the audience engaged.\r\n\r\nIn conclusion, while The Invisible Man may have its flaws, it is a solid thriller that benefits from excellent performances and fantastic direction. Fans of suspenseful movies will find plenty to enjoy here, even if it's not the scariest film out there.\r\n\r\nScore: 71%\r\nVerdict: Good", "created_at": "2023-05-15T13:34:01.220Z"}]