[{"movie_id": 256040, "review_id": "55b888b092514123d500140b", "rating": 8.0, "review_text": "While his films since Magadheera have become ambitious in terms of scale and narrative, SS Rajamouli is at heart a masala filmmaker and arguably, the best one we have in our country right now. You just have to look at how he gives every major character in Baahubali its own heroic introduction to realize how keenly he is attuned to the pulse of the audience and knows what button to push to make them cheer. We marvel at the hero's strength when he uproots a massive Shivalingam and carries it over to the waterfall; we are awestruck by the heroine's beauty and later, her bravery; we are thrilled when we see an aging warrior show his skill with the sword and terrified seeing the villain bring down a raging wild bull with his bare hands, and stirred by another lead's speech even as we are shocked by her appearance. These are terrific masala moments and Rajamouli shoots these scenes in rousing fashion and packs them in at regular intervals that we are constantly in thrall.\r\n\r\nShivu (Prabhas) is brought up by tribals but he is forever fascinated by the huge waterfall in the forest and keeps trying to scale it to see what is out there. A wooden mask gives him the drive to do it and he meets its owner — Avanthika (Tamannaah), a warrior who belongs to a rebel group trying to rescue their queen Devasenai (Anushka), who has been chained by the kingdom's evil ruler Palvaalthevan (Rana Daggubati). Shivu offers to go on a rescue mission little realizing how deeply he is connected to the characters involved in this game of thrones.\r\n\r\nBaahubali's narrative is influenced by everything from the Mahabharata and other Indian folklore to Rajamouli's own Magadheera. The backstory, involving the titular character Baahubali, is in fact, very much in the Mahabharata territory. Cousins, one good at heart and another evil, who are competing for the throne, a statesman warrior who is noble but is tainted because he is loyal to the wrong side, a scheming father who wants the throne for his son at any cost, a royal child who is rescued from a river and so on. And by the time we reach the abrupt end, which sets up the sequel, we are reminded of Kochadaiiyaan, which also chose to stop its story midway following a crucial revelation.\r\n\r\nAs for the visuals, Rajamouli takes his cues from varied sources —there are scenes that recall the grandeur of SS Vasan's Chandralekha (the installation of Palvaalthevan's statue), the sweeping battle scenes of Peter Jackson's The Lord Of The Rings (the battle with the Kalakeya army), the dreamscape scenery in James Cameron's Avatar (Shivu climbing over a waterfall), the gorgeous acrobatic movements of Zhang Yimou's Hero (the scenes involving Sivudu and Avanthika), and even a dash of James Bond (an escape from an avalanche). But Rajamouli superbly weaves these influences together and adds his own inventive touch to these scenes, so that they come across as ingenious. Even the romantic track, which some might feel perfunctory and unwarranted, is imaginatively done.\r\n\r\nAnd with his technical team (or, should we call it an army), the director gives us one of the fantastically mounted films from our country. The sheer scale of the film is breathtaking. Art director Sabu Cyril and cinematographer Senthil Kumar, along with the VFX team (despite being clearly visible in certain shots, the the visual effects efforts work is very good) seem to have worked extra hard to make every frame appear grand, while Maragathamani's rousing score heightens the drama on screen (though, the songs aren't as effective).\r\n\r\nThe same cannot be said some of the actors who fall short in terms of performance. It is easier to buy Tamannaah as an angelic beauty than as a fiece warrior. Rana isn't menacing enough while Prabhas feels a bit lightweight, though we can appreciate the effort they have put into looking their parts. Thankfully, the seniors are very good — Sathyaraj as Kattappa and Ramya Krishnan as Sivagami, the caretaker queen, are the scenestealers while Nasser, who is seen with a shriveled arm, is his usual villainous self. And Madhan Karky finds the sweet spot for the dialogues where the Tamil doesn't sound out of place and at the same time, isn't too difficult to understand (as it happened with Selvaraghavan's Aayirathil Oruvan).\r\n\r\nThere are a couple of missteps too. An item number that appears during the hunt for a traitor just yanks us out of the period and puts us in contemporary mass hero movie territoty. A pre-war scene where the two sides involve in a dialogue comes across as implausible given that the enemy army is portrayed as bloodthirsty barbarians who are only interested in pillaging the lands and raping the women of the country they are attacking. There are some shots (even close-ups) where we see the actors speaking their lines in Telugu, which is jarring. The film also doesn't feel tightly edited, probably because of the decision to split the story into two parts. Some of the scenes continue longer than needed and this is especially true of the climactic battle sequence, which goes for almost 25 minutes! Yes, it is incredibly staged and there is never a dull moment, but we do feel the length. And when the film reaches its sudden end, the experience is very similar to what we feel when we are watching a movie (or a match) on TV and the power goes off right before the climax.\r\n\r\nStill, the film is a remarkable achievement that proves that the Indian film industry is still capable of creating grand spectacles.", "created_at": "2015-07-29T08:02:56.963Z"}]