[{"movie_id": 436270, "review_id": "63501e9ed363e5007a664110", "rating": 5.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/black-adam-spoiler-free-review\r\n\r\n\"Black Adam is far from impressive, being somewhat disappointing due to its formulaic, predictable screenplay when something different was anticipated.\r\n\r\nLorne Balfe's epic score and a magnificent cast - Dwayne Johnson, Aldis Hodge, and most remarkably Pierce Brosnan are phenomenal - try to elevate the decent action and visuals, but the moderate entertainment levels don't make up for the dated narrative structure.\r\n\r\nTiresomely heavy exposition, story with little to no creativity, and inconsistent humor make it impossible for the DCEU to take \"the next step\" in a truly impactful manner.\"\r\n\r\nRating: C+", "created_at": "2022-10-19T15:58:22.495Z"}, {"movie_id": 436270, "review_id": "63540bcb2441820082f30903", "rating": 7.0, "review_text": "Well it wasn't disappointing...", "created_at": "2022-10-22T15:27:07.309Z"}, {"movie_id": 436270, "review_id": "6354b267c9dbf9008237a4b1", "rating": 3.0, "review_text": "With a horrid script, lackluster performances, and a waste of potentially awesome characters, _Black Adam_ is an explosive, $195 million, anti-heroic dud. The DCEU is about to get way more convoluted and underwhelming than ever before if this is the future of live action DC films.\r\n\r\n**Full review:** https://hubpages.com/entertainment/Black-Adam-20220-Review-A-Stale-and-Disjointed-Antihero-Kerfuffle", "created_at": "2022-10-23T03:17:59.235Z"}, {"movie_id": 436270, "review_id": "6354c7b5a843c1007d88ed93", "rating": 8.0, "review_text": "**Black Adam might not reinvent the wheel, but it doesn’t have to. It just wants to take you on a fun, entertaining, exciting superhero ride!**\r\n\r\nBlack Adam has its haters, and I can understand why. It doesn’t necessarily break new ground in the superhero genre, but that doesn’t stop it from being awesome! Action-packed from start to finish. The effects are incredible. I kept myself from saying Wow out loud on multiple occasions. Dwayne Johnson’s Black Adam is absolutely ruthless, ripping armies of henchmen with ease and speed. I was worried a PG-13 rating might soften his brutality, but it did not! The action sequences looked amazing and were well done. I really liked the Justice Society characters, although they all felt a little stereotypical with a SpiderMan jokester, a wise old Professor X, and a quipping leader in the vain of Wolverine or Deadshot. Pierce Brosnan was perfect at Dr. Fate, making me wish he hadn’t been relegated to special guest star status. The movie didn’t waste a ton of time giving background on each character which was wise with so many new heroes on screen. The film had its moments of cheese but didn’t overdo it. Definitely watch the mid-credit scene. It’s stupendous! Black Adam was a fine addition to the superhero genre, and I look forward to what comes next.", "created_at": "2022-10-23T04:48:53.283Z"}, {"movie_id": 436270, "review_id": "6355f462f8e98200817bfb30", "rating": 8.0, "review_text": "> _\"My powers are not a gift. They're a curse, born out of rage.\"_\r\n\r\nI had a blast watching this in theaters. This was very bombastic, with a lot of cool action, but also telling a heartfelt story about Black Adam.\r\n\r\nIt was very inventive how they depicted Black Adam's origin, keeping it a mystery up near the end. Dwayne Johnson was born to play Black Adam. He steals every scene he's in playing a badass anto-hero.\r\n\r\nNow the Justice Society, while they didn't have a backstory in the film, they each had prequel comics detailing their backstory. Which I really dig, these comics are meant to sell comics, after all. Might as well get the audience to buy the comics to get into some great stories (they are also currently doing this with The Flash). The movie actually starts right where the Doctor Fate prequel comic ends, so I don't think it's apographa. Doctor Fate played by Pierce Brosnan was a standout. He really put his all into this character. Aldis Hodge was also a standout as Hawkman.\r\n\r\nThe surprise villain of Black Adam, Sabbac, was a really good addition to the Shazam! mythos. If the wizards have their own champion, why doesn't the seven deadly sins have one? Sabbac is the answer to that. Doctor Fate's battle with him was really cool.\r\n\r\nOverall, this wasn't as bad as the critics were saying, I had a fun time! Be sure to stay for the mid-credits scene!", "created_at": "2022-10-24T02:11:46.746Z"}, {"movie_id": 436270, "review_id": "63563a07a06efe007a657d0c", "rating": 0.5, "review_text": "cool movie", "created_at": "2022-10-24T07:08:55.360Z"}, {"movie_id": 436270, "review_id": "63578b5aefd3c200907b78fd", "rating": 6.0, "review_text": "In search of the all powerful crown of \"Sabbac\", \"Adrianna\" (Sarah Shahi) unleashes \"Seth-Adam\" (Dwayne Johnson) from his mountain-encased tomb deep in the desert. With super-human powers akin to \"Superman\", he returns to his home city of \"Kahndaq\" which is under the control of the \"Intergangs\". Will he decide to help her and her son \"Amon\" (Bodhi Sabongui) free them from this criminal tyranny? Well what nobody had counted on are the folks from the Justice League/Brotherhood/Department - led by \"Hawkman\" (Aldis Hodge) and \"Dr. Fate\" (Pierce Brosnan) who have decided that \"Adam\" is a bit of an wrong-un and so bring their state-of-the-art rocket ship as well as the \"Atom Smasher\" (Noah Centineo) and \"Cyclone\" (Quintessa Swindell) to capture or destroy him. Thing is, \"Adam\" is the stuff of legend to these people - reputedly having defeated an ancient despotic king - but is/was he all that he seemed? Is he good or evil or both? Well, to be honest I didn't really care. This is a very well produced and technically superb creative effort, but the story is all over the place and the repetitive combat scenes just grate after a while. Johnson has charisma, we have seen it loads of times, but here he exudes none. Hodge looks great in his winged-suit but again, his character is as deep as an Ethiopian river in July. Centineo has some fun as the giant - more than a passing resemblance to Mark Ruffalo, don't you think? Otherwise the rest of this is about as derivative as it comes. Hopefully this is just a one-off, as this is nobody's finest work and is up there with \"Morbius\" as a superhero film too many!", "created_at": "2022-10-25T07:08:10.692Z"}, {"movie_id": 436270, "review_id": "635800e9d18fb9007ab4a9fe", "rating": 5.0, "review_text": "_Black Adam_ is in every aspect a generic superhero movie. There is nothing that really separates this for me, besides the body count that Black Adam stacks up during the film.\r\n\r\nOne thing I need to mention is the audio quality. So many lines of dialogue sound like they were recorded straight off from a cell phone. They do not match the scene at all and it was incredibly jarring throughout the entirety of the film. While I am talking about sound, in almost every fight scene the film included a badass rap song. It was cool the first time, but it got old and corny fast.\r\n\r\nThe plot was very generic from all aspects. It suffers by trying to catch the audience up in the first act. The film introduces the Justice Society and Black Adam and quickly accelerates the plot to start the main conflict of the film. It felt rushed and the conflict between the JSA and Black Adam was forced, nothing about it felt genuine. The villian in this movie was so forgettable, by the time he is introduced the conflict is over. I had zero emotional attachment to anyone in this movie. The dialogue was pretty bad as well, the scenes constantly switched from serious to comedy causing both aspects to fall flat for me.\r\n\r\nThe performances were okay, everyone was pretty average including Dwayne Johnson. Nothing spectacular and nothing bad enough for me to notice.\r\n\r\nOverall, I was excited for this new phase and direction of the DCEU and was left disappointed. Definitely one of the poorer movies in the franchise.\r\n\r\n**Score:** _48%_ |\r\n**Verdict:** _Average_", "created_at": "2022-10-25T15:29:45.668Z"}, {"movie_id": 436270, "review_id": "636874a81684f7008aeb6249", "rating": null, "review_text": "Best DC Movie ever !!!", "created_at": "2022-11-07T02:59:52.514Z"}, {"movie_id": 436270, "review_id": "636e49a621621b00b49e4502", "rating": 10.0, "review_text": "Very Good Movie", "created_at": "2022-11-11T13:09:58.343Z"}, {"movie_id": 436270, "review_id": "637def0ca5743d007c2dca64", "rating": 7.0, "review_text": "In all honesty, I was anticipating the same old rubbish. Neither the teaser nor the people involved left me feeling optimistic. To my surprise, I got a rather well-crafted superhero film that, despite its imperfections, is still superior to the vast bulk of its genre’s offerings in recent years. Coming from the DCEU, which has produced some of the most inconsistent content in recent memory, and starring Dwayne Johnson as the lead, who, apart from his charm and muscular physique, isn’t exactly known for his acting talents. In many respects, “Black Adam” had more going against it than for it.\r\n\r\nNevertheless, thanks to director Jaume Collet-Serra, writers Adam Sztykiel, Rory Haines, and Sohrab Noshirvani, and a supporting ensemble that makes the most out of a script that is at best passable, “Black Adam” manages to stand out from the recent run of lacklustre comic book films. It manages to establish a broader universe without appearing forced while introducing some new concepts to the genre. “Black Adam’s” most distinctive characteristic is the way it refuses to settle for any clear-cut morality. It all adds up to a film that succeeds more often than not.\r\n\r\nIn 2019, when the Infinity Saga ended, you couldn’t have convinced me that I’d be more interested in the DCEU than the Marvel Cinematic Universe. But fast-forward three years, and that is precisely what has happened; DCEU has produced some good content during that time (Zack Snyder’s Justice League, The Suicide Squad, Peacemaker). The future seems bright for the DCEU!\r\n___\r\nRating: 6.9/10 (Good, It Gets the Job Done, Slightly Flawed)", "created_at": "2022-11-23T09:59:40.737Z"}, {"movie_id": 436270, "review_id": "637e99b6a3d027009f099650", "rating": 4.0, "review_text": "I enjoyed the action mainly sometimes the shotty CGI took me out of it. Very surprised that a triple A title in this age would have subpar CGI at times. The story was ok, but most of the dialog was poorly written. Especially with 5he scenes the boy was in. On the tech side the video is crispy clear. Just gorgeous. And the audio is also great. There is a lot going on.", "created_at": "2022-11-23T22:07:50.589Z"}, {"movie_id": 436270, "review_id": "6386a8970398ab008faca367", "rating": 6.0, "review_text": "\"Its alright.\" I know, its hardly a resounding endorsement but Black Adam, is just that.\r\n\r\nTo be fair the super human genre is pretty formulaic by its very nature. Its simplistic narrative and story telling, often with a very pro American, globalist message, as is the case here, does not resonate terribly well with a sophisticated, mature audience.\r\n\r\nSo rather than pick on its predictable shortcoming's let's look at what it does do well. \r\n\r\nFirstly, I think the choice of Dwayne Johnson as the lead , is a good one. Usually associated with nice guys roles, its interesting to see him cast as someone flawed, with a darker, personality. His physicality plays well here, too. He's intimidating physically, with a strong presence that fits well with this brooding, ominous, characterisation. \r\n\r\nThe action that runs the length of this film is well paced and visually spectacular, if a little repetitive. This is not a boring film, if you are in the mood for lightweight, action fare. \r\n\r\nSpecial effects, are unsurprisingly, of a high standard too and do breathe a little extra life, into this production.\r\n\r\nIn summary, you know what you are getting when you watch these US made super human flicks. Its lightweight action fare, with a pro US, globalist message. That said, there's enough on offer here to make it mildly entertaining, nonetheless.", "created_at": "2022-11-30T00:49:27.732Z"}, {"movie_id": 436270, "review_id": "638e33a1e942ee00b77cd340", "rating": 1.0, "review_text": "The worst ever movie I've ever seen.", "created_at": "2022-12-05T18:08:33.325Z"}, {"movie_id": 436270, "review_id": "639a8f3aa4af8f00ba9874ad", "rating": 2.0, "review_text": "Black Adam feels dated. And not like it came out at the dawn of superhero movies. Before that. Like it came out during TMNT II: Secrets of the Ooze.", "created_at": "2022-12-15T03:06:34.675Z"}, {"movie_id": 436270, "review_id": "639c004893db92008cee062e", "rating": null, "review_text": "Much watch movie :)", "created_at": "2022-12-16T05:21:12.226Z"}, {"movie_id": 436270, "review_id": "63a7fe46a5743d007e529d7f", "rating": 6.0, "review_text": "Okay movie that suffers from similar issues to other DC movies, in  that it wants takes shortcuts with character development and, in the case of one character, their sacrifice feels hollow as we barely get to know them. In addition, the fight scenes, being rendered either against a green screen or via CGI, lacks any punch and thus suspense. On the plus side, I guess Dwayne Johnson was decent and as a whole it's a watchable superhero action-thriller but I doubt I'd ever revisit, and the little kernels of the now defunct DECU feel pointless, including the mid-credit cameo. **3.0/5**", "created_at": "2022-12-25T07:39:50.713Z"}, {"movie_id": 436270, "review_id": "63b7a4ce24b3330085360355", "rating": null, "review_text": "it wasnt bad , thats good", "created_at": "2023-01-06T04:34:22.809Z"}, {"movie_id": 436270, "review_id": "63c6f303de11e50087cfecfb", "rating": 10.0, "review_text": "OK, this isn't a bad movie.  \r\n\r\nBut, it as a bit much CGI (like everything else nowadays) and I think modern audiences are getting tired of paying out the wazoo to basically watch a video game.\r\n\r\nAnd then the narration.  The voice is too young and though it does make sense with the plot, it is jarring because basic tradition is that narrations have an older and wiser voice... Morgan Freeman, Spock, etc.  So that is going to instantly set the radiance off.\r\n\r\nAnd then the Snyderverse is over.  Period.  They made no illusions about that, we have known it was over for years, there was even a massive backlash about his cut of Justice League because it was given the fans what they wanted and thus bad... because politics and politics have declared that people that are enthusiastic about anything that isn't left wing politics are evil.\r\n\r\nBecause the world has gone insane.\r\n\r\nBut the greater point is that people already don't care.  They not only already don't care, but they were sort of told not to by the very people that made the movie.  \r\n\r\nIt's world is over.  This world ended before it was released.\r\n\r\nWhich, sucks, because Shazam was my favorite to come out of the DCEU.\r\n\r\nPeople aren't going to care.  They aren't going to watch it and when they do it's going to come with disdain.\r\n\r\nBut as far as a Superhero movie goes... come on, you're not really getting much.  They aren't Chinatown, they are just popcorn munchers and nothing more, and that isn't bad.  But let's call it what it is.\r\n\r\nUnless they are political like the MCU, they are just mindless action and gags.  And if they are political like the MCU, they sort of stink.\r\n\r\nThis is relatively politics free.  It's high on adventure and so-so on action (see the above CGI comment) so you have a decent film for the genre. It just should have come out before they declared the universe dead.", "created_at": "2023-01-17T19:12:03.280Z"}, {"movie_id": 436270, "review_id": "63e3ed8e1283e900aa870096", "rating": null, "review_text": "The rock looks best in this movie. with his gleamingaura look.", "created_at": "2023-02-08T18:44:30.410Z"}, {"movie_id": 436270, "review_id": "6437d590c26796010337a7e0", "rating": 8.0, "review_text": "I quite enjoyed this movie. Given the story (some superhero wakes up 5000 year later) I was a bit afraid that it would be a lot of unintelligent Hollywood slapstick humor with Black Adam trying to adapt to modern society. There where a little bit of that but, luckily, not too much.\r\n\r\nI did actually have some hopes for this movie given that those woke intellectual midgets that the rubbish site Rotten Tomatoes calls critics gave it a rotten rating whereas the actual audience gave it a near 90% fresh rating.\r\n\r\nOverall it is a decent story without too many ludicrous elements in it. It works pretty well from start to finish.\r\n\r\nThe Rock is, well, he is The Rock which is good. He did play a more serious character in this movie than he has done in many of his movies though. Pierce Brosnan (I actually didn’t recognize him at first) worked very well as Dr Fate. The rest of the characters was okay but nothing to write home about.\r\n\r\nIt is a superhero movie so of course there were plenty of special effects, CGI and action. That is really the main reason to watch these movies and I enjoyed every moment of it. Especially when Black Adams let loose.\r\n\r\nThe action is sometimes quite violent actually with limbs and heads flying. I don’t mind at all. There are way too many movies that some Hollywood bean counter has forced the producers/directors to ruin because they thought it would appeal to a larger audience. Well, then pick a story that is made for that audience you stupid morons.\r\n\r\nAs usual the mid credits scene hinted that there would be more movies with Black Adams and, as long as they keep The Rock as Black Adams in them I can certainly see myself watch more Black Adams.", "created_at": "2023-04-13T10:12:32.261Z"}, {"movie_id": 436270, "review_id": "648613ede375c0011c8068cf", "rating": 6.0, "review_text": "**There is nothing to dazzle with the DC Universe in the year 2022**\r\n\r\n\r\nIf you decide not to enter this movie into the cinemas, you will not miss except two things. The first is a very impressive Post Credit Scene, and the second is the opportunity to see the largest group of characters that look like hell.\r\n\r\nIt is the 11th film between the extended DC universe films and the only movie from this world that will be shown in 2022, in addition to the Batman 2022 movie, which shows events that don't take place in the universe that exists inside The Black Adam. As for the superheroes and comic book films in general, this film is considered the fourth for the year 2022.\r\n\r\nThis is generally true for super hero films, comic books, and things like that. The year 2022 didn't get anything remarkable for fans of this type of movie. I see it as a year that is not remarkable for this type of movie. The events focused on the character of Black Adam, who has a relationship in one way or another, and who is an extension of the personality of Shazam, which we saw within the DC world.\r\n\r\nThe events revolve around Black Adams, which is the new name that was given to him, and he is the protector of the city of Kahndaq, and he was in a stable state for 5,000 years, but he returns to modern times to fight a number of mercenaries who took control of the city called Intergang and continuously plundered the city's resources.\r\n\r\nBlack Adam's personality and methods of dealing with enemies do not apply to superheroes because he is violent and bloody, and these methods attract the attention of Amanda Waller, especially since his strength is very strong because he is considered a hero with very exceptional superpowers because his strength extends from the same source as the power of Shazam. That's why Amanda Waller decided to summon the Justice Society to capture Black Addams and control his powers.\r\n\r\nMy expectations for the Black Adams movie were medium to low. I didn't have high hopes before I watched the movie. It's probably due to DC's recent reliance on hilarious films with entertaining content, whose essence is devoid of epic content and bloated drama, which also doesn't contain things that don't. It dosent have anymore to make the viewer is shocked or surprised, and it is also not a condition that the film contains an artist with extensive talent in the world of acting. I'm not talking about actors specifically, I'm talking about superheroes, although it might apply to actors as well.\r\n\r\nWhen I found out that The Rock is playing the role, I set my expectations in this place, which is that there is nothing new in this movie that makes you dazzled by it. 6/10", "created_at": "2023-06-11T18:35:25.469Z"}, {"movie_id": 436270, "review_id": "648f6cd3559d22011c4cf745", "rating": 6.0, "review_text": "Pretty good movie. just didnt like the kid he was very annoying. also dont like the extra company of black adam. they are trying to steal the marvel characters now. one guy is like ant-man and the other is the falcon. the old guy is dr. strange. i only gave it a rating of 6 because black adam is the shit in this. otherwise i would have given it a 1.", "created_at": "2023-06-18T20:45:07.134Z"}, {"movie_id": 436270, "review_id": "6557d991d4fe0400c42334bc", "rating": 7.0, "review_text": "<em>'Black Adam'</em> holds hits and misses aplenty, but I think I got enough out of it by the time the credits rolled.\r\n\r\nThe most standout part of this 2022 DCEU flick is its humour, albeit weirdly. What I mean is that I found the comedy to actually be fairly amusing, much more so than I was anticipating, but the way it is placed into other events onscreen is very messy and almost forced.\r\n\r\nIt's as if they made the whole movie without humour and then went back and placed bits throughout. Like I'd be watching a gag and it would make me at least smirk, though it would be surrounded by more serious moments so it comes across as unconnected. It's weird, perhaps just a me thing.\r\n\r\nLorne Balfe's music is good, I particularly enjoyed \"The Justice Society Theme\" in the end titles - added it to my playlist already! As for this film's other elements, I found the action to be well done - and as such the editing. The special effects at the beginning for Kahndaq's backstory isn't great though, I've seen a lot of films (early 2010s, mind you) use that sorta effect and it rarely comes out positively.\r\n\r\nCast-wise, I have no negatives. Dwayne Johnson fits the titular character as you'd expect, I wouldn't say his performance is anything all that great but what he gives is enough - when coming to terms with Amon's superhero ideas, Johnson plays off the 'learning on the job' angle well.\r\n\r\nAldis Hodge, Pierce Brosnan and Sarah Shahi are solid. Mohammed Amer offers good comedic relief, definitely the one that got the most chuckles out of me. The characters of Noah Centineo and Quintessa Swindell feel derivative, though Marwan Kenzari is thankfully more villainy here than he is in 2019's <em>'Aladdin'</em>.\r\n\r\nA more thorough execution and I may have loved this. In the absence of that, I'd simply class it as passable.", "created_at": "2023-11-17T21:22:25.765Z"}]