[{"movie_id": 447277, "review_id": "647271fa8813e401452d0860", "rating": null, "review_text": "Halle Bailey served a very good performance with a lot of charisma and passion, she also has an impressive voice. In some parts people were clapping from excitement and I shed a tear since I saw her performing her first song.  \r\n\r\nI'm not a big fan of the growing wave of remakes and live-actions but this movie is something that I couldn't miss, they revisited one of my favorite classics and the result is striking, extravagant, funny, exciting, it has everything I love. I had my doubts since I saw the cast and the character designs (not to mention Ursula's makeup) but these actors have a lot of charisma, the final result is solid and entertaining. \r\n\r\nI love Alan Menken and Howard Ashman compositions, The Little Mermaid and Little Shop Of Horrors are my favorite works from them, their lyrics and arrangements give me goosebumps.", "created_at": "2023-05-27T21:11:22.868Z"}, {"movie_id": 447277, "review_id": "6474658dcc277c0133896d69", "rating": 6.0, "review_text": "\"Ariel\" (Halle Bailey) has longed for a chance to meet with humans but her sagely father \"Triton\" (Javier Bardem) has prohibited this. Undeterred, she witnesses a terrible storm that washes the young prince \"Eric\" (Jonah Hauer-King) overboard. She races to his rescue and leaves him to his people on the beach - both are already in love! On hearing of her latest transgression, dad is now truly furious and loses his temper driving his daughter into the manipulative tentacles of the evil sea witch \"Ursula\" (Melissa McCarthy) who offers her a bargain - three days on land to obtain true love's kiss or a lifetime in her service. Snag? Well, she will not have her beautiful voice, she will be a mute. A combination of magic, duplicity and serendipity plays it's hand now and she ends up close to the prince, having adventures with him and falling even deeper in love - but can she get her kiss? Will the wicked \"Ursula\" let her? First things first - this isn't a patch on the 1989 version. It has a clunky, over-produced, musical theatre feel to it that consists of mediocre acting and some serious over-scoring. The delicacy and charm of the characterisations and songs has been subjected to grand orchestrations and whilst Bailey can certainly sing, the delivery is more about her ability to belt out the songs rather to than imbue them with any emotions relevant to the charm of the story. McCarthy is quite effective - if only she would stay still for five seconds and that leads to the other disappointment with this film. It works perfectly as an animation - why introduce elements of live-action to it? Neither the story nor the film benefit from the cluttering mix of CGI and real visuals. As with the recent remake of \"The Lion King\", the song lyrics, for reasons that don't seem clear to me, have been reworked - this time by the always over-rated Lin-Manuel Miranda whose \"Scuttlebutt\" song is just plain annoying. It wasn't broke - why fix it? At times there is a little engaging chemistry between Bailey and Hauer-King, but for the most part this is an unnecessary, and overly long, rehash of a fairy tale that seems to me to have been made because it could be, not because it should have been. Disappointing.", "created_at": "2023-05-29T08:42:53.431Z"}, {"movie_id": 447277, "review_id": "64777cf7076ce801079b17db", "rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.firstshowing.net/2023/review-rob-marshalls-the-little-mermaid-enriches-the-original/\r\n\r\n\"The Little Mermaid enriches virtually every narrative aspect compared to the original, deepening Ariel and Eric's arcs while exploring the same core themes without losing any of its predecessor's essence. The relationship between the protagonists is unquestionably more complex and emotionally compelling, while the secondary characters - namely Sebastian and Scuttle - remain genuinely hilarious. Halle Bailey is VERY impressive and the cast accompanies her excellently.\r\n\r\nHowever, it's not without its problems: the new songs are, for the most part, forgettable; the visuals are better than anticipated, but the feeling of being surrounded by fake walls never quite disappears; and Ursula was left with unexplored potential.\r\n\r\nThat said, it's one of Disney's best live-action remakes of recent times and deserves to be seen by every child in the world in need of some inspiration - as we once were.\"\r\n\r\nRating: B+", "created_at": "2023-05-31T16:59:35.570Z"}, {"movie_id": 447277, "review_id": "64cca5c4706e56014ec49cba", "rating": 6.0, "review_text": "When they get the notion to remake an animated classic into a live action film, Disney is a well-oiled machine. They’ve found varying degrees of success and failure (“The Lion King,” “Cinderella,” “Pinocchio”) along the way, and their latest cartoon-to-real-life adventure “The Little Mermaid” lands somewhere on the better-than-average scale. There are things that work (a scene-stealing Melissa McCarthy as Ursula the Sea Witch), things that don’t (a painfully lengthy run time), and things I never want to see again (the truly dreadful “Under the Sea” number), but the film’s reimagined storytelling delivers just enough magic to weather the storm overall.\r\n\r\nThe film tells the classic story of Ariel (Halle Bailey), a curious and spirited young mermaid who yearns for adventure on land. Ariel is the youngest of King Triton’s (Javier Bardem) daughters, and also the most defiant. She spends her days exploring shipwrecks and avoiding dangerous sharks (and humans) with her crustacean pal Sebastian (voice of Daveed Diggs) and her loyal fish friend, Flounder (voice of Jacob Tremblay). On her quest to find out more about the world beyond the sea, Ariel makes a deal with evil sea witch Ursula (Melissa McCarthy) to cast a spell and give her human legs in exchange for her voice. She must find true love’s kiss from the dashing Prince Eric (Jonah Hauer-King) within a few days or the consequences will be dire.\r\n\r\nThe film sticks to the original story, and the fairytale seems outdated. The idea of marrying a handsome prince in a few days is icky, even if it is a fantasy film. It’s interesting how much of the action feels a lot more dire in a live action setting versus in an animated film, with scary eels getting blown to bits and a shipwreck that’s set ablaze as sailors swim for their lives. The worst part of the cartoon to live action translation has to be Sebastian and Flounder, however. It’s startling to see Ariel’s buddies look like a realistic talking fish and crab, and it’s one of the most jarring and unpleasant things about the movie. It takes a lot of willpower to go with the flow, if you can get over the initial shock.\r\n\r\nThe cinematography is dark and drab (although it does look as if it’s really filmed underwater), and Rob Marshall‘s direction is barely adequate. The film is choppy, slow, and long, and its biggest failure is the uneven pacing. Some of the better parts of the story are hurried along in favor of what should be show-stopping action, but the film is so dark that it’s hard to tell what’s going on in what should be the most exciting moments. Why rush the more compelling elements of the narrative in favor for a poorly executed final battle between Ursula and our heroine? It really strips away a lot of the undersea magic.\r\n\r\nThe cast helps keep things afloat, and the performances are all solid. McCarthy is the standout with her robust turn as one of Disney’s greatest screen villains, and Diggs breathes a fresh, new life into loyal crab Sebastian. Casting Awkwafina as the voice of know-it-all seagull Scuttle is inspired, and she creates an updated version of the character that’s the perfect fit for the film. Perhaps the greatest strength comes from the irresistible chemistry between Hauer-King and Bailey, two actors who comfortably step into their lead roles with plenty of charm. She makes a great Ariel, finding a terrific balance of innocence, curiosity, and stubbornness, and he is the perfect non-threatening Prince Charming that is the stuff of many young girls’ dreams.\r\n\r\nThe biggest thing the film does right is keeping the original arrangements of Alan Menken and Howard Ashman’s most beloved songs (the updated verses, which removed some problematic and antiquated lyrics, are done well and hardly noticeable). Cherished ballads like “Part of Your World” and “Kiss the Girl” have a stirring emotional power that immediately helps audience form a strong connection with the material, even if the movie is just so/so. The soundtrack probably makes the movie seem a lot better than it actually is. The new tunes, including a kid-friendly number called “The Scuttlebutt” (featuring lyrics by Lin-Manuel Miranda), sound too contemporary to really fit in, but they’re fun and bring a bit of spirited pep when the film becomes draggy.\r\n\r\n“The Little Mermaid” isn’t a great movie, but it’s one of the better Disney live action remakes because it stays true to the source material. There’s just enough magic, adventure, and romance to make this a satisfying experience for the whole family.", "created_at": "2023-08-04T07:16:20.960Z"}]