[{"movie_id": 49538, "review_id": "51e8703d19c29561d75217e4", "rating": 9.0, "review_text": "A very good movie!\r\nI'm not a massive comic book reader/fan and when I watched the first couple of the X-men movies I always wondered how it all begin and this movie do it justice! The actors where great (there no Patrick Stewart or Ian McKellen), Kevin Bacon played the baddie very well and was well suited for it and it was graphically impressive.\r\nLoved to see the development of the characters over the duration of the film.\r\nIn all, I think it was a excellent movie.", "created_at": "2013-07-18T22:46:21.628Z"}, {"movie_id": 49538, "review_id": "52aa15e919c295586903c427", "rating": 7.5, "review_text": "I didn't love this movie. There were aspects about it from the perspective of an origin story that were interesting but something about the pacing and acting just felt… off. I can't quite put my finger on it but the first word that comes to mind is \"campy\". Kind of like I was watching one of the last three Star Wars movies. The dialog and overall tone just weren't serious enough.\r\n\r\nThe trailer for [X-Men: Days of Future Past](https://www.themoviedb.org/movie/127585-x-men-days-of-future-past) looks better and Bryan Singer is back at the helm. The best X-Men movies are without a doubt 1 & 2 so here's hoping he can steer this back a bit.", "created_at": "2013-12-12T20:00:41.186Z"}, {"movie_id": 49538, "review_id": "58ac565ac3a36849ea0134ec", "rating": 9.0, "review_text": "On IMDb, X-Men: First Class has garnered the highest rating of all films in the X-Men franchise so far. Given the fact that this film features only a few of the familiar characters of the previous films, portrayed by different, younger actors, and the complete absence of Wolverine, the (current) rating of 8.1 somewhat surprised me. That was before I had seen it...\r\n\r\nBeing a pretty big X-Men fan myself, I was excited to see this, regardless of plot or characters. However, I was also a little wary of what to expect, for the reasons stated above. I suspect that anybody reading this might feel the same way. But rest assured, any doubts were quickly dispelled no later than the opening scene. First Class starts off very well, with the exact same opening scene as the first X-Men, featuring a young Erik Lehnsherr being separated from his parents in a Nazi concentration camp. What follows after this familiar story is something completely new and particularly dark and brutal. I won't give away any important plot lines, but suffice it to say there won't be a single person left wondering why Magneto is so resentful of \"normal\" people. This event also sets the tone for the rest of the film, and, to a great extent, explains why First Class is such a success: this film is all about character. Whereas all the other films were mostly about cool superheroes and special effects, First Class is all about character development and the history of those who would later become Professor X and Magneto. This concept might have failed big time if it wasn't for the superb screenplay. I take my hat off to whoever managed to incorporate every little, but crucial, character and storyline and made it flow together so beautifully. Literally everything comes together in this film, everything you might have wondered (why is Xavier paralyzed?) is given a credible and fitting explanation. \r\n\r\nAnother real strength of FC is its cast. Everybody in this film is right where they should be. Kevin Bacon is the perfect villain (but we already knew that…), James McAvoy not only looks, but sounds and moves like the young Charles Xavier would. Jennifer Lawrence is a convincing, young (and believe it or not, insecure) Mystique. All other characters are perfectly cast as well, humans and mutants alike. However, I feel that most credit is due to Michael Fassbender, an actor I am now ashamed to say I had never even heard of before. The way he portrays the 30-something Erik Lehnsherr/Magneto is stunning. His entire physique, down to every little twitch in his face, truly captivates all the pain and agony Erik has had to endure throughout his life. It makes you sympathize with Magneto and understand why he is the way he is. Whereas the \"old\" Magneto was little more than a bitter old man who despised Homo sapiens for undisclosed reasons (with no discredit to Ian McKellen intended here), Michael Fassbender does something I thought was almost impossible in a superhero flick: he gives Magneto a soul.\r\n\r\nIn case I might have given the impression that X-Men: First Class is no more than some wishy-washy character drama, don't worry. There are plenty of awesome action sequences and special effects to keep the more adrenaline-pumped movie-goer satisfied. And before I forget: there are two small, but awesome cameo appearances which I know you will enjoy… \r\n\r\nFinally, a small note on parental guidance: I was absolutely baffled to see that half of the audience consisted of parents with small children. Like I said before, this is not just another cool superhero movie. X-Men: First Class features elements which are quite dark and graphic, and especially the scenes portraying Nazi brutality are not intended for a young audience. Personally, I would say 14 is the appropriate minimum age. \r\n\r\nWith all that said, I would recommend this film to anyone, even to those of you who aren't X-Men fans. It doesn't happen very often that I can't find a single flaw in a film, but I guess this is just one of those rare cases. Great directing, great acting, great everything. Period.\r\n_(July 2011)_", "created_at": "2017-02-21T15:01:46.081Z"}, {"movie_id": 49538, "review_id": "60a8736f66e469007b3ca6f2", "rating": 8.0, "review_text": "My favourite so far.\r\n\r\n<em>'X-Men: First Class'</em> is great fun. I felt entertained throughout with nothing bothering me whatsoever, with the score and the cast particularly standing out. I will say it starts stronger than it ends, but that's not to say it isn't all enjoyable because it certainly is.\r\n\r\nJames McAvoy is very good as Charles Xavier, while Michael Fassbender is excellent as Erik Lehnsherr. Rose Byrne, Jennifer Lawrence and Kevin Bacon were three others who I liked watching too. Back to the score, it's tremendous - some parts reminded me of the outstanding theme of television's <em>'The Crown'</em>.\r\n\r\nI was feeling the decline across the preceding four releases, but thankfully this regains the series' footing and then some. Intrigued to see where it goes from here. Onwards to <em>'The Wolverine'</em>*! *watching in release order\r\n\r\n/copied directly from my Letterboxd review\\", "created_at": "2021-05-22T02:58:55.623Z"}, {"movie_id": 49538, "review_id": "638ba315420228007b025697", "rating": 7.0, "review_text": "If it's not sacrilegious for a Brit, I found this outing for the \"X-Men\" to be far better without the presence of the two elderly thespians who usually underpin these adventures. James McCoy takes on the mantle of the younger \"Xavier\" with Michael Fassbender introducing us to the role of \"Erik\". The former has the ability to read minds, his friend to manipulate metal. By means of flashbacks, we learn the back story for both of these characters, illustrating how they met and started to work together to ensure that their kind were safe and sound in an increasingly hostile world of human paranoia and suspicion. They are making progress until the re-emergence of \"Shaw\" (Kevin Bacon). Now he and \"Erik\" have a past - and the latter blames the other for leading atrocities carried out by the Nazis on his Polish family during WWII. His determination to seek revenge causes a rift between the two friends, and soon they - and their respective followers - are at loggerheads whilst a dangerous nuclear war looms for an humanity caught up in a devious cross-fire. Bacon isn't at his best here, he isn't remotely menacing - but the others, including Jennifer Lawrence's \"Raven\" and Nicholas Hoult's geeky \"Hank\" work well to give us quite an action-packed flavour of the birth of \"Magneto\" and of the foundations of his later hostilities with the \"X-Men\". The visual effects deliver well and the underlying narrative actually offers us a bit to think about - forgiveness, vengeance, fear and intolerance are all touched upon with a superior script that doesn't entirely rely on the effects and pyrotechnics to make it's point. This film works better on a big screen, these stories never really thrive on the television, and is easily - for my money - the best of the franchise I've yet seen.", "created_at": "2022-12-03T19:27:17.507Z"}, {"movie_id": 49538, "review_id": "63e70a5e9512e100a97cdba4", "rating": 8.0, "review_text": "**X-Men: First Class reset the board and brought new life to a franchise that had lost its way.**\r\n\r\nAfter X-Men: The Last Stand and Wolverine Origins, it was clear the X-Men franchise had gone off the rails, but First Class saved the day! First Class tells the origin story of Xavier, Magneto, and the X-Men with a 1960s setting and inexperienced young heroes. These raw and unrefined portrayals of Magneto and Xavier shined the characters in a fascinating new light. The story was engaging and fresh. It felt so new and unique - unlike anything ever seen before with this franchise. All these little-known characters raised the stakes since so many weren’t a part of the original movies leaving their fates unknown and futures unsecured. The 60s style added a cool new aesthetic to the franchise and seeing the beginning of the friendship between Xavier and Magneto with moments of laughter and fun gave the franchise the reboot it needed.", "created_at": "2023-02-11T03:24:14.842Z"}]