[{"movie_id": 12146, "review_id": "5948197cc3a36816c5044f9a", "rating": 8.0, "review_text": "There's always the next something, Maggie. And that will take a man away.\r\n\r\nThe Missing is directed by Ron Howard and adapted by Ken Kaufman from the novel The Last Ride written by Thomas Eidson. It stars Tommy Lee Jones, Cate Blanchet, Eric Schweig, Evan Rachel Wood, Jenna Boyd, Ray McKinnon, Val Kilmer & Aaron Eckhart. James Horner scores the music and Salvatore Totino is the cinematographer.\r\n\r\nNew Mexico 1885 and frontier doctor Maggie Gilkeson (Blanchet) has to seek help from her estranged father Samuel Jones/Chaa-duu-ba-its-iidan (Lee Jones), when her eldest daughter is kidnapped by Pesh-Chidin/El Brujo (Schweig) an Apache Warlock who sells girls into prostitution.\r\n\r\nAn obvious variation on John Ford's The Searchers, The Missing slipped under the radar some what of Western fans who were greatly served by Kevin Costner's Open Range released the same year. It was a box office flop; which in a genre that has rarely hit great heights in modern times is hardly surprising, but to dismiss Howard's film as a fop is just wrong. True enough it's hardly original on the page, but it manages to not sacrifice character depth as it crams in the Western staples. While there is plenty enough here for none Western fans to enjoy; from the many colourful characters on show (including a great horror movie like villain in Schweig), to the panoramic scenery, and the number of action sequences that flit in and out of the narrative. There's a little something for most movie loving fans.\r\n\r\nThe cast, too, are value for money. Blanchet gives it guts and layers as Maggie, emotionally cold, is forced to put family dissension to one side and take up arms as a Western heroine, and Wood equally holds court with her transference from irksome waif to bold babe. Tommy Jones enjoys himself as he finds a cowboy role to suit his craggy features, features that impressively dovetail with Salvatore's stark photography of the landscapes. Along with the plucky and endearing young Jenna Boyd's performance it obviously only really mounts up to a broken family coming together under duress. But as a quartet, and with Schweig's vile turn as the \"monster\" of the piece in amongst them, they function so well, thus all character arcs are acted skilfully and please the senses. Also to be applauded is the use of genuine Apache language from some of the actors, a nice touch that shows a director taking his material seriously.\r\n\r\nThere's a few endings available to view via DVD etc, but the one that Howard chose for its general release is the right one. It perhaps doesn't hold any great surprise, given the directors reputation and output thus far, but it works well in the context of the story and the period tone set throughout. A safe film, then, one that is very well made and tells its story efficiently in structure and verse. If only the script had dared to take a few more risks then this surely wouldn't have been the monetary flop it was. Still, give it a go and you may find as much to like as I did. 7/10", "created_at": "2017-06-19T18:35:40.982Z"}]