[{"movie_id": 334924, "review_id": "5a7702a4c3a36859cc048b59", "rating": 8.0, "review_text": "**Not your typical treasure hunt film!**\r\n\r\nWho doesn't like treasure hunt films. They are always exciting with surprises. See this film poster, and the title is just perfect. That's what I expected, like if not another 'Indiana Jones', then 'National Treasure'. I was disappointed with that perspective. But realised it was unique with the most realistic approach. I've seen plenty of same themed films, but this one stood out to be one of the rare kind. This film is not fun as the others, but surely makes sense of what real treasure hunt means. Though the film did not take the complicated route to narrate the tale. Just a simple, small film.\r\n\r\nA man from a little middle-class family living in an apartment is approached by his neighbour guy who financially broke. All he wanted was some cash, so that he could go and look for treasure that his dying grandfather told him about. Now these two join hands for the unusual quest. They had to make all the pre-arrangement before jumping into it. Like hiring a metal detector and making it a weekend event for not clashing with their routines. So finally the most expected venture begins and how it all turns out are told with some fun filled tense climax.\r\n\r\nThis is a very slow film. Particularly those treasure hunt sequences became even slower than what one would expect out of it. Probably a film for matured audience. It is considered as a black comedy and yes, that's how everything unfolded. Though not all black comedies are same. I mean not everybody understands clearly why it is called that.\r\n\r\nIn my instance, I expected something else, but got another thing. In the end, I really enjoyed it. The initial story was unbelievable. I mean, if somebody approached me with a theory like that, not just me, most of the people won't easily want to be a part of it. Not because it is illegal, but does not make sense or gives enough reason to take part. It has to be convinced thoroughly.\r\n\r\n> ❝We've all got problems. You've got problems. I've got problems. A man makes his own problems. They don't descend from heaven.❞\r\n\r\nThe little Robin Hood story at the opening was relevant to how the film has ended. That character called Costi was an ideal man for a typical world. His belief to be a good person in the society, definitely gives the right message. But I did not think he would go for such a quest. That's the first twist. Then following that, seeing his desperate to succeed, more than the man who took him in, it kind of made fun, like of course black comedy. Especially during the hunt, the verbal fight between two out of three set a perfect tone for the rest of the tale.\r\n\r\nDefinitely not a predictable storyline. That's what kept my eyes open, despite frequent drops in the pace of the narration. I liked the dialogues, especially about the some of the technical terms. Like about metal detector, and the brief history about the Romanian communist era, including the Dos and Don'ts, what the law says about the treasures that has found. It was not like you take all the needed tools and the adventure begins. It excellently highlighted that the treasure hunt is not like one you have seen in the films.\r\n\r\nFinally, regarding the treasure, it comes in many forms. How this film sorted out that part was really cool. That's indeed a well written screenplay. It's not impossible to see such a film in Hollywood, but they won't make money, that's the difference. That is the reason why small film industries around the world shines with such little gems. This is the reason I want to explore the world cinema.\r\n\r\nWhen it comes to the development, in some of the parts, the film was not that logical. That's how it has to go, so it became what it is. As I said the end was really cool. I meant the post quest end. It had ended bringing a little smile on my face. Nice performances. The writer, director is the first to be appreciated. I haven't seen many Romanian films, but from those I've seen never disappointed, and so this one, a very satisfying film. My little advise is for those who wants to see it is expect it to be a drama than an action-adventure- thriller. Patience is another thing it required. Probably you would like it after watched it than while watching. But overall a worthy film.\r\n\r\n_7.5/10_", "created_at": "2018-02-04T12:55:00.805Z"}]