[{"movie_id": 296098, "review_id": "5677b3e8c3a368167a008bf5", "rating": 8.0, "review_text": "Steven Spielberg really knows how to craft movies and this is a very good example. A simple and good story, well scripted, with a well chosen cast and with Tom Hanks, who keep giving us great performances.\r\n\r\nAmy Ryan does a great job, which is even better in the case of Mark Rylance.", "created_at": "2015-12-21T08:10:16.050Z"}, {"movie_id": 296098, "review_id": "56c09d44c3a36817ef00c413", "rating": 9.0, "review_text": "> Totally unexpected PG-13 rated negotiation-drama based on the Cold War.\r\n\r\nThe movie that should have been made 50 years ago, but due to the international political tension it did not take off. So now it's here, the same director made it. It's a rocking combo, once again Spielberg and Hanks come together, tell me who's going to miss that. Simply spellbinding, one of the best movie of the year.\r\n\r\nI think this flick is for adults. There's no sex, no nudity, not even a single kiss or the bad language and zero violence, its fine for teens and kids can understand, but the story is what I meant that suits only for the grown ups. Like the usual, this Spielberg movie is easy to follow, there's no tricky twists and turns, but aimed for only the event that's based on the real.\r\n\r\nOver a 2 hour long negotiation drama with surrounded by suspense and thrills. It's completely a one man show and the end has been just like everybody wanted. I'm not surprised that it is nominated for the Oscars in the 6 categories including the best motion picture. I would be very happy if it puts at least a couple of trophies to its basket. I feel it is a must see if you're interested in WWII related subjects, other than the war.\r\n\r\n8½/10", "created_at": "2016-02-14T15:29:08.545Z"}, {"movie_id": 296098, "review_id": "59052ff7c3a3684af0011b40", "rating": 8.0, "review_text": "Mark Rylance is brilliant in this film. Tom Hanks does his usual excellent performance. I don't know much about Mark Rylance. Maybe he is one of those rare brilliant actors who just hasn't had the accolades he deserves. I am sure that if you asked him if he was worried about his lack of recognition, that he would simply say \"would it help?\"", "created_at": "2017-04-30T00:29:43.121Z"}, {"movie_id": 296098, "review_id": "5e89ffabcf1afd00116d3797", "rating": 9.0, "review_text": "Two great actors deliver with a simple but superlative script.  Of course we know how great an actor Tom Hanks has been, with many Academy Award wins and nominations in his body of work. I think sometimes he makes it look so easy that he doesn't receive adequate credit for those roles. Sir Mark Rylance is more of a character actor, even though he has had lead roles also. He disappears into his characters. He was wonderful playing Thomas Cromwell in the British tv series Wolf Hall. Boy, am I looking forward to the next series of that standout program. Oh, and by the way, he won the Academy Award for his work in this very film I am reviewing here. And of course it was directed by Steven Spielberg, a bit of a legend himself.\r\n\r\nThe plot to Bridge of Spies is not as layered and complex as many spy thrillers, but if anything, not having twists and turns dropping onto our head from above allows the suspense to build out in plain sight. Interestingly, one of the key scenes was filmed on location where the event actually took place. I am leaving out the details in case are you haven't watched it yet", "created_at": "2020-04-05T15:56:27.348Z"}, {"movie_id": 296098, "review_id": "5f5ac9527ad08c00395412da", "rating": 10.0, "review_text": "Superb film!\r\n\r\nI love <em>'Bridge of Spies'</em>. Every angle of it, at least from my point of view, is expertly crafted. The score by Thomas Newman is outstanding, the onscreen talent bring their a-game while the story is extremely riveting. It lasts for 141 minutes, it felt like 90 minutes tops; it absolutely flies through its run time, at no moment did I feel anything close to bored.\r\n\r\nTom Hanks is brilliant in the lead role as Donovan, yet another great performance to add to his résumé. He rightly takes all the plaudits, but some must be left for Mark Rylance who is also brilliant as Abel. The support cast also more than pull their weight, too.\r\n\r\nUndeniably worth your time. Not sure how much of it is historically accurate (sounds like most is?), I honestly don't really care as it's a great film - which is what we are all here for after all.", "created_at": "2020-09-11T00:48:18.382Z"}, {"movie_id": 296098, "review_id": "63b242f10d417e00821be108", "rating": 7.0, "review_text": "**Bridge of Spies dazzles with its Oscar-winning performances and impressive true story. It’s a little slow for me personally, but still, a movie I recommend.**\r\n\r\nWhile Bridge of Spies might not be my usual taste, its performances are undeniable, and its directing is masterful. Spielberg always creates incredible work, and Bridge of Spies is no different. This true story is filled with espionage, tense world powers, and political maneuvering, all colliding with one man and his strong integrity and convictions. Tom Hanks reunites with Spielberg bringing heart and authenticity to the role, but the real stand out of this film is Mark Rylance. His performance as the embattled Rudolf Abel, a questionable spy but seemingly good man, is stunning and worthy of the Oscar he won for the role. While Bridge of Spies isn’t a personal favorite because of its slower story-driven plot, I highly respect it and confidently recommend it.", "created_at": "2023-01-02T02:35:29.785Z"}, {"movie_id": 296098, "review_id": "6593bc95a58902739695f570", "rating": 7.0, "review_text": "New York attorney James B. Donovan (Tom Hanks) is drafted in to provide what can only be described as a cursory defence for alleged Soviet spy Rudolf Abel (Mark Rylance) whom the establishment want to offer an ostensibly open and fair, but actually only a rather rudimentary, trial. This doesn't sit well with Donovan, and he manages to get the judge to commute the death sentence to one of thirty years. That proves to be visionary because shortly afterwards, US pilot Francis Gary Powers (Austin Stowell) is off doing a little spying of his own when he is shot down over East Germany. Donovan is now drafted in by his government to travel to Berlin, without formal status, and see if he can't negotiate a prisoner swap. What now ensues is a true story that wouldn't look out of place in a John le Carré novel. Lots of dogma-driven mistrust, manipulation and a fair smattering of who needs to win the PR battle - especially complicated when the East Germans take a student hostage and he must now try to get both out - a two for one deal! Hanks is on good form delivering a measured and considered effort as the ingenious lawyer with a conscience, and Rylance also performs well, if really too sparingly, as the prisoner who is also a man of principle - though slightly less sure of the nature of his welcome at home should Donovan succeed. The film looks good, is nicely scored by Thomas Newman and we get a genuine sense of just how battered Berlin was as the wall started to go up. Perhaps a little on the lengthy side - but still a solid piece of biopic cinema well worth a watch.", "created_at": "2024-01-02T07:34:45.093Z"}]