[{"movie_id": 381288, "review_id": "58986c57c3a368770e008cc9", "rating": 6.0, "review_text": "There has been much discussion about whether or not it is socially acceptable to watch Split. I'm gonna skip right over all of that and talk purely about the movie itself.\r\n\r\nAnya Taylor-Joy is good, but McAvoy is what makes Split worthwhile. The heavily touted twist/reveal was all but a non-event, even to a M. Night alum like myself. Though it is certainly (in my opinion) the best work The Shamhammer has brought out since at least Signs, it's hard to say that its successes rest on his shoulders. Again, it is for McAvoy that we really owe praise, who, with the exception of his role as the lead in Filth, gives his career best performance.\r\n\r\nFinal rating:★★★ - I personally recommend you give it a go.", "created_at": "2017-02-06T12:30:15.079Z"}, {"movie_id": 381288, "review_id": "58a85e6d92514156ab009d7c", "rating": 10.0, "review_text": "Split was a movie that I was a bit weary to see, I had been bitten by M. Knight before and I wasn't sure if this movie would be worth while. But the trailers looked great and I had always thought James McAvoy was a seriously underrated actor. \r\n\r\nSplit surprised me. I loved this movie. Ann Taylor-Joy was decent in the film and the Dr was great, but McAvoy knocked it out of the park. Being able to portray all these different personalities with no props such as wigs or makeup shows his talent. It was amazing how one personality made you feel uneasy and perplexed and the next had you smiling and feeling like you were really staring at a strange child. Bravo McAvoy.\r\n\r\nThe twist at the end made me love this movie even more. Though I'm not sure if you can really cal it a twist. A \"reveal\" might be the better word for what the audience learns. Whatever you want to cal it, the reveal at the end made me excited to see what's next!\r\n\r\nThe only thing I didn't like about this film was  the unresolved conflict between Ann Taylor-Joy's character at the end of the film. \r\nBesides that, I loved it. Definitely worth watching.", "created_at": "2017-02-18T14:47:09.317Z"}, {"movie_id": 381288, "review_id": "58b14af09251415b2d009d85", "rating": 4.0, "review_text": "**Didnt see the review section at first so,I posted on the forums**\r\n\r\nNot a fan of The director since Unbreakable. It was slightly above average but no whee near the quality of The Sixth Sence. I don't know why I keep watching his movies, probably hoping one will be the same extraordinary quality. With all the pre-release buzz I thought this was finally that movie. \r\n\r\nI was so disappointed. I rated it slightly lower than Unbreakable. I don't know exactly where it where it went off the rails, but it never held my attention (and I'm not ADHD- I sit though theee hours of a good bio pic. \r\n\r\nA good part of this was the girls trying asinine ways to escape; at other time we see McAvoy play several personalities half heartily. After all the award talk I expected a much better and diverse McAvoy. Sadly, just like the majority of Night's films he has his actors perform methodically. It actually felt McAlvoy was pushing his talents against the brick wall of what the director wanted.\r\n\r\nHe wasn't the only actor who underplayed the role. So did the doctor and the three teenage girls. First, after all these late night calls for extra appointment why didn't she get upset earlier or pull a personality up (which she has stated she can do) to discover the emergency instead of A casual bye--you-leave when another dominant personality shows up to the appointment.\r\n\r\nI rate this in the same category of Nights's films except the quality Sisth Sense and Devil, which he did not direct and only wrote the original story, \r\n\r\nAs for,the ending, I felt it was a cheap shot. If the point was they are in the same time, the message came across far too,strong. If it is a hitnt to an Unbreakable 2 I'll pass and see another big screen feature.", "created_at": "2017-02-25T09:14:24.613Z"}, {"movie_id": 381288, "review_id": "58f9021ec3a368759f00c1c6", "rating": 1.0, "review_text": "I read some reviews and gave this movie a shot. I was very disappointed.\r\n\r\nM. Night Shyamalan's last good movie, in my opinion of course, was The Village, where he had control over his style.\r\n\r\nIn Split he tries to use the same formula, but it doesn't work. There was no build up in reveling the plot, and then when we get to the end the feeling I got was : \"Is that it ?\".\r\n\r\nSure all the actors were good, but that didn't make the experience for me any better.", "created_at": "2017-04-20T18:46:54.246Z"}, {"movie_id": 381288, "review_id": "598ca8b192514110a4000b94", "rating": 8.0, "review_text": "**The 24th's about to explode!**\r\n\r\nThe much needed break for the director Shyamalan. It has been over a decade since the last time he was lauded like this for his work. On the paper, it was a simple split personality disaster theme, but cinematically clicked so well. Firstly the performance of James McAvoy made this film a very success. I have seen his lots of films, but if I had to choose only one of his great, that's would be easily this one. A straightforward story, no complication to understand, or needed to explain everything it revolves. Then suddenly the final act turned into a different mode. With a twist, all comes to end.\r\n\r\nThe three teenage girls have been kidnapped at the beginning. Following that, the victims do not know the situation, but makes a couple of bad moves, except one girl. As the film progress, many secrets revealed to us, particularly about the kidnapper. It all developed to lead in one direction where an unimaginable thing going to happen. How and what result it brings told in the following parts.\r\n\r\nThe perspective of the story was not really a thing in this. That means it does not take sides, but gives you the option to choose. And most of the viewers would root for the weird girl. It was Anya, and she's having a wonderful career in early stage. Could becomes one of the best if she contributed all her performances in the same pace and intensity. The music was equally awesome. Created the perfect atmosphere along with the visuals. I could have not asked the better one. Best thriller of the year. You will be stupid to miss it out if you love films.\r\n\r\n_8/10_", "created_at": "2017-08-10T18:40:49.385Z"}, {"movie_id": 381288, "review_id": "5c3f4a040e0a263867908c5f", "rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nJames McAvoy plays Kevin, a man with a genetic disease which allows him to have multiple personalities. His trusted psychiatrist, Dr. Karen Fletcher (Betty Buckley), knows 23 of them, but there's one hidden from everyone who desires to dominate over all the others. Compelled by one of his personalities, Kevin abducts three girls, where Casey Cooke (Anya Taylor-Joy) becomes their leader to try and escape the \"crazy\" man.\r\n\r\nIs this the return to form by M. Night Shyamalan, who has been struggling for more than a decade to release a major success? Is Split the movie that brings him back to the spotlight?\r\n\r\nOnce again, Shyamalan's storytelling is very original, unconventional and ultimately mind-blowing. Instead of establishing everything the audience needs to know about the characters right at the beginning, he gradually develops them, giving them haunting backstories and spreading parts of it throughout the runtime. That said, this film isn't for everyone. The audience needs to trust Shyamalan and be patient. Really patient. Don't start taking notes about something that you think it's negative because once you reach the third act, everything changes and suddenly it all makes sense. The screenplay is not as twisty as Unbreakable, for example, but it demands absolute attention in order to catch up on all the things that matter (and the ones that don't, as well).\r\n\r\nThe production and editing team have to be congratulated due to their seamless work. From the camera work to the extended one-take sequences, as well as the environment surrounding the characters, everything feels real and looks amazing. The soundtrack ... Let me just say that this element is so, but so much relevant to the conclusion of this movie. I can't really say anything else without spoiling the ending, so I'll leave a note after my rating at the end of the review with a MAJOR SPOILER.\r\n\r\nAs for the cast, I'll start with the man that I honestly think should have received an Oscar nomination: James McAvoy. You know, there's a big difference in portraying a non-fiction character instead of a fiction one: concerning the former, you can't really escape the true nature of the person you are playing, but with the latter, as an actor/actress, you have to deliver yourself 100% to the role for it to be believable ... And God, does McAvoy deliver! He gives 200% in what could be his best performance to date. Do you think Andy Serkis had problems portraying both Gollum and Sméagol at the same time? Well, imagine 7 ... or 8 characters. I lost the count. All in all, James McAvoy, sir, congratulations! You are superb!\r\n\r\nAnya Taylor-Joy is also incredible as Casey! Her character has the most intriguing story of the three girls, and she's the one who assumes the leadership of the group once the kidnap occurs. Her initially unknown past helps her through the traumatic situation, but it's really her rather captivating backstory that grabbed my attention. It's fundamental to the understanding of the ending and Anya does a terrific job. I also want to give a small praise to Betty Buckley for a beautiful and necessary interpretation of Dr. Fletcher, a character that offers the audience some knowledge of Kevin's disease.\r\n\r\nAs for the other two kidnapped girls, well ... They're my main issue with the film since they don’t have a good reason to be there. Claire (Haley Lu Richardson) and Marcia (Jessica Sula) aren't the main characters, and they don't have that much screen time, but their dialogue still feels extremely forced and filled with a lot of nonsense. The ending of the story might not be as twisty as in other Shyamalan's installments, but I hope that people don't give up to false expectations. The classic Shyamalan's twisty ending isn't a necessary attribute of his movies, but the truth is that the twist is not the one you think it is. Once again, the note at the end of my review will clarify this.\r\n\r\nIn the end, Split is Shyamalan's return to his old early 2000's self. Brilliantly unconventional storytelling, a lot of suspense, some very captivating subplots and a fantastic editing and production team behind him. The soundtrack plays a huge role in this film, as well as James McAvoy, who delivers his career-best performance. Anya Taylor-Joy is also pretty extraordinary, something that can't be said about her fellow friends who portrayed two bland characters. The ending brings the classic twist that makes everything more understandable, and I gotta say ... I love this film, and it is one of 2017's best!\r\n\r\nMAJOR SPOILER BELOW\r\n\r\nAs I said above, the soundtrack plays a huge role in the ending twist. That's because the soundtrack that plays right before the title of the movie appears on the screen, is the same one as in the third act of Unbreakable.\r\n\r\nThis is one of the many clues throughout the film that hint at the idea that Split belongs to Unbreakable's universe. Naturally, after the title shows up, there's a scene with David Dunn (Bruce Willis) that confirms this theory, but these are little details that make Shyamalan into a great director and screenwriter. Also, it's a pity that I've only watched these movies after Shyamalan stating that they were part of an eventual trilogy. Not that I was not surprised at the end of Split, but it did remove that first impact of pure shock in knowing that two films separated by 17 years (in real life) are part of the same universe.\r\n\r\nBoth movies end up falling into the \"superhero\" genre. Unbreakable is the story of our \"hero\" who spent his whole life sad because he wasn't doing \"what he was supposed to do\", and Split is an origin story of our \"villain\". If Glass delivers, this might be one of the best “superhero” trilogies ever.\r\n\r\nRating: A", "created_at": "2019-01-16T15:13:08.289Z"}, {"movie_id": 381288, "review_id": "5c55a0cf0e0a263ccde133d3", "rating": 7.0, "review_text": "You like to make fun of us, but we are more powerful than you think.\r\n\r\nSplit is written and directed by M. Night Shyamalan. It stars James McAvoy, Anya Taylor-Joy, Betty Buckley, Haley Lu-Richardson and Jessica Sula. Music is by West Dylan Thordson and cinematography by Mike Gioulakis.\r\n\r\nThree girls are kidnapped by a man with a diagnosed 23 different personalities. They must try to escape before the apparent emergence of the 24th - known as The Beast...\r\n\r\nWe now know that Split is the second instalment of a trilogy by Shyamalan that began with Unbreakable and is ending with Glass (released 2019). Always proving to be a most divisive director/writer/actor, Shyamalan has returned to the sort of noticeable form that had him earmarked in his early days as a director to follow - with the proviso that inevitably this is going to still infuriate some for its handling of the subjects at hand.\r\n\r\nThe plot trajectory is simple enough, girls kidnapped by a patient suffering from multiple personality disorder, as the girls in fear try to escape, a number of his personalities put in an appearance. Which builds up to the finale, which explodes after following on from the suspense and dread atmospherics so beloved by the director. In the mix joining the mental health issue with our main protagonist is a good meaning doctor (naturally), and the spectre of child abuse rears its ugly head. So not a movie to be cheered up by then! While if looking for a detailed and attentive look at the mental health issues to hand you will be disappointed.\r\n\r\nHowever, there is a style to the picture in how it draws you into the predicament of the main players, boosted no end by McAvoy on irresistible form. Given licence to chew every scene, he delivers his various characters with great relish and no little amount of skill. Props to for Taylor-Joy, who as the lead kidnappee has deftly blended youthful innocence with resourceful strength (aided by Shyamalan's writing of course). Conversely, Shyamalan is guilty of just making a pic for entertainment purpose, which works as it's a very good creepy thriller with its black humour moments, but the mental health plot devices ensure his gimmicks will not be welcomed by all. 7/10", "created_at": "2019-02-02T13:53:19.141Z"}]