[{"movie_id": 430155, "review_id": "60f9a780d7fbda0079f28d3c", "rating": 7.0, "review_text": "This is a science fiction movie made in Russia that I got as a birthday present from my second son. It is probably not a movie I would just have picked up myself, which is really stupid actually, so I am rather happy that my son did it for me.\r\n\r\nIt is not at all a bad movie. It is quite surrealistic and it does indeed take some time to figure out what is really going on. The landscape in which the main protagonist finds himself is weird, depressing and beautiful at the same time. I have to say that I found the special effects quite well done. If you consider that budget was a measly 4 million dollars the special effects become downright impressive. But then, in Russia you probably get quite a bit more for your money than in Hollywood.\r\n\r\nI do like the general theme of the landscape where bits and pieces of reality is thrown around on a backdrop of filaments that looks like synapse network of a big brain. Actually this is not far from the truth and fits well with the story.\r\n\r\nThe story is perhaps a wee bit predictable just from the name of the movie but it is still not at all bad and it actually hangs together fairly reasonable. Okay it is science fiction after all but it is still a good story.\r\n\r\nI’ve seen a few people complain about the movie. For instance that the story was a rip of Matrix and other movies. That is BS to me. I think this movie have a story of its own. Some people also complained about how bad the acting was. Well, if you watched a dubbed version of it maybe. If you cannot watch a movie in its original language then don’t bother commenting about the acting. The most pathetic comment I saw was one saying “Not too bad for not being a Hollywood movie”. Seriously? Considering the amount of woke and unintelligent crap Hollywood spews out nowadays that is a laughable statement.\r\n\r\nThe one thing I would have liked to be better with the movie was the ending. It kind of fizzled out without any real climax, neither good not bad.\r\n\r\nApart from that this movie is well worth watching for any science fiction fan.", "created_at": "2021-07-22T17:14:40.496Z"}]