[{"movie_id": 814757, "review_id": "63553b67f3b49a007dd43919", "rating": 6.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/empire-of-light-spoiler-free-review-lff-2022\r\n\r\n\"Empire of Light works best as a love letter to the art of filmmaking and the theater experience. Brilliant performances. Astonishing to behold. Emotional to listen to - score is the technical highlight. Not so captivating narratively, considering that Sam Mendes' first solo script lacks depth in the most important themes.\r\n\r\nIt's a beautiful tribute to the magic of cinema that cinephiles will enjoy, but for viewers less passionate about the 7th art, it might be difficult to genuinely care.\"\r\n\r\nRating: B-", "created_at": "2022-10-23T13:02:31.281Z"}, {"movie_id": 814757, "review_id": "63e641a1c2ff3d00f3166805", "rating": 7.0, "review_text": "\"Hilary\" (Olivia Colman) is the shift leader at a grand old cinema living a routine life and largely just going through the motions each day. When the young \"Stephen\" (a strong and engaging performance from Micheal Ward) arrives, she takes him on a tour of the building and that takes them to the upper echelons of the building - now disused - where they discover an injured pigeon. They also discover something else, and soon are having bit of a clandestine affair. Thing is, she's also having one of those with her boss \"Ellis\" (Colin Firth) and keeping secrets amongst her small team isn't the easiest! Things come to an head, however, when some fascist thugs are marauding down the local esplanade and they see the young man through the locked doors. Soon, he is in hospital and everyone is having to re-evaluate their relationships and priorities - and it's at this point that \"Hilary\" comes off the rails a little. Years of resentment and frustration - coupled with a bit of booze - all come to the fore just as her young friend comes to some conclusions about his own future too! Toby Jones is wonderful here as the projectionist, allowing the intensity of the personal stories to be diffused with a nostalgic look back at just how (even as recently as the 1980s) films were synched from a series of projectors, with cue dots and played from reels. He (\"Norman\") even demonstrates to the enthusiastic young \"Stephen\" as we go. The themes of racism, tolerance, ageism and ignorance are never far from the surface, though, and essentially this film is a cleverly nuanced piece of drama that uses a cinema - itself a conduit for so many different aspects of human life and behaviour - to serve as the focus for a brief observation of two lives that overlap for a while. It does have some sentiment to it - but for me that was about the old days of cinema gone by; otherwise this is a complex and thought-provoking look at life in Mrs. Thatcher's Britain long before she had had any real chance to mould it...", "created_at": "2023-02-10T13:07:45.326Z"}]