[{"movie_id": 605, "review_id": "51ea4d34760ee3601d24cb9b", "rating": 8.0, "review_text": "And so the much-hyped Year Of The Matrix comes to an end. Truthfully, though, the real Year Of The Matrix was 1999, when the groundbreaking original proved to be the right film in the right place at the right time. Tapping into the cultural zeitgeist and Y2K fears about the power of machines over mankind, The Matrix not only revitalized slo-mo action sequences with its 'bullet-time' style, it had a political relevance that already seems dated in a 21st century world dominated by a war against terror, not technology.\r\n\r\n\r\nThe Matrix Reloaded, for all its faults, did try to up the ante, both in its creation of a wider Matrix myth and its budget-heavy effects. Revolutions, however, is content to follow in its wake, the final couple of hours of a four-and-a-half hour slab to which the original movie, in the makers' minds, is but a pre-title sequence. Granted, there's less philosophical babble and more emphasis on action in Revolutions, but the Wachowskis, having backed themselves into pseud's corner, can only deliver with a formula where spectacle and pretentiousness follow on from each other in steady succession. Gut thrills and intellectual stimulation are never integrated as one.\r\n\r\n\r\nRevolutions' sustained action set-piece - the Sentinels' attack on Zion - is undeniably exciting, but it sure doesn't feel like an episode from a close sequel to the original Matrix. For a start, Zion was off-screen for the entire first movie. Secondly - and dramatically more importantly - this centerpiece relegates the main characters to, at best, mere bystanders. Neo and Trinity are off on a mission of their own. Morpheus - now dressed in what looks like a burgundy Benetton jumper rather an outfit consistent with his standing as the coolest dude on (or under) the planet - takes a literal backseat to Niobe's driving. Instead, the key players are the Kid, whose backstory is apparent only to those dedicated enough to watch The Animatrix cartoons, and Mifune, whose on-screen impact is unfortunately as brief as it is memorable.\r\n\r\n\r\nThat such a primary scene is completely filled with secondary characters isn't just disappointing - it's damaging, because it draws attention away from the protagonists' climactic acts. Basically, this is the bit you remember, more than Neo's vital conversation with the Wizard Of Oz-like face of the machines or his up-in-the-air fisticuffs with Smith (a fight whose sfx impact has dwindled following Reloaded's Burly Brawl).\r\n\r\n\r\nSome viewers will indeed be completely satisfied, their questions answered, as the final credits roll, but they're the ones who have done their homework. Without filling in plot gaps by watching The Animatrix or playing derided computer game Enter The Matrix, a sense of confusion reigns. And those who are confused can't emotionally engage with the characters, thus rendering any amount of sacrifices and love themes null and void. In the original film, the casual viewer could relate to a slave race of pod people and their need to be freed, but the Wachowskis seem to have moved the goalposts as the story has progressed, sidelining what began as a focal point of the plot.\r\n\r\n\r\nIn other words, few box-office-storming blockbusters have been aimed so consciously at such a narrow and precise cult audience. The Year Of The Matrix will be remembered as an indulgence for fans, while the original movie will be affectionately held as a separate entity by a bigger crowd.\r\n\r\n\r\nVerdict - What once represented the future of science fiction cinema has become little more than a solid genre offering. But, hey, it wasn't supposed to be the Second Coming, was it? Oh, hang on...\r\n\r\n3/5\r\n\r\n- Empire Magazine", "created_at": "2013-07-20T08:41:24.191Z"}, {"movie_id": 605, "review_id": "63be10ca813831008046a78d", "rating": 2.0, "review_text": "The Matrix I loved.\r\n\r\nThe Matrix Reloaded I liked AND used it to teach... seriously.\r\n\r\nThe Matrix Revolutions just stank.\r\n\r\nSeriously, it was really bad.\r\n\r\nReloaded was kind of heavy handed on the philosophy... but it still had enough stylized action to compensate for characters who were so transparent representations of religious philosophies they were as vapid as steam.\r\n\r\nRevolutions kind of abandons the conflict of philosophies, doubles down on one and then.... it commits the BIGGEST crime of all.\r\n\r\nIt switches gears into CGI battles and all but abandons the stylized Wire-Fu and gun violence that made the first two movies so much fun.\r\n\r\nHELLO! We weren't watching them because of the plot, we were watching them because they were trippy cool kung-fu shoot em up sci-fi films... and you went and abandoned the action that we loved in place of CGI battles that are even boring almost 20 years later.\r\n\r\nIt basically left everything that made us go \"WOW!\" when we saw the first one behind and took a totally new form for the climax and... you lost me there.", "created_at": "2023-01-11T01:28:42.421Z"}]