[{"movie_id": 332979, "review_id": "581bbde99251410cb000041f", "rating": null, "review_text": "The boxing sports genre has been very generic for a while. Two months ago The Weinstein Company released Hands of Stone (the biopic of Roberto Duran) which I thought was a run of the mill boxing film. It was a comeback story that was dull and shallow. Now we have Open Road Films rushing to the Oscar season with Bleed For This starring Miles Teller as Vinny Pazienza which should be his shot of getting that Oscar glory you know he wants. Since J.K Simmons’ hauntingly powerful performance in Whiplash blew Teller out of the water he deserves a biopic like this. If Whiplash couldn’t put him on the awards map, maybe a vehicle like this would.\r\n\r\n\r\n\r\n> The inspirational story of World Champion Boxer Vinny Pazienza who, after a near-fatal car crash, which left him not knowing if he'd ever walk again, made one of sports most incredible comebacks.\r\n\r\nAll boxing films are seeming like the same nowadays “ give me another chance,” “one more shot.” Writer/Director Ben Younger attempts to have this biopic be different from others. From the beginning, you see how Vinny is a hot shot wild card. They show his flaws in less than the first 10 minutes. It goes straight into his loss and the introduction of other people vital to his career and his life especially his family. The film shows how important Vinny's home means to him. Every time Vinny is boxing on TV, you see his mom in another room praying and smoking to her jesus glass figurines because of her religious views against violence yet she still calls out to her family who are in the living room to see if he's winning or not.\r\n\r\nIf you ever wanted to see Miles Teller as a boxer with a Rhode Island accent, then this is the film for you. Granted he looks more like Jerry Ferrara, he truly does a good job in his lead role as Vinny Pazienza. His voice is very similar to the real boxer. What is good about Vinny to follow as a character is that not only “he’s a fighter,” but he’s not arrogant. What makes Pazienza much more of a genuine character his near death accident and his way to recovery. Most boxing films center on the boxer’s win-loss-win storyline but this is a real accident that more depressing. Even after this man’s near death experience and when he wakes he still wants to box. It's the scenes where Vinny is wearing the HALO attempting to train that displays Teller’s dedication to the role. He got built more than you’ve ever seen him before. Younger does a great job capturing the fire and the spirit of Pazienza making him a likable person with Teller’s performance doing him great justice.\r\nAs much as Miles Teller does a great job he is at times outshines by one of the many faces of Aaron Eckhart. When he’s introduced, you have no idea it’s him. It doesn’t even sound like him it doesn’t even look like him. This year we are getting the many faces of Aaron Eckhart from Sully and now this. He’s more than your average boxing trainer with a known past but he’s also his friend. He puts on this New York accent and a majority of times deliver some of the best lines. But whenever he’s sharing the screen with Teller there is some amazing chemistry on screen. It may not as strong as B. Jordan and Stallone in Creed, but their relationship is very strong. One of the best scenes of the film is the recreation of Vinny’s training videos with his HALO.\r\n\r\nThe film does, in fact, follow some boxing cliches with numerous training montages and elements within its story. Not that its much of an issue, but the boxing aren’t all that great. The film is more centered on his comeback to boxing than boxing itself With several boxing sequences a lot of shots are out of the ring focusing on the reaction of the audience.\r\nIn some cases, this film could be sort of a sequel to Hands of Stone. It features the fight between Duran and Paz towards the end of the film. Yet since we had two boxing films featuring Roberto Duran, I’m personally disappointed the film doesn’t have Edgar Ramirez reprising his role. Hands of Stone didn’t feature the Vinny Paz fight (for obvious purposes) yet this one does so….couldn't get Ramirez? I guess the Boxing Cinematic Universe would never happen.\r\n\r\nBleed For This is a relatively solid biopic with fine performances from Miles Teller and Aaron Eckhart and a great screenplay from writer/director Ben Younger.", "created_at": "2016-11-03T22:44:57.040Z"}, {"movie_id": 332979, "review_id": "59288c3bc3a36877ee03f3f3", "rating": 8.0, "review_text": "**Born again to reach the sky.**\r\n\r\nI definitely did not expect it. It's a biographical-sport-drama, that tells an inspiring story of a talented young American boxer who faced the biggest setback in his career after met with a car crash. The remaining parts focused on how he struggles to come back, while recovering from the serious injury.\r\n\r\nThe biggest advantage was the cast. I particularly liked Miles Teller in the lead role. His recent rise in the Hollywood was phenomenal and this one is his another must watch film. Even the supporting cast and roles were awesome. If you are a boxing/sports film fan, you will love it. But there is sufficient drama in the tale to build an impressive storyline.\r\n\r\nFeels like it is under-appreciated, and being a Hollywood film, the recognition was too poor. In the coming days, years, it will reach the largest audience coverage. From this film, the director is the one who gained big. Surely he should make use of its success to his next films. Because I'll be expecting much better and bigger than this. This film is one of the best of the years, so don't miss it.\r\n\r\n_8/10_", "created_at": "2017-05-26T20:12:43.494Z"}]