[{"movie_id": 191726, "review_id": "590a7804c3a36843a100a741", "rating": 9.0, "review_text": "One of the darkest Indian movies.\r\n\r\nI had to make a conscious effort to move, after sitting motionless through the climax and the end credits. I don't recall seeing a darker Indian movie. When the movie ended, I felt UGLYNESS in my soul. That's not supposed to be a good thing, but I imagine that was the purpose. \r\n\r\nThe story revolves around a 10 year old girl who goes missing. Her biological father is a struggling actor, her mother is an alcoholic and her husband is a top cop. Then there's a guy whose the actor's friend and is a casting director. There are a few more notable characters. The central characters are trying to figure out the whereabouts of the girl, but they all have bones to pick with each other. Here the title comes into play. What's uglier than the supposed kidnapping of the girl is that they all have their vested interests and that they're more keen on satisfying those then actually finding the girl. The journey to the climax brings out the ugliness within these flawed characters. And it's not one for the faint hearted. \r\n\r\nAnurag Kashyap is my favorite Indian director of this day and age so I'm always a bit biased towards his movies but Ugly has got to be his finest work till date. The story isn't flawless, but the direction is. Mr Kashyap succeeds completely in bringing out the ugliness of his characters, who could easily be breathing and walking human beings amongst us, which makes it all the more chilling.\r\n\r\nThe acting by entire cast was superb. Each and every one of them brought their characters alive on screen. You could feel strongly for them, hate, sorrow, pity and a lot more. The screenplay and editing is tight, dialogs too good and natural. I felt there were 2-3 loopholes and if not for them, the actual story could've been perfect.\r\n\r\nAll in all a definite 9 out of 10 for me.", "created_at": "2017-05-04T00:38:28.669Z"}, {"movie_id": 191726, "review_id": "590b1dd49251414fa10145dc", "rating": 9.0, "review_text": "**One of the darkest Indian movies**\r\n\r\nI had to make a conscious effort to move, after sitting motionless through the climax and the end credits. I don't recall seeing a darker Indian movie. When the movie ended, I felt **UGLYNESS** in my soul. That's not supposed to be a good thing, but I imagine that was the purpose.\r\n\r\nThe story revolves around a 10 year old girl who goes missing. Her biological father is a struggling actor, her mother is an alcoholic and her husband is a top cop. Then there's a guy whose the actor's friend and is a casting director. There are a few more notable characters. The central characters are trying to figure out the whereabouts of the girl, but they all have bones to pick with each other. Here the title comes into play. What's uglier than the supposed kidnapping of the girl is that they all have their vested interests and that they're more keen on satisfying those then actually finding the girl. The journey to the climax brings out the ugliness within these flawed characters. And it's not one for the faint hearted.\r\n\r\nAnurag Kashyap is my favorite Indian director of this day and age so I'm always a bit biased towards his movies but Ugly has got to be his finest work till date. The story isn't flawless, but the direction is. Mr. Kashyap succeeds completely in bringing out the ugliness of his characters, who could easily be breathing and walking human beings amongst us, which makes it all the more chilling.\r\n\r\nThe acting by entire cast was superb. Each and every one of them brought their characters alive on screen. You could feel strongly for them, hate, sorrow, pity and a lot more. The screenplay and editing is tight, dialogues too good and natural. I felt there were 2-3 loopholes and if not for them, the actual story could've been perfect.\r\n\r\n**All in all a definite 9 out of 10 for me.**", "created_at": "2017-05-04T12:25:56.383Z"}]