[{"movie_id": 328111, "review_id": "579cfaac9251411b36008316", "rating": null, "review_text": "A SCREEN ZEALOTS REVIEW www.screenzealots.com\r\n\r\nAnyone who is fortunate enough to share their life with a companion animal will undoubtedly get a kick out of the latest Illumination animated effort, “The Secret Life of Pets.” The film soars when it focuses on animals interacting with their human guardians, with the canine and feline characters acting like real pets do (if my cats could talk, I’m sure they’d converse in  similar dialogue as portrayed onscreen). The first part of the movie is incredibly perceptive and clever, as is the last 10 minutes because it zeroes in on these very relationships (the opening and closing scenes of the movie are touching and have lots of heart). The problem comes in the middle when the story stops being about ‘pets being pets.’ Sadly, the majority of the film lags when it ventures into the dreaded animated movie territory of sheer stupidity.\r\n\r\nLoveable human Katie (Ellie Kemper) and her pup Max (Louis C.K.) are the best of friends. Max has several animal buddies that live in the same New York City high rise, including dogs, cats, birds and guinea pigs that stop by for daily visits. When Katie brings home Duke (Eric Stonestreet) from the animal shelter, Max devises a plan to get rid of him. Problem is, the two dogs find themselves lost in the big city and Max’s would-be girlfriend Gidget (Jenny Slate) takes it upon herself to recruit other pets — including the elderly paralyzed basset hound Pops (Dana Carvey) and lonely falcon Tiberius (Albert Brooks) — to bring Max home. Along the way they find themselves at odds with the anarchist gang of “flushed pets,” a group of outspoken, anti-human animals led by former magician’s bunny Snowball (Kevin Hart).\r\n\r\nThe voice acting runs the gamut from phenomenally good (Slate) to wince inducing (Hart). Slate is perfectly cast as Gidget, a poufy white spoiled little dog who eventually saves the day. She proves herself tenfold as a legitimate voiceover actor, and I hope to see her get more work in animation in the future. There’s no denying that Hart is a super likeable actor, but his portrayal of Snowball the bunny is nothing more than repeated, strained yelling. His overall performance felt so labored and unnatural that listening to him onscreen actually made me uncomfortable. I will not hesitate to nominate Hart for a Razzie award for worst actor of the year because his voice work is that bad.\r\n\r\nIn the ‘oh no, not again’ category, there’s plenty of dopey, brainless scenarios crammed in with a feeling that their sole existence is to appease young kids. We get yet another ridiculous animal driving a car stunt that we had to endure in this summer’s nearly insufferable “Finding Dory.” In fact, in “The Secret Life of Pets” we get not only a rabbit driving a van but also a lizard driving a bus and a pig driving a taxi.\r\n\r\nThe absurdity isn’t the only problem: it’s the repetition. The filmmakers must’ve run out of good ideas and instead of moving the story forward, the audience gets the same monotony over and over and over again. I don’t require my animated films to be completely based in reality (there’s a particularly amusing Busby Berkeley inspired musical sequence in a sausage factory), but I do expect more originality than is delivered in this movie. The story at times takes a cynical approach in several places and some of the themes may be too much for sensitive kids (but the film provides a great starting point for a learning opportunity about pets and how animals shouldn’t be viewed as disposable).\r\n\r\nAt least the animation is commendable, nice and colorful with lively, fully realized backgrounds. It’s visually interesting enough for adults and fans of the genre but it’s also vibrant and bustling enough to keep the kids interested. There’s a lovely original score with a lighthearted, almost vintage sound. For me, the original music in this film is one of the standout elements.\r\n\r\nOverall I feel like this film takes a great idea and almost completely wastes the opportunity. This dull, unremarkable action caper is mostly moronic, but the imaginative peek behind the door at an animal’s life when the humans are away is what’s pure gold. I really wish the film had focused on that component. “The Secret Life of Pets” is fine, but isn’t destined for greatness.  \r\n\r\n**A SCREEN ZEALOTS REVIEW www.screenzealots.com**", "created_at": "2016-07-30T19:06:20.701Z"}, {"movie_id": 328111, "review_id": "5835e13d9251416d2201ac61", "rating": 7.0, "review_text": "**Street pets versus the house pets! A day adventure in a big city!**\r\n\r\nAnimation films always fascinate me, because of its varieties. Even animals can be the heroes and villains. So this kind of new story perspective, including technology, what makes adults too can enjoy them like the kids does. This is now in the list of top 50 highest grossing films of all time and top 10 of the year 2016. Moreover, it is the highest grossing non Disney and non Pixar animation film. This is a very enjoyable family flick that directed by the 'Despicable Me' famed filmmaker.\r\n\r\nKind of similar to 'Bolt', but totally a different experience. This story happens in just one day. It follows a young dog named Max, one day when his owner brings another pet dog, he thinks she does not love him anymore. So to keep his position safe in the house, he strikes a deal by blackmailing his new housemate, Duke. As a revenge act, when Duke tries to get him back, something goes wrong and they get stranded on the street. So getting back to home is their biggest challenge and it should be done before the sun sets. The rest is the Max and Duke's a day adventure in the New York City.\r\n\r\nI was not expecting a masterpiece, just the last week I saw one, 'Finding Dory'. This is a good entertainer, that has some great names in the voice-over cast. Particularly you will love Kevin Hart like I did. But watch out for his impolite dialogues, if you are watching with your kids. Though there's nothing seriously affecting, just a typical Kevin Hart, but awesome. A simple story, a simple adventure, but very likable characters and screen presentation.\r\n\r\nFrom the pets' perspective about during the daytime when their owners and the kids left for the work and school, respectively, how they make their day is what's revealed in this. So the 'Secret Life' means, theirs secret get together and do whatever they want to. But an unexpected clash takes place between the two gangs, the house pets and the street pets. In so many ways, it was better than I anticipated. There are lots of untold stuffs, especially the Duke's past which might be covered in the sequel which is officially announced now. So I'm waiting for the 2018 summer. Meanwhile, watch it if you haven't yet, particularly if you like animation.\r\n\r\n_7/10_", "created_at": "2016-11-23T18:34:37.833Z"}, {"movie_id": 328111, "review_id": "5873b9619251410e6200cecb", "rating": 7.0, "review_text": "Very cute intro and some adorable animals, but the leads (voiced by Louis C.K. and Eric Stonestreet) were the worst part of the film... even if they did have a couple funny moments. What makes this worth viewing, however, are Gidget (Jenny Slate), Snowball (Kevin Hart), and Tiberius (Albert Brooks). In fact, I'd even consider watching a spin-off it it focused on them and left Max and Duke out.\r\n\r\nBTW, the funny and adorable intro is pretty much all shown in the trailer and didn't give much of an indication into exactly what the film would be.", "created_at": "2017-01-09T16:25:05.856Z"}, {"movie_id": 328111, "review_id": "58c172dfc3a3687dd9006400", "rating": 6.0, "review_text": "Meh. Funny. Acting was alright. I liked Kevin Hart as the rabbit. But it is definitely just for kids and the ending was very sudden.\r\n\r\n★★★", "created_at": "2017-03-09T15:21:03.553Z"}]