[{"movie_id": 674324, "review_id": "63553fc6f3b49a007a8507c5", "rating": 8.0, "review_text": "MORE SPOILER-FREE MINI-REVIEWS @ https://www.msbreviews.com/movie-reviews/other-films-watched-lff-2022\r\n\r\n\"The Banshees of Inisherin is a classic tragicomedy from Martin McDonagh: genuinely hilarious and deceptively inconsequential until it ceases to be.\r\n\r\nDespite the expected tonal shift, the narrative follows an even darker path than expected, and the turning point is capable of leaving some viewers \"lost\" for a while. Nevertheless, the filmmaker delivers a brutal, shocking story about friendship and the importance of some alone time. Colin Farrell and Brendan Gleeson are absolutely brilliant, as are Kerry Condon and Barry Keoghan.\r\n\r\nOne of the most stunning films of the year - gorgeously shot by Ben Davis - in addition to being accompanied by a lovely yet haunting score (Carter Burwell).\"\r\n\r\nRating: B+", "created_at": "2022-10-23T13:21:10.772Z"}, {"movie_id": 674324, "review_id": "635669bbc9dbf9008238412d", "rating": 7.0, "review_text": "I really did enjoy this film, but I can't say I am entirely sure what the point of it was...! Colin Farrell is \"Pádraic\", a man who routinely spends his days down the pub with his friend \"Colm\" (Brendan Gleeson) before returning home to their small dairy farm where he lives with his itchy-footed sister \"Siobhan\" (Kerry Condon). Out of the blue one day, his pal refuses to talk to him. He goes and sits elsewhere or outside their tiny pub. Nobody knows why. Confronting this head on, we discover that \"Pádraic\" is dull. He spends hours droning on about the contents of his donkey's manure and, well, poor old \"Colm\" has had enough. Indeed, so fed up is he, he swears to cut off one of his fingers - from his fiddle-playing hand - if his erstwhile buddy doesn't leave him alone. The consequences of this ostensibly trivial falling out soon spiral and that, to be fair, is where it stopped being a funny take on friendship and Irish rural life, and starts to become a bit darker and where I sort of got lost with the purpose (if there was one) or meaning of the tale. Meantime, the real star of the film - aside from the midget-donkey - is Barry Keoghan with his superbly honest portrayal of \"Dominic\". An outwardly simple lad who lives with his thuggish, policeman, father; who has the hots for \"Siobhan\"; a penchant for poteen and who provides much of the humour in this entertaining and quirky observational drama. The photography of this Irish island community is glorious and the sense of community - warts and all - is well captured by Martin McDonagh's pithy writing and simple direction. The two stars are on as good a form as I have ever seen them, with Gleeson using his sparing dialogue to full effect and Farrell conveying the evolving sensations of bemusement to anger convincingly too. It's a curious film, this, but I'd highly recommend it.", "created_at": "2022-10-24T10:32:27.973Z"}, {"movie_id": 674324, "review_id": "63b89129735205007dac4c43", "rating": 9.0, "review_text": "The Banshees of Inisherin is a stellar film with fantastic cinematography, tremendous performances, and an intriguing plot that will stay with viewers long past the credits. The stories set up does a fantastic job at engaging the audience, we feel for Padraic, truly wanting to know why his lifelong friend would \"ghost\" him. This sense of despair soon leads to horror as the plot progresses, creating some uncomfortable moments for both our main character and the audience. Overall, there is just something about this movie that is able to hook me. I had many laughs mixed while feeling completely heartbroken for Padriac. It is a slow burn film, with not much action, but the performances and dialogue are able to carry this movie to completion, resulting in a very unique experience.\r\n\r\nScore: 88%\r\nVerdict: Excellent", "created_at": "2023-01-06T21:22:49.122Z"}, {"movie_id": 674324, "review_id": "63f5797525b95500dd93e65e", "rating": 10.0, "review_text": "This is one of the most brilliant movies I've seen in a long time. I understand why some people might not fully appreciate the story (which reminds me of Aronofsky's Black Swan in that it's a painfully slow descent into Hell). I find this film as complex as a fine scotch, or a fine wine. The top note is, of course, the beautiful visuals created by Ben Davis. The acting all around is phenomenal. Farrell and Gleeson were, of course, nothing short of spectacular. The real surprise was the character created by Barry Keoghan. I couldn't help but be amazed by how real his character was. Although I was expecting the banshees to be like in the horror film I saw as a kid, I really appreciated the Shakespearean witch device. It was perfect in this context. The second note of flavor of this masterpiece is all about relationships in a closed community. If you ever lived in a condo, an association community or the like, you will recognize the day-to-day pettiness that everyone thinks is so important. A subtle addition to the complex layers of flavor is Burwell's perfect score. And the deep flavor of this movie? It is the parallel that the protagonists finally draw to the meaninglessness of the Civil War that rages on the mainland. If two people within a single tribe cannot make a peace, how is this poor world ever going to live?", "created_at": "2023-02-22T02:09:57.732Z"}, {"movie_id": 674324, "review_id": "6444d0f405822404e9332047", "rating": 10.0, "review_text": "**By: Louisa Moore / www.ScreenZealots.com**\r\n\r\n_This film was screened at the Toronto International Film Festival_\r\n\r\nWriter and director Martin McDonagh is no stranger to creating stories that find humor in darkness. In fact, it’s arguably what he does best. With his latest film “The Banshees of Inisherin,” McDonagh captures the sadness of a breakup between two longtime friends with his signature darkly comedic, cynical tone. It’s an emotional character study about loneliness and isolation that expertly blends humor and cruelty, and it’s one of my favorite films so far this year.\r\n\r\nSet on a fictional remote island during the Irish Civil War of 1922, the film tells the story of buddies Pádraic (Colin Farrell) and Colm (Brendan Gleeson), two men who find themselves at an impasse. It all starts one day when Colm unexpectedly and abruptly decides to end their friendship, offering no explanation and leaving his former pal stunned and saddened. With the help of his sister Siobhán (Kerry Condon) and the troubled islander Dominic (Barry Keoghan), Pádraic plans to do whatever it takes to repair the estranged relationship. His repeated efforts to reconcile annoy Colm to the point that he delivers a shocking ultimatum, which in turn escalates the petty feud to an alarming standoff that could have violent consequences.\r\n\r\nWorking from an outline of a sad breakup, McDonagh’s script flows with a natural rhythm that’s brimming with sharp wit and wry, dark humor. This isn’t a complex narrative, but the dialogue is impassioned and poignant with a genuine understanding of the human condition. McDonagh’s writing is like no other, with a natural talent that’s enviable. The script plays directly to the specific strengths of his cast, too.\r\n\r\nFeaturing Oscar-caliber performances, Gleeson and Farrell strike the perfect harmony as Colm and Pádraic. Their rapport is natural and relaxed, and there’s a comfortable feeling between the two actors which no doubt stems from being reunited with McDonagh. This trio should continue to make movies together because something magical happens when they do. Condon and Keoghan are also excellent in this story of conflicts, as Siobhán grapples with the realization that she may risk dying from an unhappy and unfulfilled life if she continues resisting her her urge to flee, and Dominic must deal with the mental suffering of being worn down by his abusive policeman father.\r\n\r\nThe strongest supporting turns come from the scene-stealing animal actors, who represent loyalty and unconditional friendship in a story that’s peppered with a dark undercurrent. Even as the humans around them struggle with their worlds falling apart (and a civil war raging nearby), their equine and canine companions keep them grounded. One of the most memorable scenes features a touching moment between a miniature donkey and a horse, and it is one that absolutely destroyed me. It’s moments like these that add up to a fiercely affective film that is adept at delivering a highly emotional experience to the audience.\r\n\r\nNot only is McDonagh an effective writer, but he is also a talented director with a knack for capturing and creating a mood. Working in tandem with his cinematographer Ben Davis, the film is filled with stunning photography and astonishingly gorgeous scenery of coastal Ireland. These desolate landscapes lend a natural beauty that in turn creates a strong sense of place, providing the perfect backdrop for the story.\r\n\r\n“The Banshees of Inisherin” is an example of that increasingly rare instance where a film fully and completely achieves its desired effect. Backed by two of the finest performances of the year and a superbly written script, this is a piece of accomplished, outstanding filmmaking.", "created_at": "2023-04-23T06:32:20.592Z"}]