[{"movie_id": 58151, "review_id": "54672b54eaeb81726e0019ec", "rating": 7.0, "review_text": "Quite a decent teen horror movie. Maybe it lacks some jokes and the story, as always, is quite stereotypical, but the formula works well.\r\n\r\nYelchin, Farrel, Tennant and Poots make a good team.", "created_at": "2014-11-15T10:30:44.752Z"}, {"movie_id": 58151, "review_id": "5a92d8ed0e0a2616c6020cf4", "rating": 6.0, "review_text": "I have to admit that I have not seen the original but from this version of Fright Night I must say that I do not understand all the fuss and why it has become somewhat of a cult classic. I give 6 stars out of 10 and that is quite frankly just barely. If someone had told me that this was a high-budget TV-movie I would not have been very surprised. Maybe it felt more fresh in 1985 when the original came out.\n\nThe first part of the movie is actually a bit boring. However, after the vampire finally reveals himself so that Charlie’s girlfriend and mother starts to believe him things starts to pick up pace a bit. Unfortunately a lot of the movie is still somewhat mediocre. There are the usual frustrating moments, which Hollywood seems to believe must be in every movie, where Charlie just stupidly stands and stares wasting time, drops his weapon etc. etc.\n\nThe special effects are okayish but never great. The “vampire hunter” Peter Vincent is just a jerk most of the time until the very end when he shapes up a bit.\n\nIt is a decent enough evening diversion but as I wrote, as far as I am concerned, it gets an “okay” but just barely.", "created_at": "2018-02-25T15:40:29.994Z"}, {"movie_id": 58151, "review_id": "62c7fd0ec68b69004f7416aa", "rating": 6.0, "review_text": "OK, so perhaps this didn't really need a \"reimagining\" but it's still quite good fun. Anton Yeltsin (\"Charley\") lives with this mum \"Jane\" (Toni Collette) when the charming \"Jerry\" (Colin Farrell) moves in next door. \"Charley\" is immune to his charms, though, and after some mysterious goings-on begins to suspect that his new neighbour is never going to be able to use a sun-lamp. Of course nobody believes him, so he searches out the supposed vampire killer \"Peter\" (an on-form David Tennant). Things really hot up when he discovers that the love of his life \"Amy\" (Imogen Potts) is target number one, so he must use all the holy relics, guile and sheer brass neck he can to try to thwart this powerful and ancient menace. Just about everyone here has their tongue in their cheek, the story moves along entertainingly and the stars - especially a wonderfully hammy Farrell are clearly enjoying this too. The visual effects won't blow you away, but they are effective enough and of course, well you just know that right will triumph. It's teen brain fodder, nothing more, but I still quite enjoyed it.", "created_at": "2022-07-08T09:46:54.659Z"}]