[{"movie_id": 407887, "review_id": "58d808c59251411f8905c59f", "rating": 7.0, "review_text": "**But it was all about the sub-operation 'X-Ray'.**\r\n\r\nBringing the stars from other film industry is not we never heard of. It is mainly done for the international appeal. So now it was Liam Neeson's turn to foray into a Korean film. He did not go a big transform. He just played an American character and spoke American English. But he did not get the opportunity to exploit well, the role he played was a very important one though. Even I was curious about this film for his presence than the director known for some great hits. The film did fairly enough to my anticipation, but I slightly disappointed with the overall.\r\n\r\nThis is another Korean war theme, that mean based on the real. I think only the events were inspired by, not all the details. Because seems they were improvised for the cinematic version like sentimentalising it. That's the opposite to X-factor in this film, according to me. I started to watch Korean films because of strong emotional appeal, but after all these years watching lots of films, I think that sub-theme was overused. This is a war film and casualties are expected. Not from the viewers' perspective, but the film characters'. So knowing the consequences, the film exploited that too much.\r\n\r\nI am sure that will patriotically appeal to the domestic (native) audience. For the rest of the world, it was a bit too much to take. This film is about a secret mission taken by the South Korean intelligence service after most of its territories were captured by the North in the year 1950. The general Douglas MacArthur of the US armed force with the UN coalition is the architect behind to hit the enemy at the right place. Where his team on an operation known as 'X-Ray' has to clear the way for the bigger one called 'Operation Chromite'.\r\n\r\n> ❝Nobody grows old by merely living a number of years. People grow old only by deserting their ideals.❞\r\n\r\nThe team who left behind their family and friends, has to be ready to sacrifice for their nation. Their notion is to steal the military strategies of the North, but it goes beyond that after a series of twist and turns. Theirs brave attempt is what this film talk about. But there is a little chance for a sequel, particularly for what this title actually meant. I mean, the film was all about the operation known as 'X-Ray' which is a sub-operation of 'Operation Chromite'. But the way the film ended gives a hint that there's no more story left to tell us.\r\n\r\nI am familiar with most of the cast and they all were good. It was worth making a film of the real event, but as I know not the best work of the director. Especially the screenplay looked unrealistic in a few parts which is mostly the confrontations between two armed forces. Though in such films it is acceptable which is done for goosebumps and to highlight the heroism with a greater struggle. If you are watching it for Liam Neeson, then you will be let down. He was magnificent in his limited appearance. For me, he looked like a bit Popeye with a pipe and at sea. A couple great quotes from him, but his absence on the field of action would hurt his fans.\r\n\r\nDespite the disappointment, the film is watchable. Reasonable runtime and pace with the fine visual effects, it is worth a try. You will learn the history and apart from that there's nothing special. Whatever happens in earlier parts, the last 30-40 minutes makes the most of the film if you love war and actions. But still I'll pass, not going to recommend it to you, especially if you have watched lots of war films and spy missions. The final thing I wanted to say is don't believe those sites rated it very poorly. It stands between average and good, so the final call should be yours in such situation, but be prepared for whatever outcome you will receive.\r\n\r\n_6½/10_", "created_at": "2017-03-26T18:30:29.428Z"}]