[{"movie_id": 476764, "review_id": "5d21116094d8a849844183df", "rating": 5.0, "review_text": "_**Reasonably well made, but barely scratches the thematic surface**_\r\n\r\n> _This is a circus. The consequences will extend long past my nomination. The consequences will be with us for decades. This grotesque and coordinated character assassination will dissuade competent and good people of all political persuasions from serving our country._\r\n\r\n- Supreme Court nominee Brett Kavanaugh; addressing the United States Senate Committee on the Judiciary in relation to several accusations of sexual assault (September 27, 2018)\r\n\r\n> _We're all going to have to seriously question the system for selecti__ng our national leaders, that reduces the press of this nation to hunters and presidential candidates to being hunted, that has reporters in bushes, false and inaccurate stories printed, photographers peeking in our windows, swarms of helicopters hovering over our roof and my very strong wife close to tears because she can't even get in her own house at night without being harassed. And then, after all that, ponderous pundits wonder in mock seriousness why some of the best people in this country choose not to run for high office._\r\n\r\n- Gary Hart withdrawing from the 1988 Democratic Party presidential primaries after being accused of infidelity (May 8, 1987)\r\n\r\nBased on the non-fiction book _All the Truth Is Out: The Week Politics Went Tabloid_ (2014) by Matt Bai, written for the screen by Bai, Jason Reitman (_Thank You for Smoking_; _Juno_; _Tully_) , and Jay Carson (Hilary Clinton's former press secretary), and directed by Reitman, _The Front Runner_ tells the story of Colorado senator Gary Hart's doomed 1988 presidential campaign. The most likely candidate to win the Democratic nomination, Hart's reputation was shattered when a _Miami Herald_ story accused him of an extramarital affair, and only three weeks into his campaign, he withdrew from the race. The film presents the events of those weeks as a seismic turning-point; when political journalism and tabloid sensationalism irrevocably fused, when private scandal became just as important to the American public as political acumen, perhaps even moreso. Aspiring to the kind of multi-character canvas of Robert Altman or early Paul Thomas Anderson, _The Front Runner_ recalls Altman's 1988 miniseries, _Tanner '88_. However, it spreads itself far too thin, trying to take on the perspective of a plethora of characters, yet telling us very little about any of them, least of all Hart himself. And in the end, it fails to work as either a darkly satirical examination of the Hart scandal, or as a socio-political critique of the current constitutional environment in the US.\r\n\r\nThe film opens in 1984, with Hart (Hugh Jackman) conceding the Democratic primary to Walter Mondale, who stands virtually no chance of defeating incumbent president Ronald Reagan. Three years later, Hart runs again, and this time he is the clear favourite not just to secure the nomination, but to defeat Vice President George H.W. Bush, who was offering the country essentially the same policies that had been seen during Reagan's two terms. Dogged by rumours of infidelity, Hart firmly believes he is entitled to privacy, and that what he does on his own time should have no bearing on his ability to govern. Exasperated at being repeatedly asked about his private life, he challenges the media to follow him, telling them that if they do, they will be very bored. However, after receiving an anonymous tip that Hart is in the midst of an affair, Tom Fiedler (Steve Zissis) of the _Miami Herald_ calls his bluff, following him to his Washington town house and seeing him enter with a woman who doesn't come back out. Over the next three weeks, Hart's campaign implodes, with the film detailing how that implosion is dealt with by a number of people, including his wife, Oletha \"Lee\" Hart (Vera Farmiga), who had asked only that he never embarrass her in public; his campaign manager, Bill Dixon (J.K. Simmons), who tried to warn Hart that the private and the public had become one; _Washington Post_ editor Ben Bradlee (Alfred Molina), who was reluctant to wade into what he saw as tabloid territory; Hart's alleged mistress, Donna Rice (Sara Paxton), who was portrayed in the media as a bimbo homewrecker; fictional _Washington Post_ reporter A.J. Parker (Mamoudou Athie), who covers the story with no small amount of distaste; fictional campaign scheduler Irene Kelly (Molly Ephraim), who promises Rice that she will keep her name out of the media; campaign press secretary Kevin Sweeney (Chris Coy); _Washington Post_ reporter Ann Devroy (Ari Graynor), who believes strength of character is just as important in a presidential candidate as policy; fictional _Miami Herald_ publisher Bob Martindale (Kevin Pollak), who stands by the journalistic integrity of his paper; and Hart's daughter, Andrea (Kaitlyn Dever), who came out as a lesbian just prior to the scandal.\r\n\r\nAlthough the film doesn't absolve Hart of being a terrible husband, it does present him as an inherently decent man trying to protect his privacy, and that of his family, against a predatory and newly mercenary media. Depicting it as more concerned with prurience than rhetoric, the film takes a dim view of the Fourth Estate - its antecedents are films such as Billy Wilder's _Ace in the Hole_ (1951), Sidney Pollack's _Absence of Malice_ (1981), and Costa-Gavras's _Mad City_ (1997) rather than, say, Michael Mann's _The Insider_ (1999) or Tom McCarthy's _Spotlight_ (2015). Following the line of the book, Reitman posits that the _Miami Herald_ and Fiedler (who is, along with Martindale, the _de facto_ villain) did Hart himself, the American people, and political discourse in general a grave disservice insofar as tabloid reporting of this nature has gone on to undercut serious political debate, and has thus subverted the importance of the political process, cheapening it by way of cynicism, sensationalism, and sleaze.\r\n\r\nAlthough ostensibly about the events of 1987, much like Spike Lee's _BlacKkKlansman_ (2018), _The Front Runner_ has one eye on the here and now, musing as to why a man who was merely accused of having an affair (an accusation that was never proved) had his political career destroyed, and yet a man accused of sexual misconduct on multiple occasions, a man who is on tape bragging about how he can sexually assault women with impunity, could be elected to the highest office in the land. The answer suggested by the film is that, since Hart, scandal has become just another aspect of politics, and that which destroyed Hart in 1987 barely made a dent on Bill Clinton in 1998 or Donald Trump in 2016. In this sense, lines such as Devroy's \"_anyone running for president must be held to a higher standard_\" are as much about Trump as they are Hart.\r\n\r\nEssentially, the film argues that the country now has a president like Trump precisely because of what happened to Hart, and in this sense, perhaps its most salient theme is that the Hart scandal represents the point at which politics became a form of entertainment, opening the floodgates to the tabloids, whilst Hart himself became a martyr to this new style of political coverage. The film drives this message home by having Bradlee tell a story about Lyndon B. Johnson, who, upon becoming president in 1963 told the media, \"_you're going to see a lot of women coming and going, and I expect you to show me the same discretion you showed Jack_.\" The media ignored the infidelities of Johnson and Kennedy (and Franklin D. Roosevelt), reporting only on their political activities, and Hart sees no reason why things should be any different for him. In this sense, his blindness is his _hamartia_, ignoring Dixon when he tells him, \"_it's not '72 anymore Gary. It's not even '82_\". The landscape had changed, and Hart's inability to change with it cost him everything.\r\n\r\nHowever, despite the fact that all of that should make for fascinating drama, _The Front Runner_ doesn't really work. The most egregious problem is the depiction of Hart himself. For starters, it's questionable, at best, to portray him as the victim of an increasingly combative media, glossing over the fact that he himself was the architect of his ruination, sabotaging his own political career and humiliating his wife all because of his libido. In this post-#MeToo era, suggesting that a powerful man was wronged when he was exposed cheating is more than a little naïve. Indeed, the film seems to yearn for simpler times, when potentially great men could walk the path to positions of power, unimpeded by intelligent women speaking out against them, or diligent reporters uncovering their less wholesome activities, when infidelity remained hidden from the public. _The Front Runner_ is not a story about a man who learns that private ethical lapses have become intertwined with public policymaking. Instead, it's about a man who was unfairly destroyed by a pernicious press for doing exactly the same thing that his predecessors had gotten away with for decades. And that's a much less interesting film.\r\n\r\nAdditionally, due to a poor script which offers Jackman little in the way of an arc, Hart barely registers as a real person, with little sense of interiority or psychological verisimilitude. Instead, he comes across as a blank slate, a cypher onto which the audience can project its own interpretation. Related to this, Reitman tells us that Hart was an outstanding candidate, offering things that others did not, and had it not been for the insidious media, he would have gone on to become a sensational president. However, the film never gets into the specifics of how exactly he was so different, what he offered that was so unique, or why he would have been such a good POTUS. Reitman asks the audience to take Hart's potential for transformative greatness on trust, never attempting to illustrate any aspect of that potential, a failing which significantly undermines his condemnation of the media.\r\n\r\nElsewhere, the film tries to touch on virtually every aspect of the scandal – reporter-editor meetings discussing the moral responsibility of the press; campaign staff trying to fight back against tabloidization; gumshoe reporters hiding in bushes and stalking back alleys; the strain on Hart's marriage; the effects on Donna Rice. Ultimately, it casts its net far too wide, briefly covering topics that are crying out for a more thorough engagement. For example, at one point, Rice says to Kelly, \"_he's a man with power and opportunity, and that takes responsibility_.\" That's a massive statement with a lot of thematic leg-work already built in, and serious potential for probing drama, but the film fails to do anything with it, moving on to cover something else. Indeed, Sara Paxton, despite given only two scenes of note, gives a superb performance, finding in Rice a decency and intelligence, playing her as someone who wants to keep her name out of the press because she doesn't want to embarrass her family. She's an infinitely more interesting figure than Hart himself, and the film would have benefitted immeasurably from more of her.\r\n\r\nIn its November 2018 issue, _The Atlantic_ carried an article by James Fallows looking at the alleged death-bed confession by Republic strategist, former adviser to both Reagan and Bush, and current head of the Republican National Committee Lee Atwater that he had orchestrated an elaborate set up of Hart so as to ensure he didn't run against Bush in the election. Obviously, this story only came to light after the film had already been shot, but it isn't even mentioned in the bland one-line closing legend, which tells us only that Hart and his wife are still married today.\r\n\r\n_The Front Runner_ is aesthetically fairly solid; well-directed, well-shot, well-edited. However, given how thematically relevant the Hart story is to the contemporary political climate in the US, especially the increasingly antagonistic relationship between the White House and the media, the script feels bland and overly simplistic. The core of the story is the question of whether or not the press was right to report on Hart's infidelity. Did the public need to know? Did it have any bearing on his ability to lead? The film answers all three questions with a resounding \"no\". However, the cumulative effect is of a scandal skimmed rather than explored, of characters glanced at rather than developed, of controversies summated rather than depicted. There are some positives – Farmiga and Paxton are both excellent, for example – but all in all, this is a missed opportunity, lacking both socio-political insight and satirical flair.", "created_at": "2019-07-06T21:23:44.331Z"}]