[{"movie_id": 455207, "review_id": "5c4486249251412bffde2924", "rating": 5.0, "review_text": "_Crazy Rich Asians_ is not really my type of movie, I don't go in much for romcoms, and I don't think I'm fully on board with some of the messages it's trying to put out there. But I can appreciate that it's very well made, culturally very important, and even kind of endearing.\r\n\r\n_Final rating:★★½ - Not quite for me, but I definitely get the appeal._", "created_at": "2019-01-20T14:31:00.063Z"}, {"movie_id": 455207, "review_id": "5e2071c6f04d010013107063", "rating": 8.0, "review_text": "Crazy Rich Asians expends its expensive mahjong skills to produce a hilarious heartfelt insight into a familial cultural clash. Romantic comedies. The amalgamation of two genres that exercise the very worst tendencies of Hollywood’s mechanical repetitions. Modern romcoms follow the same formulaic narrative structure and embed the same interpretive clichés. Y’know what I’m talking about. Boy and girl fall desperately in love, something/someone comes between them, they fight, break-up and embrace each other again, to the accompaniment of Coldplay or Ed Sheeran, when they realise that “they are the one”. All the same mundane clichés that fail to exert the writing capacity to take those mechanisms and overload them with ferocious energy.\r\n\r\nWell, Chu’s adaptation of the eponymous best-selling novel battles that. He consumes the cliché-ridden narrative structure of a romcom and transforms it into a cultural depiction of Asian traditions, juxtaposing the values of American immigrants, whilst still bashing the familiar beats of “boy meets girl”. And let me tell you now, this is without a doubt, the best romcom since ‘Bridesmaids’. I loved it! Rachel is invited by her new boyfriend Nick to Singapore to meet his family who are attending a wedding, but without realising Nick’s family is one of the wealthiest, infamous and superficial in the country.\r\n\r\nChu tackles several poignant themes and morals within this two hour romantic comedy, whilst retaining a sufficient amount of investable character development and hilarity. Yes, the underlying story between Rachel and Nick is a predictable ordeal, but much like any film within the genre, acts as the backbone for the additional qualities. One of them being the exploration into Asian culture, particularly the continent’s cuisine, highlighting the traditions that contrast with the typical audience member. I cautiously read somewhere, that Crazy Rich Asians was the “whitest romcom featuring a non-white cast”, which is an absolute barbaric statement to form. The predominant cast and crew were all of Asian descent. Just because the film was confounded within the Hollywood system, does not discredit the contents of its insight. Overtly politically correct viewers bumbling about a non-issue. I’m sure ‘Black Panther’ didn’t receive the same criticism from them. Anyway! I digress.\r\n\r\nThe point is, Chu allows the illustration of traditions and values to be accessible for everyone. However it’s not just a cultural clash. Wealth and public image are two contributing factors to the spiky relationship between Rachel and and Nick’s family. Yet neither one of them are viewed as the antagonistic force of the plot. Every character is treated as a delicate human, with sufficient back story and development, to warrant their choices and actions. A sub-plot involving an affair could’ve been a “how dare you!? We’re over!” situation, but Chu manages to present the reasoning of the immoral act and add that subtle layer of empathy. You understand. You feel. You reflect. And there are several poignant moments throughout, like this, that elevate the contextual values that are insightfully divulged.\r\n\r\nOf course though, Awkwafina provides the majority of laughs, demonstrating the creative humour of writers Chiarelli and Lim whilst showcasing her own excellent comedic timing. Conversely, Wu and Yeoh focus on levelling the comedy with romance and drama respectively. They do so with blinding results. Expressing a variety of emotions, participating in tantalising chemistry and bringing their A-game (their...acting game...).\r\n\r\nThe lavish ‘Great Gatsby’ parties and genuinely beautiful weddings, that performed a rendition of my all-time favourite romantic song “Can’t Help Falling In Love With You” by Elvis “Hound Dog” Presley, nearly brought a tear to my eye with the astounding production design. Minor nuances such as the pop soundtrack, including Coldplay, sung in Mandarin, dumplings being everything and my eternal yearning for marriage, rounded off the rough edges of Crazy Rich Asians smoothly.\r\n\r\nIt is absolutely refreshing to see a high-ticketed American produced romcom have an entirely Asian cast and crew, granting several new opportunities for those involved. It is absurdly reassuring to witness a cliché-ridden and formulaic narrative of the genre be fully exploited in a wonderfully entertaining story that harnesses every angle available. Yet most importantly, it’s a colossal piece of entertainment that can legitimately be enjoyed by everyone. Crazy fun, rich in characters and quintessentially Asian. More please!", "created_at": "2020-01-16T14:23:02.987Z"}, {"movie_id": 455207, "review_id": "638159cca410c800c884adb5", "rating": 7.0, "review_text": "**Crazy Rich Asians doesn’t reinvent the rom-com formula but adds rich characters, cultures, and locations taking this rom-com to the next level.**\r\n\r\nCrazy Rich Asians is an incredibly well-done rom-com that follows the typical rom-com blueprint but diverges by exploring cultures other than the frequent American setting. Learning more about Singapore and its people and customs added an intriguing layer to the film. Crazy Rich Asians boasts an absolutely stacked cast with Constance Wu, Henry Golding, Michelle Yeoh, Gemma Chan, Awkwafina, Ken Jeong, and more. With all that talent, it’s no wonder that Crazy Rich Asians is a top-notch romantic comedy with beautiful locations, hilarious laughs, heartfelt moments, and more.", "created_at": "2022-11-26T00:11:56.217Z"}]