[{"movie_id": 76726, "review_id": "5207b007760ee36308235111", "rating": null, "review_text": "Awkward loner Andrew (Dane DeHaan, soon to appear as Harry Osborn in The Amazing Spider-Man 2) is invited by his more affable cousin Matt (Alex Russell, Bait, Carrie) to go to a party, to help cheer him up. Andrew has problems at home; his mother is dying of cancer, the cost of her medication has become prohibitive, and his dad is an abusive drunk. Andrew brings with him the bulky old video camera he's been using of late to document... I dunno, the misery of his life I suppose. Anyway, once at the party Matt, mildly embarrassed by his cousin following him around with a camera, peels off away from Andrew to hang with some of the cooler kids, including the impossibly popular but genuinely decent Steve (Michael B. Jordan, The Wire, Friday Night Lights). The camera causes further problems for Andrew and he's unceremoniously ejected from the party. He's found outside by the aforementioned Steve, and invited to come with him and Matt to check out a weird hole in the ground in the woods nearby (elements of the party had spilled outside into the darkness, as these things do from time to time). Andrew, Matt and Steve venture down this hole, which turns out to be more of a tunnel, leading to... what is that? A space rock of some sort? Something mineral, and glowing, and a bit scary. Upon exiting the hole, the trio find that they possess mild levels of telekinesis, the ability to move objects with their minds. They also find that with practice, they can strengthen that ability. They soon graduate from levitating Lego bricks to flying through the air. Andrew proves to be particularly adept with this new \"talent\", and that proves to be problematic, because where Matt and Steve are content to limit their telekinetic use to mild pranks and perhaps flying somewhere interesting on holiday, Andrew's home life, general isolation and subsequent mood swings as a result of each cause him to want to embrace his power - and for him, it's grown into a potentially deadly power, now - in altogether different ways indeed.\r\n\r\nWith Chronicle, writer Max Landis (son of John \"An American Werewolf in London\" Landis) and director Josh Trank have taken some fairly tired areas (cinéma vérité, superhero origin tales) and made something decent and fresh with them, for comparatively little money (budget was $12m apparently, looks like five times that). It's not a perfect film - the first-person narrative's need to justify its camera angles leads to one or two bum notes despite the fairly ingenious device of having Andrew telekinetically \"float\" the camera around behind him; some of Andrew's worst rages during the second act - including one with devastating consequences - seem badly disproportionate to the infraction, disconnecting us from the character (though perhaps that's the idea); and the abusive father (Michael Kelly, Dawn of the Dead, Did You Hear About the Morgans?) seems unrealistically so. But these are things I thought about after having seen the movie. The movie's tone and pace, and the performances of the three newly-empowered young men particularly, carry the movie very well right to the brisk 78th minute end (minus the credits).\r\n\r\nRecommended.", "created_at": "2013-08-11T15:38:47.753Z"}, {"movie_id": 76726, "review_id": "5a3bdd530e0a264cc1221432", "rating": 4.0, "review_text": "Why this movie seem to get a lot of 7 and above ratings is beyond me. It’s certainly not my cup of tea. The three high school friends are behaving annoyingly stupid, reckless and irresponsibly. Only one of them is showing any sign of intelligence. One of them is just silly and the other one is a nutcase. Of course the film actually revolves around the nutcase.\r\n\r\nIt starts of kind of okay with the three friends finding this glowing alien thing which gives them superpowers and there are some mildly funny scenes when they experiment with them. After that it spirals out of control when the nutcase goes more and more insane.\r\n\r\nI can live with the drama and bizarre behaviours if the movie would have had some other redeeming factors such as imagery or acting but none of it is present here. Rather the inverse since the film shot in this wobbling-about handycam/documentary style which I really do not like.\r\n\r\nI’m afraid that I found this movie not very entertaining.", "created_at": "2017-12-21T16:12:03.637Z"}, {"movie_id": 76726, "review_id": "5f2333c93503980034e59aff", "rating": 8.0, "review_text": "Great watch, will watch again, and can recommend.\r\n\r\nI am partial to found footage style of shooting, so I understand if that's not for you.\r\n\r\nDane DeHaan does a lot of the heavy lifting in this movie, but Michael B. Jordan is right behind him, alongside Alex Russell.  It is almost literally just these 3 guys filming each other as they gain, experiment, and grow their supernatural abilities.  There are some supporting cast, but they're more there as plot devices, and another camera angle.  Found footage is not easy to do, which is why everyone complains about it.\r\n\r\nThis is a very natural feeling movie with some dark aspects too it.  I really think you can feel when the mood changes in this movie.  It also brings up some great points on the \"reality\" of if people gained super powers.\r\n\r\nWhile most people would claim to be Captain America, the reality is that people tend to do whatever they can get away with, so creating a checks and balances with one's co-supernaturals makes sense, but the reality is enforcing that turns it into super \"hero\" versus super \"villain\".\r\n\r\nSurprisingly, this movie reminds a little bit of \"Hancock\", but probably not quite as good, mostly just different.\r\n\r\nIf you like dark, edgy super power stuff or found footage, give it a go.", "created_at": "2020-07-30T20:55:37.417Z"}]