[{"movie_id": 257345, "review_id": "57f411959251413963000460", "rating": 4.0, "review_text": "**When the ancient spirits set loose.**\r\n\r\nUsually horror films are the most clichéd genre, especially when it comes to those scaring parts, all the films use the same sudden sound effects and disfigured human images with the strong makeup or the graphics. This film is nothing less than any of those, but a bit too much in the first three quarters. Like they are keeping some suspense, but it was just dragging to extend the film length and what comes in the final quarter is actually the story with a twist. So when that revelation happens, you would probably lose complete interest on this. Because that's not the demons you're expecting after all the hype was created in the earlier segment.\r\n\r\nThe story was just okay, but it was well known to us in different forms from the different films. In this, it is set in a different location with different cast, so that makes the film is fresh, but it wasn't. Some ancient spirits were set loose when a family was picnicking and it follows them to their house. Now they suffer from some unexplainable events and they decide to get rid bringing the people who can. That leads to the final act where the story comes to end.\r\n\r\nThey say it was inspired by the real event involving a family. So that might interest some viewers to check it out. But if you're an atheist, this is just a joke. From the director of 'Wolf Creek' with the decent performances by Kevin Bacon and Radha Mictchell, the film did not become best among its theme. Just a watchable film, after that you won't going to remember it a week or a month later. Very few might like it, but it's impossible to say who they're, so I'm not going to suggest or reject it.\r\n\r\n_4/10_", "created_at": "2016-10-04T20:31:17.149Z"}, {"movie_id": 257345, "review_id": "5d306d946a300b4f7ba1c9b4", "rating": 5.0, "review_text": "I think I was over-prepared to hate this based on the reviews, because though I will come right up and say that _The Darkness_ truly isn't very good, I actually had a fine time watching it. I won't go back to it, but I didn't have a particularly negative time here. I do wonder if may Greg McLean should stick to Australian stuff though, when you compare the quality of this and _Jungle_ to both _Wolf Creek_ movies and _Rogue_. \r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-07-18T13:01:08.362Z"}]