[{"movie_id": 266294, "review_id": "56f3ebb49251411a97002a7b", "rating": 7.0, "review_text": "> What it is like to throw a grand teenager-style party at your 30s?\r\n\r\nDon't assume it's a high school party movie, but the big girls'. That's where everyone's are wrong and expresses their disappointment. For me it was a nice comedy, but not comparable with other great ones. It might won't work on teenagers, but there's no issue for adults with the open mind to enjoy it. A part themed movie for the grown-ups.\r\n\r\nFrom the director of 'Pitch Perfect' another woman oriented comedy. Both, Tina Fey and Amy Poehler were not that funny, hence not a rocking combo, but did not fail either and worked okay on this. They are the sisters with the opposite character. When they visit their childhood home, they decide to throw one final party before handing it over to the new owners.\r\n\r\nJohn Cena's cameo was excellent. In this chick movie he's the only one who gave manly appeal compared with the other men. The story was decent, but most of the movie was a regular party that goes wild. So expecting development of the characters or the story is silly. What I meant was, it is an entertainer, not a biopic or a documentary, so it delivers its purpose.\r\n\r\n7/10", "created_at": "2016-03-24T13:29:24.583Z"}, {"movie_id": 266294, "review_id": "5af082b7925141768801558a", "rating": 5.0, "review_text": "Sisters tries really hard. Tina Fey and Amy Poehler certainly have chemistry and some of the best moments of the movie come from that chemistry. Still, the film falls flat on its face more than once.\r\n\r\nThe movie is mostly cringe humor. It's filled with one character or another doing something embarrassing. While this can be done really well if used correctly, Sisters seems to hit everything with the cringe hammer until it cries.\r\n\r\nThis isn't really expected, and neither is the abundant use of bodily and sexual humor. There are some great moments in the movie relating to these, as well.\r\n\r\nThe real issue with the movie is it feels like the writers went at it with a list of \"funny\" situations and tried to fit them all into a loose theme. Throwing everything against the wall to see what sticks inevitably means there will be a bunch of junk laying on the floor.", "created_at": "2018-05-07T16:45:43.162Z"}]