[{"movie_id": 7457, "review_id": "52f3216f925141133a09fa07", "rating": null, "review_text": "OK Timberlake fans and haters alike, Calm Down! Largely regarded as \"you know, that movie with Timberlake in it.\" Alpha Dog was enjoyable. And Timberlake did a great job. He is definitely all grown up now. A strong supporting cast of Sharon Stone and Bruce Willis sure didn't hurt. I loved how the cast worked so good together. They were very believable. The movie did a great job of showing us just how crazy and out of control a simple misunderstanding can get. Hopeful Hollywood does force Ben Foster down our throat! Small doses please! NOTE: Alpha Dog has a lot of language in it.", "created_at": "2014-02-06T05:45:19.764Z"}, {"movie_id": 7457, "review_id": "58a9b62cc3a3680be50089e7", "rating": 10.0, "review_text": "Going into this film, I had no idea what it was about, only that it was based on a true story. And the more I think about this fact, the truth behind it all, the more it saddens me.\r\n\r\nThe story that unfolded before my eyes last night is not one I'm likely to forget anytime soon. The characters, as I understand, are eerily like the real life people depicted, and all of the actors have done a great job terrifying me, surprising me, and making me feel sadder than any other film I can remember in recent history. Which is by no means meant to discourage you from watching this film, as I believe it is an absolute must-see for anyone who cares about the society we live in.\r\n\r\nJake Mazursky, an explosively charged skinhead, owes a large sum of drug money to a young thug called Johnny Truelove. After they get into a fight, Jake retaliates by trashing Johnny's house. Johnny then takes revenge by kidnapping Jake's 15-year-old brother Zack. Surprisingly though, Zack is OK with this, as he trusts his brother to come up with the ransom. In the meantime, Zack forms an unlikely friendship with one of Johnny's cronies, Frankie. But then, as fear starts to spread of having to do hard time, Johnny and his allies make a decision that spins the situation horribly out of control...\r\n\r\nThe character of Jake is played by Ben Foster, and I think he did an amazing job. Some people have suggested that he overacted his part, but I disagree. I think he was very convincing as a strung-out, aggressive, creep of a skinhead. Johnny Truelove, the young gangster, is played by Emile Hirsch, and his role is light years removed from anything he's done so far, and he's as equally impressive and convincing as Ben Foster - just as menacing and intimidating. Actually, he appears almost as though it's not a part he's playing, he's really some thug they plucked off the streets and put in front of a camera. Very impressive. This character in real life is known as Jesse James Hollywood, and he is the youngest person ever to be on the FBI's 'most wanted' list.\r\n\r\nZack is played by Anton Yelchin, and he's is everything his character requires him to be; young, naive, even a little endearing, and most of all desperate for a little excitement in his life. The role of Frankie is performed by Justin Timberlake, and I must admit, he was better than I would have initially given him credit for. Actually, there wasn't a single actor or actress who was miscast in my opinion. All roles, big and small, were equally well played. I must not forget to mention the parents: Johnny's father is played by Bruce Willis, and even though his part is small, is it crucial. Sharon Stone plays Zack's mother, in a role that is gut wrenchingly emotional and very well played. Although there is one scene at the end where she wears a fat suit, and it's so obvious that it's distracting, and this is a discredit to an otherwise excellent and very important scene (but that's not her fault, of course).\r\n\r\nWhat makes Alpha Dog so important, I think, is that's it's a testament of the times we live in. A time where, apparently nobody seems to be shocked anymore about the fact that young people in their teens and twenties lead a lifestyle of drugs and guns and no respect whatsoever for other people's lives and wellbeing. The ease with which some ideas and actions are executed, exemplifies and also amplifies the anarchy and devil-may-care attitude that lives within the hearts and minds of these people. Who cares if you beat a person to within an inch of his life. Who cares if you hurt, damage or even kill another human being, just so long as you can save your own neck. It's dog eat dog in the hierarchical food chain that is life, and this film is a disturbing reminder of that. I thought we'd moved on since the Dark Ages, but apparently I'm mistaken.\r\n\r\nAside from the heavy, moral message of this film (which, for once didn't tick me off, but really engaged me), I must also praise it on a technical level. It really is very well made, and it draws you in from the very first second with the beautifully edited opening scene. Director Nick Cassavetes ('John Q') has constructed the story into a balanced, properly paced whole, seemingly letting his actors run free and do what they do best, creating a spontaneous, natural feel and environment. The music is excellent and well dosed.\r\n\r\nAlpha Dog is a film that you must see at least once if you care about this world and the people in it. It is a portrait of frighteningly laconic individuals and the shockingly low bar to unnecessary violence, and it shows just how easy it is for young people to get involved with all the wrong influences, simply because they have not yet lived enough to know any better, or lack the proper role models to show them alternative ways.\r\n\r\nI cannot recommend this film enough. It's heavy - but very, very much worth it.\r\n_(October 2012)_", "created_at": "2017-02-19T15:13:48.533Z"}, {"movie_id": 7457, "review_id": "5d2c1a440745e1000e774417", "rating": 7.0, "review_text": "You ever have that dream: the one where you did something... You don't know why, but you can never go back?\r\n\r\nAlpha Dog is a filmic interpretation of the real life Jesse James Hollywood/Nicholas Markowitz case of 2000.\r\n\r\nWe are in the company of young dope dealers, a group of wannabe gangsters who ultimately are way out of their depth, whose decisions are so moronically misguided they form the basis for what is the tragedy of this story. Directed by Nick Cassavetes, the pic has serious intentions but never quite gets to reach the greatest heights for dramatic verve purpose. Yet for all that, after being in the company of genuine lost boys and girls, watching them as 24 hour party people bluster for majority of the piece, it means that once the tragedy strikes the film has done its job. It becomes something to last in the memory, where Cassavetes' flashy techniques (split-screens - freeze frames etc) don't detract from the harsh reality of it all. There's a bunch of committed exuberant performances on show, with a roll call of then up and coming young actors to note. 7/10", "created_at": "2019-07-15T06:16:36.152Z"}]