[{"movie_id": 1072342, "review_id": "659750cfea37e006fa4d0ab1", "rating": null, "review_text": "The first major release of 2024 has arrived in the form of “Night Swim” and the Blumhouse production looks to follow on the success of “M3gan” and\r\n\r\ntheir other recent hit “Five Nights at Freddy’s”.\r\n\r\nThe movie stars Wyatt Russell and Kerry Condon as Ray and Eve Walter; a married couple trying to raise their two children and deal with Ray’s M.S.\r\ndiagnosis. Ray is a former Major League Baseball player and holds out hope that he can overcome his situation and make a return to his profession even if those around him do not.\r\n\r\nA life on the road has caused Ray to miss many events such as the birth of their daughter as well as be distant from their son. A new job at a prestigious school offers Eve a chance to have the needed insurance for Ray and work to do while she completes her degree.\r\n\r\nThe family opt to purchase a home with a pool versus renting as the ability to finally have some stability and use the pool for therapy is a welcome combination. This is enhanced by the discovery that the pool is\r\nactually filled by a natural water source which Ray believes is healing him and rapidly putting him on the road to recovery.\r\n\r\nThings are not as they seem as the pool holds some dark and deadly secrets that go back for decades and the family soon finds themselves dealing\r\nwith forces beyond their control as they desperately try to survive.\r\n\r\nThe film has an interesting premise though at times I did think about various other films and some of the shock moments failed to get me as they did others in the audience but I am not one who startles easily.\r\n\r\nThe cast was strong but at times I found myself not caring as much for the outcomes of certain characters as I was more concerned with the overall\r\nexplanation behind the supernatural elements of the film.\r\n\r\nDespite this, it was an enjoyable watch that provided something a bit different than the usual monster or psycho on the loose horror film and Co-Writer/ Director Bryce McGuire has adapted his short film well into a\r\nfilm which provides just enough of what the core audience wants to make it an effective horror entry.\r\n\r\n3 stars out of 5", "created_at": "2024-01-05T00:43:59.378Z"}, {"movie_id": 1072342, "review_id": "659af41eca4f6701fe77183c", "rating": 3.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://fandomwire.com/night-swim-review-yet-another-forgettable-january-horror-flick/\r\n\r\n\"Night Swim fails to rise above the limitations of its generic horror foundation.\r\n\r\nDespite commendable performances from Wyatt Russell, Kerry Condon, and the emerging Amélie Hoeferle, Bryce McGuire's reliance on exhausted tropes, predictable jumpscares - even if well-executed - and underdeveloped themes and characters ultimately sink the movie under the weight of its own uninspired narrative choices, namely the rushed ending with frustrating messaging.\r\n\r\nSadly, it's not the film I wish I could use to counterargue the idea that January can't have memorable horror.\"\r\n\r\nRating: D+", "created_at": "2024-01-07T18:57:34.390Z"}, {"movie_id": 1072342, "review_id": "659f9ff9efea7a012edb799e", "rating": 6.0, "review_text": "Wyatt Russell is former baseball star \"Ray\" who has been diagnosed with MS and is now looking for a home for his wife and two children that he can more readily navigate. They alight on a rather run-down property that has a large swimming pool and that's that! In they move and after having had some fairly toxic looking gloop removed from the pipework, discover that it is fed directly from an aquifer and could contain minerals to help his treatment. Boy, does it help! After a few swims his health is improving no end, but his family start to believe that the water is the source of some wickedness. They each experience a malevolence that drives his wife \"Eve\" (Kerry Condon) to track down the previous owner who eventually and rather menacingly confirms what she has already discovered on Google! It appears that this pool has a benevolence but in return requires an horrific sacrifice - whether you agree it's term or not! It's quite a well paced little horror film, this, with no attempt to create much by way of special effects. The audio, flickering lighting and the frequently murky water do all of the heavy lifting as we gradually realise what's going on. The acting isn't really up to much, nor is the standard of the writing, but I still found it at the slightly more threatening end of the Blumhouse scale of scary stories. It will work better in a big dark cinema - on television it will be completely unremarkable.", "created_at": "2024-01-11T07:59:53.660Z"}]