[{"movie_id": 287948, "review_id": "56600011c3a36875ed002259", "rating": 0.5, "review_text": "Its Not Jason Statham, Why Reboot a movie from last week that was already great. Statham is the Transporter, this is just a WOFTAM.", "created_at": "2015-12-03T08:40:49.528Z"}, {"movie_id": 287948, "review_id": "56b37e9392514112b9001271", "rating": 4.0, "review_text": "> It's a women's revenge movie, definitely not a 'Transporter'.\r\n\r\nThere are hundreds of reasons to say it did not look like a fourth film in the 'Transporter' series. One such was the cast, especially the title role that replaced Jason Statham and the rest as well not very convincing. The stunts were just good, but sometimes it was annoying. The overall movie is even worse than the 'Agent 47'.\r\n\r\nFrom now on, this franchise will downgrade if they fail to bring back Statham. Recently plenty of franchise rebooted than ever, so I thought the fever hit for this one as well. But no, it is simply a next installment and worst part in the series from a far distance.\r\n\r\nI'm not against bringing a bunch of fresh faces and crew on board, but the structured planning was not good. The storytelling and especially it is missing the originality, the stylish tone that set by Mr Statham. That's how everyone remembers this franchise. All I wanted was to upgrade to a higher level by carrying the original legacy.\r\n\r\nI think, 'Transporter' is a trilogy. The following ones are simply the B films from the tier-two filmmakers to experiment with their skill under the limited budget. The announcement of the cast and crew for the next film will reveal whether it climb back to its glory or keep falling. But for now, to the 'Transporter' fans, it is done.\r\n\r\n4/10", "created_at": "2016-02-04T16:38:43.218Z"}, {"movie_id": 287948, "review_id": "596ddd4c9251412d7b00a1b8", "rating": 6.0, "review_text": "Ed Skrein doesn't hold a candle to Jason Statham in this role, try though he might. The actual plot is not too bad, with I wouldn't say twists and turns, but maybe the odd curved ball. Some of the acting, though, is attrocious.", "created_at": "2017-07-18T10:05:00.573Z"}, {"movie_id": 287948, "review_id": "639c618993db9200847689ff", "rating": 3.0, "review_text": "Immer dann, wenn Auto gefahren wird ist The Transporter Refueled richtig gut. In allen anderen Szenen leider nicht. Die Kampfszenen wirken undynamisch, die Story ist dünn und langweilig erzählt. Am stärksten fällt allerdings ins Gewicht, dass Ed Skrein eben nicht Jason Statham ist. Statham hat die Rolle von Frank Martin in den Vorgängerfilmen einfach zu stark geprägt und das Reboot kommt nun einfach vielleicht einfach 10 Jahre zu früh, als dass man eine neue Figure in der Rolle bereits akzeptiert. Zumindest einen Lichtblick gibt es neben den Autoszenen noch Ray Stevenson als Franks Vater macht eine gute Figur und sorgt für manch unterhaltsame Szene. Unter dem Strich braucht man The Transporter Refueled nicht zu schauen, es reicht wenn man die ersten beiden Filme geschaut hat. Nun bin ich gespannt, ob die Serie meine Meinung hierzu ändern kann. [Sneakfilm.de]", "created_at": "2022-12-16T12:16:09.638Z"}]