[{"movie_id": 314405, "review_id": "58446d659251416a8000c996", "rating": 8.0, "review_text": "**The flea, the flay and an offspring.**\r\n\r\nIt's shocking to find how much this film was underrated. Certainly it is not a fairytale like from the Disney production. That mean not for the children, but for the adults. Based on the collections of tales by some 17th century Italian poet. All the tales blended together so well, You won't even feel the familiarity with the original tale, because the modifications were at its best. So I appreciate the writer first, and then the director, followed by the actors.\r\n\r\nSince the film has a multiple story narrative layer, like three, the opening and the ending was common to all. But soon after the initiative, the tales go separate ways with its own twists and turns and conclusion, till again falling back in the line to finish it off the film. First a royal couple tend to do anything to have their own child. After many years, having no luck with the pregnancy, they now follow the instruction given by a necromancer. The result is most certain, but not without a negative effect.\r\n\r\nThe desperate couple sacrifices greater to have a child. The remaining story takes place in the few years later where a royal born child and his mother have differences. A fresh complication arises that puts the mother again in a tight spot. How it is going to be solved narrated in the following parts.\r\n\r\nIn the second story, the king of a hill castle is obsessed with his new insect pet. That leads him to neglect his own daughter who is dreaming of getting married and have a great life. But the things are not going well between father and daughter with her mother's absence. When the king comes to realise that, he comes with an agenda to achieve two things in one shot. That does not please his daughter, and soon she ends up in the hands of an ogre. The remaining is to tell us what happens to her in a thrilling way.\r\n\r\nThis is the story of a father's responsibility. If his wife was alive, their daughter would have been taken care at best. Compared to the others, this tale gets more exciting and edgy, even the locations. Of course they have used blue/green screens, but still beautiful like the one from the top of the castle scene. I liked the casting for this, particularly the princess part.\r\n\r\n> \"The equilibrium of the world must be maintained.\"\r\n\r\nThe third tale is about a lustful king. One day when he hears a woman singing in a beautiful voice, the next minutes he lands on her home's front door, not knowing the woman is aged and has the wrinkle skin. But she and her sisters play along hiding behind the door and asks for a favour in order to win them back, I mean one of them. So how the rest of the story develops and who gets what, followed by a twist, it comes to an end.\r\n\r\nIt is a spectacular film. But not visually as the fairy tales told in the present Hollywood films. Particularly, it minimised the computer related special effects. So it was more realistic, yet you will get that fantasy feel with how the tales shape up. It's a black comedy, and that's an absolutely well done part. You know designing the dark humours are not an easy task and this film has three layers, though not all of them has them. The conclusions were so perfect, reminds us the happy and sad are the parts of our life.\r\n\r\nOver two hours long film, there's no drag in the narration. The length is because of the three tales and each one was narrated with a pretty good pace. But still it gives the impression the film is slow and that's for being silent like less background score in the most of the parts. From Salma Hayek to Toby Jones, Vincent Cassel, all were so good. The casting was the advantage for the film to shape up well. Since it is an international project, that will help the global audience to their comfort.\r\n\r\nThe director's first English language film and I think I'm going to keep an eye on his future projects. Certainly I have not seen such film like this, not in the todays cinema. The film was like in the old days. It does not deliver a couple of quick jokes and/or breathtaking visual effects, but the depth of the tale was good. The writers, director did not hesitate to add extra minutes to get what they wanted. I would have liked it if another layer of the tale was included and extended for another 30 or more minutes. For the grown ups, I suggest it not to miss, you won' get a film like this often.\r\n\r\n_8/10_", "created_at": "2016-12-04T19:24:21.989Z"}]