[{"movie_id": 7980, "review_id": "5a3d34280e0a265f7703f852", "rating": 8.0, "review_text": "Most people have probably seen The Lovely Bones by now but I will keep the spoilers to a minimum. This film will always be remembered as the breakout role for the incredible Saoirse Ronan. It will also be remembered as one of the most controversial films ever made. People tend to break off into two camps: Team Salmon or Team Harvey.\r\n\r\nIt starts off innocently enough: a boy-crazy teenage girl in the 1970s is crushing on a man at school. It seems that he is interested in Susie too and despite the disparity in age, she falls for his charms, mostly due to his exchange student allure and suave accent. As the film progresses, it becomes clear that another gentleman is also interested in the nubile teen. His name is Mr. Harvey and he lives in Susie's neighborhood. Unlike the man from school, Mr. Harvey puts in a tremendous amount of effort in an attempt to win the love of Susie Salmon. He builds her an amazing underground clubhouse, complete with all the stuff young people from that era loved. He had beverages such as Coca Cola that he selflessly shared with Susie as they hung out. It became clear that Mr. Harvey, while having great taste in females, was a bit awkward around them. His nervousness around Susie Salmon was evident and she picked up on that. Girls prefer a man with confidence. I also feel that maybe she was turned off because the Coke that Mr. Harvey gave her was warm. I didn't see an ice-filled cooler in the clubhouse anywhere. So I think these factors all led to Susie Salmon losing her patience, which erupted in an unfortunate display of rudeness. Mr. Harvey only had one rule in the clubhouse: Be polite. Susie Salmon broke that rule and the series of events that followed spiraled into one great, big, unfortunate chain reaction. \r\n\r\nThere are no bad people in The Lovely Bones. True, Susie Salmon came off as being a little narcissistic and immature but she was only 14 years old. Mr. Harvey was socially awkward and made some unfortunate choices in life but he had a deep desire to be loved and respected. Despite his talents and generosity, it seemed nobody opened up their heart to him. \r\n\r\nThe Lovely Bones is a film that will force you to take sides. Whether you end up on Team Harvey or Team Salmon, be prepared for an emotional ride. There are great performances all around. 8/10.", "created_at": "2017-12-22T16:34:48.289Z"}, {"movie_id": 7980, "review_id": "5af72529c3a3682ac800074c", "rating": null, "review_text": "This was a very good movie.  I never heard of this movie so i was watching my tv,lazy day so i left this on  my tv and i was really interesting movie.   I will give a 9 out of 10", "created_at": "2018-05-12T17:32:25.717Z"}, {"movie_id": 7980, "review_id": "6163988291745b00932b96f4", "rating": null, "review_text": "Without the rape, from the book, the movie loses all potency and gravitas. In what universe is there a Pro-Harvey/childraping/murderer?", "created_at": "2021-10-11T01:50:58.741Z"}]