[{"movie_id": 508, "review_id": "5680738892514131df00bd2d", "rating": 8.0, "review_text": "God only knows what I'd be without you.\r\n\r\nLondon, England, and it's the run up to Christmas, and we are in the company of a number of couples dealing with the joys and problems that love can bring.\r\n\r\nWe open with a narration from Hugh Grant who tells us that when he is troubled by the hate in the world, he thinks of the arrivals area of Heathrow airport. A place where loved ones greet returning loved ones, a place that indeed showcases a strand of love in its joyous form. He further ventures that when the aeroplanes hit the twin towers on 9/11, as far as he knows, all those phone calls from those sadly involved were messages of love, not hate. Pertinent musings that although somewhat sombre for an opening, sets it up nicely for what Richard Curtis (writer and director) wants to say.\r\n\r\nA roll call of fine British and Irish actors, and American Laura Linney, lend their considerable talents to Curtis' ensemble piece. The structure is surprisingly simple considering the number of stories being woven together, the result being that there is sure to be a story in there to either love, or, yes, even hate. Is it sentimental? Of course. Is it as stuffed as a turkey on Xmas day? Naturally. Does it stretch credibility in some strands? For sure. But only the coldest of hearts could truly decry that Love Actually is all around. Very often it's funny too. Curtis, following on from writing credits such as Four Weddings And A Funeral, continues to show himself to be a very fine writer of comedy. None more so than with Bill Nighy's past his sell by date pop star, Billy Mack. There's something for everyone in here, indeed there's likely to be something that many can associate with.\r\n\r\nIt's a lovely affecting film that should hopefully perk up those that get blue around the holiday season. With perceptive writing, some excellent acting (Nighy, Emma Thomson, Colin Firth et al) and a soundtrack of some worth, Love Actually is a winner. 8/10", "created_at": "2015-12-27T23:26:00.084Z"}, {"movie_id": 508, "review_id": "61007951a84a47002564f9f5", "rating": 7.0, "review_text": "Love Actually coulda been somebody; it coulda been a contender. There were scenes and characters I loved, but the movie was all but ruined by the irritatingly bad bits.  They could have dropped two entire  subplots and raised the quality considerably: I am thinking pf the needlessly crass over the hill singer with the Christmas song competition, and the male fantasy thread about the idiot going to Wisconsin and encountering three shapely nymphomaniacs. The time saved cutting those scenes could have been allocated to Laura Linney’s special needs brother and her infatuation, a plot that just petered out near the end, and to the Emma Thompson character’s marriage, which showed promise but similarly fizzled out with a half-hearted scene at the end. Or they could have given more screen time to Natalie, the prime minister’s love interest, who stole a few scenes and deserved many more.\r\n\r\nSo it was fun in places and touching at other times, and I can just about see myself watching this star-studded near-miss again, as long as I can keep a finger on the fast forward button.", "created_at": "2021-07-27T21:23:29.582Z"}, {"movie_id": 508, "review_id": "635e59208289a00079581734", "rating": 8.0, "review_text": "**Bringing together several plots, the film is not about love, but about Love in its most diverse facets… and not always happy.**\r\n\r\nUnlike most romantic movies, which stick to a sugary story and follow it to the end, with the invariable marriage at the end, and everything in rosy, this movie seems to care more about love itself. , as a feeling. In fact, there are nine sub-plots involved and each one explores a different facet of love: we have teenage love, we have illicit loves, we have unlikely romances, we have love triangles, we even have a love that blossoms without one or the other. speak the same language… and all during the pre-Christmas times! So I won't waste time sifting through each plot, maybe it's for the best.\r\n\r\nThe movie could have gone terribly wrong, but the truth is that it works reasonably well. It's not a film where we can like all the characters, obviously many of them are making mistakes in the name of love, but the truth is that the film brings, with all this, a much more human and realistic tone than others of its genre. : who has never made a mistake because they fell in love, or found themselves in love with the wrong person and with full awareness of it? Even so, and despite the merits, there are indeed some subplots that seem underwritten and poorly developed, and others that I just don't understand why they were added. And I'm not in favor of some of the jokes that were being made, there's some humor that doesn't work, even though the dialogue is good and well written.\r\n\r\nI lost count of the number of great actors that went into this film. It seems that all the good British actors of the decade decided to book a coffee and show up. Some are more prominent, others not so much. Hugh Grant is one of the highlights of the film and he is really good in the role he has been given, and he plays very well with Martine McCutcheon, who also does well in her role. I also enjoyed the performances by Liam Neeson and his teenage stepson, Thomas Brodie-Sangster (who would later break out as an actor in Maze Runner). It is still beautiful to see the way their characters relate to each other and the intimacy that is created between them. Bill Nighy is funny and irreverent, but I didn't understand his subplot here, and Laura Linney is good at what she does, but I wasn't captivated by the character. The same can be said of Keira Knightley (I never particularly liked this actress). Emma Thompson is better, and she does a good job here. Finally, a small word of praise to Colin Firth, and also to my compatriot Lúcia Moniz. It feels good to see someone from our country shining abroad, and to hear our mother tongue in a foreign film.\r\n\r\nThe film is not brilliant on a technical level. Betting everything, or almost, on the script, on the performance of the actors and on the very competent direction by Richard Curtis, the film is not particularly remarkable in these points, assuming a standard aesthetic and having almost nothing at the visual level that surpasses the average. There are, however, some good aspects, related to the scenarios and the choice of filming locations, very well selected and used.", "created_at": "2022-10-30T10:59:44.678Z"}, {"movie_id": 508, "review_id": "657638549451e700e4a98834", "rating": 8.0, "review_text": "Seen this one several times over the years and still so good, though the whole Colin Firth storyline didn't quite connect but cute nevertheless. Just a great ensemble — Alan Rickman, Liam Neeson, Bill Nighy and Hugh Grant were standouts — with plenty of heart and charm with risqué humor that doesn't get gross. Great movie for both Christmas and Valentine's Day. **4.0/5**", "created_at": "2023-12-10T22:14:44.303Z"}, {"movie_id": 508, "review_id": "6578130c4bfa545cfd7877f8", "rating": 7.0, "review_text": "It takes us until the end of this film to realise what the connection is between these people who, with Christmas fast approaching, are having troubles with love lives they have had for ages, have only just started - or just didn't know they wanted at all! Hugh Grant is the Blair-esque British Prime Minister who takes a shine to his assistant \"Natalie\" (Martine McCutcheon); recently widowed Liam Neeson (\"Daniel\") has to come to terms with the adoration his drum-learning eleven year old son 'Sam\" has for a girl at school who is soon to head back to her American home; Colin Firth's rather wimpish \"Jamie\" finds that his relationship maybe just takes the concept of keeping things in the family a bit too far - but perhaps hope is on the horizon in Portugal? Meantime, an on-form Bill Nighy is hoping a re-versioned, shockingly tacky, seasonal version of the Trogs' \"Love is All Around\" will put him and long-suffering manager \"Joe\" (Gregor Fisher) back on the top of the chart; Emma Thompson is facing a crisis of confidence in her marriage to Alan Rickman - a man who seems to be having a crisis of his own with his office assistant/temptress \"Mia\" (Heike Makatsch); Martin Freeman and Joanna Page are gradually bonding while acting out an increasingly detailed series of sex scenes for a movie rehearsal and, well you get the drift. The story is peppered with pithy, observational humour that illustrates quite potently the various stages of love and relationships from loved-up ascendency through routine mundanity with all the concomitant tribulations that make us laugh, cringe and occasionally want to weep a bit. I always had a bit of a crush on Andrew Lincoln ever since he was in the BBC's \"This Life\" (1996) and so his storyline here with newly-wed best friend Chiwetel Ejiofor and Keira Knightley was a bit sad - there are two ways it can go, possibly even three? Laura Linney also features as the overworked \"Sarah\" who has her own crush on colleague \"Karl\" (Rodrigo Santoro) but who also brings some seriousness to the proceedings as she is constantly on her phone, at the most inappropriate of moments, but for anything but frivolous reasons (though this story does rather peter out). This is an amalgam that spins the threads together cleverly and entertainingly, whilst still keeping our eyes open to the realities of so many people who find Christmas a joy and/or a pain. Some storylines work better than others, but I suspect we'd never all agree on which we liked best - and that's a testament to the innovative writing and consistent pacing of this drama. I don't know about the Prime Minister's experiences at Heathrow Airport, but I came through there yesterday and can assure you - there were few feelings of love and affection as everyone battled just to get out - with trolley fights that wouldn't have looked out of place in \"Ben Hur\"", "created_at": "2023-12-12T08:00:12.908Z"}]