[{"movie_id": 127585, "review_id": "53821f910e0a2624cb00a4ab", "rating": null, "review_text": "**Year of release** 2014 **Directed by** Bryan Singer **Written by** Simon Kinberg **Starring** Hugh Jackman James McAvoy Michael Fassbender Jennifer Lawrence Peter Dinklage Ellen Page\r\n\r\n**X-Men: Days of Future Past** (rating: 4 ++)\r\n\r\n**Plot** - In a dystopian future of 2023 where mutant-kind has been all but wiped out by powerful robots known as Sentinels the last surviving mutants launch one final attempt to save their species from extinction. Hiding out in a monastery in China, Kitty Pryde (Page) sends Wolverine's (Jackman) consciousness back in time to 1973. His task is to prevent Mystique (Lawrence) from murdering the Sentinels' creator Bolivar Trask (Dinklage). His murder made him a martyr and ensured that his destructive creation went into production. In addition, Mystique is captured in the process and her DNA used to engineer even more powerful machines. By stopping the murder the hope is that they will change the future and save their species. Seeking out the young Charles Xavier (McAvoy) Wolverine is despondent to find that he is not the man he will come to know decades later. With Xavier a broken man, Wolverine's first challenge is to help him find his old strength. The next challenge isn't one that sits all that well with Xavier; they must break Magneto (Fassbender) out of a prison cell beneath the Pentagon. To do so they enlist the aid of Quicksilver (Evan Peters), a mutant with superhuman speed. With Magneto and Xavier once again standing side-by-side they head to Paris to attempt to stop Trask's murder at Mystique's hands, but will they make it in time?\r\n\r\nIn a fitting move considering the storyline of this film allow me to go back in time to the year 2000 where I can still remember going to see the first X-Men film in August of that year. Hard as it may be to believe, the big superhero film was not the guaranteed box office success they are nowadays. Following the disastrous reception that met 1997's Batman & Robin the superhero genre was on life support, and another big failure could have seen the plug pulled. Thankfully for all us fanboys out there the film proved to be both a critical and commercial success, kicking off a surge in comic book films which has seen them come to dominate the box-office. Well somehow 14 years have passed since then (and I can't quite believe that :eek:) and we now have the 7th film in the X-Men franchise. Now since the solid start of X-Men the series hasn't exactly been the most reliable in terms of quality and has been rather overshadowed by the Batman's, Spider-Man's, Iron Man's and Avengers' of this world. In truth you could probably split the previous 6 films evenly into 'the good' and 'the not so good'; though to be fair to The Wolverine which I'd put in the latter category it's pretty decent. Well as the 7th film in the series this was always set to break the tie and the good news is that it has swung the pendulum very much towards the positive side of things. \r\n\r\nThat said however I didn't find that I was quite as high on the film as many other people seem to be. As seems to be the case for just about every other superhero film these days, the release of DoFP has seen many people instantly jump on the bandwagon of proclaiming this the best superhero film ever. While I certainly wouldn't go that far this is an extremely entertaining entry into the X-Men franchise, and one that continues the upswing of First Class. The film does open in absolutely thrilling fashion and ends quite strongly as well. In between these wonderful bursts of action though I just found that the film had a tendency to fall into a lull on a couple of occasions. With its complicated story the film has to spend a lot of time trying to keep things clear for the audience, which sadly results in the situation and the stakes being reiterated time and time again. It just threatens to get bogged down by becoming overly talky, derailing the momentum and in general I didn't feel it was as well paced as Captain America: The Winter Soldier for example. An additional action sequence or two I don't think would have gone amiss. I also feel that it perhaps lacked the colour, energy and sense of fun of X-Men: First Class. Some of that comes from the fact that I didn't feel DoFP embraced its period setting to the degree that First Class did which on more than one occasion felt like a Sean Connery Bond film. A few snazzy outfits and some brief touches upon the Vietnam War aside I don't think it really exploited the 70s era to the fullest. And I think the Vietnam sequence was actually amongst the film's weaker moments; an unnecessary detour which could easily have been left on cutting room floor.  \r\n\r\nAs I mentioned, the opening sequence of DoFP is a terrific way to kick the film off; in fact I think its got to be one of the best opening gambits of any superhero film. The film instantly drops us right into the middle of a Sentinel attack upon the X-Men in the future; making for an absolutely thrilling opening. It's a wonderfully creative sequence that features  some genius choreography as the hitherto unknown Blink (played by Fan Bingbing), with her ability to create teleportation portals, emerges as one of the most visually dazzling mutants we've seen so far throughout the series. It's a terrific set-piece that the film arguably never matches for the next two hours, at least in terms of action and excitement; there is a sequence however that is fantastically entertaining which we'll get to later. The big finale then aims to be and mostly achieves feeling like a suitably epic affair that encapsulates Sentinels, the White House and the RFK sports stadium. At the same time the film is also jumping back and forth between this and the future where the Sentinels have once again launched an assault upon the X-Men. The only problem, and one that is in complete contrast to other superhero films such as Man of Steel, is that I didn't feel its concluding battle was quite long enough. The two competing sequences feel like they are slightly lacking in action and drama, and are over too soon.\r\n\r\n**Film Trivia Snippets** - In reference to the X-Men member Kitty Pryde, and her importance to this particular film, DoFP was shot under the working title of “Hello Kitty.” /// Days of Future Past is based on a storyline of the same name that appeared across two issues of Uncanny X-Men in 1981, and was written by Chris Claremont. It is now the fourth film to be based on a story penned by legendary X-Men writer Claremont. X2 was adapted from 'God Loves, Man Kills'; X-Men: The Last Stand was based on his 'Dark Phoenix Saga'; and The Wolverine was based on his comic of the same name. In the comic the future world was set in the year 2013, the same year in which filming for the movie version began. /// The bullet wounds that appear on Wolverine's chest on his arrival to the 1970s is in the form of the Big Dipper. This is an homage to the 1980s anime series, Fist of the North Star, whose protagonist Kenshiro has the same scar pattern on his chest. /// Prior to making the film, Bryan Singer had a two-hour discussion with James Cameron abut how to make a time-travel concept feasible and workable within the film. Thanks to Cameron's experience as the director of The Terminator and Terminator 2 the two discussed concepts including alternate universes and string theory (a field of quantum physics that define multiple universes). /// It's quite clear just by looking at the credits that this is one hell of a cast that's been assembled. If you're looking for more proof however then how about this; the four main female X-Men in the principal cast (Halle Berry, Jennifer Lawrence, Ellen Page and Anna Paquin) are all Academy Award nominess, while the six principle male cast members (Hugh Jackman, Michael Fassbender, James McAvoy, Ian McKellen, Patrick Stewart and Peter Dinklage) are all Golden Globe nominees.\r\n\r\nWith such a prestigious cast at Bryan Singer's disposal it's no surprise to find that performances across the board are generally of a high standard. Though the sizeable cast means that not everyone gets an equal chance to shine; Halle Berry's involvement for example is little more than a cameo. In fact I'm struggling to think if she even had a single line throughout the whole film or if all she did was make it rain a little bit. And the whole future ensemble are almost completely sidelined, meaning that the established regulars are given little to do other than spout some exposition, while the various new additions (Bishop, Blink, Warpath, Sunspot etc) are given absolutely no introduction whatsoever so we have little reason to care about them or mourn their demise. In fact for the majority of them I'm not even sure there names are known until we get to the closing credits. The lack of exposure given to the future timeline was certainly a disappointment. As a result it's in the past where the most noteable performances come from with solid efforts coming from Lawrence, Fassbender, Jackman etc. However the one individual who is able to stand out from the crowd for me would have to be James McAvoy who I thought was just excellent as the young Charles Xavier. The fact that he is given the strongest characterisation and the most to work with certainly helps. We initially find him as this supremely broken individual who is in great pain both physically and emotionally, but with help from Wolverine he is able to find his way back onto his path. \t\t\r\n\r\nThe two most notable additions to the X-Men world this time out were Evan Peters' Quicksilver and Peter Dinklage's Bolivar Trask. And as it turns out the end result for both was completely flipped from what many were predicting beforehand. The promo images for Quicksilver had fanboys already sharpening their knives before the film had even hit cinemas, ready to tear into him with the kind of fervour reserved for Batsuit nipples and Ben Affleck. And yes I have to say that his appearance still comes across as rather bizarre and stupid, kind of like Julian Assange as styled by Lady Gaga. As a character however he kind of kicks ass, his introduction arguably being the coolest addition to the franchise since Alan Cumming's Nightcrawler back in X2. And just like Nightcrawler had with his incursion into the White House, Quicksilver is given the spotlight all to himself at one point to really make a name for himself. This time it's a break-out from the Pentagon where his incredible speed comes into its own with a terrifically fun and inventive set-piece that allows him to steal the film from his more illustrious co-stars before sadly disappearing shortly afterwards. The way he is just written out is rather disappointing and feels like it's only been done to help free up space for everyone else. It does however leave the audience wanting more, so it's good news that he's going to be starring in X-Men: Apocalypse. My only concern about the character is whether they've actually made him too powerful. They show his abilities as being so strong that you imagine he could destroy any mutants, even the likes of Magneto and Xavier, before they even had the chance to respond.\r\n\r\nThe real disappointment amongst the cast is Dinklage's Trask. Now Dinklage is a great actor, no doubt about that, and I think he personally does good work here. It's just that the character he is lumbered with here I felt was a little bit dull to be honest (particularly for the film's supposed 'big bad'), giving him very little to really sink his teeth into. That also creates one of the film's few main flaws in my eyes; the lack of a strong villain. Trask kind of takes the place of Senator Kelly from the first X-Men film, but that film also had Magneto and his Brotherhood of Mutants as villains. While the future X-Men do face off against the considerable threat of the Sentinels they are a fairly blank entity devoid of an actual character or personality that can interact with the X-Men. Which is not to say they are not effective foils for our mutant heroes, you just get the feeling that there should be big bad in charge of deploying and controlling those machines. In terms of design the Sentinels may disappoint and likely anger the real X-Men fanboys out there, baring little resemblance to their comic book counterparts. In fact they aren't a million miles away from The Destroyer as seen in the first Thor film. However I don't think there's any denying that they most certainly do make an impact; in fact they are rather chilling, unsettling creations. The fact that the X-Men suffer some very violent, nasty deaths certainly heightens that feeling.\t\r\n\r\n**Film Trivia Snippets** - Bryan Singer talked about \"changing history\" in an interview with Empire Magazine(May 2014). The director stated \"I don't want people to panic about us erasing the movies. I believe in multiverses,\" explaining the possibility of certain events as they would be part of the history of alternate universes. /// In the \"Days of Future Past\" comic it was Shadowcat (Kitty Pryde) who went back in time; in the film it's Wolverine. According to writer Simon Kinberg, Kitty was intended to be the time-traveller but it didn't work out: \"Kitty in the era of young Magneto and Xavier, would have been negative 20 years old. The reflex response to that was a character who doesn't age. Wolverine is the only character who would look the same in 1973 as he does in the future.\" Thus, Wolverine was picked for being an ageless immortal character who would bridge past and future. /// To create the sensation of Quicksilver's incredible speed ability Bryan Singer filmed his scenes in a special format of 3600 frames per second. This means that Quicksilver will be moving 150 times faster than normal. /// Josh Helman was originally going to be cast as a young Cain Marko/Juggernaut. But Juggernaut was written out of the film, and Helman was offered the role of a young William Styker. /// Bryan Singer based Bolivar Trask on Adolg Hitler; “As Hitler used the Jews as a scapegoat to bond the darker parts of Europe, he's doing the same thing with mutants. But he wasn't a six foot, perfect blond Aryan - he was a short, funny looking fellow!” \t\t\r\n\r\nNow considering the fairly dense and complicated storyline that encompasses two timelines and what feels like dozens of characters I think that the film's writer, Simon Kinberg, actually does a fairly commendable job of keeping everything in some kind of balance and managing to just about ensure that it all makes some kind of sense. And considering the twisted mess of continuity that he has had to deal with it would perhaps be unfair to poke holes at it. But hey these are films for comic book fanboys, what do you expect but for us to nitpick! :D The film is still unable to address a few niggling questions, perhaps because that continuity mess makes it almost impossible to actually do so. However questions still linger such as how exactly is Charles Xavier still alive after being killed off in X-Men: The Last Stand? What's the deal with Wolverine's claws and their constant shifting back and forth between adamantium and bone? Still no explanation as to why Xavier and Mystique didn't appear to know each other in the original trilogy, but were so incredibly close according to these films etc. The script has to spend so much time just trying to establish the story that there is little chance to focus on the actual characters at its heart. As someone who loved the Magneto-Xavier relationship and interaction in First Class that's a shame. And it feels like there is barely a single line of dialogue in the whole film that isn't exposition\t\r\n\r\nThe script also fails to address a few new issues, just completely glossing over them perhaps in the hopes that we just won't notice. For example when and how exactly did Ellen Page's Kitty Pryde get the ability to send people's consciousness through time? And perhaps it's just me but the whole plot point (and it's a very important one) about Mystique's blood being so vital in the development of the Sentinels seems rather vague and questionable in its logic. If they were going to go down that route I feel Rogue would have been a somewhat more logical choice given that her ability is to replicate the powers of other mutants, not just change her physical appearance. It kind of came across as them just trying to shoehorn Mystique into being as important as possible to the film, largely inspired you suspect by the meteoric rise of Jennifer Lawrence since First Class. In fact with Hugh Jackman getting on in years, and his days as Wolverine coming to an end, the search is on to perhaps try and find the new face of the franchise. With Channing Tatum set to take on the character of Gambit he seems like a decent bet to take over that mantle. However with Days of Future Past they certainly seem to be positioning Jennifer Lawrence as another possibility to take on the role if she were to extend her current deal. I doubt anyone would ever have predicted Mystique being pushed to the fore in such fashion. Oh and just as another little nit-pick; was I the only one who thought the make-up job for Mystique looked rather s*itty this time out? I think it looks a lot more fake now than it ever did even 14 years ago.\t\t\t\r\n\r\nJust a few more thoughts to wrap up. After the fresh start that was First Class, bringing Wolverine back and once again making him a central figure feels like a little bit of a step back. While he's only had two official solo films this almost films like the 6th Wolverine-focused film we've now had in the series. And if you're going to bring him back I think you should at least use him correctly. His strongest feature for me is as a brutal, kick-ass warrior, but DoFP actually gives him surprisingly little opportunity to unsheathe those iconic claws of his, placing him more in the role of a diplomat trying to keep the peace between Magneto and Xavier. The fact that the film kills so many of the mutants introduced in First Class offscreen I found quite disappointing. And the use of Blink's portals aside I didn't think the film quite captured the same team dynamic that was present in First Class, with several of the team going off on solo missions or taking their enemies out all by themselves. And now a couple of other little things that I liked. While we get to see very little of it the wasteland that the Earth has become in the future dystopia is a very effective and stirring touch, and one that evokes the future war as seen in the Terminator films. Oh and one little touch that I really loved was the film recreating newreel footage of the decade to match actual footage from the era. It comes off looking like the Zapruder JFK film. \r\n\r\nAmongst fans of superhero films, 2008 is seen as a bit of a holy grail for the genre; the release of both The Dark Knight and Iron Man, two of the most acclaimed and loved entries so far, gaining it that reputation. 2014 has so far seen the release of two great efforts (The Winter Soldier and Days of Future Past); if Guardians of the Galaxy lives up to the promise of its trailers then we could have a new contender for that title of comic book movie's holy grail year. \r\n\r\n**Conclusion** - I know I've been pointing out a lot of flaws with the film in this review (perhaps as a response to all the gushing over it) but the truth is I did still find it to be an extremely entertaining addition to the X-Men series. As a result of some of those flaws however I'm not quite as high on it as many other people seem to be. For the moment I would have it in 2nd place amongst 2014's superhero flicks behind the excellent Captain America: The Winter Soldier, and after one viewing it would slot into 3rd place amongst the X-Men films.\t\r\n\r\nOne thing I should definitely add however is my condition when watching it. As I have been for a great deal of time recently I wasn't feeling particularly great when I went to watch it; feeling rather run-down and a bit yuck. So that perhaps hindered my enjoyment slightly,meaning there's a chance that score could rise on a repeat viewing.\t\t\t\r\n\r\n\r\n\r\n**Bonus Film Trivia** -  Patrick Stewart and Ian McKellen were performing in a touring production of \"Waiting for Godot\" when Bryan Singer approached the actors about reprising their respective roles as Professor X and Magneto. According to McKellen, both men were utterly shocked as they thought they'd passed their roles on to James McAvoy and Michael Fassbender, and would never play the characters again. Both Stewart and McKellen were delighted to return to two of their most popular roles, and to work with the younger actors playing the same characters as well. /// When Matthew Vaughn was going to direct, he was going to make the film a direct sequel to X-Men First Class and have it set in the 1970s. Early ideas included an opening with the Kennedy assassination being caused by Magneto, and mutant encounters set in the Civil rights movement/the Vietnam War. When Singer took over, he integrated these concepts into a viral marketing campaign to set up the action of the film. In this alternate history, Magneto is arrested and imprisoned for the assassination of Kennedy, but maintains his innocence. The \"Bent Bullet\" Theory (a reference to the real life \"Magic Bullet\" Theory criticized by conspiracy theorists) holds that the Warren Commission determined that Magneto manipulated Lee Harvey Osawld's bullets to kill the President in retribution for the murder of the mutants Azazel and Tempest by the CIA. Conspiracy theorists, based on Magneto's testimony, insist however that Magneto had tried to prevent the murder of Kennedy, and that the true shooter was not Oswald, but Mystique in disguise who, with the help of Emma Frost framed Magneto, and manipulated Jack Ruby into later murdering Oswald. The theory also posits that Mystique offered to double as Kennedy in an attempt to grab power, all of which backfired horribly, leading to anti-mutant hostilities.", "created_at": "2014-05-25T16:51:29.835Z"}, {"movie_id": 127585, "review_id": "53f11deac3a3685aed0030f2", "rating": 6.0, "review_text": "Not as good as the previous X-Men movies but it has a pass... Jennifer Lawrence doesn't even get close to Rebecca Romijn. Also, Michael Fassbender and James McAvoy are really far from their senior characters performed by Ian McKellen and Patrick Stewart but the rest of original cast from first 2000's movie are great, as always.", "created_at": "2014-08-17T21:26:02.298Z"}, {"movie_id": 127585, "review_id": "543a3207c3a368198900215d", "rating": 8.0, "review_text": "This is a good and very enjoyable movie which, to me, was a bit surprising since I generally find that time travel is akin to sticking your foot in some messy and smelly stuff. It almost always screws up the movie in some way or another. This one was not without its faults but it did survive becoming too screwed up by it.\r\n\r\nThe opening scenes are indeed somewhat impressive throwing the viewer directly into an apocalyptic future where mutants as well as human are rounded up by sentinels. I could not help but think about Terminator during these scenes. Maybe not very original from a general point of view but the dark and gloomy opening was not the opening scenes I would have expected from an X-Men movie.\r\n\r\nThen we, unfortunately, dive straight into some time travel when they send Wolverine back to 1973. This is of course a opportunity to make yet another twist of the mutant scare, mutants hunt, a good mutant is a dead mutant etc. story that we have seen in so many movies now. The main adversary changes but the general story idea stays the same and the arguments for hunting down the mutants are as silly as ever. Quite frankly, I find that angle a wee bit overdone and boring by now.\r\n\r\nLuckily the story is fairly well implemented. The scene were Wolverine wakes up and disposes of the three thugs are rather funny. Pretty standard stuff but pretty funny nevertheless. The part where they retrieve Magneto is quite nice and the scene down in the Pentagon where the guards and everything else is “frozen” while Maximoff calmly walks around and rearranges things is outright hilarious.\r\n\r\nI quite disliked the cheap twist where Magneto just decided to go amok and screw things up just when they were about to retrieve Mystique though. They could have spent some time coming up with a better way to twist the story at that time. The idiotic stuff with Wolverine getting a fit at the same time was just adding to my annoyance with that scene. This part is the main reason I will not give this movie a top score.\r\n\r\nApart from this scene the movie is a very well done superhero movie with lots of nice special effects. Sure it is also rather predictable but most people, including myself, do watch these movies mostly for the effects after all. As long as the plot is not downright stupid it get to pass.\r\n\r\nTime travel. Okay, I have to harp a bit about time travel. I do not like it in movies because there are too many things that just does not add up. In this movie it is not too bad and most of the time the actual time travel aspect is kept out of the action. Wolverine goes back in time, does his stuff with a lot of action, and saves the day. Sure the dialog often comes back to the “I’m from the future” aspect but not much more. One thing annoys the hell out me though. Wolverine affects a lot of events while he is back there but not a single things seems to change in the future until one single event passes at the end of the movie. Then everything changes and it is happy ending. That is the kind of nonsense that time travel in movies ends up with.\r\n\r\nBottom line is that this is a very enjoyable movie. Without the rubbish plot twist in the middle it would have gotten 9 or 10 stars.", "created_at": "2014-10-12T07:47:19.203Z"}, {"movie_id": 127585, "review_id": "5af723cac3a3682acb000a92", "rating": null, "review_text": "ok..i like all the x-mens except the last one.  Logan.   That was horrible.  a 8 out of 10 for this", "created_at": "2018-05-12T17:26:34.531Z"}, {"movie_id": 127585, "review_id": "5bf4dfa70e0a26265e0b324c", "rating": 9.0, "review_text": "***Focuses on the best characters and an interesting story***  \r\n\r\n\"X-Men: Days of Future Past\" (2014) starts in an apocalyptic near-future where mutants are being wiped out by Sentinels, government-made robots created for this very purpose. The X-Men and Magneto decide to send Wolverine's consciousness back to his body in 1973 to prevent the Sentinels from attaining their mutant-killing powers.\r\n\r\nThis is easily one of the best X-Men films because of the interesting plot and the focus on the most interesting characters. Wolverine (Hugh Jackman) has been the top X-Men since day one so you can't go wrong with making him the focal point. James McAvoy and Patrick Stewart are excellent as Professor X, as are Michael Fassbender as young Magneto, Jennifer Lawrence as Mystique and Evan Peters as Quicksilver, the latter in a small but highly entertaining role. Nicholas Hoult as Beast gets an honorable mention and Bingbing Fan is notable as Blink, particularly her stunning face. \r\n\r\nThe plot is convoluted and yet easy to follow if you're familiar with the franchise's story arc. The film is all-around compelling. It has the confidence to slow down and be pensive while throwing in the requisite thrills and not forgetting to be entertaining. For instance, the creative and amusing way Quicksilver takes down a bunch of security guards at the Pentagon, which is one of the movie's top scenes. Lastly, I like the way Magneto’s great power is illustrated (you’ll see what I mean).  \r\n\r\nThe film runs 2 hours, 11 minutes and was shot in Québec, Canada. \r\n\r\nGRADE: A", "created_at": "2018-11-21T04:31:35.207Z"}, {"movie_id": 127585, "review_id": "63a9e0cae4b576007a96f311", "rating": 7.0, "review_text": "So in the best spirit of \"Terminator\", the X-Men conclude that the best way of securing the future is to send \"Wolverine\" (Hugh Jackman) into the past to try to stop history from causing the demise of both human and mutant alike. Why? Well that's because they realise that modern science, which has created the unstoppable robotic \"Sentinels\", is capable of destroying all in it's path - and them fighting each other will merely ensure they all end up going the way of the dodo. The task assigned to \"Wolverine\" is to try and convince the 1973 version of \"Mystique\" (Jennifer Lawrence) upon whose DNA these metallic creations are based, to co-operate - and that is not going to be an easy task. Especially as she has no idea that she is the crucial source of their genetics. This is easily the best of the series for my money. The amalgam of new and old cast deliver the best, meatiest, of the stories efficiently and entertainingly. \"Wolverine\" takes the lead but there is plenty of scope for the other characters to shine, use their powers, have a bit of romance and generally keep this 2¼ hour action adventure moving along quickly. We are spared much of the repetitive close-combat scenes that Jackman's character usually delivers; the visual effects are lively and vibrant and the denouement offers a degree of food for thought amidst the chaos and mayhem. Great to watch on a big screen and well anchored by the (slightly side-lined) Thespians, this is well worth a watch.", "created_at": "2022-12-26T17:58:34.877Z"}, {"movie_id": 127585, "review_id": "63b30f6e391b9c008b9fadfa", "rating": 10.0, "review_text": "**X-Men: Days of Future Past leverages time travel to bring its expansive universe and different casts together for one of the most powerful and entertaining superhero epics ever made.**\r\n\r\nDays of Future Past was the pinnacle of the 20th Century Fox X-Men franchise. It beautifully unites the original cast with the First Class cast in one of the best X-Men comic book stories. The story feels urgent and high stakes right from the beginning, with the world destroyed and only a small band of mutants fighting to survive and try to prevent this apocalyptic future. The time travel plot of the film allows Hugh Jackman to interact with McAvoy and the young X-Men but also bring back the older cast and correct some of the franchise's past mistakes. Evan Peters' Quicksilver offers some of the movie's best moments with his silly but technically stunning scenes. Seeing Stewart and McKellen back and seeing their performances contrasted with McAvoy and Fassbender was incredible. With great highs like X2 and First Class and disappointing lows like Last Stand and Dark Phoenix, Days of Future Past rises as the best X-Men movie and one of the best comic book films of all time.", "created_at": "2023-01-02T17:07:58.646Z"}]