[{"movie_id": 46689, "review_id": "659846407d5504014d0482b4", "rating": null, "review_text": "Nominated for best documentary for the Academy in 2012.\r\n\r\nI don't know if I could be wrong but some of the the reviews here are very negative from those who live in Brazil. The point of view is valid from what people say negatively about documentaries, but I also agree with another aspect - in the same way that the impact of knowing that your painting is worth so much more than you as a person in a landfill, it also shows the perspective that things can be different if you believe and fight for it, no matter how small the fight - growing in literacy, courses, and other things that I don't think people read that changed on the lives of those shown as is stated at the end of the film.\r\n\r\nHe didn't take advantage of these people's lives, I believe he had a purpose and followed through by donating the profits from sales back to them. Many times, to pursue something in life you need to have something to ignite the change in your perspective and that's what he at least tries to do, something most people don't even try (as several ones that criticize his work here). As a note, Jardim Gramacho was closed in 2012 after operating for 35 years and providing compensation to the collectors and the waste was sent to the Waste Treatment Center in Seropédica.\r\n\r\nThe president of the collectors' association Tião fought for their rights, in numbers around 5,000 of them, to have investment in training for new roles in 15 years in addition to unemployment benefits and around 15 thousand reais in compensation for each one.\r\n\r\nIn other words, it's not exactly like everyone returned to their previous life - or in other words, learn to research and read before giving opinions.\r\n\r\nVik is not a dazzled one as many people try to portray him - the son of people from Pernambuco who migrated to São Paulo, he managed to attend FAAP and moved to NY in 1983 at the age of 22, speaking almost no English, after being shot in the leg by an accidental bullet while trying to help the victim of a fight at a party - took the compensation money received and went to live in suburban Chicago with a maternal aunt, working various minor jobs (as a butcher shop cleaner) until deciding to move to the East Village in NY looking for minor jobs associated with art until having their first success in 1988.\r\n\r\nBecause of his dyslexia, Muniz's grandmother read him the Encyclopedia Britannica, the only book they had on the shelf. At age seven, Muniz could read but could not yet write and instead, he began to draw compulsively in his notebooks and developed a writing system that only he could understand.\r\n\r\nIn 1975, at the age of fourteen, Vik Muniz earned money repairing televisions, and around the same time a teacher saw his drawings and recommended his participation in a state-sponsored arts festival held among public schools.\r\n\r\nAs a result of his unparalleled talent, Muniz participated in this competition and won a partial scholarship to study at a drawing and sculpture academy (FAAP). As he recalls, his three years learning to draw and model geometric solids and nudes taught him almost everything about art. (content from arteref.com website).\r\n\r\nIn other words, understanding the person's context helps to understand the work and the artist's original intention...or to learn to red what the pre credits scene did tell.", "created_at": "2024-01-05T18:11:12.279Z"}]