[{"movie_id": 9799, "review_id": "5cd31b19c3a3683697dfba3a", "rating": 7.0, "review_text": "***Kinetic, “hip” street-racing flick with Vin Diesel and Paul Walker***\r\n\r\nA newbie to Los Angeles (Paul Walker) falls for a café host (Jordana Brewster) while trying to join a street-racing gang led by her brother, Dom Toretto (Vin Diesel). Meanwhile the LAPD are trying to apprehend a radical group on the highways that targets semis and their valuable cargo. Michelle Rodriguez is on hand as Dom’s babe while Matt Schulze plays an angry member of his gang.\r\n\r\n“The Fast and the Furious” (2001) was the beginning of the popular street-racing franchise that currently has eight movies with two more planned. The over-the-top action is akin to “The Road Warrior” (1981) while the tone mixes the comic book melodrama of “The Warriors” (1979) and “Torque” (2004) with the more serious air of “Grand Canyon” (1991) and “Training Day” (2001). (Yes, I realize “Torque” and “Training Day” debuted after this one; I’m just providing comparative references). \r\n\r\nSpeaking of the tone, there’s no goofiness and the actors take everything dead seriously, which is good in my book, but the flick has several unintentional laughs because, while quasi-realistic, the thrills & posing are so exaggerated.\r\n\r\nBrewster and Rodriguez are effective in the feminine department, but neither do much for me personally. There are a few good-looking ladies in the periphery, however.\r\n\r\nThe soundtrack contains several dynamic urban numbers, including the excellent “Deep Enough” by Live.\r\n\r\nThe movie runs 1 hour, 46 minutes and was shot in Los Angeles & nearby areas (San Bernardino, Hemet, Malibu, Westminster, Beverly Hills, etc.).\r\n\r\nGRADE: B", "created_at": "2019-05-08T18:08:25.852Z"}, {"movie_id": 9799, "review_id": "5d2f1f836a300b0010a7df36", "rating": 10.0, "review_text": "I can’t call this film a legend. The film, which gave a big push in such a concept as street racing and tuning cars. He raised interest in illegal races on the night streets, gave life to such a renowned game like Need for Speed: Underground, which in turn gained countless fans. And maybe the storyline is really simple and without frills, but its implementation is worthy of deep respect.", "created_at": "2019-07-17T13:15:47.709Z"}, {"movie_id": 9799, "review_id": "63002c5edfe31d00800ff51c", "rating": 7.0, "review_text": "Point Break with cars! Sure it is a little cheesy but in the best way. Fun cast and fun premise. Diesel, Walker, Rodriguez, and Brewster deliver a great movie.\r\n\r\n**Once again, Point Break with cars. Do you need more?**", "created_at": "2022-08-20T00:35:42.099Z"}, {"movie_id": 9799, "review_id": "64f2e5b7caa50800ab72d42f", "rating": 6.0, "review_text": "To be honest, the thin plot doesn't really matter here. This is just a good excuse for some fit people who look great to race souped-up production cars at break-neck speed around Los Angeles. Eye-candy Paul Walker (\"Brian\") and hardened \"Dom\" (Vin Diesel) look like they are truly pumped up for their roles and given neither have much by the way of dialogue to remember, they just get on with it. The soundtrack is irritating but the production and stunt work match the high octane pace of the film and I quite enjoyed it.", "created_at": "2023-09-02T07:35:19.593Z"}]