[{"movie_id": 68726, "review_id": "51e86ad719c29529911b8687", "rating": 8.5, "review_text": "First I want to say I liked this movie. I was surprised, I've been hearing bad reviews but I can't see big problem. The only issues was with the story. Apart from that the graphics where very good. The actors where okay (no major actors) and the baddies (no spoilers) where well thought out and graphically impressive (same for the robots).\r\n\r\nAll in all a good movie.", "created_at": "2013-07-18T22:23:19.500Z"}, {"movie_id": 68726, "review_id": "51ec25ca19c29551fb0f6f70", "rating": 9.5, "review_text": "When monstrous, building-sized creatures (dubbed \"kaiju\") hell-bent on destruction begin pouring out of an extra-dimensional fissure at the bottom of the Pacific Ocean, humanity bands together to build titanic mechas called jaegers, each controlled simultaneously by two pilots whose minds are linked through a neural bond called \"The Drift.\" As the kaiju get stronger and the signs point to an all-out flood of the beasts, the fate of humanity looks bleak, and the surviving jaegers are brought together for one last-ditch attempt at saving the world.\r\n\r\nAfter an agonizingly long five-year wait, filled with some heartbreaking starts and stops (like the almost-weres of The Hobbit and At the Mountains of Madness), Guillermo del Toro has finally returned with his biggest budget and story yet. The Mexican master of fantasy returns to the toybox of his youth, drawing from the kaiju films of old (Godzilla, Gamera, Mothra, and the like) and anime to create the modern-day monster movie we didn't even know we wanted.\r\n\r\nI am a genre man through and through, and del Toro's films are filled with both the intelligence of the best of science fiction, fantasy, and horror and a flawlessly-rendered vision unique to him. His innate knowledge of what makes those outlandish stories truly matter to us is the backbone of his work as a writer and director, and his visual style is one that invokes true wonder.\r\n\r\nIt's that wonder, that childlike glee that makes Pacific Rim work so well, and well it does work. This is a brawny, massive film made by a true artist and auteur at the top of his game, but while the technicals of this film could have been mounted by any number of working directors, the magic of Guillermo del Toro is that he infuses every film with himself. His love of the material, whatever it may be, shines brightly through every frame. It is this complete sincerity that makes his films such a joy to experience, and even when there are 250-foot behemoths slugging it out on the screen, there's not a trace of the disastrous irony or cynicism so readily supplied by other blockbusters anywhere to be found.\r\n\r\nThe cast gamely comes to play, with Idris Elba (TV’s Luther) as Stacker Pentecost (one of my favorite character names of all time) as the stoic leader of the jaeger program, Charlie Hunnam (TV’s Sons of Anarchy) as former pilot Raleigh Becket, who suffered a tragic loss and has to be convinced to return to jaeger service, and Oscar-nominated Rinko Kinkuchi (Babel) as Mako Mori, another life touched by the kaiju and ready to serve up some righteous fury. If these sound like tried-and-true archetypes, it’s because they are. This is a grand, epic war film on a bigger scale than anything ever attempted before in that genre, and one of the strokes of genius from del Toro and original writer Travis Beacham is that we instantly establish and identify with the characters onscreen. There are so many ideas flying around (monsters, mechas, neural bonding, kaiju culture, and many, many more) that the broadly-drawn characters serve as a perfect anchor for the audience, immediately relatable in their inherent humanity.\r\n\r\nIt seems that the mission statment of this movie was, in a word, “texture.” Del Toro delivered a visual feast unlike any other big spectacle films, with his insistence on it not looking like a “glossy car commercial.” Instead, every frame is filled with rain, snow, scuffs, smoke, debris, and other visual elements that reflect the weight and dimension of these cyclopean combatants. Unlike the ultra-glossy (and emotionally irrelevant) Transformers films, or virtually any other modern big-budget actioner, this universe feels dirty, grungy, and lived-in, like the original Star Wars trilogy.\r\n\r\nIn fact, dubbing a film “this generation’s Star Wars” has been overused to the point of robbing the phrase of all meaning. But Pacific Rim feels just like that. It invokes those most elusive of emotions in the modern studio film: wonder, awe, and sheer enjoyment. Do you remember the awe you felt upon seeing a Star Destroyer creep onto the screen? Discovering a brachiosaurus on Isla Nublar? Laying eyes on the verdant fields of Middle Earth? This film has that. No one builds worlds like del Toro, and here he is, the master, inviting you to play in his sandbox with him. Grab your favorite action figure and hop in.", "created_at": "2013-07-21T18:17:46.827Z"}, {"movie_id": 68726, "review_id": "51f3a8df19c2955ef000469f", "rating": null, "review_text": "My favorite movie for years!!!I absolutely love this movie!No big story.A lot of action.The only bad thing is all the fights are at night & in the rain.A bright daylight fight would have really made it great!!!", "created_at": "2013-07-27T11:02:55.428Z"}, {"movie_id": 68726, "review_id": "5470872e9251417066002723", "rating": 7.0, "review_text": "This movie has almost everything that is expected from it so just relax lay back with the pop corn and your soft drink and enjoy.\r\n\r\nJust to make noticeable the remarkable few amount of females featuring in the movie and how bad is that Travis Beacham and Guillermo del Toro just copy Evangelion's idea without giving anything back.", "created_at": "2014-11-22T12:53:02.725Z"}, {"movie_id": 68726, "review_id": "5a5c53e30e0a260da00065c7", "rating": 7.0, "review_text": "I have to say that I enjoyed this pure special effects movie quite a lot even though the plot is totally ridiculous. Clumsy giant robots beating at alien beasts with their fists should be better than modern tanks and airplanes with modern explosive and armor penetrating weapons? As I said, a ridiculous story. Well it does not really matter does it because the story gives an excuse for some real cool special effects loaded action. Giant robots and alien Godzillas in the same movie. Cool, simply cool.\r\n\r\nOnce you have gotten past the silliness of the story it is a very entertaining rollercoaster ride of action. The scenes where the robots and aliens go head to head is visually very enjoyable. Sometimes they make you laugh as well. For instance the scene where Gipsy Danger (one of the robots) drags a cargo ship after it to use as a club.\r\n\r\nUnfortunately a somewhat somber mood is set right from the start by the fact that the Jaeger program is discontinued. Not because they are really defenseless as the movie blurb states but because dumbass politicians wants to save money as usual. Instead they build giant walls that are subsequently breached in hours. As I said, dumbass politicians. I guess they wanted to put some realism into the movie!\r\n\r\nAs much as the robot and alien action is tremendously enjoyable I think some of my favorite scenes are the ones with Ron Perlman as Hannibal Chau. I have always liked Ron Perlman and he is simply outrageously (as in funny) wacky as Hannibal Chau.\r\n\r\nThe one thing I did not like with the movie is the ludicrous nonsense statements about the dinosaurs being the first attempt at an invasion. Whoever wrote that must be an idiot. Worse, the fact that it made it into the movie means that someone believes that the audience are idiots. When it then was followed by some green-religious crap that the atmosphere was not right for them then but that we have now “terraformed” earth for them by our pollution it was at least a star off just for that. I hate it when they put crap like that in the movies. It is an insult to the audience.\r\n\r\nAnyway, despite the dinosaur nonsense I found it a very enjoyable movie. Without that it would have received a near top rating but as I said, it is at least a star off due to that crap.", "created_at": "2018-01-15T07:10:27.678Z"}, {"movie_id": 68726, "review_id": "5a972408c3a3686151004e4d", "rating": 5.0, "review_text": "Watching a CGI heavy movie 5 years following its release doesn't sound like such a hot idea, but in the case of Pacific Rim nothing really drew me out of the experience in terms of aging animation.\r\n\r\nHowever, the film itself was an 'okay' at best. Aside from the spectacle CGI fights of giants robots versus giant alien monsters it doesn't offer anything of value. This is one of those movies you can safely keep on your second monitor and zone out in between the set piece fight scenes.", "created_at": "2018-02-28T21:50:00.615Z"}, {"movie_id": 68726, "review_id": "63b30b7b0102c9008114688e", "rating": 6.0, "review_text": "**Pacific Rim is outrageous and cliche but loads of fun if you embrace it for what it is: insane robot/monster action.**\r\n\r\nPacific Rim is a ridiculous action monster movie that is a lot of fun if you have the right expectations. It’s a film about giant rock em sock em robots fighting giant Godzilla-like monsters, filled with shallow characters, goofy dialogue, great thrills, and exciting action sequences. Charlie Day’s wacky scientist was exceedingly annoying, but then you also have Idris Elba’s inspiring gritty performance of Stacker Pentecost in the same film. Those two performances perfectly define the movie as one of extremes. Extreme robot monster action. Extreme goofiness. All mixed in together for a unique movie worth a watch but not the movie hall of fame.", "created_at": "2023-01-02T16:51:07.473Z"}, {"movie_id": 68726, "review_id": "63b81f8724b333008536395e", "rating": 7.0, "review_text": "**It could be so much better with some logic.**\r\n\r\nGuillermo Del Toro is a good director, but he seems to be learning too much from Tim Burton instead of forging his own path. I really liked some of his films, especially “Pan’s Labyrinth”, but this film, despite its merits, has nothing to do with that and doesn’t even seem to be from the same director.\r\n\r\nThe best thing about this film is the extremely high production values. Visually, the film is amazing and it's really nice to watch. We've got great visuals, stunning cinematography, and an absolutely immersive dose of high-quality CGI. In addition, the film has very well-made sets and costumes, thought out in detail and indisputably expensive. The special effects department, despite all the computer graphics used, also had a series of good opportunities to show its value, and it never failed to do so. The editing is good, the cuts are barely felt and the pace of the film is extremely pleasant. All good reasons to see the film, which was a great blockbuster.\r\n\r\nDirector Del Toro, I have no doubt, had the courage to take a risk on a film that looks like nothing I've seen of him. However, and as I said, he is good, he is creative, and he is a perfectionist in his work, assuring us of an impeccable job in this film. The cast has great actors, and all of them were at the best level. Idris Elba is, for me, the most notable and the best of them all, but I also appreciated the efforts of Rinko Kikuchi and Charlie Day. The worst performance came from Ron Perlman, but this is largely due to the poor conception of the character, who is a crude caricature of a common drug dealer with no taste. Charlie Hunnam, honestly, was an actor that I completely missed. I felt that not only did he lack the charisma and ability to hold the audience and be the protagonist, but he also lacked the skills for the task.\r\n\r\nI deliberately left the script for the end because, for me, this is where all (or almost) of the film's problems lie. The script is based on an alien invasion of Earth: coming from the bottom of the sea, aliens take the form of gigantic monsters, forcing the entire planet to unite and create metal monsters capable of breaking their faces. The first problem is the illogicality of these premises: how and when did aliens arrive in our world, and how could they penetrate the Earth's crust? This is not explained, nor how countries funded the construction and maintenance of such metallic machines, nor how they manage to walk and fight in an ocean as deep as the Pacific. How did they withstand the heat of the planet? How did they withstand the pressures on the ocean floor? The battles against the monsters almost always take place in the coastal area next to the big cities, threatened, in a clear allusion to films like “Godzilla” or “Transformer’s”. The dialogues also lack any kind of authenticity. The movie simply makes up for it all with tons of action.", "created_at": "2023-01-06T13:17:59.060Z"}]