[{"movie_id": 787, "review_id": "5e206dcbf04d0100150fd553", "rating": 6.0, "review_text": "Mr. & Mrs. Smith explodes with flaming chemistry but assassinated its own script. “Brangelina”. Without Liman’s standard action comedy, we wouldn’t have had the power couple that dominated the tabloids. Several children wouldn’t have been adopted and brought up in a completely different, yet financially stable, environment. Jolie wouldn’t have been the charitable humanitarian she is now. And Shiloh’s first baby photograph wouldn’t have amassed over ten million dollars worldwide. Wow! Suffice to say, the two most beautiful humans in Hollywood have a substantial amount of gratitude to show Liman for his efforts in pairing them. If only his energetic vibrancy was enough to power the lacklustre screenplay, the balance of action and comedy could’ve been a landmark within the sub-genre. A bored upper middle class married couple are astonished to learn that they work for differing assassination organisations, soon to be assigned to kill each other.\r\n\r\nIt’s your standard marriage. Winning a teddy bear at a carnival, falling in love whilst buying the most expensive mansion on the street, succumbing to the same mundane daily routine, destroying the house with an almighty shootout followed by a gas explosion, participating in the feistiest erotic love-making scene ever and naturally ending in marriage counselling. A cruel irony for “Brangelina”, maybe they should’ve watched the film they made together? Cynicism aside, what truly elevates the memorability of this feature is the onscreen (and offscreen, bow chicka wow wow...) chemistry of its leading stars. Jolie and Pitt are exceptionally effortless with their comedic timing, dramatic endeavours and high-octane action. The lightning-fast wit that they inject into Kinberg’s less than impressive script is nothing short of, well, impressive. They make the film. They are the film. And they certainly have solid taste in curtains.\r\n\r\nLiman maintains a light tone throughout, never dabbling into the cracks of the marriage which is vital for retaining a fun buoyancy. This isn’t an analysis on marital breakdown. It’s just a tongue in cheek slice of entertainment.\r\n\r\nHaving said that, despite the tantalising chemistry of its leads, you never quite feel that they are truly in love. Unfortunately, Kinberg’s script is so vacuous in emotional conviction, that both Smiths resemble roommates than a married couple. Understandably the marriage is stale as they conform to their upper middle class lifestyle, but even when they fight and makeup, there’s no real connection. I yearn to see Jolie and Pitt lust over each other. The momentum essentially grinds to a halt after their house explodes, with Kinberg’s script focussing on a central plot point involving “The Tank” and an onslaught of heavily armed operatives raiding a department store. Attention for the splendid couple instantly dissipated with a third act that seemingly refused to end, ultimately losing the acute fun that preceded the underwhelming conclusion. The whole “keeping up appearances” act was tossed out of the smashed window, and that was the sole element that made the film incredibly fun.\r\n\r\nMr. & Mrs. Smith doesn’t conclude with a divorce, as it is sensible light entertainment for the vast majority of its runtime, yet the concluding act and poor screenplay prevent the marriage from flourishing fully. Angelina Jolie man! I would abandon my homosexuality for her...", "created_at": "2020-01-16T14:06:03.922Z"}, {"movie_id": 787, "review_id": "6077a48b2a09bc005791f608", "rating": 5.0, "review_text": "Average performances, average script. What did you expect?", "created_at": "2021-04-15T02:27:23.759Z"}, {"movie_id": 787, "review_id": "626ab2ab9824c80064245f0a", "rating": 7.0, "review_text": "Been a long time since I last watched this and while not great, was certainly entertaining thanks to the charisma and chemistry between Pitt and Jolie and the action from director Doug Liman was well done. Kind of had a weird ending with no resolution with their respective agencies going after them. **3.5/5**", "created_at": "2022-04-28T15:28:43.787Z"}, {"movie_id": 787, "review_id": "63c24ac0a5743d00dd552f99", "rating": 7.0, "review_text": "**Mr. & Mrs. Smith’s experienced director and cast make it the peak of the spy versus spy romantic comedy genre.**\r\n\r\nMr. & Mrs. Smith shares a similar romantic spy versus spy plot as movies like This Means War, Killers, and Knight and Day. However, a significant difference is that Mr. & Mrs. Smith came out 5-7 years before the rest and is hands down the best of the group. Doug Liman was coming off his enormous success with The Bourne Identity and landed two of the biggest stars in Hollywood (especially at that time) to lead his next big spy action thriller. The script is a little clunky, but Jolie and Pitt’s chemistry and charisma carry the film. Car chases, explosions, hand-to-hand combat, gun fighting, and pretty much every other action movie element permeate every moment of the film with short pauses to laugh at Vince Vaughn’s ridiculous banter. The movie might be a little outrageous, but it’s a fun take on the spy genre from a director and actors who have proven they know the genre well.", "created_at": "2023-01-14T06:25:04.070Z"}, {"movie_id": 787, "review_id": "6473309a5cd16e00dc3de014", "rating": 10.0, "review_text": "This is another one of those greatly nuanced movies people just don't get. Viewers are expecting another run-of-the-mill action film so that's all they look for, and in doing that they miss so much more! The interplay between the characters, the subtext and the layering you can only fully appreciate after absorbing the film in its entirety is a thing of beauty. If all you get out of this is the action then I'm afraid that says more about you than the movie.", "created_at": "2023-05-28T10:44:42.769Z"}, {"movie_id": 787, "review_id": "64b86de61d53860101e689ba", "rating": 8.0, "review_text": "Awesome movie, and lots of action. I love how they try to hide that their in the same occupation from each other. Until they both end up going for the same person then things start to change.", "created_at": "2023-07-19T23:12:38.231Z"}]