[{"movie_id": 157354, "review_id": "54208a700e0a26577f000139", "rating": 8.0, "review_text": "I never saw its teaser, nor read its synopsis, but straight went to see it. And I kind of not satisfied for the first hour of the movie. I just wondered what was the movies' idea to fulfill the viewer's desire. Right away I knew it was not an entertainer, then it must highlight something or give a message. Till the beginning of the end, I thought the same way. Then my perspective changed, actually it changed my previous stance about all the earlier narration.\r\n\r\n**''I know y'all are upset, but got to lift him up.\r\nLet's keep him lifted up.''**\r\n\r\nAfter witnessing the crucial last scene, I was stunned by the incident that was portrayed in the movie. Realized all the initial developments were got meaning in this part of the movie. So I came to know it was based on the real incident. First of all it was not a person's whole biography, though it is told from his critical time of life. The incident can be viewed in two ways. The fight definitely took place on the sub-way, it was not the Oscar Grant's (lead man) fault. But still the consequences are expected, especially on the new year's eve the alert against violence cannot be negligible by the law. But, what cops did was the over reaction to the situation.\r\n\r\nSuch incidents happen in every country and many of them won't come into the lights. I'm glad about this movie, because it kind of creates awareness of such events. Hats off to all the cast and crew who brought it into the silver screen and now the whole world can know the truth. A must see movie among the 2013 releases.", "created_at": "2014-09-22T20:45:36.634Z"}, {"movie_id": 157354, "review_id": "6041a61622df2e006f7bc4a5", "rating": 8.0, "review_text": "A very good film about an upsetting true event.\r\n\r\nMichael B. Jordan (Oscar) nails it in the lead role, he gives an impressive portrayal. There are a few other good performances, the most notable to me being from the excellent Octavia Spencer (Wanda) - yet to see a bad showing from her. Melonie Diaz (Sophina) is notable, too.\r\n\r\nThe story is told in a straightforward but still highly meaningful way, there are a couple of times where you could argue it's too on the nose but even then it still gave me that dreadful feeling in the pit of my stomach. The ending, meanwhile, is tough to forget due to Spencer's performance.\r\n\r\n<em>'Fruitvale Station'</em> is well worth a watch.", "created_at": "2021-03-05T03:31:34.684Z"}, {"movie_id": 157354, "review_id": "63ef888435818f0081d2f481", "rating": 8.0, "review_text": "Fruitvale Station is the heartbreaking story of Oscar Grant’s unjust murder by the hands of law enforcement. It is impossible to talk about this film without discussing the landscape of America today. This film was released in 2013, the murder occurred in 2009, and yet this same exact story is flashed on our timelines on a monthly basis. Nothing has changed. It is sick and disgusting that we live in a country where police can brutalize American citizens without any repercussions. We need change! For Oscar Grant, for George Floyd, for Breonna Taylor, for every American who has been murdered by the officers sworn to protect us…\r\n\r\nAs for the movie, Ryan Coogler handled this topic beautifully, showcasing the life of Oscar Grant and the beautiful aspects of his family, friends, and personality. It was paced well, allowing the audience to form a deep bond with Grant, which makes the ending all the more tragic. There is fantastic cinematography and amazing performances from the entire cast. Michael B Jordan is superb, giving an incredibly nuanced performance by having a rough and manly exterior with a soft and kind inside. His drive to good for his family is shown by not only his actions but by his facial expressions when he interacts with his daughter. It was stellar. The emotional scenes are impactful, and they linger for an uncomfortable period of time, letting the gravity of what occurred sit with you.\r\n\r\nOverall, no matter how great this film is, it should have never needed to be made and that is the true tragedy of Fruitvale Station.\r\n\r\nScore: 81% |\r\nVerdict: Great", "created_at": "2023-02-17T14:00:36.155Z"}]