[{"movie_id": 799379, "review_id": "63649da70d2f53007acd3a7b", "rating": 6.0, "review_text": "Project Wolf Hunting has a lot going for it.  It offers a rather unusual mix including horror/sci-fi and crime genres. Its well acted, well paced but and this is no small \"but\", its also, excessively violent.\r\n\r\nI had a hard time watching this one, without feeling, at times, somewhat queasy. This could have worked far better had they had dialled back the bloody, gruesome violence and death. \r\n\r\nTo my mind its brutality does this film no favours and will, I suspect, turn off a lot of viewers, who might have otherwise found this an enjoyable, action filled romp.\r\n\r\nIn summary, if you have the stomach for it, this is an entertaining film but its goriness is overdone and starts feeling oppressive, even to those of us, with a hardened constitution.", "created_at": "2022-11-04T05:05:43.893Z"}, {"movie_id": 799379, "review_id": "6429144f9cc67b059cc462e1", "rating": 8.0, "review_text": "I recently saw a trailer for the South Korean horror movie Project Wolf Hunting and it looked interesting, so I added it to my LONG to watch list. But I didn’t think I would be able to see it anytime soon because I didn’t expect it to be streaming yet. To my surprise it showed up on HOOPLA so I knew I had to watch it. I am so glad I did. It was a fun, gory ride.\r\n\r\nThe Plot:\r\n\r\nProject Wolf Hunting is set on a cargo ship between the Philippines and South Korea. On board are several dangerous criminals and cops guarding them. A dangerous escape leads to them unleashing something far dangerous.\r\n\r\nPositives: \r\n\r\nHave I mentioned that Project Wolf Hunting was gory? There is a ton of blood and graphic kills. I have quite a few favorite kills but I won’t spoil them now.\r\nThe plot. I like the story. \r\nIt’s very action packed.\r\n\r\nNegatives:\r\n\r\nThe plot. I like the story, I wish they would have gone more in depth with the backstory of some of the characters.\r\n\r\nI thought this was a really fun ride where you never knew who would live and who would die. There’s plenty of blood and gore to satisfy anybody and plenty of action to keep the story going. I definitely would recommend watching this movie. On a side note, I hope they make a sequel. I would definitely watch it if there is one.\r\n\r\nMy rating:  3.75/5", "created_at": "2023-04-02T05:36:15.945Z"}]