[{"movie_id": 269149, "review_id": "56e4290b92514172c7001002", "rating": 9.0, "review_text": "One of the best movies Disney has created in the last years. Smart plot with a great background topic talking about the differences, stereotypes, prejudices and joining the tendency of giving women more important roles.\r\n\r\nIt has still several gaps to fill and enhance on the latest point but it is, IMHO, a milestone in the right direction.\r\n\r\nThe characters work pretty well and it is funny when needed and not too full of cheesy songs.", "created_at": "2016-03-12T14:34:51.433Z"}, {"movie_id": 269149, "review_id": "5752fa5d925141187e0021a6", "rating": 8.0, "review_text": "> Try everything (but differently). So Disney has done it again.\r\n\r\nThis beautiful animation came to exist because of coming together of the directors of 'Tangled' and 'Wreck-it-Ralp'. It is Disney who had once again done it, since their rival Pixer is going down in a rapid speed. As a Disney fan since my childhood, I'm very happy for their success in live-shot films and animations, especially for this one.\r\n\r\nOkay, since the revolution of 3D animation over 20 years ago after overthrowing the 2D animation, most of the big productions like Disney, Pixer and Dreamworks with few others never failed to deliver. Believe me, I was not interested in this film when I first saw the teaser and trailer. But they have done great promotions and so the film did awesomely at screens worldwide. I was totally blown away after seeing it, Disney's another unique universal charactered story. From the little children to the grown ups, everybody definitely going to enjoy it.\r\n\r\nAll kinds of animals coming together happens only in cinemas, and that too mostly in animations. But todays kids are very sharp who ask lots of questions, so they had a fine explanation for the doubts regarding putting animals in a same society. It was like the United States, where everyone came from different continents and represents different race. And so in this film every animal came from different land to live together peacefully in a city called Zootopia.\r\n\r\nSo the story begins when Judy the rabbit follows her dream to become a police officer in Zootopia. There she meets Nick the fox, who are actually arch-rival species in the wild, but it was thousands of years ago before adapting the civilisation. So trust is what not promised between them, but they're forced to work together after a small missing person case becomes their prime agenda. Solving the mystery is what brings the end to this wonderful tale.\r\n\r\nThese days animations are not just concentrated on comedies, trying to get us emotionally as well. Maybe that's how they're grabbing the adult audience, especially the families. Shakira's cameo was the highlight, and her song 'Try Everything' helped the get attention from all the corners.\r\n\r\nThe Oscars was concluded just a couple of months ago, but it already feels like the fever is gripping again for the next edition and looks like this film is leading the way for the animation category. I know it's too early, but I hope it wins it. And finally a request for the Disney, bring it on a sequel as soon as possible.\r\n\r\n8/10", "created_at": "2016-06-04T15:57:17.183Z"}, {"movie_id": 269149, "review_id": "57a718b3c3a368255b0017d8", "rating": 10.0, "review_text": "Zootopia is the latest family animation movie from Disney about a young bunny determined to be a cop at all costs  – in a land where only 'predators' are cops, she would be the first ‘prey’ cop. Seriously? Anyway, she puts on the hard work and makes it to the land where anything is possible.\r\n\r\nZootopia makes some good real life comparisons: Zootopia itself seems to look like New York, even including a hustle by a sly fox.  Racism seems to be ever present in both color and speech. But the best thing about Zootopia is Judy’s positive attitude and relentless determination to succeed.\r\n\r\nThe animation is as good as a Pixar animation – perfectly made  – and the story is well told, full of action scenes and funny moments. Kids will definitely love this one and grown up kids will enjoy the deep thought provoking tones set in this movie. \r\n\r\nThe best performance in this movie arguably comes from Police Chief Bogo whose voice is played by Idris Elba. His performance should earn him an Oscar this year! No wonder it has grossed 1 Billion dollars worldwide despite little marketing. \r\n\r\nRated 9 out of 10 only because we cannot give it a 10.", "created_at": "2016-08-07T11:17:07.921Z"}, {"movie_id": 269149, "review_id": "57acf08792514158770001ed", "rating": null, "review_text": "A great movie with a great message. Read my full review here.\r\n\r\nhttp://www.hweird1reviews.com/allreviews/zootopia-review", "created_at": "2016-08-11T21:39:19.096Z"}, {"movie_id": 269149, "review_id": "57cc1a8fc3a3680a58003dab", "rating": 7.0, "review_text": "_Zootopia_ leans pretty hard on a few tropes that I absolutely detest, but even I can't deny that this animated family movie succeeds spectacularly at what it set out to do: Entertain all audiences, young & old, and deliver an important moral centre without detracting from its engaging plot. Something rarely achieved by the medium outside of Pixar. And even Pixar has had a few missteps the past years.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2016-09-04T12:58:55.310Z"}, {"movie_id": 269149, "review_id": "58b3fded92514177d1016987", "rating": 9.0, "review_text": "This is a really, really good animated family movie. It is a perfect blend of funny characters, decent story and little jokes spread around in the animation.\r\n\r\nAlmost all characters are very likable and funny, each in a different way. The actual story has quite a bit of suspense (for an animated family film) while still being sufficiently light and funny. Actually it is kind of two stories. One is the story of Judy Hopps fighting to prove herself as a police officer and the other is the more sinister evil plot that she attempts to unravel.\r\n\r\nThe movie moves at a good enough speed leaving enough room to both tell the story itself and inserting jokes and comical situations. The two bureaucratic sloths were quite fun already in their first scenes but the last scene with them at the very end of the movie was absolutely hilarious.\r\n\r\nThe animation itself was certainly adequate although I sometimes miss the old hand drawn animations from Walt Disney.\r\n\r\nOverall, one of the better, if not the best, animated movie I have watched in quite a while.", "created_at": "2017-02-27T10:22:37.733Z"}, {"movie_id": 269149, "review_id": "58c16f5c925141732f00b2c6", "rating": 8.0, "review_text": "This film is named 'Zootopia' in the US but the title was changed when it was shown in the UK. I thought it is a very good children's film. Very well animated. Colourful. Really cute animals.\r\n\r\nIt is a great parable about tolerance and racism which could be seen as a mirror to the xenophobia in society today. The story is of a rabbit called Judy Hopps who overcomes diversity to become a police officer in the city of Zootropolis (Zootopia). This is a very tough city full of crime and only strong predators take charge. Judy must help to solve the case of predators disappearing around the city but needs to fight her colleagues' prejudices at the same time.\r\n\r\nThe jokes are funny and the story is intriguing. The film contains lots of references to other films which will keep viewers of all ages happy (including a very funny Breaking Bad spoof).\r\nThe voice acting is very good and each actor perfectly adds to their character.\r\n\r\n★★★★", "created_at": "2017-03-09T15:06:04.310Z"}, {"movie_id": 269149, "review_id": "5a1514b592514178bc00868e", "rating": null, "review_text": "Zootopia is an allegorical tale which subtly takes on vast topics like racism, politics and society. It explores these underlying philosophical themes in a rather humorous manner! Everything, right from the characters to the storyline, is just top notch!\r\n\r\nIt’s similar to George Orwell’s Animal Farm, just the underlying issues are different in this one. It’s definitely worth watching! \r\n\r\nOverall, Zootopia is a brilliant movie! I would give it a rating of** 4/5**", "created_at": "2017-11-22T06:09:57.114Z"}, {"movie_id": 269149, "review_id": "5d129e06c3a36870fc1e5af8", "rating": 10.0, "review_text": "Why I find Zootopia revolutionary\r\n==============================\r\n\r\n1. The creative design of the titular city, and the astonishing world building.\r\n\r\n2. Using colors and deliberately simple animation not just to make the movie appeal to children, but also to indicate the so-called ideal city of Zootopia where every animal is pure and innocent.\r\n\r\n3. Blending more than one genre into a single animated film while keeping the plot spotless and not messy.\r\n\r\n4. Delivering many contemporary messages and tackling some quite touchy timely themes that have never been explored in an animated film before. And by giving the priority to the center message, that of prejudice, nothing felt muddled and all over the place, since no message overshadowed the other.\r\n\r\n5. Using the on-the-surface message (achieve one's ambition) as a characteristic of the main character (Judy Hopps), not as the actual main message. That makes this message works as a motive not as a major theme in the movie as in, for instance, Wreck-It Ralph (I LOVE it, though ♥).\r\n\r\n6. Avoiding being over-sentimental, although Nick's character could have been easily used to manipulate our feelings.\r\n\r\nThis movie is an absolute masterpiece. Not only because its wonderful way that gives its many messages in, but also because the importance of its messages in themselves, and how smart and relevant they are. Today, children really need to be taught these morals.\r\n\r\nThe talented cast's voices fit their characters perfectly. It has a plenty of funny scenes littered with extremely hilarious jokes which we haven't heard before in any animated movie, or even in a live-action movie. This movie blends so many genres: Comedy, Adventure, Action, Crime, and Mystery. That said, you will never feel confused while watching it.\r\n\r\nThe characters are definitely some of the most complicated characters I've ever seen in an animated movie. Each character has its own point of view due to the experiences they had, and thus makes each character has different motives and feelings.\r\n\r\n(10/10)", "created_at": "2019-06-25T22:19:50.620Z"}, {"movie_id": 269149, "review_id": "5f53bf32665408003208d62a", "rating": 8.0, "review_text": "I like <em>'Zootopia'</em>, it's much better than I had anticipated.\r\n\r\nFirst off, the animation is superb - as we expect from Disney of course, but that doesn't change the fact. Ginnifer Goodwin (Judy) leads the cast very well, while Jason Bateman gives the most memorable performance as Nick. Idris Elba and Jenny Slate (not Edie Falco or Constance Shulman, as I initially guessed... just me? Probably) are good too.\r\n\r\nThe premise is actually my favourite part of this film. I'm not saying it's anything revolutionary, but it actually feels fresh throughout - I enjoyed seeing it play out, it's paced perfectly. There's a nice <em>'Breaking Bad'</em> reference in there, too.\r\n\r\nAn entertaining 2016 animated film, one that also has a positive message. Recommended.", "created_at": "2020-09-05T16:39:14.218Z"}, {"movie_id": 269149, "review_id": "6593c4c0651fcf5eba8fce33", "rating": 7.0, "review_text": "Bunny rabbit \"Judy\" is determined that she is going to be the first of her kind to make it into the ranks of the \"Zootropolis\" police force. Her boss, \"Bogo\" is not so enthusiastic, so it's lucky that an otter has gone missing and that she can promise his wife that she will track him down! As she delves deeper into the mystery, she encounters the street-smart fox \"Nick\" and together they gradually uncover a plot to turn the city's predator population into dangerous menaces and that that scheming runs all the way to City Hall! It's now up to these two to put aside their mutual suspicions and work together if they are to thwart this dastardly plan! The story itself, here, isn't really anything new - but along the way some effort has been made to create some fun characterisations. Not least the painfully slow sloth doing the vehicle checks, the sheepish assistant mayor \"Bellweather\" as well as just about every beast from jungle and pasture alike. The script is often quite funny allowing the partnership to evolve at quite an entertaining pace and there are plenty of escapades en route to the slightly left-field denouement... Unlike many of it's Disney contemporaries, there has been investment in a solid story and it comes across well in this enjoyable and characterful family drama.", "created_at": "2024-01-02T08:09:36.976Z"}]