[{"movie_id": 265712, "review_id": "55898e8e92514152dc0007da", "rating": 7.5, "review_text": "> No gadget can edit the future, only hard work does.\r\n\r\nHonestly, I am not a Doraemon fan, I did not grow up watching the series. I was hooked up to the Cartoon Network and its all the shows. But this one, they never aired it, so I am not familiar with. However, I had a few glimpses while passing by when my niece watching it on the television set. She loves it and she draws it. It was an English dubbed version though, that did not excite me a much. Officially, this movie was my first encounter with this what millions of children love, Doraemon. I really, really liked it, almost loved it. Feel regret that I should have known it before the movie because it was so good like those I'd enjoyed in my childhood days.\r\n\r\n3D anime is a new market. It is an easy production compared to 2D animation where digital 3D is an optional advantage. That does not mean the regular Anime is losing its trade, but recent Studio Ghibli's decision to halt in production makes suspicious. Look, what has 3D animation done in Hollywood, a rapid growth in last ten years shrunk the 2D animations. The last film I remember I saw was 'The Princess and the Frog'. On one side, I am delighted because we are advancing, but in another it is very sad that Cartoons are losing its honour. The bright side is, all those flat characters we loved in our days are reshaping in the 3D avatar. The great successful example is the latest 'Asterix and Obelix' movie. 'Popeye' and many other films are too in the line, so something to cheer!\r\n\r\n\r\nFirst of all I did not know Doraemon is a science-fiction, in fact, I thought Doraemon is some kind of talking toy, like in the movie 'Ted'. Fans, don't mind, I am just a beginner, but quickly learning. The only criticism I heard so far from the Doraemon fans was that the story was not new, they have already seen it in the anime short version. This film was not a follow-up to any earlier films are TV series. It was a fresh beginning like from the scratch that really helped me to understand and would do same for anyone who are unfamiliar with this. It was based on the six Doraemon manga short stories. You would easily find splits between those parts while changing the phases, but overall, a fine assembles.\r\n\r\nUnlike television series, this Japanese Academy Award winner for Animated movie is for all. That mean adults as well can enjoy it besides the kids. There are many special things about the movie. Obviously it is very humorous, but unexpectedly so romantic and emotional with the matured materials used to tell the tale, even for the kids it is something to learn from. I loved many individual scenes, because those were not just beautiful and funny, but very clever indeed. Especially the end twist makes 'what the heck!', yet simple charmingly smart. Instantly I became the Doraemon fan, and now I want a sequel.\r\n\r\n> It's hard saying goodbye. But...\r\n> It's harder thinking that I'll be making her unhappy. \r\n\r\nThe character Nobita was just like the one from 'CJ7' who is obsessed with his new beneficial friend. Because he is not good at anything, sometimes he begins well, but ends it in a disaster, so he always depended on the gadgets from his beloved robot cat. Besides, he's lazy and always get bullied by his classmates Gian and Suneo. But he do has a crush on a girl called Shizuka, a brainy student Hidetoshi stands between him and her. Now he has a competitor and to win her heart, which as well helps to fix his future, whatsoever he must work hard. Those efforts are pleasantly illustrated in the movie.\r\n\r\nI liked all the 3D converted characters, especially Shizuka was so cute. Doraemon looked little bigger and like a giant blue ball, in a nice, funny, acceptable way. The same energy was maintained from the anime, like the law of gravity is not applicable. Such as in situations when someone jumps in the air, he stays there for a while when he/she was in joy or shocked and tears drip sidewards. That's the difference between 2D and 3D animations, but it worked well in this film. After all, that's why the animations are for, making impossible to possible. Animals can talk and they can be our (generally children) hero. I enjoyed it as much any kid does. This movie is a revolution in Doraemon's history, an opportunity to get in to meet these adorable characters in the beginning itself if you're alien to this. I know Doraemon fans love it, hope others as well do the same.\r\n\r\n7.5/10", "created_at": "2015-06-23T16:51:26.967Z"}]