[{"movie_id": 380111, "review_id": "585ea158c3a3681a6500e731", "rating": 7.0, "review_text": "**There comes a time for everyone to prove their worth.**\r\n\r\nThe Russian disaster film, partially inspired by the 1980 film of the same name. One of the film to do good business outside the domestic market, particularly in Japan and China. So there are lots of great stuff about it, from filmmaking to the box office and I enjoyed watching it, but did not like it as overwhelmingly. That does not mean it is overrated, but I liked it less, that's all.\r\n\r\nIt is set to tell the story of life of pilots, their personal life, such as trouble with romance, family issues and tackling obstacles in their professional line, especially when they were needed the most. So in the first half it was all about drama, an introduction to what comes in the latter half. A pilot father struggling with his troublesome teen son. And another pilot who got fired from the Russian air force, now in a private airline where he meets a woman, but having a difficulty to stabilise the relationship.\r\n\r\nWhen the second half begins, the narration completely flips. Like it is a different film, particularly brings attention to the action- adventure fans. Fate brings them all together in a plane and they decide to evacuate people who are stranded in an airport near the Alaskan region island when it was hit by volcanoes and a series of earth quicks. The remaining is to reveal the heroic acts by the pilots and Co.\r\n\r\n> \"He's a pilot gifted by God. My hands are only hands, his hands are wings. I have never seen anyone like this before.\"\r\n\r\nVisually, it was good. All those crucial parts of the graphics were rendered neatly. Even the stunt sequences were composed so well. But some of them were unrealistic. That's very common, even for a Hollywood film, so I think it's not a big deal. My issue was the film length. It was over two hours long and I did not like much of the first part. The next half was quite good, because of its thriller. When I thought it's over, the narration surprised with another adventure followed by in the final segment.\r\n\r\nLike usual this Russian film too has been built on the corruption plot. Not the whole film, but in the initial stage. The influenced people who target the honest employees for going against them. Really a good theme, but when the disaster part takes over, everything will be forgotten. Then it gets edgy, so that's where you will forget the time and sit straight to enjoy it. If you had seen plenty of similar heroic films, then it will be another okayish type. If not, you will have a good time with it.\r\n\r\nIt took an hour to get into action-adventure, but in those times, it failed to build the romance part to its best. I'm disappointed with that since it had fine actors and situation to build on. The Father- son duo looked much better. In the second half, nothing of these sentimentally appealed as it should have been, not for me. Because it became more a heroic type with sacrifice than family and relationship influence. So overall it's a good attempt, a nice film for the weekend watch.\r\n\r\n_7/10_", "created_at": "2016-12-24T16:24:56.362Z"}]