[{"movie_id": 135397, "review_id": "55910381c3a36807f900065d", "rating": null, "review_text": "I was a huge fan of the original 3 movies, they were out when I was younger, and I grew up loving dinosaurs because of them. This movie was awesome, and I think it can stand as a testimonial piece towards the capabilities that Christopher Pratt has. He nailed it. The graphics were awesome, the supporting cast did great and the t rex saved the child in me. 10\\5 stars, four thumbs up, and I hope that star wars episode VII doesn't disappoint,", "created_at": "2015-06-29T08:36:17.837Z"}, {"movie_id": 135397, "review_id": "559238f89251415df80000aa", "rating": null, "review_text": "Overall action packed movie... But there should be more puzzles in the climax... But I really love the movie.... Excellent...", "created_at": "2015-06-30T06:36:40.291Z"}, {"movie_id": 135397, "review_id": "5639d6cd9251416d5201312c", "rating": 3.0, "review_text": "I've never been a fan of this series. The only impressive thing of the original was the graphics that were, at the time, breathtaking. But we all know great graphics alone can't save a film. \r\nI watched this new effort just to see how far CGI has come in the time since the original and I can safely say, not very far. From the opening scene with the terrible looking and poorly animated bird, it's obvious that CGI has reached its limits in recreating realistic content. \r\nAs for the film. The dreadful script and annoying characters helped me lose any interest after about 15 mins. Ok for the age range it's aimed at I suppose, but there are far better films out there worthy of your money.", "created_at": "2015-11-04T09:58:37.287Z"}, {"movie_id": 135397, "review_id": "56544b11c3a36850fa003fcc", "rating": 7.0, "review_text": "Untamable Devil.\r\n\r\nOne thing that would be 100% guaranteed prior to the release of Jurassic World, is that whatever the quality, or lack of, the notices would be mixed. Thus the reactions would be akin to those that \"Indiana Jones 4\" received, charges of ruining childhoods and franchises etc.\r\n\r\nJurassic World does exactly what is expected of it, it's a popcorn blockbuster that plays out as mindless fun, complete with outstanding effects, monster mayhem and moments of dumbness. In fact it's very much a safe sequel, reverting to the original formula without the classy edges of Spielberg's deft touch.\r\n\r\nThere's a likable cast fronting up the pic, with Chris Pratt as the hero carrying some olde adventure chops about him, and Bryce Dallas Howard (her natural beauty sparkling on Blu-ray) a fun femme side-kick. The writers introduce a couple of new mighty monsters to the series, hell of beasties for sure, while the photography, stunt work and musical score all impress greatly.\r\n\r\nThe Velociraptor plot line is crummy and daft, almost as daft as Bryce's high heels character arc, and the familiarity factor does grate a little at times, but it's a rollicking good time not to be taken remotely seriously like it's some sort of series disgrace. 7/10 ", "created_at": "2015-11-24T11:33:37.429Z"}, {"movie_id": 135397, "review_id": "56daade3c3a3684cae001628", "rating": 8.5, "review_text": "All in all this movie brought back the franchise that started out and captured the worlds attention. From the T-Rex chasing them down the road in there jeep to the velociraptors stalking them and picking them off one by one. \r\n\r\nJurassic World brought the franchise back to the state of reality. (If dinosaurs were real, this would be the set up for a park and containment of dinosaurs).\r\n\r\nChris Pratt did a great job on not only playing his part but looking it as well. Mis. Howard did ok. It seemed like she stumbled through most of her scenes and didn't bring key emotional expressions or reactions to the scene moments. But with her OCD and control issues played up against Mr. Pratt it brought the key relationship to tie the movie together. \r\n\r\nThis is a must see movie!", "created_at": "2016-03-05T09:58:59.545Z"}, {"movie_id": 135397, "review_id": "577c151c9251411ea2001fab", "rating": null, "review_text": "Not bad", "created_at": "2016-07-05T20:14:20.448Z"}, {"movie_id": 135397, "review_id": "58c16e48c3a368265000a4ec", "rating": 4.0, "review_text": "Well choreographed action set-pieces. Good effects. Dinosaurs are magnificent.\r\n\r\nAnnoyingly cliched characters. Stupid story. I thought the idea of commercialism and ethics could have and should have been explored better. A character talks about never being able to match the first part which is true. Not sure if they were trying to be funny or just self-referentially depressing.\r\n\r\nChris Pratt was good. Everyone else was pointless.\r\n\r\nNo where near the first. I would even prefer to watch Jurassic Park 3 than this.\r\n\r\n★★", "created_at": "2017-03-09T15:01:28.660Z"}, {"movie_id": 135397, "review_id": "58d554b19251411fd502e9fe", "rating": 6.0, "review_text": "**Jurassic World: A Jurassic Disappointment**\r\n\r\nAs a fan of the Jurassic Park franchise, especially the first movie, I am quite disappointed with Jurassic World. I was honestly super stoked for the long-awaited sequel to Jurassic Park, but in the end, the movie lacked the charm and mysticism from Jurassic Park. From poorly-developed characters (with the exception of Chris Pratt's Owen Grady) to idiotic plot elements, Jurassic World's only saving grace is the fact that it's a sequel to Jurassic Park. \r\n\r\nThe dinosaurs honestly look awful and pale in comparison to the dinosaurs in Jurassic Park. The CGI is so obvious and doesn't look realistic at all. Jurassic Park found the right balance of practical effects and computer-generated imagery, giving viewers the feeling that the dinosaurs feel so life-like. Jurassic World basically uses minimal practical effects in favor of CGI galore. It's sad that a 1993 movie has better CGI than a movie made in 2015.\r\n\r\nClaire and her nephews Gray and Zach, are cheap imitations of John Hammond and his grandchildren Tim and Lex. Claire is primarily motivated by greed and exploiting the dinosaurs. Hoskins just wants to use the dinosaurs as military weapons. Dr. Henry Wu is a bit more antagonistic, revealed to be secretly creating hybrids for Hoskins as military weapons. The only character that's given some form of development is Owen Grady, played by Star-Lord a.k.a Chris Pratt. His motivations are for researching Velociraptor behavior and actually treats the dinosaurs like living creatures and not just exploited science experiments. Honestly the only redeeming factor throughout the entire movie.\r\n\r\nThe Indominus Rex tricks the personnel into thinking it's escaped confinement by clawing away at the top of its enclosure. They somehow believe the dinosaur escaped, but wouldn't security be alerted right away? The enclosure doesn't come equipped with bells and whistles? To much surprise (not), the Indominus is actually inside the enclosure with them. This idiotic plot choice allows the Indominus to escape.\r\n\r\nZack and Grey revisiting the original site of Jurassic Park brought back so many nostalgic memories of Jurassic Park. One of the best moments of the entire movie, absolutely loved when they picked up the Jurassic Park banner and the goggles used by Tim. But what killed the moment was when they managed to get the original Jeep started. It's been sitting for over 20 years, non-operational. But for plot convenience, they learned how to fix vehicles previously. \r\n\r\nI thought the assault upon the park attendees by the pterosaurs was chilling, swooping up people in the process. Gave a sense of terror that you could actually feel. One of those people being Zara, Claire's assistant. She is attacked by a pteranodon and then eventually eaten alive by the mosasaurus. Her death was just way too drawn out and totally undeserving. A death like this should have been reserved for the villain.\r\n\r\nThe final battle between the Indominus Rex and Owen's pack of surviving Velociraptor brought me back to the battle between the T-Rex and raptors in Jurassic Park. Then Claire brings out the T-Rex, the very same one from Jurassic Park, and manages to outrun the T-Rex IN HEELS. I was rooting for the T-Rex to win, then the Mosasaurus swoops up and drags the Indominus into the lagoon. \r\n\r\nThough this movie attempts to bring back the Jurassic Park charm, it ultimately fails to capture that same magic. Unlike The Force Awakens, another similar movie that calls back to its roots, Jurassic World managed to be much worse than its source material. You feel no true connection to the characters or dinosaurs, the excitement factor is gone, and the music is not memorable at all. \r\n\r\nMy Rating: 5.5/10.0", "created_at": "2017-03-24T17:17:37.137Z"}, {"movie_id": 135397, "review_id": "5b960066925141431c02bd8a", "rating": 5.0, "review_text": "Most assuredly the best sequel to _Jurassic Park_, but it doesn't touch the original. \"Not being as good as a different movie\" is not what's bad about _Jurassic World_ though, what is though is the dropped plotlines, unlikeable characters, haphazard mixing of respect and disrespect for the original at random intervals, a **complete** lack of chemistry between any two characters whatsoever, but most of all the romantic leads, underdeveloped arcs of both characters and story, more Deus Ex Machinas than you can shake a stick at, and some of the most painful dialogue I've seen in a Hollywood flick all year.\r\n\r\nBut there's Bryce Dallas Howard proving (when given the chance) she's an acting force, which was a particularly pleasant surprise given that the last thing I saw her in was _Spider-Man 3_. Chris Pratt doesn't for a moment make you believe he is anyone other than Chris Pratt, but Chris Pratt is a pretty rad dude so that's more or less a chip in the film's favour.\r\n\r\nIt also has dinosaurs, so there's that.\r\n\r\n_Final rating: ★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2018-09-10T05:25:58.897Z"}, {"movie_id": 135397, "review_id": "62a70a08eb14fa09dca0a6e8", "rating": 7.0, "review_text": "MORE REVIEWS @ https://www.msbreviews.com/\r\n\r\nJurassic World remains my second favorite film of the whole saga.\r\n\r\nColin Trevorrow is able to blend the suspenseful traits of the original with a more adventurous, light tone really well. Dinosaurs look amazing, still today. Characters could have benefited from a little more work. Decent story.\r\n\r\nRating: B", "created_at": "2022-06-13T09:57:28.993Z"}, {"movie_id": 135397, "review_id": "62ebe4a18566d2005a48a7d6", "rating": 6.0, "review_text": "I recently watched the first three movies in this series, for the third time or so, but it occurred to me as I watched this one that I probably watched it only once, if at all.\r\n\r\nIt brings with it the usual elements of this film franchise: the children (not the thousand extras who run around but two we care about), whose mission is to get themselves into the path of extreme danger; the somewhat evil guy who presumably will also end up being Dino food; raptors who get smarter and stronger with every film; and footage of the original Jurassic theme park in case we are in danger of forgetting its roots.\r\n\r\nI try not to notice stuff like how extras can never outrun dinosaurs but the stars always manage it.  It is just entertainment, after all. Let’s not overthink it. And I question whether a company that must be so susceptible to lawsuits in its day to day operation would really create more dangerous creatures because they need new thrill rides. Wouldn’t they be more apt to create more up close and personal rides or experiences with the existing ones? Especially the herbivores? If a customer needs more excitement than standing near a 100-foot tall dinosaur, maybe they need to scale back their drug intake, or go climb Mt. Everest. But again, I don’t want to overthink this thing. It was watchable enough, just not thought provoking or revolutionary.", "created_at": "2022-08-04T15:24:17.164Z"}, {"movie_id": 135397, "review_id": "6340c52c1b7c59007917fd61", "rating": 9.0, "review_text": "**Jurassic World captures the delight and suspense of the original films while adding a fantastic new cast, an epic new park, and bigger, scarier dinosaurs.**\r\n\r\nJurassic World perfectly blends the nostalgia of the original movies with a new grand scale, incredible effects, and big stars. Hollywood’s flood of reboots and remakes rarely capture the heart and quality of the original source, but Jurassic World stands out as one of the best. Chris Pratt’s tough and lovable rogue, Owen Grady, brings the action. At the same time, Bryce Dallas Howard’s high-stung and successful business executive, Claire Dearing, grows and develops from selfish career focus to respecting nature and valuing family. Every scene feels grandiose and epic, with a bigger park, bigger attractions, and bigger dinosaurs. The childlike wonder still shines through, with kids giddy at a dino petting zoo and crowds cheering as the Mosasaurus feeds on a great white shark. The scares are back, too, with deadlier predators and plenty of hapless park employees to hunt. While the Jurassic series has its ups and downs, Jurassic World is at its peak!", "created_at": "2022-10-08T00:32:44.940Z"}, {"movie_id": 135397, "review_id": "64a82e99957e6d00c5dd35f6", "rating": 6.0, "review_text": "They rebuild the theme park and claim its safe. You can't keep a bunch of Godzilla like dinosaurs contained.", "created_at": "2023-07-07T15:26:17.108Z"}]