[{"movie_id": 540549, "review_id": "649a15f3d35dea00aea77920", "rating": 8.0, "review_text": "Acceptance, reconciliation and forgiveness are arguably among the hardest feelings for many of us to deal with, but coming to terms with them is by no means impossible. When Monica (Trace Lysette), a transgender woman kicked out by her family as an adolescent, leaves her Midwestern home and heads to California to start a new life, she struggles to get by. And, after years of effort, she indeed manages to work it out for the most part. But, years later, when Monica’s sister-in-law (Emily Browning) informs her that her long-estranged mother (Patricia Clarkson) is terminally ill, she’s torn about what to do. Should she ignore the news or step up as a dutiful child? She reluctantly relents and heads back to Ohio to help care for the woman who threw her out of the house, a situation made more complex by the fact that her mother’s malignant brain tumor has seriously affected her memory, leaving her unaware of the identity of the new caregiver who has suddenly appeared in her life. Writer-director Andrea Pallaoro’s third feature outing presents a deftly nuanced, sensitively handled story of a family painfully torn apart trying to put itself back together again under trying circumstances and while there’s still time. The pacing comes across as somewhat slow (undoubtedly by design), so those expecting material that moves along at a brisk, breezy may not find it to their liking, but, given the profound nature of the subject matter, it suits the narrative perfectly. There are admittedly a few plotline gaps here and there, but they’re more than adequately compensated for by the film’s superb ensemble cast, razor-sharp writing and gorgeous, atmospheric cinematography. “Monica” may not have received much fanfare upon its theatrical release earlier this year, but this fine streaming offering is well worth the time, providing viewers with a moving cinematic experience that many of us can probably relate to – and whose wisdom should be thoughtfully considered should the need arise in one’s life.", "created_at": "2023-06-26T22:49:23.957Z"}, {"movie_id": 540549, "review_id": "6588804e5aba3266b0b9c317", "rating": 6.0, "review_text": "Trace Lysette is quite effective here as the eponymous woman who returns to her family to help care for her terminally ill mother \"Eugenia\" (Patricia Clarkson). She's a trans woman, is \"Monica\", and it's been more than twenty years since she left. Needless to say, there are adjustments a-plenty to be made by all concerned, and given the imminence of the impending demise, the story gains an added potency putting things and erstwhile priorities into sharp new perspective. Gradually we discover that the scenario of estrangement wasn't caused they way we might have expected, and as the narrative develops we realise that lives have been traumatic for all concerned over the intervening decades. What's also pretty clear from the outset is that \"Monica\" has self-esteem issues, and the near constant references to her friend \"Jimmy\" whom we never meet does make you wonder of he is real or a place to put her soul - but I doubt both. What does rather let this down badly is the pace and the standard of the writing. It's a slow burn, but that needn't have mattered if the dialogue could have been a little more considered and punchy. As it is, I found it developed in an almost languid fashion. That's not to say that at times it's not poignant, and there are some very emotional scenes between mother and daughter, and between sister and brother (Joshua Close) that cut very close to the bone. Though it's essentially a story about acceptance - and it's not just the trans elements that require that - it's about a family coming to terms with loads of errors of judgement and rash decisions that with just a slightly more assured and focused hand at the tiller, could have delivered much better.", "created_at": "2023-12-24T19:02:38.240Z"}]