[{"movie_id": 192134, "review_id": "549c010292514131320036f0", "rating": 6.0, "review_text": "After 12 years, **Dom Hemingway** (Jude Law) finally gets the Call. It is time for him to leave prison and collect what is owed him. 12 years in prison have really fueled this guy's hatred and there are plenty of things to take care of, like the man who stole his wife, the man who got him into jail and who owes him and lastly, the daughter who wants nothing to do with him.\r\n\r\nThere is a lot to dislike about this guy, but for some reason, I don't. Dom is a loser, but he just doesn't know it. Dom has all the self-esteem that a man will ever need, and yet, his life is falling apart around him. \r\n\r\nDom Hemingway is not an original movie, but thats ok, all movies doesn't have to be original to be worth watching. This movie, like Dom, has just the right amount of self-esteem, arrogance and cockiness, it believes that it is more than it is, and that makes all the difference. Jude Law delivers a great performance as Dom, especially the scenes where he rambles (like the opening scene), and the scenes where he tries to win back his daughter, is where Mr. Law earns his wages. I don't mind that he is a bit over the top, that is, as far as I am concerned, the strength of the movie.\r\n\r\nDom Hemingway is a movie in the tradition of Lock, Stock and Two Smoking Barrels and RockNRolla, only... better, if you ask me. It wants to tell us a story about a man, a man that we all know, a man that we can all relate to, it is not just here to entertain us, it is here to convince us that it has both heart and soul.\r\n\r\n_Last words... don't expect this movie to change your life, but watch it regardless, and take a moment to reflect over the things that are worth changing in your own life. It won't give you answers, but it might just give you the kick in the balls, that sends you in the right direction._", "created_at": "2014-12-25T12:20:18.145Z"}, {"movie_id": 192134, "review_id": "577aa4edc3a368200800133d", "rating": 4.0, "review_text": "> An ex-con caught between in his old life and to adapt a new one.\r\n\r\nThe film is worth watching only for Jude Law in the title role. All the other character were weak, only he was the bright shining spot in it. The story also should have been better. At least improvising Emilia Clarke's part as she was in a an important role would have had a good impact on the film. Of course, it's a black-comedy-drama in the crime theme, but utilise its full potential to go some extent like maybe some interesting crime plots.\r\n\r\nA few segments were quite absorbing like bet on to open the safe and France visit. There's no smooth storytelling, but the constant rise and fall of the main character was the reason for the lag in development and its pace. The overall point was very clear in portraying a struggling ex con and how he adapts to a new life or he desires to go back to his old life tells the remaining film. So some people might like or liked it, but I did not. Just below average film, but it's okay to watch once.\r\n\r\n4/10", "created_at": "2016-07-04T18:03:25.835Z"}]