[{"movie_id": 46529, "review_id": "5eb842390cb3350020d00b9e", "rating": 8.0, "review_text": "_**“I am not a number; I’m a free man”**_\r\n\r\nJohn is a very gifted teen (Alex Pettyfer) who keeps having to move from town to town with his guardian (Timothy Olyphant) because they’re actually alien fugitives on the run from malevolent extraterrestrials called Mogs. They start over in southwestern Ohio and John insists on going to high school where he meets a special girl (Dianna Agron). Callan McAuliffe is on hand as a notorious geek at school while Teresa Palmer plays a mystery woman whose identity is revealed in the last act.\r\n\r\n“I Am Number Four” (2011) was based on the book by Pittacus Lore (aka James Frey & Jobie Hughes). I never heard of the flick until stumbling upon it on streaming. It turns out that this was a fairly big production, costing $60 million and being produced by Michael Bay. \r\n\r\nDirected by D.J. Caruso, the film starts out too busy, like it’s in a rush, not to mention there’s zero subtlety about the nature of the protagonists and their extraterrestrial-oriented dilemma. But the flick soon finds its footing once the setting switches to Ohio and John goes to school. This, of course, brings to mind “Twilight” (2008), but “I Am Number Four” is way more ballsy. Yes, it’s comic booky, but who cares? It delivers the goods as sci-fi drama/action.\r\n\r\nThe creativity turned my head on a few occasions and when Teresa Palmer shows up in the final act, it’s all the better. Then there’s the cute dog with a revelation. Unfortunately, there was never a sequel even though the ending lays the groundwork. While the movie made $55 million domestically and $150 million worldwide, it was considered a disappointment. The fools.      \r\n\r\nThe film runs 1 hour, 51 minutes, and was shot in southwestern Pennsylvania as follows: Monaca (Sam’s house), Murrysville (high school), Beaver & Beaver Falls (the falls, etc.), McKeesport (house party & police car scenes), Vandergrift (street light explodes), Harmony (cemetery scene) and Pittsburgh. The opening was shot in Islamorada, Florida, with a scene or two done in Santa Clarita, California.\r\n\r\nGRADE: A-", "created_at": "2020-05-10T18:04:41.391Z"}]