[{"movie_id": 415358, "review_id": "590b28a4c3a3684383016092", "rating": 10.0, "review_text": "**NO is a complete sentence in itself. Period.**\r\n\r\nThere are movies that have great plot lines, there are movies that have great actors who make the movie great, there are movies which have great directors. But this is a movie with a great message and one that our Indian society needs to listen, believe and enact upon.\r\n\r\nIncidents happen and are forgotten, people speak and they go quiet, mass movements are organized and they fade. But our mindset has not really changed. We still judge a woman's character by the way she dresses, the way she starts to feel comfortable with someone, by the time she steps in and out of home, by her choice of consuming alcohol or not, and the list can grow pretty long.\r\n\r\nPINK tries to make that exact same point that any sane society believes in, that we cannot have different set of rules to judge someone's character. One gender cannot be judged by some specific set of rules that do not apply to the other gender. In fact, it isn't even about the gender, judging anyone's character is a crime we all commit when none of us can measure our own selves with the same set of rules in the same scale of balance and come out of it pure and serene.\r\n\r\nNow, going towards the movie's review, this movie shouldn't be judged by it's story line, direction, editing, cinematography, or the acting. All of which were commendable in their own way so as to put through the point that the movie was trying to present to the audience precisely. Rather, it should be judged by the fact that our society deeply suffers from this disease of judging a woman's character and act with her in a manner according to the outcome of our judgement as we see fit. The part where Rajveer's character says that everybody present in the courtroom would feel the same way bout girls like these sums up the thought process of a great part of our society.\r\n\r\nAmitabh Bachchan's character's expressions in the end personifies the sorry state our country would feel at times like these. When we have to issue a manual about the woman's safety in our society. The points mentioned by Deepak Sehgal that should be there in the manual are cruel but true.\r\n\r\nI can go on and on about the greatness and seriousness of the point that the director has tried to put across, but it'd all be for nothing if we'd feel that it was another good movie that made a good point.\r\n\r\nWe need to change the way we grow up our boys and nurture them with the idea of respecting a woman's modesty and understand the firmness, completeness and absoluteness of the word NO. I wish dearly that I witness this change in our society in this lifetime where movies like PINK are no longer NECESSARY to make us realize that the way we treat women in our somewhat modern society, sometimes, is inhumane.\r\n\r\nGoing away from the preachy tone of this review I'd like to mention that the acting of all the characters, Amitabh Bachchan, Tapsee Pannu, and the other girls, Kirti and Andrea in fact, especially was just what was required, nothing less nothing more. It was believable and you could feel their helplessness. The direction by Aniruddha Roy Chaudhary was really good.\r\n\r\nAll in all, for me, this is more than your good , bad, average Bollywood movie. Seemed like a message to be thought and enacted upon, by Shoojit Sircar", "created_at": "2017-05-04T13:12:04.039Z"}]