[{"movie_id": 44603, "review_id": "545c791bc3a368535d00377e", "rating": 6.0, "review_text": "Clearly, no the best movie directed by Eastwood.\r\n\r\nThe performances are quite OK but the story is flat from the beginning to the end.", "created_at": "2014-11-07T07:47:39.316Z"}, {"movie_id": 44603, "review_id": "58ac468492514158bc014c63", "rating": 10.0, "review_text": "Clint Eastwood has once again proved himself to be a formidable director. The style and structure of storytelling used in Hereafter will not appeal to a large audience, but something tells me he knew this all too well but honestly, didn't care and rightfully so. Because let's face it, he can afford it and it's certainly a privilege he has earned. And with Hereafter, it seems that all Mr. Eastwood wants to do is share a story. A very beautiful one at that.\r\n\r\nHereafter is divided into three story lines, spread over three different countries. We have Matt Damon as a reluctant psychic in the United States, Cécile De France who plays a journalist in France and a young pair of twin brothers (Frankie and George McLaren) in England. All of these peoples' lives are in one way or another affected by different aspects of death, whether that be a near-death experience or the passing of someone very dear. Or, in Damons case, the ability to establish a certain connection with those who are no longer with us. Eastwood has decided on a particularly art house-like approach, which, like I mentioned earlier, will certainly back off a large amount of potential viewers. However, I personally very much appreciate his decision. He has obviously chosen not to make this some big, hyped-up monster movie about all things paranormal. Instead, Hereafter deals with its subject with great integrity and subtlety. Although, despite said subtlety, it features a few moments which are, by contrast, incredibly intense and shocking (in a non-scary way). In fact, I would even go so far as to say it is not for the faint of heart, but I mean that mostly in an emotional sense, rather than a spectacular one. On a side note, I would actually not recommend this film to anyone who has, in any way, shape or form been confronted with the 2004 tsunami, or even the London terrorist attacks. It might be really confronting, so be advised.\r\n\r\nI personally think the film's user rating is a bit low, but on the other hand I do somewhat understand why this film has not received the appreciation it deserves. Simply put, not everyone (actually, many people) will not understand it. It is a small story, for a small audience. Also, anyone watching this because they think it's all about Matt Damon will be somewhat deceived. I fully understand why they put his name and picture on the poster, since he is the only big name on the payroll. But this is really not 'his' film, he just plays a part in it. And he does it well, but the rest of the cast actually deserves a great deal of credit, because they are quite simply phenomenal. And I mean *all* of them. Cécile de France is really impressive, she plays her part with great dignity and empathy. She truly carries every scene she's in, and she will definitely do her country proud. Personally, I was most affected (both story- and acting wise) by the 'London segment' of the film. The story of the two young brothers is absolutely heartbreaking, and the McLaren boys do a superb job at translating this onto the screen. Anyone who doesn't at least feel a shudder of emotion when watching their story unfold, well... honestly doesn't have a lot of heart. I refuse to give away any plot points at all, other than what I already have. This is really the kind of story you just need to surrender to in order to really appreciate it. The pacing demands some patience, but if this is your kind of film it really won't be too much trouble and you will be greatly rewarded.\r\n\r\nThe way the story unfolds (the three-way structure, which doesn't come together until the very end), inevitably evokes comparison to 'Babel', but honestly, that one cost me a far greater deal of effort to sit through than Hereafter. But that is entirely personal of course, and the structure is really the only similarity between the two; the stories are completely different. And I also think Hereafter is actually far more accessible than Babel, despite its subject matter. The stories are told with such tenderness that it didn't actually bother me at all that they were three separate stories which, until the end, had nothing to do with each other. They all intrigued me in their own personal way.\r\n\r\nActually, I could go on and on...\r\n\r\nIt's been a long time since a film has really touched my heart, but this one has. I've been thinking about what rating I should give it, but honestly, I can't think of a single reason why I wouldn't give this film a 10. Hereafter is a film of true beauty, a real gem. Which, unfortunately, won't be understood by many people, but who knows... Perhaps someday, its time will come.\r\n_(August 2011)_", "created_at": "2017-02-21T13:54:12.541Z"}, {"movie_id": 44603, "review_id": "62071ad01cac8c0043a8b607", "rating": 6.0, "review_text": "Bit of a disappointment, to be honest.\r\n\r\n<em>'Hereafter'</em> spends the majority of the 2hr (or so) run time building up the intrigue, but then proceeds to do hardly anything with it. As the credits rolled, I felt like I wanted more from this 2010 release. The three stories take too long to connect, even if each one is actually quite interesting.\r\n\r\nI like the performances of Matt Damon and Cécile de France, while youngsters Frankie and George McLaren do well. Bryce Dallas Howard is also involved, she and Damon have good chemistry - it's not quite Damon and Emily Blunt in the phenomenal <em>'<a href=\"https://letterboxd.com/film/the-adjustment-bureau/\" rel=\"nofollow\">The Adjustment Bureau</a>'</em>, a film that in fact caused a <a href=\"https://en.wikipedia.org/wiki/Hereafter_(film)#:~:text=The%20original%20Hereafter,complete%20both%20films.\" rel=\"nofollow\">production delay</a> for this film, but they come across nicely together onscreen. I also recognised George Costigan (<em>'<a href=\"https://en.wikipedia.org/wiki/Line_of_Duty\" rel=\"nofollow\">Line of Duty</a>'</em>) and Mathew Baynton (<em>'<a href=\"https://en.wikipedia.org/wiki/You,_Me_and_the_Apocalypse\" rel=\"nofollow\">You, Me and the Apocalypse</a>'</em>).\r\n\r\nFor how long it takes to connect and how little satisfaction the end product gives, I can't help but feel disappointed with this flick from Clint Eastwood; who worked alongside <em>'<a href=\"https://en.wikipedia.org/wiki/The_Crown_(TV_series)\" rel=\"nofollow\">The Crown</a>'</em> creator Peter Morgan, interestingly.", "created_at": "2022-02-12T02:26:24.851Z"}]