[{"movie_id": 71679, "review_id": "510e1a21760ee338304ecd95", "rating": 7.0, "review_text": "This movie is the 5th instalment in the Resident Evil series. Why would you want to watch this movie? Why would you want to watch any Resident Evil movie come to think about? Good acting…nope. Intelligent and intriguing plot…absolutely not. Zombies…yep. Action…most definitely yes! Anything else…well if you’re member of the younger part of the average male population you probably watch it for Milla Jovovich as well.\r\n\r\nNow that we have established the baseline for the movie, does this movie deliver? The answer to that is, without a doubt, YES! This film delivered exactly what I expected of it. As I mentioned it is the 5th movie in the series and the entire series is sprung from a video game in the first place so it should really be no surprise that the film is one long video game action sequence sporadically interrupted with some dialog. Yet a lot of people seems to expect something else and judges the movie by those expectations.\r\n\r\nI think those really low rating are quite unfair. The movie does indeed deliver what I think you should expect. A lot of the action scenes are marvellous. The slow motion scenes are well done and enjoyable unlike some movies where they are just annoying. The zombies and other monsters are good. And yes, I confess that, although I’m hardly among the younger part f the mail audience anymore I do like watching Milla Jovovich jumping around in the scenes in those ridiculous skin tight suits.\r\n\r\nIf I should complain about anything it would be that I sat through half the movie being annoyed that nobody would get the, painfully obvious, idea to rip that red mind control gizmo off Jill’s chest. When it was finally done in the end it was like “did you really have to take that long to get that idea into your head you dumb bastards”.\r\n\r\nI cannot really give the movie a top rating since it does lack much of a story after all but I certainly think it is worth 7 out of 10 stars. I enjoyed myself a lot while watching it. The ending is the usual video-game-movie cliff-hanger and I really hope they make another sequel now when Alice got her powers back. That she lost those was one of the big downers for me in one of the previous movies in the franchise.", "created_at": "2013-02-03T08:04:49.826Z"}, {"movie_id": 71679, "review_id": "5fb83f554b6d9d004058a1c8", "rating": 3.0, "review_text": "Watching it again after 8 years, my feelings about this installment remains the same. Guess I found it easier to watch after revisiting the franchise but still think the plot was weak, even by the standards of the series, and while I know it’s based on a video game, really wish the movie didn’t feel like one, even more so than the previous installments. Still like Jovovich in the role of Alice, in fact, and take this for what you will, is the strongest actor of the ensemble with Guillory turning in an especially awful performance (at least under the Umbrella Corp’s influence). Easily this is the weakest entry. **1.5/5**", "created_at": "2020-11-20T22:12:37.845Z"}, {"movie_id": 71679, "review_id": "64dada37d100b600ada2c2b5", "rating": 6.0, "review_text": "Alice is going through an alternate world. When she finally snaps out of it, she finds herself trapped in and underworld city.", "created_at": "2023-08-15T01:51:51.670Z"}]