[{"movie_id": 1020006, "review_id": "656ce4b88ee0a900ae84b97e", "rating": 6.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/priscilla-mini-review\r\n\r\n\"Priscilla navigates the familiar territory of biographical storytelling, offering a nuanced exploration of Priscilla Presley's life.\r\n\r\nCailee Spaeny's career-best performance skillfully delves into the complexities of a toxic relationship with Jacob Elordi's also convincing portrayal of Elvis. Sofia Coppola authentically captures Priscilla's struggles with love and fame, though it occasionally falls into a repetitive narrative.\r\n\r\nStill, in the end, Spaeny's compelling portrayal elevates the film so much that I definitely recommend it for fans of the genre and/or subject matter.\"\r\n\r\nRating: B-", "created_at": "2023-12-03T20:27:36.869Z"}, {"movie_id": 1020006, "review_id": "65974320726fb171a0ab22c4", "rating": 6.0, "review_text": "Just rather uninteresting, on film terms at least.\r\n\r\nIt <em>is</em> interesting seeing the film portray a different type of version of Elvis Presley, one that is uncomfortable to watch unfold but one that ought to be told. That's where anything noteworthy I have to say about this release ends, though. As a movie, it's rather boring. I'm not convinced there's enough to be told across a full blown picture, at least not one around 1hr 45mins in length. I will say that Cailee Spaeny puts in a solid display as the titular character, in fairness.\r\n\r\nJacob Elordi as Elvis, in my opinion, isn't a positive to be honest. If I didn't know he was playing Elvis I genuinely wouldn't have guessed he was playing the singer, aside from a few outfits and the twisty bit of hair in his fringe. Accent particularly seemed off to me too, Elordi amusingly (given the director's connection) sounds more like Nicolas Cage (c. 1997, <em>'<a href=\"https://letterboxd.com/film/con-air/\" rel=\"nofollow\">Con Air</a>'</em>, Cameron Poe) on phone call scenes.\r\n\r\nIt's competently put together visually at least, though overall I can't honestly say this made a mark on me personally. I don't feel like I learnt anything about 'Priscilla' herself. I doubt I'll remember this one long term, sadly.", "created_at": "2024-01-04T23:45:36.053Z"}, {"movie_id": 1020006, "review_id": "659e40e76d97e600f078fc4a", "rating": 6.0, "review_text": "Having recently watched Bradley Cooper's \"Maestro\" (2023) and \"Tchaikovsky's Wife\" (2022) I was wondering if Sofia Coppola was about to bowl us a bit of a googly about Elvis here after half an hour! The young Priscilla (a competent Cailee Spaeny) is invited to meet him (Jacob Elordi) in Germany where both he and her father are serving in the US military. Not yet 16, she is chaperoned to his home where it's quite clear they take a shine to each other. He returns home and after a while sends for her to come visit Graceland. She's totally besotted by this stage and what follows tells us the story of their burgeoning relationship. It's got to be said, that's not always plain sailing - he is hugely charismatic, but has a temper, is controlling, and is very career-minded. He's also not that interested in consummating their relationship, either! History tells us the rest and with the lady herself executive producing we're not going to stray very far from the facts - as she saw them - that gripped the tabloids and the world. It's curious that her parents would have allowed their pubescent daughter to go live with a millionaire rock star half a world away, and of course once she's there she is soon taking his uppers and downers like a trooper to stay the pace. At times, it's quite a potent look at just what both wanted from the relationship, and at how it becomes clear that it is impossible for both to reconcile their aspirations with their desired obligations to/of each other. It also shows us the increasing lack of a sense of self-worth or fulfilling continuity to her increasingly lonely existence. That's a well-made point in illustrating just how shell-like her day to day life was as she had access to unlimited funds but not to any palpable feelings of being needed or loved. Talking of pace, though, that's one of the things that I found really let this down. He is home, then he goes away, makes a film, has \"alleged\" affairs, comes home then does it all over again. Also, there is a real lack of his music here. Not that it's supposed to be about him, but it was an integral part of his allure and his personality - not to reflect that rendered his character rather charm-free and the rather bland Elordi hasn't really the skills to imbue his character with much, well, character on his own. I am afraid that I found this all just a bit shallow and though beautifully set, just too sterile a look at the turbulent life of those two people. It just lacks passion, power and substance.", "created_at": "2024-01-10T07:01:59.394Z"}]