[{"movie_id": 102780, "review_id": "55a957fac3a36847760023a5", "rating": 8.0, "review_text": "> The way I wanted like the old days, great!\r\n\r\nAn Irish vampire movie, thus back to where the vampires were originated. There are no good vampire movies these days, all those are teen target products which are simply a fantasy flick. In the old days, its horror and terrifying ugly giant beasts, the werewolves were, but in the todays movies they are adorable giant wolves. It's either vampire movie or werewolf, the result is same. 'Twilight' or 'Vampire Academy' and others, just not my type, though watch them for entertainment and to keep up-to-date.\r\n\r\nThe reason I watched it is for Saoirse Ronan, because I like her. But Gemma Arterton has been so good like always. To me this is what called a vampire movie. Of course, themes should vary from a movie to another, that does not mean one can completely abandon the basic theory. Neo-gothic is one of that, the present filmmakers forgets, because that kind of set-up gives Dracula effect. This film has been just like everything I wanted, so I enjoyed every bit.\r\n\r\nIt is always great to see a movie that portrays the world over the span of 100 or more years. As usual survival and hiding the identity is the main intention for the concept. But from who (other than humans) and why is the suspense that reveals formally at the right time. If you like 'We're the Nights', then this is the right one to pick. But not great as 'Interview with the Vampire' was, in fact, it was directed by the same director.\r\n\r\n7.5/10", "created_at": "2015-07-17T19:31:06.710Z"}, {"movie_id": 102780, "review_id": "587317539251410e68006164", "rating": 9.0, "review_text": "With it's beautiful cinematography, steady pace, and understated acting, <i>Byzantium</i> is solid modern Gothic vampire tale. A bit reminiscent of <i>Interview with the Vampire</i> and <i>The Moth Diaries</i>, we see mother and daughter vampire in current day and through flashbacks and storytelling are told of how they came to be and the loneliness of their existence.\r\n\r\n<i>Byzantium</i> is a slow burn and never takes any drastic chances. It forgoes the cheese of many vampire films and remains melancholy throughout. This certainly won't be for everyone, yet there is definitely something worthy here.", "created_at": "2017-01-09T04:53:39.054Z"}]