[{"movie_id": 505642, "review_id": "636de2bdd4653700b44daee9", "rating": 7.0, "review_text": "**Wakanda Forever was an earnest film that tackled some tough themes and honored its hero well but got bogged down introducing vast new worlds and complicated characters.**\r\n\r\nWakanda Forever left me with mixed emotions. The respect and love paid to the legacy of Chadwick Boseman were heartfelt, meaningful, and sincere. The movie wisely grappled with the aftermath of T’Challa’s passing on his family and nation. This subject matter created excellent opportunities to dive deeper into characters like Shuri, Nakia, and even M’Baku. Instead, Wakanda Forever primarily served as a vehicle to introduce Namor and Talokan. The film rightfully embraced a more somber tone as it dealt with themes of loss and legacy, but the mournful spirit caused the plot to sag and drag along throughout most of the runtime. Winston Duke offers the little levity the movie had. The cast delivered exceptionally, with Angela Bassett’s performance as the true standout. I liked the movie, but the melancholy approach made it more difficult to really enjoy, and the introduction of Namor and his threat to Wakanda chewed up so much of the story that it was difficult to bring closure to characters struggling with loss and heartbreak satisfyingly.", "created_at": "2022-11-11T05:50:53.964Z"}, {"movie_id": 505642, "review_id": "636e21f0f14dad008399fc36", "rating": 7.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/black-panther-wakanda-forever-spoiler-free-review\r\n\r\n\"Black Panther: Wakanda Forever may not quite measure up to its predecessor, but it leaves a proud, beautiful, silent tribute to the legacy of Chadwick Boseman, telling an emotionally powerful, resonant story about how grief can truly be love persevering.\r\n\r\nThe screenplay runs into problems when it deviates from the central theme and tries to mix in other MCU stories/characters, with Namor and Riri suffering collateral damage. Technically, the action set pieces are mostly riveting, despite some inconsistent VFX and lighting. Score and sound production stand out in a remarkably memorable manner.\r\n\r\nBrutally passionate, moving performances, especially from Letitia Wright, Angela Bassett, and Danai Gurira. Exquisite pacing reduces the weight of the long runtime.\r\n\r\nTotally worth the emotional investment.\"\r\n\r\nRating: B+", "created_at": "2022-11-11T10:20:32.109Z"}, {"movie_id": 505642, "review_id": "6371fb8b6bdec3008a7c105e", "rating": 6.0, "review_text": "Mourning the unexplained death of King \"T'Challa\", the tech-rich African nation of \"Wakanda\" returns Queen \"Ramonda\" (Angela Bassett) to the throne and she must stabilise the kingdom and try to help her daughter \"Shuri\" (Letitia Wright) deal with the loss of her much-loved brother. A fireside chat late one night doesn't quite go to plan though, when they are introduced to an interloper. \"Namor\" (Tenoch Huerta) arrives to ask their help to thwart the Americans who nave managed to design a machine that can trace vibranium, and this has put his hitherto unknown population of underwater, Mesoamerican, people at risk. Either they help him to track down the scientist who created this or there could be war. The Princess and her general head to Massachusetts where they track down a college student who is almost as much of a whizz-kid as \"Shuri\". The FBI are on soon their trail and skedaddle they must, straight into the arms of the waiting \"Talokan\" who take them to their beautiful watery homeland where we learn just how they evolved. Somewhat narked, the Queen wants her daughter back and that action sows the seeds for a conflict between the two nations that, well, you can guess the rest. Sadly, that's the problem here. Despite a really strong and vibrant performance from Wright and some very fine production values, there is precious little story here. It is far, far, too long to sustain the thin plot and the conflict engineered between the two races is flawed in more ways than an US Congressional election. The pace is really slow, the combat scenes could have been choreographed by Sir Matthew Bourne - or by a Wakandan cheerleader at their equivalent of the \"Superbowl\" - and the supporting characters aren't on screen long enough to give Miss Wright enough help to wade through the frequent tedium. I wasn't helped by Huerta's very thick accent which made his dialogue nigh-on impossible to comprehend at times and the denouement screamed sequel so loudly that I forgot that I'd long given up on any jeopardy at the end two hours ago. There is a bit of character tragedy, character loyalty and thankfully Martin Freeman's (\"Ross\" - why does he need an American accent?) appears but sparingly as we go along but Marvel must stop taking the audience for granted. They have to realise that their gorgeous Avatar-esque visual effects and technical wizardry are not going to entertain us indefinitely if the stories continue to deliver so weakly. Great to look at, a few power-ballads from the soundtrack and Wright is certainly a stylish and classy star - otherwise, this is a film nobody will remember in two years time, I'll bet!", "created_at": "2022-11-14T08:25:47.429Z"}, {"movie_id": 505642, "review_id": "6381322ab3316b007bde10b9", "rating": 7.0, "review_text": "_Black Panther: Wakanda Forever_ had an impossible task in the wake of the tragic passing of lead Chadwick Boseman, and for the most part Ryan Coggler does a great job at picking up the pieces and creating a heartfelt story.\r\n\r\nI feel as though this movie is attempting to do too much though. There are so many side plots and new characters being introduced that the film has a hard time finding its footing. For as much as I enjoyed Riri Williams and here banter with Wakadans, her arch was not necessary. By omitting this character, the story could have been more focused and streamlined creating an easier viewing experience and deflating the runtime.\r\nThe writing was decent, but it was pretty exposition heavy. There were countless number of lines that were strictly feeding information to the audience, and they felt inorganic and awkward in the moment. These writing mishaps really hurt my enjoyment and constantly pulled me out of the film.\r\n\r\nAfter those main criticisms, I think this movie overall does a great job in all other departments. The action is surprisingly light, but when it does come it is intense and well-choreographed. There are some really unique fight sequences and weapons introduced with the \"Atlanteans\" that allowed for some really cool scenes and visuals that were done with some stellar CGI. I specifically like how the final battle had some letterboxing that was not present in the rest of the film. It gave it a grand scale that I thought was excellent touch.\r\n\r\nThe performances were fantastic all around. Angela Bassett was mesmerizing and really captivated me with her emotion and distress with the passing of her son. There is a scene in here that gave me literal goosebumps. Dominique Thorne was a great addition as Iron-Heart and Lupita Nyong'o was amazing in her limited screen time. I loved Winston Duke and desperately wanted more screentime from him. He was sidelined for the majority of the film, and I think that was the wrong decision. Letitia Wright is the real highlight here. She stepped into a very difficult situation and acted her ass off. I never envisioned her as a lead actress, but she proved me wrong.\r\n\r\nSomething I want to note that I do not normally include in my reviews in the music choice. The score to this movie was crafted brilliantly and really elevate so many scenes. I enjoyed every song and feel as though it blended with the movie brilliantly.\r\nOverall, this movie has its drawbacks but is still an enjoyable watch and one of the better movies in Marvel Phase IV.\r\n\r\n**Score:** _75%_ | \r\n**Verdict:** _Good_", "created_at": "2022-11-25T21:22:50.733Z"}, {"movie_id": 505642, "review_id": "639c76cf81a7fc00d1c7c8ca", "rating": null, "review_text": "This was such a fun movie to watch. It was long but didn't feel longer than a regular movie. There was a lot of action, but also excellent character exposition. I don't want to give anything away, but I loved the novel perspective on leadership this one evolved to. Also the contrast between how different Black Panthers inhabit that role and the implications of that.\r\n\r\nI loved the new world discovered, with its own mythology, and the way those two worlds can come together, for good or ill. I can't wait to see where the story goes next.\r\n\r\nBeautiful scenes and a fun story with great characters. And the tribute to Chadwick Boseman, his character, and the actor, were deeply moving and tastefully done. Great soundtrack too. strong text", "created_at": "2022-12-16T13:46:55.267Z"}, {"movie_id": 505642, "review_id": "63b7015843250f0082e8cd69", "rating": 8.0, "review_text": "Chadwick Boseman is undeniably missed, but <em>'Black Panther: Wakanda Forever'</em> still manages to produce an entertaining and even touching final chapter of the MCU's Phase Four.\r\n\r\nI had a positive time with this, one good thing about watching it almost two months after release is that I got to watch this in an empty cinema - absolute bliss. Thankfully I managed to avoid all spoilers, though had heard the name Namor bandied about online so that's all I knew coming into it.\r\n\r\nSpeaking of Namor, I'm a fan. He makes for a cool new character to the universe, as does Talokan as a whole, with Tenoch Huerta a welcomed addition to the cast - first time I recall seeing him in something, and I'm impressed. The star of this 2022 flick, however, is Letitia Wright. I don't really remember her standing out in the original much, at least to me, but here Wright is excellent.\r\n\r\nAngela Bassett is very good also, there's one emotion-filled speech scene in particular that stands out in my memory. Danai Gurira is always a joy to watch, while Winston Duke and Lupita Nyong'o are the best of the rest - though, the whole cast are good; even Martin Freeman, who I'm not always convinced by.\r\n\r\nThe film handles Boseman's absence nicely, there are some very touching moments in there. I'd say they went the correct way with the character of T'Challa, no-one would've been able to even closely replicate Boseman. The music, meanwhile, is pleasant.\r\n\r\nI do think this has some relatively minor pacing issues, mainly around the midway point, but other than that I felt more than satisified with what I had just watched when leaving the cinema. Phase Five, see you soon!", "created_at": "2023-01-05T16:56:56.269Z"}, {"movie_id": 505642, "review_id": "63e8ede69512e100846251b3", "rating": 1.0, "review_text": "I just saw this great Marvelesque fresco. Very great show, special effects to cut the breath.\r\nBut where are the bits of humor that make the Marvels sympathetic, and especially, where is the peaceful spirit of Wakanda?\r\nThe writers and directors have really lost their way. We feel so strongly the American messages behind this long adventure: the importance of technology, to be a good ally you must submit.\r\nIt's such a narrow view that it diminishes the pleasure of watching it!\r\nCome on, guys from Marvel: you got us used to better than this. Special effects and big budgets are not enough!\r\n-------------", "created_at": "2023-02-12T13:47:18.985Z"}, {"movie_id": 505642, "review_id": "640cda9d323eba00844946b5", "rating": 1.0, "review_text": "I want to first state that I am absolutely thrilled about how Wokely pro-racism this, I mean it's 2022, the worst year in cinematic history, but I didn't think the Woke corporate overlords would go to this racist extreme.  This is some repugnant crap and if I didn't know better, I would think that they were trying to go full Blazing Saddles and spoof racism.... but alas, it is Disney, and Disney is woke, the racism here isn't satirizing the subject, it's embracing it in all it's evil glory.\r\n\r\nLet's start with how they castrated Namor and then move on to utterly and completely they stereotyped Latinos, right down to focusing on how wet his back is and beating him by drying off his wet back.\r\n\r\nAs if that wasn't racist enough it goes on to make it's prideful support of Black Nationalism clearly stated, the opposite of which we call White Nationalism, which is very much the purview of groups like the Neo-Nazis, KKK, and other hate groups.  Wakanda Forever has done an excellent job of embracing that same ideology for the Black people of the world... and claiming it as a sort of pride.\r\n\r\nAnd that, of course, is exemplified by their virtuous victory over the forces of... Latino, who are so overtly masculine, right down to their shameful gendered language (like about 90% of the other languages on the globe) that they had to edit out Namor's bulge in order to... what... show more African Racial Superiority over the Latino population, or maybe just to add corporate feminism to the Black Nationalist message.\r\n\r\nEither way, the statement they made here was clear, Latinos bad, Black Nationalism good...\r\n\r\n... God I can't wait until racism is something that is shunned across the board again, because the people who like this crap deserve all the respect we give to the people that loved the original Birth of a Nation and rode around the south wearing sheets on their heads.\r\n\r\nI expected a healthy dose of Black Nationalism when I walked in, I even expected the in your face male-hating... but I thought the racism was going to be directed at people like me, you know, white people.  Instead the racism was directed at Latinos and, for some reason, that seems even more repugnant given the hypocrisy that comes with it.", "created_at": "2023-03-11T19:46:37.188Z"}, {"movie_id": 505642, "review_id": "6437dff71d53860077a44ff7", "rating": 7.0, "review_text": "I have to admit that I was quite a bit hesitant about this movie. I feared this was one movie where the woke intellectual midgets of Hollywood would go overboard with their nonsense.\r\n\r\nLuckily, the movie was more or less free of such rubbish except for maybe the lame “joke” at the end of the movie. If you are one of the woke intellectual midgets watching the movie I am sure you could find some contrived way of construing some message out of it but normal people will probably find it rather woke free.\r\n\r\nOverall it was a pretty decent movie actually. Lot and lots of special effects and action of course and, as with Black Adams that I just reviewed, that is the main reason to watch this movie.\r\n\r\nUnlike Black Adams, the story as a hole has more Hollywood nonsense in it though. It is good enough to propel the movie from start to finish but that is all.\r\n\r\nThe main plot of the movie is unfortunately one of those nonsensical bits. Not even a kid (actually she is not really a kid but an adult) having the misfortune of attending one of those depraved grooming and indoctrination institutes they call schools today would be stupid enough to hand over a detector that would put their African home nation in such grave danger.\r\n\r\nThen there was that illogical rant from the Queen where she, in a emotional fit, fired her best (only) General. The cognitively impaired sock puppet might do a thing like that but not a real regent.\r\n\r\nThe part with the French in the UN was also utter rubbish. That was to please the Chinese, who are the ones that would actually do what the movie claimed the French were doing, and nothing else.\r\n\r\nAnyway, it is still a decent movie. Certainly a lot better than quite a few Marvel/DC movies that Hollywood has produced over the last couple of years. The special effects are very nice and most of the action is quite cool.\r\n\r\nI am somewhat concerned that they picked that rather non-charismatic and overly emotional woman to become the next Black Panther though. After all, she could have re-created the magic flower a lot earlier but instead she let her stubbornness and emotions stand in the way. Not exactly qualities you would want in the Black Panther.", "created_at": "2023-04-13T10:56:55.050Z"}, {"movie_id": 505642, "review_id": "644e9f314d23dd268c92b394", "rating": 5.0, "review_text": "So many things wrong with this movie. Wanna be iron man chick. The movie was better without the black panther. Could have took the black panther out the name. Just made it about them as a nation instead. She makes a horrible black panther. She looks like captain america before he became him when he was skinny. Lol! They should have just made Michael B. Jordan be Black Panther.", "created_at": "2023-04-30T17:02:41.134Z"}, {"movie_id": 505642, "review_id": "644ea040c8a2d402dd005e9e", "rating": 5.0, "review_text": "So many things wrong with this movie. Wanna be iron man chick. The movie was better without the black panther. Could have took the black panther out the name. Just made it about them as a nation instead. She makes a horrible black panther. She looks like captain america before he became him when he was skinny. Lol! They should have just made Michael B. Jordan be Black Panther.", "created_at": "2023-04-30T17:07:12.721Z"}, {"movie_id": 505642, "review_id": "647623db6743fa00c29c0775", "rating": 1.0, "review_text": "It's getting harder and harder to support these movies with the constant racist tones. How many digs/jokes against white people do you need? Even that wasn't enough for this movie they also had to get digs in against latinos as well. \r\n\r\nHow does anyone think that this is the way to equality? \"If I berate you enough you'll see my point of view!\" Race relations were SO much better 20 years ago...", "created_at": "2023-05-30T16:27:07.808Z"}, {"movie_id": 505642, "review_id": "650e1114f29d6600ad651505", "rating": null, "review_text": "Black Panther: Wakanda Forever was a good Marvel movie. I liked the movie so much more than the others. For me, Wakanda Forever is an enjoyable movie that I would watch again. Angela Bassett’s performance as Queen Ramonda was amazing. Letitia Wright, Winston Duke, Lupita Nyong'o, and Danai Gurira were also good as their respective characters. Namor was amazing as the antagonist of the film. Tenoch Huerta plays the character amazingly. The cinematography of this movie was amazing. I liked the underwater world of Talokan and the back story of Namor and Talokan. Dominique Thorne did an amazing performance bringing Riri Williams to on screen. I liked her first suit in the film. The second suit was good in action sequences but when the suit is still, the face of the suit looks animated. First Black Panther is my second favourite MCU film. I did not like this movie as much as the first one but overall as a film, this is a good film.", "created_at": "2023-09-22T22:11:32.846Z"}]