[{"movie_id": 504562, "review_id": "5dfd92d565686e0015918e73", "rating": 5.0, "review_text": "**_Looks great and is well acted, but the pacing is turgid_**\r\n\r\n>_I raise my stein to the builder who can remove ghettos without removing people as I hail the chef who can make omelettes without breaking eggs._\r\n\r\n- Robert Moses; Open letter to Robert Caro, refuting many of the claims in Caro's biography of Moses, _The Power Broker: Robert Moses and the Fall of New York_ (August 26, 1974)\r\n\r\n>_Have you ever felt, in the course of reading a detective novel, a guilty thrill of relief at having a character murdered before he can step onto the page and burden you with his actual existence? Detect__ive stories always have too many characters anyway. And characters mentioned early on but never sighted, just lingering offstage, take on an awful portentous quality. Better to have them gone._\r\n\r\n- Jonathan Lethem; _Motherless Brooklyn_ (1999)\r\n\r\nIn his introduction to _The Wire: Truth Be Told_ (the official companion book to the greatest TV show ever made), series creator David Simon writes that although it may appear to be a cop show, in reality, _The Wire_ is \"_about politics and sociology, and, at the risk of boring viewers with the very notion, macroeconomics._\" In a similar(ish) manner, Jonathan Lethem's 1999 novel _Motherless Brooklyn_ may appear to be an old-fashioned private-eye noir, but in reality, it's about gentrification, institutionalised racism, political corruption, and how such things are woven into New York City's historical fabric. It's about how the city of today was built on the cruelty, prejudice, lies, and unchecked power of yesterday.\r\n\r\nLethem's novel is a fascinating and quintessentially postmodern narrative, fracturing the relationship between the physical and the temporal by taking the sensibilities of 1950s gumshoe noir and supplanting them into an end-of-century _milieu_. On the other hand, the 1957-set film is more literal, less interested in playing with form. Written for the screen, produced, directed by, and starring Edward Norton, this two-decades-in-the-making passion project asks how much corruption are we willing to forgive and whether truth and ideals even matter in a world in which there's a direct confluence between power and amorality. However, far too in reverence to films such as Roman Polański's _Chinatown_ (1974) and Curtis Hanson's _L.A. Confidential_ (1997), _Motherless Brooklyn_ is your average noir mystery – a likable but flawed protagonist begins what seems like a fairly straightforward investigation, only to be led down a rabbit hole of corruption and power games, until he's in the midst of an elaborate political conspiracy. And whilst it's aesthetically impressive (the period detail drips off the screen) and the acting is universally excellent, the film can be spectacularly on the nose and didactic. It also moves at a snail's pace, and Norton is never really able to generate any sense of urgency, making the whole thing feel laborious, and, ultimately, rather pointless.\r\n\r\nNew York City, 1957. World War II veteran Frank Minna (Bruce Willis) runs a small PI firm, employing Tony Vermonte (Bobby Cannavale), Danny Fantyl (Dallas Roberts), Gilbert Coney (Ethan Suplee), and Lionel Essrog (Norton), all of whom Minna rescued from an abusive orphanage when they were still children. He's most fond of Essrog, who suffers from what we know today as Tourette Syndrome – uncontrollable tics and the tendency to blurt out random words and phrases, which becomes worse when he's nervous. However, he also has a photographic memory. As the film begins, Essrog and Coney are listening in on a clandestine meeting between Minna and unidentified parties. When the meeting becomes contentious, tragedy strikes, and although none of Minna's staff know who he was meeting or what he was investigating, Essrog determines to get to the bottom of the case, slowly unearthing a labyrinthine conspiracy involving local government, urban redevelopment plans, and housing relocation programs. Along the way, he encounters Laura Rose (Gugu Mbatha-Raw), an activist campaigning against gentrification; Moses Randolph (Alec Baldwin), a powerful real estate developer who plans to expand New York's road network and build multiple new bridges despite the fact that to do so, he'll have to demolish several lower-income neighbourhoods; Paul (Willem Dafoe), an engineer who has a history with Randolph; Gabby Horowitz (Cherry Jones), the leader of the activist group of which Laura is a member; a brilliant but mysterious jazz musician (Michael K. Williams); Julia Minna (Leslie Mann), Frank's wife; William Lieberman (Josh Pais), Randolph's right-hand man; Lou (Fisher Stevens), one of Randolph's thugs; and Billy Rose (Robert Wisdom), Laura's father and the owner of a jazz club at the centre of the mystery.\r\n\r\nAnyone familiar with the novel will immediately recognise that Norton has made sweeping changes, not just in terms of relocating the story to 1957 (thus making explicit what was so indelibly postmodern in the book), but so too in terms of plot and character. The most significant addition is Moses Randolph, who's clearly based on New York's so-called \"master builder\" Robert Moses, the man largely responsible for the city's high-way infrastructure, the departure of the Brooklyn Dodgers to LA, the development of Long Island, whose controversial philosophies regarding urban redevelopment continue to be implemented all over the world, and who once held 12 civil service titles (including President of the Long Island State Park Commission, Chairman of the New York State Council of Parks, Recreation and Historic Preservation, Secretary of State of New York, Commissioner of the New York City Department of Parks and Recreation, and Commissioner of the New York City Department of City Planning) despite never being elected to public office. Operating with almost complete autonomy from regulatory oversight, Moses was a narcissist obsessed with power, and an amoral racist, and so too is the character in the film. Indeed, although the film is ostensibly based on Lethem's novel, it contains more than a hint of Robert Caro's magisterial Pulitzer Prize-winning biography of Moses, _The Power Broker: Robert Moses and the Fall of New York_ (1974).\r\n\r\n_Motherless Brooklyn_'s most obvious strength is its aesthetic, about which I really can't say enough. The production design by Beth Mickle (_Drive_; _Only God Forgives_; _Lost River_), the art direction by Michael Ahern (_Stake Land_; _Arbitrage_; _The Drop_), and the costume design by Amy Roth (_Top Five_; _Two Night Stand_; _Indignation_) are all exceptional, contributing to the nuanced and immersive period-specific tone, with the milieu feeling lived-in and completely authentic.\r\n\r\nNorton's direction is, for the most part, straightforward and unfussy, but one visual motif he uses several times is shooting directly from Essrog's POV. First-person shots in cinema are infrequent enough that when a director uses the technique a few times, it stands out. What's most interesting here is when Norton uses it – three scenes in which Essrog is lying on his back either currently being beaten up, or having recently been beaten up. It's a nice (if somewhat unsubtle) directorial choice, drawing us directly into Essrog's experience, but only when he's at his most vulnerable. On the other hand, the tonally inconsistent use of dream scenes is far less effective, feeling as if they're from another film entirely.\r\n\r\nIn terms of the decision to set the film in the 50s, it actually makes sense. One of the reasons the novel works so well is because the modern setting clashes with the mannerisms of the characters, the style of the dialogue, the cadences of the plot, all of which are straight out of classic 40s and 50s noir. The effect of this is quintessentially postmodern – a self-reflexive pastiche that's drawn from both the 50s and the 90s, and yet which belongs to neither. And although this works tremendously on the page, Norton argued (correctly, I think) that to try to replicate this on film – have the story set in 2019 (or even 1999), but told in the manner of a classic noir – wouldn't work, as it would send mixed and confusing messages to the audience.\r\n\r\nAnd so, he simply relocated the story to the time-period which underpins the style of the novel. With this in mind, the film features many of the trappings of classic noir – the world-weary private eye, the laconic voiceover speaking directly to the audience from an unspecified point in time, the seemingly important clues which ultimately lead nowhere, the seemingly irrelevant clues which ultimately lead somewhere, the smooth (so smooth) jazz score, the smoky (so smoky) jazz clubs, the chiaroscuro lighting (albeit very restrained), the antagonist who seems to see all, the political corruption. There's even a scene in which Essrog finds an address written on a pack of matches. About the only thing missing is a femme fatale, although there is a woman who may (or may not) know more than she's letting on.\r\n\r\nFor all its thematic importance and laudable aesthetic aspects, however, I found _Motherless Brooklyn_ disappointing. For one thing, there's the pacing, which is so lacking in forward-momentum that the story is practically somnolent. The narrative is unfocused and flabby, needing at least one more editorial pass, occasionally doubling back on itself and wasting time giving the audience information we already possess. Partly because of this, it's a good 20 minutes too long (at least), and much of it feels like padding – characters that do nothing, clues that lead nowhere, scenes which don't advance the story or develop the characters. I understand Norton wanted to let the material breath (the novel is around 300 pages), but there's a difference between giving the characters and themes room to develop and stalling for the sake of it, and so much of the film feels like the latter.\r\n\r\nThere's also a significant disconnect between the politics and the detective story. In _Chinatown_, everything feels organic – the personal and the political are intertwined, with the political elements never feeling artificially shaped so as to fit a generic template, or the genre structure never feeling artificially bolstered with extraneous political elements. In _Motherless Brooklyn_, however, Norton is never really able to integrate the two, leading to a kind of identity crisis, with the film unable to find a comfortable middle ground – in trying to be both a noir mystery and a societal commentary, it ends up as neither. Another issue is that because the novel features 50s values displaced into the last years of the century, the endemic racism is deeply disturbing – society today is more enlightened about such things, but here's a novel in which characters are acting like it's 40 years prior despite being set in a modern _milieu_. This is a vital part of Lethem's postmodernist deconstruction of power structures. However, with the film set in the actual 1950s, the racism just comes across as period-appropriate window dressing, losing virtually all of its thematic potency.\r\n\r\nAn old-fashioned detective story with a lot on its mind, Norton's passion for the material is self-evident. However, that passion hasn't translated into an especially good film. Void of almost any tension, although it looks great, _Motherless Brooklyn_ fails to unify its genre elements and its political preoccupations, resulting in a film unsure of its own identity and unable to make us care about much of what it depicts.", "created_at": "2019-12-21T03:34:45.827Z"}, {"movie_id": 504562, "review_id": "5e2e56bb98f1f10014fc2641", "rating": 6.0, "review_text": "It's a difficult task to pace a noir for a modern audience, and you can feel the two and a half hour runtime. The story is interesting and the parallels to America in the present day are welcomed, but there isn't enough tonal balance to contrast all the shadowy moodiness. The plot is on the more convoluted side, and you'd imagine that with it being a story about following a trail of clues, 'Motherless Brooklyn' would reward repeat viewings - but I'm not sure I would optionally sit through all of it again. There is nothing inherently wrong with this film, bar some odd edits and framing choices, and Norton tackles the material fairly well, creating a great tribute to the noir era of filmmaking. It sometimes treads the line of parody rather than homage, but for anyone in the mood for crime mystery in the vein of 'Chinatown' or 'L.A. Confidential', this will absolutely hit the spot.\r\n- Joel Kalkopf\r\n\r\nRead Joel's full article...\r\nhttps://www.maketheswitch.com.au/article/review-motherless-brooklyn-a-neo-noir-set-in-1950s-new-york", "created_at": "2020-01-27T03:19:23.882Z"}, {"movie_id": 504562, "review_id": "63094f27b04228007a58e914", "rating": 2.0, "review_text": "Motherless Brooklyn’s lead performance recalls two previous Ed Norton outings: Primal Fear and The Score. In the latter two, Norton plays, respectively, a cold-blooded killer posing as a stuttering altar boy, and a thief posing as a mentally-challenged janitor; in the former, he plays Lionel Essrog, a private investigator with Tourette’s syndrome. \r\n\r\nThe key difference is that Lionel really does have Tourette’s and isn’t just pretending. In  Primal Fear and The Score there is a performance-within-a-performance, with the character pulling a Sun Tzu and appearing weak when he’s strong in order to achieve an ulterior goal. Conversely, there is no means-to-an-end scenario in Motherless Brooklyn; the protagonist’s handicap is genuine, and while Norton does this medical condition justice like only he can, it sadly turns out to be a hindrance not only for the character, but also the actor, the movie, and even the audience.\r\n\r\nThere is enough material here for two films, and Norton, who writes, produces, and directs, neglects to edit; perhaps he should have been as involved in his own movie’s cutting process as he was in American History X’s, instead of leaving the responsibility to the undistinguished Joe Klotz. The first film follows an individual with Tourette’s as he juggles his disorder, his job, and his personal relationships. The second, which doesn’t need the Tourette’s angle, involves a murder mystery that takes us from Harlem’s jazz clubs to Brooklyn’s slums to the drawing rooms of the rich and powerful. Norton would have done well to focus on the first story; first, because of his performance, which strikes a prodigious balance between tactful and funny. And second, because Tourette isn’t the film’s only malady; the plot, such as it is, is a dull intrigue concerning urban renewal and housing relocation – and outside an 80s family comedy wherein the gang must save the old people’s home from being torn down to make room for a parking lot, it is near impossible to take an urban planner seriously as a credible villain, even if he’s played by Alec Baldwin; here’s one turd that not even he can polish.\r\n\r\nBaldwin is not the only talented performer whose talent goes to waste here, though. Ethan Suplee, Dallas Roberts, and Leslie Mann show up to push the plot forward, hang around for a couple more scenes, and then disappear without a trace; all of their characters, especially Mann’s, could have been replaced with a little timely exposition. At least Bruce Willis has the decency to die after setting the events of the movie in motion.\r\n\r\nMotherless Brooklyn shows much more ambition than Norton’s previous directorial credit, which was also his debut: the romantic comedy Keeping the Faith. That’s the good news. The not-so- good news is that he remains a greater actor than he is a director and scriptwriter. His performance here is flawless, but that doesn’t change the fact that his character has been overwritten.\r\n\r\nOverall, the film would be neither better nor worse with or without the whole Tourette’s syndrome stuff, and that leaves us with a feature-length picture where the length has gotten out of hand, and that only rises above mediocrity during Willem Dafoe’s all-too-brief interventions. Unlike Norton, Dafoe is able to convey mental instability more subtly; not with a stutter but with a tone of voice, not in the way he looks but in the way he looks at others. He slow-burns until he reaches the boiling point, and when he does it’s beautiful and terrifying at the same time. His is the most well-rounded character in the movie, and that’s likely more Dafoe’s doing than Norton’s.", "created_at": "2022-08-26T22:54:31.383Z"}, {"movie_id": 504562, "review_id": "630d7c81226c560092cb84da", "rating": 2.0, "review_text": "Motherless Brooklyn’s lead performance recalls two previous Ed Norton outings: Primal Fear and The Score. In the latter two, Norton plays, respectively, a cold-blooded killer posing as a stuttering altar boy, and a thief posing as a mentally-challenged janitor; in the former, he plays Lionel Essrog, a private investigator with Tourette’s syndrome.\r\n\r\nThe key difference is that Lionel really does have Tourette’s and isn’t just pretending. In Primal Fear and The Score there is a performance-within-a-performance, with the character pulling a Sun Tzu and appearing weak when he’s strong in order to achieve an ulterior goal.\r\n\r\nConversely, there is no means-to-an-end scenario in Motherless Brooklyn; the protagonist’s handicap is genuine, and while Norton does this medical condition justice like only he can, it sadly turns out to be a hindrance not only for the character, but also the actor, the movie, and even the audience.\r\n\r\nThere is enough material here for two films, and Norton, who writes, produces, and directs, neglects to edit; perhaps he should have been as involved in his own movie’s cutting process as he was in American History X’s, instead of leaving the responsibility to the undistinguished Joe Klotz.\r\n\r\nThe first film follows an individual with Tourette’s as he juggles his disorder, his job, and his personal relationships. The second, which doesn’t need the Tourette’s angle, involves a murder mystery that takes us from Harlem’s jazz clubs to Brooklyn’s slums to the drawing rooms of the rich and powerful.\r\n\r\nNorton would have done well to focus on the first story; first, because of his performance, which strikes a prodigious balance between tactful and funny.\r\n\r\nAnd second, because Tourette isn’t the film’s only malady; the plot, such as it is, is a dull intrigue concerning urban renewal and housing relocation – and outside an 80s family comedy wherein the gang must save the old people’s home from being torn down to make room for a parking lot, it is near impossible to take an urban planner seriously as a credible villain, even if he’s played by Alec Baldwin; here’s one turd that not even he can polish.\r\n\r\nBaldwin is not the only talented performer whose talent goes to waste here, though. Ethan Suplee, Dallas Roberts, and Leslie Mann show up to push the plot forward, hang around for a couple more scenes, and then disappear without a trace; all of their characters, especially Mann’s, could have been replaced with a little timely exposition. At least Bruce Willis has the decency to die after setting the events of the movie in motion.\r\n\r\nMotherless Brooklyn shows much more ambition than Norton’s previous directorial credit, which was also his debut: the romantic comedy Keeping the Faith. That’s the good news.\r\n\r\nThe not-so- good news is that he remains a greater actor than he is a director and scriptwriter. His performance here is flawless, but that doesn’t change the fact that his character has been overwritten.\r\n\r\nOverall, the film would be neither better nor worse with or without the whole Tourette’s syndrome stuff, and that leaves us with a feature-length picture where the length has gotten out of hand, and that only rises above mediocrity during Willem Dafoe’s all-too-brief interventions.\r\n\r\nUnlike Norton, Dafoe is able to convey mental instability more subtly; not with a stutter but with a tone of voice, not in the way he looks but in the way he looks at others.\r\n\r\nHe slow-burns until he reaches the boiling point, and when he does it’s beautiful and terrifying at the same time. His is the most well-rounded character in the movie, and that’s likely more Dafoe’s doing than Norton’s.", "created_at": "2022-08-30T02:57:05.709Z"}]