[{"movie_id": 339846, "review_id": "5915db88c3a36842690217dc", "rating": null, "review_text": "Baywatch is a movie based off the popular TV show of the same name which launched the careers of such acting talents as Yasmine Bleeth and Pam Anderson. And then those quickly died right afterwards but hey, the show ran like 11 years and\u0085little known fact, Jason Mamoa was on spin-off show Baywatch: Hawaii.\r\n\r\nThe movie is very much like the show; as in if you walk in expecting to take it seriously you're already watching it wrong. The situations people need to be rescued from are just as ridiculous and far-fetched and the main plot here gets far more convoluted and hackneyed than the average day of any real lifeguard.\r\n\r\nAnd like 21 Jump Street and a bunch of lesser TV to movie adaptations, this seeks to make fun of all of it, plus all the slo-mo beach running. Does it come off as good as Jump Street? No. Do we need this? God no. I mean didn't the show basically already make fun of itself enough as it is?\r\n\r\nBut all I can say here, and I guess the only thing anyone interested in this might want to know is, it could have been so much worse. I'm not saying this is the best movie of the summer so far. I don't really even know if i'm saying this is a good movie. But it's easy enough to sit through and the laughs, while not great, are consistent.\r\n\r\nWhere the script sucks, the cast knows how to make fun of itself. The Rock is the head honcho who takes the job very seriously. Zac Efron is the selfish, cool pretty boy new trainee who clashes with him. Both have a plethora of jokes for one another that work with varying degrees of success.\r\n\r\nThere's a fat lifeguard and the movie takes the shots you would expect it to take but actor Jon Bass also does have some comedic talent here in the Josh Gadd sense of the word. Actually he may even be funnier than Josh Gadd. Point is he works the best here from a comedic perspective.\r\n\r\nThe movie gives us quite a few dick jokes but this dude actually has one embarrassing moment that may rank up there with \"There's Something About Mary\", just with not as good a payoff.\r\n\r\nHannibal Burress also gets a couple scenes for a cameo and I love when he gets those. It's time for Burress to headline a movie though.\r\n\r\nThe women aren't as funny but I guess you can say they add some nice support to that and the action. Alexandra Daddario has shown a few times she's a pretty decent actress, and the others don't just seem like stiffs there to just show off a hot body. Priyanka Chopra is also here as the villain, and she's fine.\r\n\r\nThe whole movie can really be described as fine. It's funny and doesn't take itself too seriously and the cast all seems game for it. You don't have to see, but if you do, know it's already planning on sequels.\r\n\r\nSo I go 6 out of 10 on this one. For more reviews, check me out on Youtube at- https://www.youtube.com/channel/UCY_IvAm1bJADConJhDCuq6A\r\n\r\n\r\n\r\n\r\n\r\n", "created_at": "2017-05-12T15:58:00.587Z"}, {"movie_id": 339846, "review_id": "59b6a8ab9251417cbc016eae", "rating": 4.0, "review_text": "Yes, you're all very, very attractive, can we have something else too please?\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2017-09-11T15:15:55.947Z"}, {"movie_id": 339846, "review_id": "59fe1eb492514146e8022646", "rating": 3.0, "review_text": "**When lifeguards turned homicides!**\r\n\r\nIn the 90s, when the original television series was aired, I was just a kid. Then it was too sexy, that I was not allowed to watch. The world has changed so much all these years. I always wanted to see that, but never had a chance. Now a film, possibly a new franchise if it all goes well. There were lots of expectations on it, but the film did not deliver that. Yet they have already announced a sequel.\r\n\r\nThe bay security team is now recruiting new members. Three joins as the trainee after the tryout. Within a few days, a couple of suspicious deaths happen in the bay. The cops are not worried to solve it, but the Baywatch team jumps in and starts their own investigation. That leads them to a dangerous territory. From there, how they deal with it was revealed with some action-thriller.\r\n\r\nPumped up body, starring alongside a current top star, nothing is working for Zac Efron. He's just an accidental actor, won't survive long, unless he turns it all his way like Ben Afflect did. On the other hand, Dwayne was awesome. All the other actors too. Priyanka was not ideal for such role. Because an Indian in a negative role for an American film, nah, it does not work. India keeps all the thugs and sends only engineers, doctors, scientist et cetera to the foreign lands. A Chinese or a Russian villain works better.\r\n\r\nNo suspense. Everything was open from the beginning itself. Some of the comedies were good, but some were most absurd. Especially, I did not like the storyline. The Bay security force not doing their job, but police work. It goes completely out of the frame. It's okay doing same within their enclosure, but the film entered beyond that. Thus, the film missed to cover the beach events as what the title had promised. I hope the sequel would fall in line.\r\n\r\n_3/10_", "created_at": "2017-11-04T20:10:28.672Z"}, {"movie_id": 339846, "review_id": "5f3afccea3b5e60037f05b6e", "rating": 6.0, "review_text": "It has a couple of decent moments, but <em>'Baywatch'</em> is mostly uninspiring.\r\n\r\nFor a comedy, it takes itself way too seriously in parts. None of the heartfelt stuff really lands, while a lot of the humour is over reliant on sexual innuendo. The premise is followable, if entirely predictable. The cast is oversized, way too many characters. Dwayne Johnson and Zac Efron are good enough in their respective roles as Mitch and Matt.\r\n\r\nSummer (Alexandra Daddario) and Victoria (Priyanka Chopra) are alright but underdeveloped, as is Stephanie (Ilfenesh Hadera). C. J. (Kelly Rohrbach) and Ronnie (Jon Bass), meanwhile, are annoying and extremely pointless. Yahya Abdul-Mateen II (Ellerbee) is solid in a small role.\r\n\r\nI've never watched the original television series so maybe I missed a few callbacks etc., while there are two (incredibly forced) cameos from it. If it stayed at what it should be - a comedy - then I may have liked this, I simply didn't though.\r\n\r\nNot terrible, but I still wouldn't say you should rush to see this.", "created_at": "2020-08-17T21:55:26.298Z"}, {"movie_id": 339846, "review_id": "6448797e49756004badef88e", "rating": 6.0, "review_text": "I only watched this movie cause it had the Rock. I was extremely surprised that it was a good movie. It was pretty funny as well.", "created_at": "2023-04-26T01:08:14.032Z"}]