[{"movie_id": 58595, "review_id": "508ce3d019c29569c9001e9f", "rating": 8.0, "review_text": "This is not the fairy tale from Walt Disney that we have become used to but a rather more mature dark and sinister movie. I have to say that I enjoyed this movie.\r\n\r\nDespite that a lot of the world is much darker and filled of despair in this movie the photography is nice and the film is beautiful to watch. The film focuses a lot more on the huntsman than previous Snow White movies that I have seen and I think this is also the first one that I have seen where snow white mounts up in full battle armor. I think it worked quite well.\r\n\r\nThere is quite a few special effects in the movie but not enough to overdo it and they are reasonably well done as far as I am concerned. As I mentioned earlier the plot is somewhat different although it follows the general lines of the original story. It is still a fairly simple adventure/action plot but it holds together well enough.\r\n\r\nThe dwarfs are present of course and, although the film takes much more serious take to the Snow White story, they still give you a laugh or two. There are a couple of scenes which more or less seemed to be fillers with not that much to add to the story but they did not really disturb the flow of the movie either.\r\n\r\nWhen the credits started to roll I was quite satisfied with my movie evening.", "created_at": "2012-10-28T07:50:40.000Z"}, {"movie_id": 58595, "review_id": "58ac4e9292514158bc0150a8", "rating": 8.0, "review_text": "Ever since I saw the first photographs of Snow White and the Huntsman surface on IMDb about a year ago, I've been extremely excited to see this film. And over the past few weeks, that excitement only built op more and more to the point where almost no film can meet such high expectations. See, I have always loved the fairy tale of Snow White and the evil queen, but never before had anyone attempted to make it into what I believe it was always meant to be: a Gothic tale of fantasy and horror, rather than a sweet night time story. And now, with a much promising trailer, it appeared that Rupert Sanders had fulfilled my wish. And even though he has claimed quite some artistic license story wise, the end very much justifies the means. Snow White and the Huntsman is a film worth watching.\r\n\r\nLiterally everything I ever imagined about this classic story is there. The Dark Forest is actually Dark. It's creepy and spooky in the best kind of nightmarish way. Funnily enough, throughout the film there were some analogies with the classic Disney film. For instance, in the Dark Forest, the tree branches move autonomously towards whoever dare enter their territory, grasping around like freakish clawing fingers. The mushrooms spew poisonous fumes when you touch them. And the hills literally have eyes... The Evil Queen's castle is every goth kids' dream house. And the dwarfs are rugged, mean little men. Graphically, there's simply nothing not to love.\r\n\r\nHowever, without the key elements perfectly worked out, the pretty pictures alone wouldn't have made this film work. Let me start with the leading lady. I don't know why Kristen Stewart is getting so much hate, honestly. Not only is she a very talented young actress, she is the perfect Snow White. I can't imagine anyone doing a better job with this than her. She doesn't just have the right look (pretty face, pale skin and raven dark hair), she also has the right attitude to play Snow White the way her character was written: smart, daring and independent. This is no damsel in distress, this is a girl ready to kick some ass and get revenge. She just needs a little help from her friends. First and foremost friend on the list is Eric, the Huntsman. He is initially hired (or rather, commanded) by the Evil Queen, to hunt down Snow White. However, when he finds out that he has been deceived, he turns on the Queen and decides to help her instead. This character is played by Chris Hemsworth, and he is perfectly cast. He is all the Huntsman needs to be; rugged but charming, complete with a husky Scottish twang. Lastly, there is Snow White's childhood friend William, played by Sam Claflin, who sets out on his own personal mission to help her.\r\n\r\nOf course, the tale of Snow White would not have been complete without the notorious 7 (or 8, in this case) dwarfs. It seems the casting director pulled open a can of Britain's finest for this occasion. Bob Hoskins, Ian McShane, Eddie Marsan, Ray Winstone, just to name a few. These characters are a delight to watch and also bring some much needed comic relief to the story, without actually turning it into a comedy (which is a good thing).\r\n\r\nAnd then there's the Evil Queen, Ravenna, played by Charlize Theron. Ms Theron is a great actress, and I was really looking forward to her playing this purely evil character. And as such, the Queen was everything I had hoped for; a heartless, sadistic beauty who relies on dark magic to remain forever young and beautiful, sacrificing whosoever crosses her path for this purpose. Though strangely, viewed solely as a performance, I caught Charlize doing something I had never expected from her: she overacted. Personally I feel that her performance would have actually been much more intense had she decided not to spend half her screen time screaming at the top of her lungs, but rather just some of it, carefully dosed. However, Ms Theron has garnered a more than sufficient amount of brownie points in my book, so I'll just chalk it up to excitement. It's obvious she had a lot of fun playing this character, so she's easily forgiven. Besides, physically she fit the role perfectly and I still really enjoyed watching her.\r\n\r\nVisually, Snow White and the Huntsman is truly stunning. The CGI is top-notch, especially the Mirror is quite awesome. It transforms into a human-shaped mass of liquid gold in order to speak, and it's one of the best visual surprises in the film. The Dark Forest is the closest thing I've ever experienced to an acid trip, and all the fantasy creatures are really cool (my favourite was the angry forest troll!).\r\n\r\nI don't need to tell you about the story, we all know how it goes (although I've never seen Snow White in a harness before...), so there's no really big surprise anywhere, and of course you get the happy ending (trust me, that's not a spoiler). Still, it's the way this story is told here, that makes it a very exciting ride. There's only one point of critique I have, and that's the pacing. They really could have kicked it up a notch here and there.\r\n\r\nI think, in the end, Snow White and the Huntsman actually did live up to my expectations, and that's quite an accomplishment, considering how high they were. Anyway, I thoroughly enjoyed this film and I highly recommend it if you're in the mood for Snow White: The Gothic Version. Beautiful, awesome, cool!\r\n_(June 2012)_", "created_at": "2017-02-21T14:28:34.378Z"}, {"movie_id": 58595, "review_id": "60359e6397eab40041d2770a", "rating": 8.0, "review_text": "Great watch, will likely watch again, and do recommend.\r\n\r\nThis is probably my favorite Snow White story version to date.  I'm a fan of Kristen Stewart, and both Chris Hemsworth and Charlize Theron are both top tier actors giving amazing performances.\r\n\r\nA dark and gritty tale with plenty of money to fuel the amazing CG effects of the movie.  The story is well laid out with complex multi-threading, Each story thread is actually interesting and I've always thought fairy tales like Snow White needed more fight and military battle scenes.\r\n\r\nCharlize Theron really steals the show, not only as a villain, but she embodies the insanity of the character and is worth the watch all on its own.", "created_at": "2021-02-24T00:31:31.152Z"}]