[{"movie_id": 514847, "review_id": "5e7e7e1726677800184c8087", "rating": 4.0, "review_text": "Liberal snooty types lashing out at conservative cronies and their right-wing leanings should have made for some enjoyably edgy satire, but 'The Hunt' is merely a by-the-numbers comedy-horror-suspense thriller that has a few punchy moments. But, if production company Blumhouse wants to remake a bunch of 90s Jean-Claude Van Damme action movies with Betty Gilpin in the lead role, I think I'd be down with that. I'd watch them, not in the theatres obviously, but late at night after a few beers.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-hunt-blunt-lazy-and-undeserving-of-controversy", "created_at": "2020-03-27T22:28:39.699Z"}, {"movie_id": 514847, "review_id": "5e8c9e6c3a340b001403e7d7", "rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nIn case you don't know, I'm from Portugal. Why does this matter? Well, The Hunt was delayed after a massive shooting in the USA, and since the movies' themes are extremely sensitive, the producers decided to postpone the film. At the time, I felt frustrated that, once again, movies have to suffer from real-life situations. Going to the theater is supposed to be an \"out of this world\" experience. The audience is transported into a fictional place where real-world problems can be forgotten for a couple of hours. So, I never handled these constant controversies surrounding films very well...\r\n\r\nWith that said, I believe The Hunt not only benefited from that delay, but its satirical story has even more impact now. There's no way around this. Craig Zobel's movie is meant to be one of the most divisive films of the last few years. I know it's a pretty basic analogy, but it's just like a dark humor standup show. If you don't have any issues with jokes about topics like racism, stereotypes, immigration, refugees, religion, politics, and every sensitive theme that your mind can imagine, then you'll find The Hunt a brilliant allegory of society's most extreme people. If you do have problems with this type of comedy, then stay away from this movie because Damon Lindelof and Nick Cuse go all out!\r\n\r\nWhen I write that every remotely sensitive taboo subject or activity is unrestrainedly addressed, I mean EVERY SINGLE theme. This is a narrative completely packed with extreme, over-the-top cliches and stereotypes of both right and left political sides. At first glance, The Hunters feel like the \"bad guys\", in the sense that they're hunting innocent people for pure pleasure. Once the audience understands the reasons behind the selection of the people being hunted, one small but tremendously effective thought enters everyone's mind: \"you know what... the world would actually be a better place without this kind of people\".\r\n\r\nSuddenly, not a single character is worth caring about. To clarify, I don't mean \"caring about\" in the common, emotional way. No character is written with the purpose of making the audience worry about it. In fact, almost every character (maybe except Betty Gilpin's) is a despicable human being. Their view of the world is clouded by ideologically outdated mentalities. I love how the screenwriters use each character to represent a particular type of ... extreme personality, let's call it that. One of the best compliments I can give the film is that it didn't pick a side. Everyone gets blasted with jokes.\r\n\r\nIt's a dark yet hilarious satire of today's society with a special focus on the close-minded people that go online to try and spread their conspiracy theories and immoral beliefs. Everything that I just wrote so far resembles the movie's impact on the viewer: either you're okay with this type of screenplay and you'll be incredibly entertained; or you'll get extremely triggered by all this. It's one of those films that will end up on a bunch of \"Worst Movies of 2020\" lists simply due to its narrative's nature.\r\n\r\nHowever, the story isn't the only aspect that can make people give up on watching this movie. The actual hunt is as over-the-top as everything else. There's blood everywhere, ridiculously disgusting deaths, and absolutely no limits whatsoever in killing people in the most insanely entertaining way possible. Action-wise, The Hunt is better filmed than a lot of blockbusters. Beautiful wide shots when something (or someone) explodes, exceptional (and hilariously long) choreography for the \"final fight\", and excellent editing overall. It's genuinely a well-made, well-produced, and well-filmed movie. The score is also pretty cool.\r\n\r\nObviously, it's one of those films that's easy to pinpoint flaws. Every single paragraph that I wrote above can be interpreted as some of the worst aspects of the entire movie, depending on each person's perspective. In my opinion, I think the ending would have benefited from a more serious tone, but at the same time, it would probably clash with the widespread satirical one, so it's an inevitably difficult ending to completely get right. The cast is a bit hit-and-miss when it comes to each actor's performance (some are very bland), but Betty Gilpin delivers an outstanding display and seamlessly carries the whole film. Finally, there's a small part of the movie that involves military characters who don't belong to either side of The Hunt, and that portion didn't really work for me.\r\n\r\nAll in all, The Hunt is a brilliantly dark satire on today's political views of the world. It's meant to be one of the most divisive films of the last few years, and it undoubtedly succeeds in its mission. Just like dark humor, either you're okay with it, or you're not. If you can't take a joke about the most extremely sensitive taboo themes (and I mean ALL of them), then stay away from this movie or you'll be triggered for a whole week. However, if you can see the fun side of this type of comedy, The Hunt is the most entertaining, witty, hilarious, bloody, over-the-top action thriller you'll see for a long time. Damon Lindelof and Nick Cuse go all out, and they don't forget to approach a single topic. It's a well-made film all-around: well-written, well-produced, and well-filmed. A few minor issues regarding its ending and a small subplot don't diminish Craig Zobel's exceptionally captivating concept and Betty Gilpin's compelling performance. I definitely recommend it depending on how much you enjoy dark humor.\r\n\r\nPS: everyone knows the tale about the rabbit and the turtle, right? How the rabbit races the turtle, and all that? Well, The Hunt's version of that story just became my all-time favorite.\r\n\r\nRating: A-", "created_at": "2020-04-07T15:38:20.163Z"}, {"movie_id": 514847, "review_id": "5e94881eccb15f001371155e", "rating": 10.0, "review_text": "> Review From **_Horror Focus_**\r\n\r\nGaining its momentum back in mid 2019, The Hunt stirred up quite a bit of controversy prior to its initial release, branding it too brutal for release due to the mass shootings in Ohio, Texas last summer. This Blumhouse picture was later rescheduled, and was at one point never to see the light of day, which would have been a crushing blow knowing how relevant this actually turned out to be. Luckily for us, Blumhouse soon caught on and realised movies like The Hunt are exactly what our cruel audience’s need right now, something with a sharp satirical bite with a gut-punching narrative reflective of modern society. Welcome to my favourite horror movie of the past few years.\r\n\r\nImagine a Twitter thread was made into a movie, this is The Hunt. What we have here is a film that functions on the confliction that exists in the real-world between liberals and conservatives, as they take chunks out of each other when discussing politics online, spilling blood on each side as opinions and views are torn to shit by the opposing party. What is depicted is literal death and carnage, which is representative of how the different identities and political views that are one person's beliefs, but another’s infuriating joke.\r\nImage result for the hunt 2020 film\r\nThe beauty here (which is addressed as a massive concern to most reviewers) is the lack of depth to these characters within The Hunt, and to their lifestyle choices and political standpoints. What works best is that it never takes a stance when mocking both sides of the political spectrum, and allows us as an audience to identify which whatever our political views lead us to, even if one side is draped in murderous overtones. I admire how we are left to decide where we would stand, and if what is happening is something we can sympathise with. To most, what I’m saying sounds ridiculous, but this lack of depth to these characters is very much reflective on the current state of our social media, having people who we know nothing about spreading their views which are toxic to half and relatable to others.\r\n\r\nIt’s that online façade that is at play here, as we witness comments and statements daily that tear down others, ruin people’s professional statuses or simply to spread offensive and insensitive comments online to troll others. This is the world we live in, and the characters in The Hunt exist within our real world. The characters within this may not be fleshed out, but to the online profiles with nothing but a name, a picture and a flurry of controversial tweets neither are they, and that certainly looks like modern day humanity to me.\r\n\r\nMuch of The Hunt’s satirical sting comes from its reliance on our current climate and political correctness, which leans on its accurate depiction of society to get its laughs in when it can. It’s understandable that this particular sense of humour might to a little too one-note for some, but it firmly has its own tongue planted in its cheek when openly mocking our current way of thinking, juxtaposing these characters with opposing mind-sets to create a genuinely clever and on-the-nose depiction on humanity’s contemporary views. Aside from the intelligent links to modern society, it’s also really enjoyable and highly entertaining when utilised to its full potential. One could be offended by some of the humour here, but when the film itself jokes on our own generation of snowflakes, it begs the question if The Hunt is pointing the finger at you, and calling you out for being said snowflake. It all really works for me on a sharply pungent level, one that had me tickled pink until the final credits. The Hunt ultimately holds up a darkly comedic mirror up to the political divisions in a way that hasn’t been explored to this stature.\r\nImage result for the hunt 2020\r\nThe action here is outstanding, with the violence being the appropriate level of over the top to match its exuberant premise. Betty Giplin is undeniably outstanding as she delivers a powerhouse of a performance in her portrayal of Crystal, a tough as nails heroine who easily establishes herself in the ranks next to such genre greats as Erin from You’re Next and Alien’s Ripley. Her level of badass is contagiously ferocious, making every scene she’s in an absolute blast to witness. Each fight scene is crafted brilliantly, looking seamlessly effortless with its high-energy intensity, most notably when we reach our final act in which our Million Dollar Baby Hillary Swank comes head-to-head with Giplin, which can only be described as one of the most entertaining fight scenes in recent horror memory.\r\n\r\nNothing is ever fully dripping in suspense, but you soon realise it doesn’t need to be when you’re watching enigmatic fight scenes that are as vicious as they are diverting. The film also works its best when it plays at its most unexpected, knocking familiar faces off like Drew Barrymore in Scream level of unexpected in ways so gleefully gory it will have you laughing with sheer shock. The Hunt may split audiences right down the middle, but there is one thing that is universal, and that’s that Betty Giplin’s Crystal is already this decades best Final Girl.\r\n\r\nVERDICT \r\nProving to be one of the strongest contemporary social and political horror movies in recent memory, The Hunt is a lean, mean, fighting machine that is as sharply satirical as it is viciously violent. Make room for Betty Giplin, our new final girl is in town.\r\n\r\n★★★★★", "created_at": "2020-04-13T15:41:18.543Z"}, {"movie_id": 514847, "review_id": "5ec3d80c6dea3a001bf8eba5", "rating": 5.0, "review_text": "Irony of ironies that this movie's release got pulled due to Trump's shitfit despite never having seen it, when a not insubstantial part of _The Hunt_ is about the left's propensity for sparking outrage without having the whole story. The reality is, the nothing _The Hunt_ has to say is worth being outraged over. Betty Gilpin's great in it, because of course she is, intermittently there some pretty fun violence, and only **most** of the dialogue is incredibly awkward, but if you want any sort of consumable message, or witty repartee, don't be fooled by people on any end of any spectrum, saying that's something you can find here. \r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2020-05-19T12:58:52.774Z"}, {"movie_id": 514847, "review_id": "5ee2a565197de400218eea3f", "rating": 7.0, "review_text": "It was... fine. Nothing really to write home about, but some decent kills and gore, plus true subverting expectations with the cast of characters killed off early on. Kind of peters out towards the end but overall it's worth a rental but one could wait until it's available for free as part of a streaming service. **3.5/5**", "created_at": "2020-06-11T21:43:01.602Z"}, {"movie_id": 514847, "review_id": "5eef8bd8d2b2090036004d1f", "rating": 8.0, "review_text": "I knew this film was going to be something different but I didn’t read anything about the film before I started watching it. And this is my absolute recommendation to anybody who is thinking of watching this film. Don’t read anything about it. Just watch it. It is different, obscure, unusual, political, weird and overall awesome!\r\n\r\nWould I watch it again? Yes! Would I make my friends watch it? Absolutely!", "created_at": "2020-06-21T16:33:28.122Z"}, {"movie_id": 514847, "review_id": "5fd42319d48cee003a7174ec", "rating": 9.0, "review_text": "Fantastic watch, will watch again, and do recommend.\r\n\r\nThis is one of the best, if weirdly refreshing movies I've seen in quite some time.  I'm a sucker for a good survival movie, and this is an \"elites hunt people for sport\" trope mixed with a good mystery plot if there ever was one.  The story structure alone is worth the watch as it essentially runs 3 (-4) sequential stories to tell one overall story while telling you about the story structure.  Some movies clearly put a lot of effort into keeping you on your toes, this movie just does it.\r\n\r\nNot only is the gunfighting immaculate, but the combat action sequences are amazing.  Betty Gilpin steals the show every time she's on screen, and I would normally say she's the one that carries the movie, but the movie is good enough that even though she's over the top great, I can't say the movie needs her to carry it.\r\n\r\nThere is an investigative aspect of the movie that is very intriguing, but that is given in the \"why are they doing this to us\" of it all, but unless the villains give an \"evil speech\", then it should be expected.\r\n\r\nIf you enjoy human vs human survival situations, then I think you will be pleasantly surprised by this one.", "created_at": "2020-12-12T01:55:37.787Z"}, {"movie_id": 514847, "review_id": "638c1fb68a84d200b34f876b", "rating": 8.0, "review_text": "**_Satirical look at Left and Right in a “Most Dangerous Game” setting_**\r\n\r\nSeveral non-Liberal people wake up in the middle of nowhere, possibly Arkansas, to discover they’re being hunted by cutthroat Leftwing radicals. \r\n\r\n\"The Hunt\" (2020) takes the basic-Zaroff scenario of \"Open Season\" (1974) and \"The Hunger Games\" (2012) and applies it to the Left’s ire toward “deplorables.” Unlike those other two flicks, this is an amusing satire that pokes fun at both political sides while arguably veering toward pro-Conservative, at least more so than pro-Left.\r\n\r\nBetty Gilpin is quite effective as the protagonist, Crystal, while Hilary Swank eventually shows up in the last act for a knock-down-drag-out climax.\r\n\r\nThe film is snappy at 1 hours, 30 minutes, and was shot in Louisiana, including New Orleans.\r\n\r\nGRADE: A-", "created_at": "2022-12-04T04:19:02.283Z"}, {"movie_id": 514847, "review_id": "63bf5399e16e5a00afca6e1e", "rating": 10.0, "review_text": "Basically, there are a ton of 1 star reviews on IMDb complaining that it makes the left look bad... despite, you know, things like Antifa and their belief that a red hat means they gt to physically assault people.\r\n\r\nSo I am going to give it 10 stars... because my wife had a milk shake thrown at her for being a \"race traitor\" and, on our way back from work we got egged (along with everyone else at a red light) in an attempt to convince us to support impeachment.\r\n\r\nAnd, because of that I think that this works as a satire about that attitude that having a different opinion means they have the right to act violently, by taking that attitude to an extreme.\r\n\r\nAnd when reviewers write sentences like \"insipid portrayals of both the elite and the deplorables\" it only serves to reinforce the attitude that the film is parodying, that attitude that they are \"elite\" elevated above all others, and those in the out group are dehumanized as \"deplorable.\"\r\n\r\nIn fact, the vast majority of the 1 star reviews are written with a vocabulary that so perfectly echoes the people that the film is a satire of that it is almost impossible not to see the brilliance here.\r\n\r\n\"Elite\" and \"deplorable\" a part of me thinks that they realize that they are the subject of satire in this film... but can't seem to avoid acting exactly like the people that are being mocked here.\r\n\r\nSo, congratulations, language of the negative reviews alone make this a brilliant satire.", "created_at": "2023-01-12T00:26:01.658Z"}]