[{"movie_id": 370755, "review_id": "58623b6fc3a3681a72042bcf", "rating": null, "review_text": "If you appreciate the delicacies of a quiet, slice-of-life dramedy that hinges on the edginess of minimal observations of routine life as an artistic examination then you are in for a delectable treat with the skillful and witty inflections of writer/director Jim Jarmusch’s whimsical and wry offering **Paterson**. Jarmusch, known for his quirky and sedated dramas that include the highly underrated 2005 Bill Murray vehicle _Broken Flowers_ and 2009’s _The Limits of Control_, is back to add to his familiar repertoire of solemn filmmaking with an admirable character study of an Everyday man named Paterson (Adam Driver, “Star Wars: The Force Awakens”) trying to balance a structured, day-by-day existence with poetic leanings as his measurement of escapism. Remember, this is Jim Jarmusch’s isolated cinematic world where experiencing one of his big screen creations is much like living in an insulated bubble with meditation whale sounds to ease your tension…you just need to go with the slow pacing and appreciate the nuances of its resonance. In fact, the only recent radical submission from Jarmusch is this year’s documentary _Gimmie Danger_ and that is even riddled with mild-like rawness.\r\n\r\nConsequently, **Paterson** is the type of off-kilter, contemplative and quaint motion picture that begs one to check their excitement at the door. The flashiness of Jarmusch’s creative overtones is ironically the low-key blueprint of the film’s leading protagonist Paterson (the man) and urban setting (Paterson, New Jersey–the city that shares the same name with Driver’s blue-collar characterization). Dutifully, the film allows the audience to ride the waves of the repetitive conformity of a man seemingly going through the motions in life from the perspective of a married working stiff whose occasional stimulation besides his lovely wife Laura (Iranian-born actress Golshifteh Farahani) and four-legged adorable bulldog Marvin is his need to write poetry in his trusted notebook of eloquent thoughts. It certainly helps that the hometown bearing his moniker that surrounds him as he regularly drives the bus each day carrying the familiar and not-so-familiar faces as they are carted off to their various destinations acts as a steady stream for inspiration.\r\n\r\nSome will relate to Paterson’s stillborn existence of repeating his daily agenda for work and leisurely downtime while others may dread the tedious notion of being so predictable and practical as this disciplined city bus driver has mastered so effortlessly. The scheduled outline never deviates for Paterson as he gets up early at the same time, goes to work while cruising the same bus routes, returns home to his fetching spouse Laura for dinnertime then walks Marvin to the local bar for his taste of a mug of beer to ease the tensions of the work day. It does need repeating that Paterson must engage in his passages of poetry–something that he does not miss a beat on for sure.\r\n\r\nInterestingly, Laura is also an odd duck whose own sense of head-scratching regimen actually rivals that of her husband’s day-by-day customs. Laura has dreams and does not hesitate in throwing herself into random activities that give her a sense of anticipated rush and reason to follow with faithful conviction. With the obsessive black-and-white coloring schemes in clothing, food and furniture that perversely pleases her Laura longs for the personal satisfaction that feels as therapeutic for her as the reliable quirks does for Paterson as well. Together, they march to the bizarre beat of their own drums. However, the dichotomy in their philosophical lives clash as Paterson is a creature that does not cozy of to change whereas Laura embraces her urges for different challenges whenever they come into fruition.\r\n\r\nOne may find it quite difficult to celebrate **Paterson** because it is an intimate film with a small-scale mentality that dares to look at the lives of ordinary, married people as they shift through their livelihood tainted with tiny triumphs and trying times. Nevertheless, at the box office office where superheroes, zombies and continuous _Star Wars_ installments reign supreme there can be something said for cheeky melodramas such as **Paterson** that draws its imaginative scope on solid storytelling with the concentration on hard-working, flawed people just trying to take on the day for the moment.\r\n\r\nIn a sentimental and subtly sharp performance, Driver is effectively potent as Paterson, a poetic pariah that translates the rhythms of his beloved city and people into a notebook that speaks his lyrical language. He is who he is and is unapologetic about his mission to adhere to anything different than what he is already used to that persists. Also, the beautiful Farahani is a revelation in her own right as the free-spirit with various whims that entail baking cupcakes one minute or arranging drapes the very next minute. The supporting characters are refreshingly realized especially when the spotlight settles in on the small tavern where Paterson systematically nurses his one beer all week long. And even the gruff but treasured Marvin (as played by the late canine actor Nellie) fits so handsomely into the saga of these ordinary folks relaxing in their own arbitrary skin. As simplistic as the poet Paterson is at heart and soul Jarmusch is shrewd to suggest that perhaps the hidden complexities of his expressive leading man is more explosive than what is let on throughout the narrative. Indeed, the mysterious nature of Driver’s devoted transit worker is a curiosity worth speculating over.\r\n\r\nIn conclusion, there is nothing wrong with worshiping car chases, alien attacks or enjoying the occasion teen sex farce. Still, whenever there is warranted shelf room for a sublime, insightful look at under-the-radar celebrations of casual lives, love and checkered eccentricities than the Jim Jarmusches and Terrence Malicks of the cinema world are welcomed to the table of film fodder that moves and grooves on its old-fashioned, unique purpose more relatable than your doomsday delight of resident space invaders.\r\n\r\n**Paterson** (2016)\r\n\r\nAmazon Studios/Animal Kingdom/Bleecher Street Media/Inkjet Productions\r\n\r\n1 hr. 55 mins.\r\n\r\nStarring: Adam Driver, Goldshifteh Farahani, Method Man\r\n\r\nDirected and Written by: Jim Jarmusch\r\n\r\nGenre: Comedy/Drama\r\n\r\nMPAA Rating: R\r\n\r\nCritic's Rating: **** stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2016", "created_at": "2016-12-27T09:59:11.065Z"}, {"movie_id": 370755, "review_id": "59ec9cf992514119fc00e43e", "rating": 8.0, "review_text": "**A week with a bus driver, a part time poet.**\r\n\r\nThe time Jim Jarmusch has struck back. He does not make films often, but those he makes are not easily forgettable. I don't think people hate his films, especially the grown ups. They know how hard the real life is and contents this filmmaker use for his flicks are not much different. But the thing is, in his style, adding a slight fun, romantic, poetic, all together works so well. I still remember how I become his fan after watching 'Stranger Than Paradise'.\r\n\r\nAs usual, he wrote the story for this film. Even if he had to borrow from another source, the screenplay is generally his. For this film, it was original and that's what worked out awesomely. But he had to borrow some poems from his favourite poet, Ron Padgett. A great team work, because when their work came together, the film became a masterpiece. It was nothing less than any literature, for sure. Definitely this film should turn into a book. The readers deserve their own imagination of this tale.\r\n\r\nThis is the story of a man's life in a week's time. Starts from Monday and ends on next Monday. So, his name's Paterson, a bus driver from the city of Paterson. A happily married man, and love his profession. In the meantime, he's a poet. He has kept a book where he writes his poems, especially during his lunch time, even in the small breaks when he gets. His mind's always filled with thoughts. Chanting words, verses.\r\n\r\nHis inspirations are the places he goes through his bus and the strangers who ride in his bus. Their each others conversation about their lives and experiences is his motivation. His wife is an interesting character too. Sadly, she was not focused as much as he was. Though there are enough scenes to enjoy the role. But I think she deserves her solo film, from another angle, about her life, her hobby which her husband backs.\r\n\r\nIt's a simple, normal life. Without much trouble, a peaceful life the most people would ask for. The film is not everything about him. But he's the centre of the story. When other, one time characters enter the screen. It's because of his presence around them. Hence some interesting facts revealed. Just like our life when we ride a public transport where we come in to contact with many passengers coming and going in different stops. But all the above, what they talk, which we, everybody in the bus listen without hesitation. Paterson is a person who learns every day out of that.\r\n\r\n> ❝Poetry in translation is like taking a shower with a raincoat on.❞\r\n\r\nHis other activity is walking his dog out at every night. It's an opportunity for him to mix with some friends at the pub he had made with frequent visits. The place which has its own story as the film progresses. So all these stuffs keeps repeating every day like what we call a mechanical life. But Paterson is neither enjoying it nor depressed over. He usually does best out of the given time and place. The difference is, not every day are same. Even a slight change in order of activity brings a new thing in. His wife insists him to publish his works. But the narration strikes with an unexpected twist before the end.\r\n\r\nI have said many times when I liked the films I have watched that they are so poetic. But it's very rare to find a film from top to bottom being very poetic. Recently I saw one, in fact, two from Japan known as 'Little Forest' duology. And now this one. Particularly if you love poetry or if you are yourself a poet, then this is a must see. Surely you would love it. As well as a good film to gift to any such person you know in your life. Believe me, this film is like a wine bottle. As it gets older, it will turn the best. I have already changed my stance twice and rated better every time. I consider it is a bit low rated right now. But only time will answer to that.\r\n\r\nFor me, it is the director's top 3 films. I have seen Adam Driver in many films, he's not considered a solo lead actor, because of marketing purpose. But he's really good which proved in this flick. So it is his best performance I have seen so far. He really took the driving classes to learn drive the bus to perfect his character. That's the dedication the creator of the film expects from his cast. How much I loved it means, I'm eager for a sequel, despite knowing this kind of films are one-off. Otherwise, I'll be happy if the director and him join the hands once more time for a new project.\r\n\r\nVery slow moving tale. But not a boring film. If I had watched it when I was a teenager, I don't think I would have felt similarly. From middle aged people to the older ones, they are the target audience. In order to see and feel what this film reveals, one must have experience in real life. Hence, not all the youngsters, particularly the teenagers would thumb up. In my world, this kind of films is the Oscar worthy. I would have surely nominated the film, as well as the director and the lead actor. So by now you would have learnt what my final word could be. Recommended!\r\n\r\n_8/10_", "created_at": "2017-10-22T13:28:25.602Z"}, {"movie_id": 370755, "review_id": "5b53a0789251411f84018ab9", "rating": 6.0, "review_text": "Jim Jarmusch's 2016 film PATERSON is a study of everyday life in a small American city. Its title refers on one hand to its setting of Paterson, New Jersey, much less known abroad than other towns in the state but a surprising number of prominent Americans hailed from there and it was eulogized in an epic-length work by the poet William Carlos Williams. On the other hand, Paterson is coincidentally the last name of our protagonist, a thirty-something bus driver played by Adam Driver.\r\n\r\nThe film is a day-by-day account of one week in Paterson's life and in fact each day is rather the same: Paterson wakes up, kisses his wife (played by Golshifteh Farahani), goes to work driving the bus, comes home, eats dinner with his wife, takes the dog for a walk, and has a beer at the local bar. Yet Paterson also has an unusual hobby: for some time he has written poetry during each day's lunch break, and he has filled a small notebook with poems that his wife calls wonderful, but which he has never shown to anyone else.\r\n\r\nThere is a plot to Paterson, that is, an increasing of tension and a sudden and jarring climax, but overall Jarmusch is not aiming for any grand and intricate storytelling here. Instead, he is intentionally trying to capture the quiet music of one ordinary person's existence. Or should I say, two ordinary people's existence, for the film sympathetically captures this couple's marriage. Their relationship is a simple, uncomplicated one of trust and mutual understanding. Paterson is extremely fortunate to have this, as events around him show. (The script is by Sara Driver, Jarmusch's partner of decades, and one might see the film as a hymn to their own special relationship.) Many viewers are likely to find this heartwarming, while other viewers in more fraught marriages might burn with jealousy at Paterson and his wife's incredible harmony.\r\n\r\nThose familiar with Jarmusch's earlier work know that he has always liked to show a great deal of urban blight before the camera, such as vacant lots overgrown with weeds and graffitied walls. For Jarmusch, these backdrops supposedly served as a counterweight to the typical Hollywood depictions of the USA as all glitz, and it helped to underscore the bohemian qualities of his characters. Yet this blight surprisingly absent here. Paterson, New Jersey is instead shown as a clean and fairly prosperous town. Its residents, regardless of socioeconomic status or race, are depicted as rather content people.\r\n\r\nIn fact, at regular points in the film Jarmusch depicts interactions between whites and African-Americans or between gays and straights as if celebrating our new modern era when all those old divisions don't matter any more. This is definitely the most optimistic film that Jarmusch has ever shot, but this utopian vision does come across as a little heavy-handed and one feels that Jarmusch is overlooking pressing social issues that continue to hold many people back. Watching this film, I couldn't help but protest that this gentrified setting is not all of America, just a privileged few. \r\n\r\nStill, in spite of the film's flaws, the depiction of married life and the way that poetry is worked into the story is very moving, and I do feel this is worth watching, at least for established Jarmusch fans or those comfortable with indie cinema.", "created_at": "2018-07-21T21:07:04.266Z"}, {"movie_id": 370755, "review_id": "614b26d92b531d0062510b19", "rating": 10.0, "review_text": "I will go out a limb here (and try not to cut the branch out from under myself) and say that I feel this is nearly a perfect movie. Oh, I don’t mean that it is one of the best of all time, or even that it makes my own top ten list. But rarely does a film live up so well to what it strives to accomplish.\r\n\r\nIt is a quiet and gentle movie, full of love in nearly every scene. The two leads have great chemistry together. Laura almost comes across as a ditzy character, but the more time I spent with her, the more she seemed merely quirky, artistic and wise in small ways that matter in life.  She is optimistic and confident in her marriage, so I feared something would come along to threaten or damage that confidence. But that is not what this movie is about.\r\n\r\nPaterson could easily be a date night movie, or a “It has been a long day” movie to help you unwind. Heck, there is no violence, explicit language or sex, so you could watch it with kids and talk about some of the stuff that happens. (Not too young though; it might be too slow for real young’uns.) There is mild (and again, gentle) humor here, like from the scene-stealing dog Marvin, played by Nellie!\r\n\r\nWhen I went back to school in my 30s, we studied poet William Carlos Williams in an Honors program course, so I was interested to hear some of his work here. As the film states, he was a physician by occupation, but also a respected poet who influenced those who followed him. The book we studied (Perhaps the one named for the city of Paterson) actually began with a colon, like this -  :   Imagine the fun we had in class discussing why he did that! \r\n\r\nActually, I wasn’t crazy about the poems the character Paterson wrote in this film. I think the best poetry leaves a few things out, or represent by inference thoughts with word images. These poems feel like they would work just as well slid together as a prose essay. But I write novels, not poems, so what do I know, except that I really like this movie?", "created_at": "2021-09-22T12:51:37.538Z"}]