[{"movie_id": 986280, "review_id": "656f4aaf46e75f0100030457", "rating": 7.0, "review_text": "There's a lovely scene in this film where \"Holappa\" (Jussi Vatanen) and his mate are in an Helsinki karaoke bar staffed by a motionless barman who looks like he's straight out a zombie movie! Talking of zombie movies, the story follows the lives of this fellow and of \"Ansa\" (Alma Pöysti) whose first date at the local \"Ritz\" cinema is ecactly that - unlikely fodder for a burgeoning romance - even if their post film chat afterwards is under the gaze of a \"Brief Encounter\" poster. She has recently been fired for pinching some out-of-date food from the supermarket in which she worked. He's been fired a few times for too many vodka breaks at work. Her latest boss is arrested for drug dealing and that's when they first meet. They click, they go for a coffee - then that cinema trip ensues. Thing is, she has views on excessive drinking - it has profoundly affected members of her family. He's a bit of an ass about that - but perhaps she's had more of an impact on him than he realised. Maybe he can give up? Maybe she'll give him another chance? The humour here is plentiful but really quite dark and subtle. There are plot developments that we probably ought not to laugh at, but we do - and the ending leaves us hoping but not knowing. It's not exactly laugh out loud but you'll get plenty to smile about if you keep your wits about you for eighty minutes. Perhaps not a film the Finnish Culture Ministry would be too fond of - but I enjoyed it.", "created_at": "2023-12-05T16:07:11.612Z"}, {"movie_id": 986280, "review_id": "657076efd18fb9095ecf10d3", "rating": 5.0, "review_text": "It’s not much of a secret that the worldview of Finnish society can be more than a little bleak. At the same time, though, it also possesses an understatedly campy, eminently whimsical quality that comes in stark contrast to this otherwise-dour outlook. And this makes for a combination of traits that can be somewhat puzzling to fathom, especially to outsiders. That’s the quirky social conundrum that writer-director Aki Kaurismäki seeks to capture in his latest offering, a wry comedy-drama focused on the lives of two lonely, lovelorn working class Helsinki residents (Alma Pöysti, Jussi Vatanen) who struggle against life’s hiccups while seeking to forge a romance. But, in telling their story, the filmmaker has difficulty finding sufficient traction to engage viewers. We witness a story full of modest, garden variety ups and downs, as well as more than a few miscommunications, experiences we’ve all no doubt undergone ourselves from time to time. However, is that enough to make a compelling picture? It certainly doesn’t feel that way much of the time, given its wooden dialogue and restrained, sometimes-stilted performances, no matter how pointedly this production may portray the nature of this extraordinarily reserved people. To its credit, the film works best when it pokes fun at the nature of Finnish culture, providing some delicious nuggets of droll humor, backed by a diverse yet spot-on soundtrack that fittingly and ironically complements what’s unfolding on screen. Nevertheless, there’s so much here that lends so little to a narrative that just never catches fire that it’s hard to imagine almost anyone generating any interest in, or enthusiasm for, the protagonists and their feeble attempts at launching a relationship. Maybe I’m missing something here, but, if there is something meaningful that this release is trying to convey, it’s apparently well buried under one of those big piles of fallen leaves that give this picture its title.", "created_at": "2023-12-06T13:28:15.625Z"}]