[{"movie_id": 24271, "review_id": "63a4515820ecaf0091b74546", "rating": 6.0, "review_text": "**Discreet, elegant, modest... they could show films like this to the goofs who throw tomato soup at museum paintings!**\r\n\r\nArt has existed since human beings learned to understand the beauty of the world around them, and to capture it, to immortalize it on a surface. Initially, it was on the walls of caves, where our most remote ancestors represented the animals they lived with, the hunts they did and themselves. Whether in vivid color or simply engraved in stone, it was the birth of art as a concept, and the flowering of civilizations, the evolution of societies and the improvement of techniques led to an explosive and incredible evolution in artistic expression, and an enormous legacy that we, today, take care very badly. It is difficult for us to understand, now, in the 21st century, that art is a public good, not the exclusive property of a museum or a given collector. They are just guardians, sometimes temporary, of something that is much more universal and that should be cherished, valued and appreciated. And this reasoning also includes objects and buildings of historical and ethnographic value, archaeological remains and even documentary and archival funds. Not being art, together with it, they constitute a great cultural assemblage that is, in essence, our collective memory. As a historian, I am one of those who devote my life to studying, preserving, disseminating and caring for this memory.\r\n\r\nThis film, being a very light and funny comedy, shows very well the impact that art can have on someone's life, if we allow ourselves to be touched by it. The script, light and well written, brings together three museum security guards who, unhappy with the sale of their three favorite artworks to a Danish museum, decide to steal them before they are taken away. The plan involves replacing them with identical copies, and things, as is often the case in this type of film, will not go well without several funny incidents, and without the plan, on several occasions, running serious risks of failing. Spirited, it is a light film, but one that shows the affection that art deserves from all of us. Honestly, I would show this film to those groups of spoiled upstarts who are throwing mashed potatoes, tomato soup and the like at museum paintings!\r\n\r\nThe film brought together three great actors for the main roles: Christopher Walken, Morgan Freeman and William Macy. Each of them did their best, and we could see very well that they even had fun working on this project. Marcia Gay Harden is also present, and is very supportive of the trio, but keeps a low profile. The film is not particularly original, it even reminded me a little of “Ocean's Eleven” or “Thomas Crown Affair”, and the whole heist has a certain degree of credibility: it is not a complicated or far-fetched plan, but something that could be credibly carried out. However, not everything was so good: the biggest problem with this film is the domestic sub-plot of Walken and Harden, where some things aren't properly explained; the characters (except for Walken) are unexplored, and their past and personality is not revealed. But being a comedy, I think it's a minor issue.\r\n\r\nTechnically, it's a very good film, considering the relatively low budget, and the fact that it went straight to video. Normally, this is something that is done to very basic films, but this film would even have deserved an afternoon session in any “multiplex”, because it made every coin pay and does not appear modest, although it is a discreet film that will be, surely, quickly forgotten. Filmed in various locations between Boston and Puerto Rico, it has good production values, good sets, good costumes and good cinematography. The jokes are quite unobtrusive, they don't always work and won't make fans of more brazen humor laugh. The soundtrack is effective.", "created_at": "2022-12-22T12:45:12.422Z"}]