[{"movie_id": 374720, "review_id": "5975c00f92514106a802387a", "rating": null, "review_text": "\"Surely the filmmaker’s insistence upon imposing his favourite device upon all his narratives is edging towards Shyamalan-like overkill...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2017/7/22/dunkirk.html", "created_at": "2017-07-24T09:38:23.861Z"}, {"movie_id": 374720, "review_id": "59824ad8c3a3680d3201d930", "rating": 3.0, "review_text": "I was a little disappointed with this movie. I expected much more. Cinematically it was brilliant and it was an event/action driven movie when left me feeling a little disconnected. We don't know anything about these characters that we see and I personally didn't feel any emotions for the movie, even though I wanted to. I found myself quite bored halfway through the movie, the whole time I kept expecting more.", "created_at": "2017-08-02T21:57:44.203Z"}, {"movie_id": 374720, "review_id": "5984ff1fc3a36875040120b5", "rating": 8.0, "review_text": "Tense film draws you to a doomed group.\r\n\r\nThose how are veteran war historians will quibble at some parts of Dunkirk, notably the separation of English and French troops in evacuation and the ships used to evacuate them. Dunkirk uses a few conceits to keep you involved. The first, which adds a notable amount of tension to the film, is a ticking clock in the background moving you to the final day. We see intercut scenes from different periods, prior, during and enacting the rout.\r\n\r\nActing is excellent throughout, and versimilitude is achieved with models of aircraft, uniforms, landing stages and so on. Injections of friendship and subsequent loss direct our affection to the sufferers. Harry Styles is more than competent as a young troop and Kenneth Branagh brings integrity and verve to his role as a tired and firm leader. If one oversight might have been addressed, it is the lack of focus on the German side of things in this affair. Our few glimpses are of German fighters and so on, with very explanation of the goings-on at the front.\r\n\r\nOverall an excellent war movie meant to be among your top ten, if not top five (It will be hard to dislodge All Quiet on the Western Front, Apocalypse Now, Paths of Glory, Saving Private Ryan and Tora Tora Tora!, among others). Recommend highly a good 8/10.", "created_at": "2017-08-04T23:11:27.437Z"}, {"movie_id": 374720, "review_id": "59b8094f9251417e650011f9", "rating": 7.0, "review_text": "Dunkirk is a beautiful and unconventional World War 2 epic that is undoubtedly captivating, but it takes risks that may alienate some viewers. \r\n\r\nWhen people talk about a film they think it's about the setting, but it's actually about the characters. Saving Private Ryan isn't about World War 2. It tells a story about a squad of soldiers tasked with finding a young Private Ryan and getting him back safely to his family. Saying Dunkirk is a film about the Battle of Dunkirk however, is not inaccurate. The setting and characters are one. The choppy waters of the English Channel are equally as important, if not more so than the people who fought and died in them. As much as this makes for an interesting way to make a mainstream war film, it's also the reason why I wouldn't care to sit through it again. In some ways, it feels like watching a documentary with the narration turned off. \r\n\r\nI walked away impressed, and at the same time emotionally and intellectually unfulfilled.", "created_at": "2017-09-12T16:20:31.375Z"}, {"movie_id": 374720, "review_id": "5a45fd130e0a264f8507a60a", "rating": 4.0, "review_text": "_Dunkirk_ was my best mate's favourite film of 2017. I find it difficult to understand exactly what drew him to this film so strongly. I find it difficult to say anything passionate about _Dunkirk_ at all. I think I arguably felt some tension in the earlier moments, and some of the shots were beautiful... I think? I honestly can't remember. _Dunkirk_ washed over me in the least impactful way possible, and then, like the tide, it was gone.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2017-12-29T08:30:11.717Z"}, {"movie_id": 374720, "review_id": "5a510e64925141133300c8fe", "rating": 9.0, "review_text": "I want to start by saying I’m tired of seeing the big names in every movie I see, I think at times big name actors can take away from a movie more than benefit.  Dunkirk did a great job of allowing us to focus less on the actors and more on the story. I feel this movie put me in the story and allowed to experience first hand some of the lives that were impacted.\r\n\r\nThere wasn’t a lot of character building in this movie, but that’s what I loved, I feel like I was allowed to more so build on the experience over one person’s story. Since we’re not typically used to a movie being experience based over character based, I think some may find this as a flaw.  I did not. There were multiple stories and perspectives, all which immerse you into the current situation.\r\n\r\nChristopher Nolan did a great job of creating an overwhelming feeling of hopelessness throughout the movie, I felt like I could never feel safe and constantly looked for a way out. I was on the edge of my seat for the majority of the movie.\r\n\r\n**Dunkirk was a great roller coaster ride that allowed a view one may otherwise never experience.**", "created_at": "2018-01-06T17:59:00.119Z"}, {"movie_id": 374720, "review_id": "5a9af8ce9251412842020efd", "rating": 6.0, "review_text": "Okay first off, who came up with the idea \"Let's all cast guys who look exactly the same\"?  With all the jumping around in the story I could not tell who was where and what was going on half the time.  I see what he was trying to do on the cinematic side but it made it difficult as the viewer to fully follow it all the way.  \r\n\r\nProduction value was amazing and some of the scenes were absolutely stunning! Tom Hardy just flying over the coast was amazing.  But Tom Hardy could not save this movie.  I didn't know who was running where or if this person had died yet and the lack of dialogue was no help at all.  \r\n\r\nWouldn't watch it again", "created_at": "2018-03-03T19:34:38.853Z"}, {"movie_id": 374720, "review_id": "5c2b93dec3a3682913a152be", "rating": 4.0, "review_text": "I have put off viewing this film for quite a while. The main reason for this is that I am somewhat reluctant watching a movie where the story is pretty well known before you sit down to watch it. However a few days ago I finally did and, given all the hype, I have to say that I expected more, a lot more.\r\n\r\nSure the movie is a cinematically very well down movie. Acting, camera and all that is excellent. Unfortunately that is all there is.\r\n\r\nFirst of all, where the hell did the over-inflated budget go? Dunkirk was a major undertaking with almost 400 000 soldiers involved and hundreds and hundreds of boats. We get to see what? A few columns of soldiers, a handful of boats and three pitiful spitfires against a bomber and two Fock Wulfes. To add to this insult we pretty much get to see the same bloody event over and over from different angles. This is an insult to all the brave men that made this rescue possible.\r\n\r\nThere are a few likable people in the movie. Like the Navy commander and the elderly guy on the pleasure boat steaming to rescue. The rest are either psychotic or morons.\r\n\r\nRealism? Not so much. Like the scene where a bunch of soldiers are trapped in a boat being shot to pieces. Would any one in their right mind really have thought they could plug dozens and dozens of holes with their hands and then sail across the channel?\r\n\r\nThen we have the spitfire which runs out of fuel and glides around forever over the beach so the director can get some scenic shots done. Other times fairly large boats gets damaged and flips over in seconds.\r\n\r\nI would also have expected some pre-story. Some build up. But no, the story starts right away with these measly handful of boats and planes taking for bloody ever to drag themselves over to where they are supposed to go.\r\n\r\nQuite a disappointment indeed.", "created_at": "2019-01-01T16:22:54.285Z"}, {"movie_id": 374720, "review_id": "5ff0c88028d7fe0040b08e0a", "rating": 8.0, "review_text": "Very good.\r\n\r\n<em>'Dunkirk'</em>, as you'd expect given the director, is extremely well made. I particularly enjoyed how the film is shot, the sound editing and the score. It's a watchable story about an event from World War II.\r\n\r\nI wouldn't, personally, say there's a standout cast performer. I don't mean that negatively, it's just more a film about a group of people rather than individuals - which I assume was the intention. There are still good performances, from the likes of Tom Glynn-Carney and Jack Lowden. It also features star names, including Tom Hardy, Cillian Murphy and Mark Rylance.\r\n\r\nThe music and how the sequences are crafted is what elevates this film up, while the pacing is almost spot on - they could easily have made this 2hr 15mins+, like most war films seem to do, but keeping it at around 1hr 47mins was a smart choice. I do still feel like it could've been greater, yet I still got entertainment from it.", "created_at": "2021-01-02T19:24:48.185Z"}, {"movie_id": 374720, "review_id": "63bf88fea5743d00b0be9170", "rating": 1.0, "review_text": "It starts off well, with a little glimpse of a British Soldier that was as unprepared as the UK for the war. It's a nice teaser...\r\n\r\n...then a little story about the civilian involvement with the evacuation...\r\n\r\n...And it all comes with the promise of being a British \"Saving Private Ryan.\"\r\n\r\nUnfortunately it ends up being a lot more Michael Bay than Steven Spielberg. that is to say that it looks nice and sleek and professional but is otherwise lacking in a real story.\r\n\r\nSpielberg managed to tell a story that was both pro-Soldier and anti-war, and that made the whole Normandy Beach until the very end a pleasure to watch.\r\n\r\nDunkirk, on the other hand, gives up about 15 Minutes in and decides to just focus on the action with the story being an after thought.\r\n\r\nIn short it's boring.", "created_at": "2023-01-12T04:13:50.821Z"}, {"movie_id": 374720, "review_id": "645fcc14ef8b3200fe7ce3df", "rating": 3.0, "review_text": "**Considering the quality and talent of those involved, the budget and all the variables, the film is unforgivably disappointing.**\r\n\r\nThe Dunkirk disaster was one of the opening moments of World War II: in the face of the unstoppable advance of German troops, a mixture of British, Belgian and French soldiers were pushed into the English Channel, fortifying themselves in the French city of Dunkirk. The prospects could not be worse: in a few weeks, hundreds of thousands of exhausted Allied soldiers found themselves surrounded by a powerful Panzer division and under constant attack by German aviation, having no port capable of evacuation, which would be carried out by smaller vessels in the so-called “Operation Dynamo”. And everything indicated that, after France, it would be England that suffered the German invasion, so the British could not be more apprehensive.\r\n\r\nDespite the fact that the film paints the episode in a positive light (trying to highlight the ability that the British had to successfully evacuate their troops), there is no doubt that Dunkirk was a disaster and is, even today, one of the most humiliating moments of British military history, comparable to a similar situation that occurred in 1809 in A Coruña, where British soldiers also found themselves between the sea and the enemy, this time Napoleon's army. Moreover, this film turns out to be a kind of remake of a film with the same name and the same theme made in the 50s.\r\n\r\nDirected by Christopher Nolan (a talented and fashionable director), the film has a cast full of strong names in the industry. Mark Rylance has the most prominence in the role of a civilian, owner of a small yacht, who decides to go personally to rescue soldiers with his sons. Tom Hardy also gives us an excellent job, in the role of a British aviator who helps as he can. Cillian Murphy is believable in his work, giving us an idea of the shock a soldier can experience in a combat situation. Harry Styles and Aneurin Barnard also deserve a positive note. Sir Kenneth Branagh stands out, embodying the figure of British stoicism, but I found his character somewhat forced to be more impassive than would be plausible in that situation.\r\n\r\nDespite its merits, it is an indisputably cold and unexciting film. Anyone expecting incredible shootouts or grandiose battle scenes will be disappointed and have to settle for some good dogfight-style fighter combats and some more tense scenes, but which never materialize in combat scenes worthy of a great war movie. And considering the number of soldiers surrounded there, one would expect to see a crowd of soldiers... however, this only happens occasionally, and it even seems that production has saved on the means. Written in a simplistic way, the script distracts attention and places more emphasis on what is happening in the sea and in the sky, so the German threat is something that we don't quite understand and that the film doesn't waste time explaining. With me, that wasn't a problem, but the worst History students will have to read a little to find out what's going on. The characters are also not developed: there is no concrete villain because the enemy soldiers are collectively, so there is also no undisputed protagonist character.\r\n\r\nTechnically, it has several merits and demerits to consider. On the one hand, it is an authentic visual spectacle thanks to a masterful filming work and a remarkable and very well crafted cinematography. The sound also deserves praise thanks to very good effects, very well-used and, of course, a tense and efficient soundtrack signed by Hans Zimmer (in yet another collaboration with Nolan). Unfortunately, the editing is bad and, if the script already had flaws, the non-linear narrative accentuated them even more, making the film confusing and strange.", "created_at": "2023-05-13T17:42:44.071Z"}, {"movie_id": 374720, "review_id": "6532942d6d9fe800c4a8de11", "rating": 8.0, "review_text": "Yes.", "created_at": "2023-10-20T14:52:29.976Z"}]