[{"movie_id": 44264, "review_id": "51ec28a319c295369c3a2ed7", "rating": null, "review_text": "Over their storied career, the Coen Brothers have made some of the most original, most iconoclastic, and most critically-acclaimed films of all time. They've tackled adaptations (No Country for Old Men, O Brother, Where Art Thou?) and remakes (The Ladykillers) before, of course, but even these films have borne the brothers' unmistakable mark of originality, their skewed vision of the world, and their cynical, sarcastic sense of humor.\r\n\r\nWhat, then, to make of True Grit?\r\n\r\nIt's termed a re-adaptation of the original Charles Portis novel, a \"re-imagining,\" in the parlance of our time. One is hardly able to discuss the film without the spectre of John Wayne, however: the best-known adaptation of the book was one of the film legend's definitive roles, one of those cultural touchstones that rarely if ever are engineered. Discussion of that film invariably centers on Wayne and his performance: a washed-up, forgotten cowpoke that seemed tailor-made for Wayne to draw on his position at the time. A direct predecessor of Mickey Rourke and The Wrestler.\r\n\r\nI'll admit that it was the Coens' pedigree that moved me to see this film. I've by nature little interest in Westerns, but despite producing a few lesser films (I'm looking at you, Burn After Reading), the Coens' sheer talent, along with the casting of Jeff Bridges in the John Wayne role, had me intrigued.\r\n\r\nThe story is simple and straightforward: The father of young Mattie Ross (Hailee Steinfeld) is murdered by a two-bit criminal (Josh Brolin), and she takes it upon herself to see him brought to justice. To that end, she hires a reputedly ferocious US Marshal named Rueben \"Rooster\" Cogburn (Jeff Bridges), while a prideful Texas Ranger (Matt Damon) tags along, hoping to bring the perpetrator to justice for a big reward.\r\n\r\nAnd that's it, really. Completely absent is the trademark Coen plotting, convoluted subplots that twist and turn over onto themselves as though the script were one enormous Möbius strip (Möbius script?). Gone are the defiance of genre definitions, the satirical take on stories, the feeling of the brothers Coen peering through the camera lens at their subjects as though they're studying specimens in a jar. This is straightforward filmmaking, telling a simple tale with all the incredible talent and creative power the Coens command.\r\n\r\nSo what's not missing, then, are the richness of character, impeccable performances, beautiful cinematography and arresting score that are the other hallmarks of a Coen film. Attention is naturally centered on Jeff Bridges, having the audacity to take on one of the defining performances of one of the most famous actors ever. Bridges doesn't attempt to mimic Wayne. He crawls into this character and wears him like a suit. A hairy, shaggy, smelly suit. But Bridges inverts the typical presentation of such a character: instead of offering the audience with a cold, unfeeling badass whose heart is gradually thawed by the presence of a precocious youngster, this Cogburn is introduced as a shiftless layabout with a reputation who seems to have all but given up on such activities in favor of sleeping and boozing, the events of the film conspiring to scrape away that useless crust to reveal the force of nature beneath. Matt Damon, an actor who's never been in a Coens film before but seems as though he should have, also offers a great performance as the proud and buffoonish Texas Ranger LeBeouf, as do Barry Pepper and Josh Brolin in their short but effective appearances as heavies.\r\n\r\nBut the yeoman's work lies not on Bridges' grimy, slouched shoulders. Instead, our focus is on fourteen-year-old Mattie Ross, and the performance given by fourteen-year-old Hailee Steinfeld is, in short, one-of-if-not-the finest performance I've seen in quite a long time. Not content with giving such an incredible performance as a young teenager, this is, to boot, Steinfeld's first film performance. Steinfeld's Mattie Ross is smart, wily, mature, childish, scared, brave, and a force of nature in her own right. She has been wronged, she will see that wrong redressed, and nothing will stand in her way. An early scene in which she negotiates with a trader for horses and money is not only hilarious but revealing, one of the best character introductions in film history.\r\n\r\nSuch an unexpectedly straightforward film from the Coens deserves an equally straightforward judgment: I truly loved this film. There is so much greatness contained within it, from the powerhouse performances of Bridges and Steinfeld to the dark, touching, hilarious script, to Roger Deakins' breathtaking cinematography, to Carter Burwell's haunting score comprised of reorchestrations of classic hymns. It's one of the most perfect films I've ever seen. This is the second fantastic remake I've seen this year, the second to eclipse the original (the first being the superlative Let Me In). If you're wondering whether or not to see this film, wait no longer: go immediately to your nearest theater and buy a ticket. Speaking for myself: I can't wait to see it again.", "created_at": "2013-07-21T18:29:55.254Z"}, {"movie_id": 44264, "review_id": "5ad81f7b0e0a26434500ba76", "rating": 8.0, "review_text": "Some people have said that this film followed the book better than the original one with John Wayne. I have not read the book but I must say that I did not feel that there was that much difference between the John Wayne version and this one. Sure, there was a difference in the details but the main elements was pretty much the same. There was an epilogue on the end which was a tad more sad, but certainly not misplaced, than in the original film.\n\nI have to say that the film it was very good. Jeff Bridges was doing an excellent interpretation of Rooster Gogburn. I found him to be quite “John Wayne like” in this film which is perhaps why I liked it so much.", "created_at": "2018-04-19T04:47:55.218Z"}]