[{"movie_id": 256274, "review_id": "5758fac1c3a3684e300002e8", "rating": 10.0, "review_text": "I'm giving this movie 10/10. It became one of my favorite movie & below are reasons why: First, it's original, different from other horror movies, which brings interesting story, where crowd of few people seek historic relic & treasure. Movie was very eerie & creepy, especially when they go deeper & deeper close to hell. Some very strong & intense moments. Atmosphere was also eerie cause whole movie happens in damn catacombs. If you have Claustrophobia I don't recommend to watch it. If you're fan of movies like The Tunnel(2011) or The Devil's pass, you gonna like it.", "created_at": "2016-06-09T05:12:33.748Z"}, {"movie_id": 256274, "review_id": "5f789b9f021cee00352dcc13", "rating": 8.0, "review_text": "Great watch, would watch again, and can recommend.\r\n\r\nIt is found footage in the catacombs of France so in addition to shaky cam and odd angles, it does feel really claustrophobic at points.  If you were okay with \"The Descent\", then you're likely fine.\r\n\r\nThis is based off of a real thing that people do, exploring existing structures, some lost through history, others unused, and even more that are assumed inaccessible from the the layman.\r\n\r\nPersonally, instead of making these places a crime, people should be able to add infrastructure as needed, but it is the primer for the events of the actual movie.  Chased down into the catacombs, they basically just keep going towards insanity.\r\n\r\nThere are so many good points in the psychological horror of it all, and the great unknown of the caves plus random acts of terror makes a great formula for the events of this movie.\r\n\r\nProbably the best \"philosopher's stone\" story I've ever seen.", "created_at": "2020-10-03T15:41:19.779Z"}, {"movie_id": 256274, "review_id": "6391fe2d957ce500a9b482b4", "rating": 7.0, "review_text": "Expected very little going in and was pleasantly surprised by how much I liked it. “As Above, So Below” will keep you on the edge of your seat from start to finish. The attention to detail in this film is impressive, with each scene meticulously crafted to create a sense of unease and tension while maintaining an internal consistency unusual in the horror genre.\r\n\r\nThere’s a chance that this was lost on some viewers. Perhaps it’s just the found-footage fatigue. It’s a shame that the ratings fail to reflect the film’s merits; it’s one of the more inventive entries in the found-footage horror subgenre. The frights are expertly staged, with little reliance on cheap jump scares, instead creating a foreboding mood that keeps you on the edge of your seat until the very end. The setting, an underground maze of catacombs beneath the streets of Paris, adds to the film’s eerie atmosphere and gives it a unique twist on the typical haunted house tale.\r\n\r\nAs a thriller, “As Above, So Below” succeeds on most fronts and should please audiences. It’s a must-watch for fans of the genre because of its meticulous attention to detail and expertly constructed suspense.\r\n\r\nRating: 7.2/10 (Good)", "created_at": "2022-12-08T15:09:33.221Z"}]