[{"movie_id": 217, "review_id": "53fe9e9f0e0a262de5003162", "rating": 8.0, "review_text": "Life in the old dog yet.\r\n\r\nIndiana Jones is called back into action when he becomes entangled in a Soviet plot to uncover the secret behind mysterious artifacts known as the Crystal Skulls.\r\n\r\nSo here it is, the fourth instalment of the Indiana Jones series is finally here, one of the most talked about, most anticipated, and most yearned for films is here to hopefully entertain the fans and maybe garner some new ones in the process?? Does it deliver? Well to me it most certainly does, as adventure yarns go, this is a ripper, and although the plot gets lost within the outlandish ideals, the film still emerges as one of the betert popcorn blockbusters of the year. All the chief ingredients that have made the franchise so beloved are crammed in by way of crowd pleasing necessity, and it damn well works, outrageous action sequences perk us up at frequent intervals, deftly self aware comic moments are many, and crucially, the film remains loyal to the heroic good against evil spirit of the franchise.\r\n\r\nWe begin in the Nevada Desert in 1957, and it's through this 50s setting that we come to accept the ageing of the main protagonist, he is after all a mere mortal, a man with a whip and a bit of guts. The 50s was a time of paranoia, spies and dubious cover ups were all the rage, this shines through from the outset here, and putting an aged Indiana Jones in this time frame is nothing short of genius. But enough of the politics, we as fans just want to be entertained, and we are well served here, spooky chambers, mysterious civilisations, tricksy maps, unfathomable codes, creepy crawlies, peril at every turn, and stuntery abound, oh yes it's all here. However, the purists will hate the use of CGI in this, and for sure it does grate during one over extended sequence, but just like it didn't stop Stephen Sommers' The Mummy being a riot, it doesn't harm this picture either, we are after all talking about a popcorn actioner here. Surely going into a film of this type one immediately suspends disbelief? I mean I'm personally going into the cinema to escape for a couple of hours, and Kingdom Of The Crystal Skull is just what the doctor ordered, with a lollipop to follow for good behaviour.\r\n\r\nThe cast are a mixed bunch, Ford easily carries off the role as the older Indiana Jones, very aware and with tongue firmly in cheek, he surely has rammed all the pre-negative vibes down the throats of the doom mongers. Shia LaBeouf fits into the series with no problems at all, spunky and witty, he adds the young sparkle needed to off set the aged nature of our hero, and he gets a quite delightful entrance to boot. Ray Winstone is an odd casting choice because his character is very underwritten, if you are going to utilise the big Englishman then give him the reins to take, he's gruff and watchable but it remains a case of wasting talent. Karen Allen joyfully reappears as Marion, and the film takes a significant leap upwards once she arrives, however the character is reduced to playing fourth fiddle in the ensuring shenanigans, and as much as the interplay with Indy still sparkles, you can't help hankering for much more from our Marion. Cate Blanchet is sparky as Irina Spalko but although as our chief villain of the piece she's tough, sexy, and not to be messed with, it's a turn that is never quite fully formed. John Hurt does the best he can with what little the role calls for, whilst Jim Broadbent barely gets time to fill the considerable boots left by Denholm Elliott's Marcus Brody.\r\n\r\nIndiana Jones and the Kingdom of the Crystal Skull will divide fans and newcomers alike, but I honestly say without nostalgia rearing its head, that this film is a joy ride to be judged on its own merit. It's difficult to understand some of the venom aimed at this latest instalment, it's not like anything has really changed with the formula, Indiana Jones has always been about fun, nothing more and nothing less, just remember why you fell in love with the franchise in the first place and you will see the makers here have given the fans what they wanted. Perhaps the advent of time and the new technology available has a hindrance value for sure, but although Indy 4 obviously isn't quite the impacting franchise jolt that Bond got with \"Casino Royale\", it's sure as hell shown \"Die Hard 4\" how it should have be done. 8/10", "created_at": "2014-08-28T03:14:39.887Z"}, {"movie_id": 217, "review_id": "5f3c6d96e295b400329dfaf4", "rating": 6.0, "review_text": "Good watch, could watch again, and can recommend.\r\n\r\nI'm always confused on when this movie is supposed to happen, and too many people get caught up in the involvement of Shia Lebouf to think too hard about it.\r\n\r\nThis movie catches a lot of flak for Shia and half a dozen other things, but  compared to the original 3 movies, the concepts of a crystal skull aren't any more weird.  While people forget that aspects of the first 3 artifacts are real, the crystal skulls are a real thing that is actively being investigated.  Because it's caught up in all the \"alien conspiracy\" communities I think the movie absorbed some of the ridicule of those people.\r\n\r\nThe story itself is well structured, Cate Blanchett and Karen Allen are welcome are awesome additions to the story, and despite the \"sci-fi\" element from an alien skull, the movie keeps to a archaeological theme by investigating an ancient temple site.\r\n\r\nWhile I'm not going to re-watch this, please ignore the negative hype and give this a try if you like a good action adventure story.", "created_at": "2020-08-19T00:08:54.304Z"}]