[{"movie_id": 635910, "review_id": "64f444983d43e0011b1c09f9", "rating": 7.0, "review_text": "Last Voyage of the Demeter, manages to wring every creepy last drop, out of what is, a rather limited setting. \r\n\r\nThis is a disturbing film in many respects. It takes the myth of Dracula as envisioned by Bram Stoker and makes something fundamentally primal, awful and genuinely chilling, out of it. \r\n\r\nThis vampire is not your polite, European, with dental problems but more your monstrous Nosferatu.Its a sensible choice, as it amps ups the fear factor, in what is,the confined setting of a ship.\r\n\r\nActing is top shelf too and really adds depth to what is already, a more than decent, horror film. \r\n\r\nThe only real downside is a few inconsistencies in the plot. Two of the characters go to investigate the crates, where they suspect the vampire dwells. One says she has no idea how to kill the vampire, having observed a crew member, who was bitten, burning in daylight. Indeed, why would the other character, who asks the question, apparently a doctor, not be more observant too? The captain and the remaining crew, are left out of this dangerous expedition, why? Why too, go at night, in the knowledge that this is when the vampire is out and about, taking compulsory blood donations?\r\n\r\nIn summary, an above average horror film that's truly creepy, disturbing and chilling. Perhaps only limited a little by the confines of its setting and a few, rather obvious, plot holes.That said, I still rate this a decent watch, if you enjoy vampire films.", "created_at": "2023-09-03T08:32:24.590Z"}, {"movie_id": 635910, "review_id": "6510445e6f53e10aa7af1d0d", "rating": 4.0, "review_text": "Very middle ground horror movie. The CGI Dracula is pretty boring throughout. Not much new to offer.", "created_at": "2023-09-24T14:14:55.027Z"}, {"movie_id": 635910, "review_id": "6557e5ed0816c700e01a70b6", "rating": 7.0, "review_text": "MORE SPOILER-FREE MINI-REVIEWS @ https://www.msbreviews.com/movie-reviews/mini-reviews-2023-edition\r\n\r\n\"The Last Voyage of the Demeter breathes new life into the Dracula narrative, offering a surprisingly fresh take on the classic tale. This adaptation stands out with exceptional makeup work, impressively relying on real, practical effects instead of succumbing to the CGI trend. A remarkable choice that adds realism to the gruesome scenes filled with gore, bloody kills, and shocking imagery. Director André Øvredal's willingness to make bold decisions deserves much praise, as do the claustrophobic, eerie atmosphere and a potent score that avoids the formulaic build-ups to jumpscares. Gorgeously shot with excellent control of dark lighting and commendable VFX. Despite its strengths, the film overstays its welcome, falling into a somewhat predictable structure. A notable frustration arises from the nonsensical decision to reveal the ending in the opening sequence without substantial justification, leaving a lingering dissatisfaction with an otherwise daring, visually striking, highly entertaining horror flick.\"\r\n\r\nRating: B+", "created_at": "2023-11-17T22:15:09.667Z"}, {"movie_id": 635910, "review_id": "6558c3c6d4fe04011b92da1c", "rating": 6.0, "review_text": "The Last Voyage of the Demeter is a movie directed by André Øvredal (Troll Hunters, 2010, The Autopsy of Jane Doe, 2016), that tells basally the prologue of 1897's Bram Stoker's \"Dracula\" (1847-1912) that tells about the Captain's Log of the Bulgarian ship named after the movie tile in 1867, before the events that happens in England.\r\n\r\nBragi Schut Jr. that took almost 20 years to put the idea to a movie adapted the text to a full screenplay (Escape Room, Velvet Road) and there may reside the big flaw of the movie, because the rhythm is inconsistent and the plot even being interesting moves very slowly, with many flaws. It tries to emulate an ancient Alien the 8th passenger movie to this claustrophobic setting.\r\n\r\nMaybe the worst mistake was to put a protagonist Corey Hawkins in the role of the afro-english doctor Clemens that survives the trip and will start the hunt for Dracula, this already show in a pre-credits scene where the doctor is on a bar and see's the shadowy figure of Dracula, alrey telling the viewers that will de a sequence, on cinema or streaming.\r\n\r\nNothing to say about the well know story - a massacre of the tripulation of the ship, that consists with the book, and the arrival at the destiny as a wreck with the coffin containing earth of Dracul's \"bed\" (I wonder if it sunk in the middle of the Atlantic what would happened - no earth, but no no sunlight so...anyway:). \r\n\r\nAfter some gruesome assassinations on the ship, is obvious that somebody would be suspicious of each other, but not in the scale they happen, The mouse and cat cat between Dracula (in his man-bat form) and crew is the main core of the movie. \r\n\r\nGöran Lundström made the wonderful prosthetic work that was used almost 100% oon the scenes with dracula only using CG to put the artist that interpreted it  on the creature (that is very similar to the one at Midnight Mass at Netflix)\r\n\r\nBeside the prosthetics and some scenes, the movie is too slow, and the final is ridiculous. I would give it a score of 6,0 out of 10,0 / B- by the effort.", "created_at": "2023-11-18T14:01:42.416Z"}]