[{"movie_id": 97367, "review_id": "5c2c82610e0a2655f43a6800", "rating": 8.0, "review_text": "If you ride like lightning, you're going to crash like thunder.\r\n\r\nThe Place Beyond the Pines is directed by Derek Cianfrance and Cianfrance co-writes the screenplay with Ben Coccio and Darius Marder. It stars Ryan Gosling, Bradley Cooper, Eva Mendes, Emory Cohen, Dane Dehaan, Ray Liotta, Ben Mendelsohn and Rose Byrne. Music is by Mike Patton and cinematography by Sean Bobbitt.\r\n\r\nA motorcycle stunt rider finds he has a son he never knew about and turns to robbing banks as a way to provide for both the child and his one time lover. This puts him on collision course with an ambitious rookie cop that has serious life changing consequences for both of them...\r\n\r\nThe Place Beyond the Pines (superb title) is a three parter of a character study that examines the critical decisions we make in life whilst putting different characters along a road of reckoning. The atmosphere of palpable human foibles is quickly established by Cianfrance, the introduction of stunt rider Luke Ganton (Gosling mesmerising) the kick start for what will be a multiple character piece even though the narrative core is purely about Ganton and cop Avery (Cooper) and their impact on each other and those connected to each.\r\n\r\nSuch is a key element of events in the story, it's difficult to say too much because this picture demands that spoilers are not dished out willy nilly. Going in blind without knowledge of the story trajectory is a must to garner maximum rewards. What can be said is that for the final third the pic does lose momentum, there's a big shift of emphasis (though critically connected to all that has gone on previously). It's not a film killer, though, for this remains a damn fine film, one that is packed with utterly gripping sequences, but the ambitiousness shown by Cianfrance is almost the undoing of a fascinatingly engrossing experience.\r\n\r\nThe consequences of choices are profoundly explored here, the multigenerational axis riveting in execution by director and writers alike. It also looks terrific, evocative cinematography from Bobbitt (12 Years a Slave) is in turn boosted by Patton's tonally compliant musical score. Ultimately, to enjoy fully you will have to accept implausible contrivances and that the psychological digging never really achieves all that it should. A bit of better thought for the last third and some trimming of the run time would have helped greatly, but this is still quality film making and recommended to grown up film fans for sure. 8/10", "created_at": "2019-01-02T09:20:33.511Z"}, {"movie_id": 97367, "review_id": "63add1b822af3e00d3db2b10", "rating": null, "review_text": "Great movie", "created_at": "2022-12-29T17:43:20.725Z"}]