[{"movie_id": 414001, "review_id": "600f94659a6435003e92d956", "rating": 6.0, "review_text": "I like Colin First enough to cut his films some slack sometimes, and this is one of those times. I thought the movie was entertaining overall, and well acted. At the same time I had a couple of problems with it. One was that I found the family flashbacks while he was at sea to be distracting. It wasn’t a big thing, but they didn’t seem meaningful or well placed as far as furthering the plot or his character.\r\n\r\nThe other issue was perhaps because I wasn’t paying close enough attention, but a few gaps emerged for me as far as knowing what he was doing during the voyage. It made sense to me when I researched his story a bit, but until then there as some confusion for me.  But I wouldn’t discourage anyone for watching it for that or any other reason.", "created_at": "2021-01-26T04:02:45.185Z"}, {"movie_id": 414001, "review_id": "65a3e32ad35dea012b431978", "rating": 6.0, "review_text": "Based on the true story of aspiring round-the-world yachtsman Donald Crowhurst (Colin Firth) this rather disappointingly sluggish drama tries to engage us in the man's lifelong passion. A passion that jeopardises his business, puts him into debt and relegates his wife and two young children to second place as he reckons he can circumnavigate the globe in his catamaran. This isn't a story that I was aware of, historically, but the facts are undeniable so it's really all down to how director James Marsh tells us the story of the determined man. In that respect this doesn't really deliver. Firth brings no sense of peril to the risks of the role. It's as if he was one of those people who would go off climbing mountains in January with just trainers and a t-shirt on. It emphasises way more the venal aspects of funding his participation but not really the competitive or characterful ones and the seaborne action - such as it is - is duck pond stuff that gives us little sense of just how treacherous the ocean can be. Though the denouement did rather swipe at a press that can be desperately fickle, this whole film just didn't ever get going and at almost two hours I felt it dragging as surely as if it had an anchor of it's own. It's a watchable film, but it's certainly not a memorable one.", "created_at": "2024-01-14T13:35:38.361Z"}]