[{"movie_id": 16614, "review_id": "5eb5b61bbbe1dd00217fdc87", "rating": 8.0, "review_text": "Mottola strikes one from the heart. \r\n\r\nIt's 1987 and James Brennan is home for the summer after earning himself a degree in Renaissance Studies. Which unsurprisingly isn't any use to him when trying to gain employment in this part of Pittsburg. Which is now a problem since his planned trip to Europe has fell by the wayside due to his father's enforced unemployment. So thus he finds himself working at Adventureland, a rusting time warp amusement park where only odd balls and idiots appear to frequent. But here James will make friends, learn life lessons and maybe just find true love?. \r\n\r\nBe under no illusions, Adventureland is no teen sex comedy reliant on crude jokes and cringe slap-stick moments to get its humour. Which as it's brought to us by the director of Superbad may come as something of a surprise. Greg Mottola is the said director, who here has crafted an ode to his own teenage strife's concerning first jobs and first loves. Though not really offering anything new as such, I mean the old \"summer I came of age\" film is hardly new is it? Mottola has however managed to blend youthful spirits with a serious kink and nicely cloak it in a bittersweet 80s haze. \r\n\r\nSome parts are clearly aimed at the guffaw teen viewers, awkward erections and friends who punch you in the testicles - tee hee hee, Adventureland feels, and is, a subtle film made by someone who clearly lived it. The care and thought that Mottola has put into it benefits the cast as much as it does the viewers. Jesse Eisenberg (James) is a splendid bit of casting, almost poetically slow, he nicely plays it to have the upcoming tribulations totally believable. Enter Kristen Stewart as Em, pretty and smartly essaying a girl, soon to be woman, trying to make sense in her off kilter world. Her scenes with both Eisenberg and the buff Ryan Reynolds, in a role that takes some skill to get as right as he does, are the highlights of the piece. While Martin Starr is the other performance of note as the pipe smoking intellectual, Joel. \r\n\r\nWhat youngsters that I know who have seen the film have had less than favourable reactions to it. This can probably be put down to two things. One is that the expectation of another Superbad-a-like comedy has not been met. Two is that, you know what folks? Mottola hasn't made this for kids, he's made it for those who were once kids themselves in a decade not so very long ago... 8/10", "created_at": "2020-05-08T19:42:19.460Z"}]