[{"movie_id": 133805, "review_id": "5265730919c29515a204eafb", "rating": null, "review_text": "In this remake of the 1976 cult horror classic, Director Kimberly Peirce tactfully repaints the repressed and bullied and telekinetic Carrie (Chloe Grace Moretz) exacts revenge upon her fellow prom-nighters. Julianne Moore seizes the day as Carrie's fundamentalist and demonically cruel mother \r\n\r\nhttp://www.ihavenet.com/movies/Carrie-Movie-Review---Chloe-Moretz-and-Julianne-Moore.html", "created_at": "2013-10-21T18:31:37.224Z"}, {"movie_id": 133805, "review_id": "53c62c6e0e0a267ffb001cda", "rating": 7.0, "review_text": "It was a loooong time since I watched the original Carrie movie. I was never a real fan of the original. I thought it took too long to get going and the ending was too tragic. But then, I was rather young when I watched it. Yesterday I sat down and watched the remake.\r\n\r\nI have to say that I found it surprisingly good. Sure, the actual story of the movie with the poor girl being bullied by these school assholes, or in particular one asshole, cannot be said to be a story that really appeals to me. It is a rather depressing and frustrating story to say the least. It is a movie that, I myself at least, watched for the outbreaks of telekinetic special effects.\r\n\r\nHaving said that, I think that both Chloë Grace Moretz and Julianne Moore made commendable performances. Especially Julianne Moore who really made me riled up and squirm from frustration in my seat when she got started with her insane religious nonsense.\r\n\r\nA remake is of course always at somewhat of a disadvantage in that you already know the general story and thus pretty much know what is going to happen. Thus I liked that they had splattered outbursts of telekinetic powers (= special effects) fairly liberally also in the early parts of the movie. I do not remember that Carrie was showing very much of her powers until the very end in the original. For me this made the movie more interesting to watch as it would have been both boring and frustrating if it had been nothing more than the bullies, and Carrie’s crazy mother, harassing Carrie until the very end.\r\n\r\nThe end, well I still think it is a rather sad one. I would have been much happier if Carrie would have gotten her revenge and somehow survived but then, that would have been too much of not-following-the-book instead so I guess I have to live with the depressing ending.\r\n\r\nOn the whole I am positively surprised by the movie. It is a remake that adds modern flavor and special effects without destroying the general look and feel of the original.", "created_at": "2014-07-16T07:40:30.813Z"}]