[{"movie_id": 406990, "review_id": "5a460cda0e0a264f2907793c", "rating": 6.0, "review_text": "Tommy Wirkola steps away from his typically fun style of filmmaking for this dark and tragic scifi. But a good director's a good director and despite being maybe a little more predictable than it thinks, not to mention Glenn Close trying her hardest to derail he manages to pull off _What Happened to Monday_. Extra special props to Noomi Rapace who successfully plays not seven as advertised but **eight** different characters with virtually no overlap in characterisation.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2017-12-29T09:37:30.594Z"}, {"movie_id": 406990, "review_id": "5a7cfaa0c3a3680fad0190b1", "rating": 5.0, "review_text": "I'm not aware if this is a remake but it does stand in debt to the dystopic sci-fi of the seventies. Decent acting by lead Noomi Rapace against herself(s) with good support from Willem Dafoe. Scenery is well made but uninteresting and the same goes for the action. It is a quite forced how disparate the siblings are and their individual characters may be in different colours but are only one sheet thick. The story of their upbringing would be a more interesting story than what we have here. Ultimately, it is a predictable thing this entire weekly affair.", "created_at": "2018-02-09T01:34:24.961Z"}, {"movie_id": 406990, "review_id": "5e3fd7453dd1260018533a7c", "rating": 8.0, "review_text": "If you were to go through my movie collection, you would find an eclectic mix of films. One of the most prevalent in the mix of genres & sub-genres, I have many that are post apocalyptic/futuristic dystopian world films. Its the kind of film I love exploring, as its a look at not only our possible future, but a look at ourselves now, and where we are heading should we continue down certain paths.\r\n\r\nIn the tradition of some of the great films like the classics Blade Runner, and Total Recall, to more modern tales like Equilibrium, and Children of Men comes What Happened to Monday.\r\n\r\nSet in a future where food resources are drastically low due to overpopulation, a sinister organization responsible for implementing a one-child policy by taking all subsequent sibling to be cryogenically frozen until such a time when resources are enough to cover everyone.\r\n\r\nTerrence Settman (Dafoe) finds himself in a rather precarious position with the birth of sextuplets, granddaughters, whose mother dies during labour. Naming them after each day of the week, he makes the dangerous decision of taking them all in to his care, raising them in secret, and taking all necessary precautions to ensure that they live in secret.\r\n\r\nWhen the girls have grown to an age where he feels comfortable, and confident that they are aware of the dangers of the outside world, and the consequences of anything that could mean the secret being uncovered, he allows each girl to go out on the day after which they were named, ie; Monday on Monday, Tuesday on Tuesday, and so on, and so forth. The girls each live their day outside as one Karen Settman.\r\n\r\nAs is the case with any group of children, the girls exhibit an array of personality traits from shy and demure to outgoing and rebellious, with the rebel of the seven causing a uncomfortable, and lasting, consequence for the other six siblings when she goes out on a day that she was not designated to do so, and suffers a painful injury.\r\n\r\nFast forward some 30 years we find that the girls have grown to adulthood successfully in secret, and while inside they exhibit their own personalities, do their own thing, and keep their own interests, they work very well together maintaining the life of Karen Settman out in the world. This is largely down to nightly debriefings from the one who went out that day, so that the others are aware of their role to maintain their cover.\r\n\r\nThis all works perfectly until Monday doesn't come home from work, leaving her sisters extremely worried about what could have happened to her, and Tuesday going blind to what is waiting for her outside, with no knowledge of the previous days happenings. It is now up to Tuesday and her sisters to figure out what happened to Monday.\r\n\r\nThe thing I love most about this film is it's concept, its what I love about the genre in general, as a dystopian future story can lend itself to anything that can cause a dystopia to happen, over population causing implementation of restricted breeding, or emotions being banned so that people don't fight, and cause war.\r\n\r\nI also love the performances of Noomi, and Clara in the two stages of the girls' lives, the seven nuanced personalities demanded such range from both to capture the essence of the seven sisters, but also the prime character of Karen.\r\n\r\nWhat also impressed me about this film, is the way in which the seven different characters were juxtaposed in the scenes they were together in. In no way was this done cheaply, or nasty, and definitely did not come off cheesy.", "created_at": "2020-02-09T09:56:21.600Z"}, {"movie_id": 406990, "review_id": "64c30d41eec4f300e709a1f5", "rating": 10.0, "review_text": "**The Anti-Matrix**\r\n\r\nWhen I saw the poster, I was expecting it to be a cheap Matrix rip-off. I was so wrong; this is the Anti-Matrix. The similarity to the Matrix are only superficial and very intentional and only to mock the Matrix.\r\n\r\nThis becomes very obvious when we see that rooftop scene actually play out (it ends quite differently than it does in the Matrix). Why would I love a movie that mocks the Matrix? I am not saying the Matrix is a bad movie, but there is a more sinister aspect to it, that the makers of this movie picked up on and this movie is their response.\r\n\r\nBecause if there is no \"reality\" and it's all just an illusion created by the \"Architect\" the imprison us, then human life becomes cheap. Because their lives are all just an illusion anyway and if they die, their souls might even wake up and become free of the Matrix. Or at least that's actually the conclusions some lunatics came to after having watched the Matrix.\r\n\r\nSo in this movie we are faced with an autocratic system that's actually completely modeled after real life China with a similar view on human life - viewing average, everyday humans as similarly expendable. And to justify their State wide \"family planning\" they promise the \"superfluous\" siblings that they imprison a kinda Matrix of their own where they put them into pods similar to the ones we see in the Matrix and where they are then induced into a sleep state in which they dream and have a sort off life of their own, even if only in their heads. So it is a kinda Matrix, except that at the end we of course find out that their Matrix is... well... I don't want to give spoilers. You just have to watch it if you haven't seen it. It's a great movie with some superb acting.", "created_at": "2023-07-28T00:35:13.618Z"}]