[{"movie_id": 8960, "review_id": "63be02e481383100bd761a51", "rating": 1.0, "review_text": "Yeah, this stank.\r\n\r\nHancock had character at the start of the film, but that slowly faded away by the second half, that just sort of floundered until it ended.\r\n\r\nIt lacked the humor that comes with a lot of Will Smith's other outings, and it lacks the charisma that usually seeps out of Smith.\r\n\r\nIt just seemed to fail on every front.", "created_at": "2023-01-11T00:29:24.583Z"}, {"movie_id": 8960, "review_id": "64419c2ccee2f602fb358b18", "rating": 4.0, "review_text": "**Despite being one of the great films of Will Smith's career, it is a weak and uninteresting film.**\r\n\r\nI think almost everyone who has seen superhero movies, especially the bigger budget ones, has wondered how it's possible that those heroes are so destructive: in order to eliminate an enemy or a danger, they destroy half a city as collateral damage. This film works precisely on top of that: Hancock is a superhero who doesn't seem to want to be one, and who doesn't know how to deal with it. As a result, and despite being effective at what he does, he is quite destructive and unpopular until the day he gets an image manager.\r\n\r\nAlthough Will Smith is one of those actors that I never really appreciated very much, I have to admit that he did a lot of good to bet on this film. The character is perfect for the actor, who seems to be as charismatic as he is grumpy, and Smith's effort turns out to be the big reason to see the film. Smith gives us a very well done job and manages to bear the effort and responsibility of the protagonist with great capacity. Charlize Theron also deserves a positive note for the work she left us in this film. Jason Bateman brings to life the most likeable and palatable character in the film, but he doesn't have the material to match his colleagues.\r\n\r\nUnfortunately, beyond the work of Smith and his co-stars, the film doesn't really have much else to offer us. The script starts from a very interesting idea, but fails to flesh it out and develops it in a very inefficient way. The result ends up being a frankly uneven film, where a good beginning leads to a dull stagnation and, later, a highly predictable and tiring ending. On a technical level, we can highlight, on a positive note, the quality of the cinematography and CGI effects used, as well as the effective and properly used soundtrack. Everything else is simply boring and not worthy of particular mention.", "created_at": "2023-04-20T20:10:20.483Z"}, {"movie_id": 8960, "review_id": "646d8a192bcf67011bf564d6", "rating": 8.0, "review_text": "I like this movie because it's different from your typical superhero character. He cracks me up to. They have some pretty cool fight scenes in this.", "created_at": "2023-05-24T03:52:57.757Z"}]