[{"movie_id": 1865, "review_id": "52533f1919c295760c01fdb2", "rating": 3.0, "review_text": "More of the same ... but it is not funny any more ...", "created_at": "2013-10-07T23:09:13.630Z"}, {"movie_id": 1865, "review_id": "581ad3049251412bfe000a78", "rating": 10.0, "review_text": "This is just **awesome**", "created_at": "2016-11-03T06:02:44.090Z"}, {"movie_id": 1865, "review_id": "5d5dafcea3d02700160c27eb", "rating": 7.0, "review_text": "View it as a spin off and it's a rollicking treasure seeking adventure.\r\n\r\nOk lets have it out front right away, this particular writer loved the first film (Curse of the Black Pearl), was disappointed with the second (Dead Man's Chest) and positively found the third (At World's End) to be an incomprehensible bore. Part 4: On Stranger Tides is a shift in another direction, where a group of piratical characters, some we know well, others new to the fold, embark on missions to find the fabled Fountain of Youth. So think \"Indiana Jones\", \"National Treasures\" like adventures (hell even \"It's a Mad Mad Mad Mad World\") and you get the drift here. Expectation of this franchise getting back to the heady days of that first film will be crushed pretty early on.\r\n\r\nThere's a little too much going on here for it to be safe children's fare, but the adults, especially those who remember the serial silliness of adventure films of yore, will have a good time. The action set-pieces are superb, enter high speed carriage chase through London, some spiffing sword play deep in the brewery, Blackbeard (Ian McShane) using his black magic whiles to incarcerate mutineers in a whirl of maniacal ropes, and a mermaid attack that quite frankly rocks - as do the mermaids themselves the sexy vicious teasers they are.\r\n\r\nProduction is as expected top notch, and the cast, in spite of having to battle for screen time in a cast of thousands, are doing fine work (Penélope Cruz a welcome heaving bosom of spunkiness). For sure our main man Captain Jack Sparrow, with Depp just about keeping the characters charm on tap, isn't as dominating a force as we would like, but he leaves his trusty fun mark and the others (Barbosa is back drinking rum out of his newly acquired peg leg) pick up the slack. It's unlikely to get better on revisits, so if you be hardcore POTC from earlier adventures, there's no point going back to se tis one. Those who like the type of films mentioned previously, and don't mind a different direction for the series, then tis holds no fears. 7/10", "created_at": "2019-08-21T20:55:42.710Z"}, {"movie_id": 1865, "review_id": "64c15011df86a80125828121", "rating": 6.0, "review_text": "Not a bad movie. Part 4 has Jack Sparrow on a quest to find the fountain of youth. A lot of the important cast that helped make the movie are not in this movie.", "created_at": "2023-07-26T16:55:45.877Z"}, {"movie_id": 1865, "review_id": "64f44f7ae0ca7f00ae3a91cc", "rating": 6.0, "review_text": "At least this is bit shorter than the previous edition of the franchise, but sadly it isn't really any better. Rob Marshall has taken the helm and we have lost Orlando Bloom and Keira Knightley - who presumably recognised that the boat has sailed on this much weakened fantasy adventure series. This time around \"Jack\" (a rather battle-weary Johnny Depp) finds himself looking for the fountain of youth with the newly Anglicised \"Barbossa\" (Geoffrey Rush) in hot pursuit of him and of his old flame \"Angelica\" (Penélope Cruz) who happens to be none other than the the daughter of the legendary \"Blackbeard\" (Ian McShane). Now she is clever. She convinces \"Jack\" that her dad isn't so well, and that only an elixir of this water can cure him. Thing is, is \"Jack\" gullible enough to fall for this yarn? Are we? Of course it's not so simple - not only do they need to find the water, they must also find a couple of charmed chalices and, naturally, the tear of a mermaid - the latter creatures not being so benign as Walt Disney's other films might suggest. The visuals are great with a new slew of scary beasties from the depths to entertain us, but the story is pretty weak and the established characterisations struggle to resonate in anything like the way they used to. Sam Claflin adds a bit of eye candy and Richard Griffiths looks every inch the part as George II, but McShane is one of my least favourite character actors - he only has the one gear - and Miss Cruz seems more like a fish out of water than a duck taking to it. There's far too much dialogue and the denouement is stretched beyond breaking point before the obligatory \"next time\" pointer to the next instalment of this over-tired series. \"Pirates of the Caribbean\" ought to hang up it's hat now; it's had it's day.", "created_at": "2023-09-03T09:18:50.773Z"}]