[{"movie_id": 242310, "review_id": "549c3bf2c3a3682f1b003cfa", "rating": 2.0, "review_text": "A man, Paul Maguire (Nocolas Cage), has quit the business of... crime. However, one day his past catches up to him and his daughter is kidnapped. Now, in order to get her back, he must get the old gang back together and find the people responsible.\r\n\r\nYes, there is more to the movie than this, but if you are planning on watching the movie, I won't spoil your fun. However, thats not to say that this is a big and interesting plot, far from it.\r\n\r\nNormally, I love movies with a twist, but a twist is nothing if the cast, script and anything really... is bad. In this case, nothing works. Nicolas Cage (whom I know can act) is two dimensional and anything he does seems false and... without passion. While shooting this movie, he must have figured out that it was a mistake and simply... given up. It shows. It just goes to say, a good actor (and I am not saying that Nicolas Cage is a good actor, but he can act, just watch Adaptation) can't keep a movie going on his own, except if your name is Tom Hardy and the movie is Locke, or Robert Redford and the movie is called All Is Lost. Unfortunately, this movie is called Tokarev, the name of a gun, and that... just... says it all. Really.\r\n\r\nI gave this movie two stars, and I'd like to tell you why. Peter Stomare has a small role, and he is always good, and... the ending that goes on beyond the credits... is actually a nice little touch. But everything else. Not worth the bother.\r\n\r\n_Last words... don't watch this movie. Unless you like action for the sake of action and cares nothing for acting, interesting characters and... plot._", "created_at": "2014-12-25T16:31:46.478Z"}, {"movie_id": 242310, "review_id": "57bd125ec3a368157c004af8", "rating": 4.0, "review_text": "Ooh look, it's another revenge thriller.\r\n\r\nNicolas Cage stars as a reformed mobster who is forced to go back to his violent ways when his daughter is kidnapped by baddies.\r\n\r\nIt is what it is really, a Nic Cage starrer that does exactly what the plot synopsis suggests. Does it bring anything new to the revenge formula of genre film making? Absolutely not. But on reflection there are very few that have improved upon originals from as far back as Fritz Lang's Fury in 1936. Sure there is more blood now, more gruesome deaths to put bums on theatre seats, but the majority of them remain soulless, existing only for the point of existing. The market is there for those who either enjoy such genre splatters, or for those who like me just merely wanted a brainless pic to pass the time away with - which of course means leaving said brain at the door.\r\n\r\nIt's all very preposterous, even insulting at times, but this is actually no worse than some of the more praised revenge thrillers of recent times - but that just makes the point that ultimately the bar hasn't been set high for a considerable time now. So wake up film makers! Give us something new! 5/10", "created_at": "2016-08-24T03:19:58.846Z"}]