[{"movie_id": 353486, "review_id": "5a4ff969c3a3681bca00082a", "rating": null, "review_text": "Previous 2 parts were much better story wise, however effects are good in this part.", "created_at": "2018-01-05T22:17:13.366Z"}, {"movie_id": 353486, "review_id": "5a5c7031c3a3686d7c007302", "rating": 7.0, "review_text": "**The 90's Game is back and got even more adventurous !!**\r\n\r\n\r\nWhen four teenagers in detention discover an old video game console with a game they've never heard of, they are immediately thrust into the game's jungle setting, into the bodies of their avatars, played by Dwayne Johnson, Jack Black, Kevin Hart, and Karen Gillan. What they discover is that you don't just play Jumanji -Jumanji plays you. They'll have to go on the most dangerous adventure of their lives, or they'll be stuck in the game forever.\r\n\r\n\r\n\r\nIn the age of Hollywood's obsession with franchise-building and reboots, the idea for a sequel to 1995's 'Jumanji' came across as another eye-roll worthy project. However, the combination of charming actors Dwayne Johnson, Jack Black, Karen Gillian and Kevin Hart, made it evident that this would wind up either being a complete trainwreck, or total mindless fun. Fortunately, 'Welcome to the Jungle' falls solidly into the latter category. The chemistry between the lead cast is evident and the script makes the most of this by giving each actor moments to shine and showcase their skills while they clearly enjoy playing their characters.\r\n\r\nJohnson's younger persona Spencer is a nerdy guy who has lived a sheltered life and is afraid of the world. When he enters the game he takes on the avatar of a hunk with no discernible physical weakness. Johnson has fun with this switch of persona and watching him go back and forth doesn't get old. The same goes for Jack Black who plays a self-absorbed, social media addicted teenage girl Bethany. Her switch into Black's trademark rotund shape is the most extreme and ends up being hilarious. While Black and Johnson are engaging as they are completely cast against their typical selves, Gillian and Hart aren't too far behind playing an awkward, insecure but intelligent girl, and an all-star jock boy trapped in a less-than-stellar body respectively.\r\n\r\n\r\n\r\nThis entire body-switch premise works on slapstick humour that's not crass and moves quickly with ample action to ensure that the 2-hour runtime doesn't feel bulky at any point. Granted there's a villain problem with Bobby Cannavale's Van Pelt being as one-dimensional as they come. It's conveniently explained away as this is all a video game, and the same rules apply for its lack of depth. \r\n\r\n\r\n\r\n_Overall_, 'Jumanji: Welcome To The Jungle' ends up being a fun, holiday film that will keep you entertained enough to make it worth your time and money.", "created_at": "2018-01-15T09:11:13.832Z"}, {"movie_id": 353486, "review_id": "5aa49b0dc3a3687c0c0197a7", "rating": 4.0, "review_text": "The effects have improved (as you'd hope they would over the course of 22 years), but _Welcome to the Jungle_ didn't really do much for me. It completely lacks the charm of the original movie, but also the worldly scope of the animated series. I sat there patiently as weak joke after weak joke bounced off of me ineffectually, but the person I watched it with seemed to be having a great time, so maybe I'm just dead inside?\r\n\r\n_Final rating:★★ - Definitely not for me, but I sort of get the appeal._", "created_at": "2018-03-11T02:57:17.607Z"}, {"movie_id": 353486, "review_id": "5af70f35c3a368125400bf62", "rating": null, "review_text": "Eh.  This was so-so.  I like the rock so ill give this a 6 out of 10. The original was WAYYYYY better.", "created_at": "2018-05-12T15:58:45.048Z"}, {"movie_id": 353486, "review_id": "5e76d6ea357c0000194f96a8", "rating": 7.0, "review_text": "***Entertaining adventure/fantasy with a little welcome depth***\r\n\r\nFour high school teens in Atlanta – a nerd (Alex Wolff), a muscular football player (Ser'Darius Blain), a shallow “hot blonde” (Madison Iseman) and a brainy, demure redhead (Morgan Turner) – get sucked into a video game and find themselves as avatars – a brawny explorer (Dwayne Johnson), his diminutive zoological sidekick (Kevin Hart), a cartologist / palaeontologist (Jack Black) and a martial arts babe (Karen Gillan). Can they get back alive?  \r\n\r\n“Jumanji: Welcome to the Jungle” (2017) is the third film in the current four-film franchise if you include “Zathura: A Space Adventure” (2005). It was a surprise hit at the box office and produced an immediate sequel in 2019.    \r\n\r\nWhile I give the edge to the original 1995 movie, this one delivers the goods for an entertaining family-friendly adventure/fantasy with a good message. The nonsense in the jungle is amusing & thrilling without overstaying its welcome. What really makes the film work is that it effectively establishes the four characters and their situations in the first act and wraps up with showing how they’ve grown as a result of their otherworldly adventure.\r\n\r\nDwayne Johnson is always great for the lead in these kinds of flicks and Hart & Black offer comical support. Karen Gillan is cute and athletic, but needs to gain some weight IMHO. Meanwhile Madison Iseman (Bethany) has alluring eyes, but Morgan Turner (Martha) actually outshines her. The exceptional title song plays during the credits.  \r\n\r\nThe movie runs 1 hour, 59 minutes, and was shot in Atlanta, Georgia (neighborhood scenes) and Hawaii with loads of CGI backdrops.\r\n\r\nGRADE: B", "created_at": "2020-03-22T03:09:30.174Z"}, {"movie_id": 353486, "review_id": "606d01c909c24c00782f5592", "rating": 10.0, "review_text": "Fun and cool movie, probably better than the original.", "created_at": "2021-04-07T00:50:17.374Z"}, {"movie_id": 353486, "review_id": "63b241a70d417e00bdd42028", "rating": 9.0, "review_text": "**Jumanji: Welcome to the Jungle surprisingly exceeds the original and all expectations as one of the best, funniest, and most entertaining sequels of all time.**\r\n\r\nThe sequel no one saw coming or expected to light up the box office as it did! Jumanji: Welcome to the Jungle is a fun adventure film with hilarious characters that works in every way. I will be honest; I was not a fan of the original movie - it freaked me out as a child. But the new film minimized the horror elements of Jumanji and focused more on adventure and humor. This time instead of a board game, Jumanji has morphed into a video game that sucks its unsuspecting victims into its deadly world. Welcome to the Jungle leans into all the video game tropes with hilarious results with jokes about skills, lives, NPCs, boss battles, and more. The movie is at its best with all the humor surrounding the body-swapped teens dealing with the game’s characters they now inhabit - the skinny nerd becoming the muscular hero, the jock becoming a tiny sidekick, and the funniest of all, the pretty popular girl becoming Jack Black (who is the real stand out of the film). Jumanji is a must-see family adventure film that brings fun and laughs to everyone who dares to play the game.", "created_at": "2023-01-02T02:29:59.652Z"}, {"movie_id": 353486, "review_id": "64a6f0a6c3bffe01445164d8", "rating": 8.0, "review_text": "Love this movie. Better then the original. Honestly this would be fun to do for real. It would be the ultimate gaming experience. The movie is so hilarious.", "created_at": "2023-07-06T16:49:42.694Z"}]