[{"movie_id": 174675, "review_id": "585ebdd2c3a3681a6f011096", "rating": 5.0, "review_text": "**Creating an artificial intelligence, but its intelligence beyond expected's the issue.**\r\n\r\nMaybe the films about artificial intelligence that were made in the last 5 years might outnumber to those were made before that for centuries. Especially there are lots of B movies on this theme and some of them surpassed the film critics and the film fanatics' expectations. Here is another one, but this is a British film. Though one thing I don't understand is, in all these films they make the same mistakes. I mean the film characters recognising the AI as one of us which leads to a major disaster.\r\n\r\nSets in the future, when the Chinese aggression towards the Taiwan made the west, especially Britain to counteract them in the region, they decide to build a most advanced AI. But when the scientist creates beyond what the military needed, the conflict of interest surface among them. From this, who gains what, and how the story ends comes in the latter part.\r\n\r\nInitially I liked it, but not the progression. It led nowhere, but the same crumble and a conflict between the man and the machine. I'm not saying the film was bad, but I blame the overcrowded films on this theme. The filmmakers have to start to think a different kind of storyline. Going advance like what AIs can do in the field than the initiation programmes which is too old for now and onwards. So that's where I disliked it, but not hated it. I hope you enjoyed it better than me or would do if you yet to try.\r\n\r\n_5/10_", "created_at": "2016-12-24T18:26:26.978Z"}, {"movie_id": 174675, "review_id": "59fa33df9251412363005e4d", "rating": 3.0, "review_text": "A disaster ... the effects are good, but the plot is very **forced** and closed ... very trite the subject of AI that becomes human ... there are other titles even recent that far exceed it, starting with \"Yo Robot\" (_to which does not even reach the heels_)!", "created_at": "2017-11-01T20:51:43.646Z"}]