[{"movie_id": 271110, "review_id": "572d7bc1c3a3680fdb001d69", "rating": null, "review_text": "Well another super-sized Marvel Comics superhero saga hits the big screen with the selected savior Captain America taking the top billing on the marquee. Thus, the pulsating popcorn pleaser **Captain America: Civil War** arrives on the scene to giddy audiences that have been loyal and fixated on the successful spring of mighty Marvel heroes that have been paraded to viewers throughout the last few years. Thankfully, **Captain America: Civil War** carries on the tradition of spry superhero-studded spectacles that have been glorious and adventurous from the stable of Marvel-based movies guaranteed to win over the enthusiastic hearts of avid comic book fanboys everywhere. Joyously overstuffed and convincingly extensive with a super team armed with crime-fighting excess, **Civil War** seizes the moment to introduce a noteworthy twist: two factions of rescuing superpowers engaging in some explosive in-house fighting led by two of Marvel Comics main standouts in Chris Evans’s Captain America and Robert Downey Jr.’s Iron Man.\r\n\r\nCo-directors Anthony Russo and Rene Russo were instinctively crafty to link the overly successful Iron Man film franchise to the **Captain America: Civil War** inner circle to ensure an even more treasured toxic atmosphere. Superhero fans will get a thrill of witnessing the extra add-ons concerning other dynamic titans to join the action-packed festivities involving Team Captain America versus Team Iron Man. True, **Civil War** has its share of flaws but that does not take away from this heroes-in-crisis flick demonstrating its ambitious overtones.\r\n\r\nSo what has caused the bad blood among the great and grand good guys known for protecting the world from evil dominance and destruction? Essentially the theme of collateral damage, the involvement regarding civilian-related deaths and injuries plus the world-wide backlash has created a controversy pitted against The Avengers. Specifically, Captain America (a.k.a. Steve Rogers) and Scarlet Witch/Wanda Maximoff (Elizabeth Olsen)  are responsible for the boisterous battle that caused such negative sensation resulting in political turmoil. Avengers head honcho Iron Man (a.k.a. Tony Stark) is dealing with his own personal regrets in the ill-advised creation of the unpredictable Ultron. The political authority want to hold Iron Man, second-in-command Captain America and the rest of the Avengers accountable for the global devastation that have taking its toll when trying to oversee the potential harm wreaking havoc on humanity.\r\n\r\nLeading the charge in putting a watchful eye on the labeled reckless Avengers is Secretary of State Thaddeus Ross (William Hurt) that suggests the super group be monitored by the United Nations. Naturally friction develops between the superheroes that either agree with Ross’s UN restriction policies or disagree with being placed under a microscope that threatens to handcuff their free-wheeling heroic duties. All these contrasting beliefs eventually turn into epic back-and-forth confrontations where the raging Avengers are at odds with each other.\r\n\r\nFor Stark/Iron Man’s stance, he is willing to toe the line and ultimately agree that his crew needs to tone down their tenacious tactics as crime-stoppers. Iron Man’s consciousness, particularly in the case of a disillusioned mother (Alfre Woodward) making him feel guilt-ridden over her son’s death during an intense Battle of Sokovia, is probably the main factor behind his decision to have his team reigned in a bit from the political watchdogs. Siding with Iron Man’s viewpoint are the likes of Black Widow (Scarlett Johansson), Vision (Paul Bettany) and War Machine (Don Cheadle). As for Rogers/Captain America, he is not too thrilled being put in check by the intrusive governmental pencil-pushers that want to scrutinize the team’s every move. Standing with Captain America firmly are Falcon (Anthony Mackie) and the aforementioned Scarlet Witch.\r\n\r\nOn top of Captain America’s current Avengers-oriented strife in his contentious mingling with Iron Man and his ardent backers, he now finds himself trying to defend his old buddy-turned-wanted man Winter Soldier (Sebastian Stan) who is accused of killing civilians. Iron Man believes in Winter Soldier’s innocence and goes so far as to help him escape. Yes…Winter Soldier does come with more baggage attached to him–mainly in the form of the menacing Zemo (Daniel Bruhl).\r\n\r\nThe Russos and screenwriters Christopher Marckus and Stephen McFeely (all attached to the previous “Captain America: Winter Soldier”) provide the eyeful visual effects that predictably stimulate and effectively add to the overload of frenzied frolicking in this boisterous blockbuster. Certainly the deepened angst among this bombastic bunch works far more solidly than what was displayed in the stiffened and problematic Batman v. Superman. The notion that the entire globe and its leaders are weary of all the collective chaos at the hands of the Avengers trying to save their hides is a bit ridiculous. Besides, why are not the foes of the Avengers put on the hot coals for the societal ruination? It seems rather counterproductive to chastise the noble superpowers offering the safety of mankind yet the detractors not being grateful for the services that the Avengers bring to the table. It is somewhat convoluted to think that the global community are sour on our heralded heroes or that the heat generated within the walls will completely destroy the Avengers and their colorful, capable colleagues.\r\n\r\nThe movie’s aptly entitled **Civil War** does invite more punch to the proceedings especially when a who’s who of superhero showstoppers join the feisty fray at hand. The noted inclusion of defiant do-gooders are packed with the likes of Spider-Man (Tom Holland), the retired returnee Hawkeye (Jeremy Renner), Ant-Man (Paul Rudd), and nifty newcomer Black Panther (Chadwick Boseman). No doubt Captain America: Civil War is the impish and energizing launch pad for upcoming Marvel-induced movies waiting to make their future distinctive arrival on the big screen. Although Evans’s steady and charismatic Captain America more than holds his own as the solo act billed in the film’s title one cannot overlook Downey’s compelling Iron Man as the reliable source that lifts the profile of Evans’s Masked Wonder. This is indeed a collaborative big score for the glorified costumed cast but special kudos are reserved for Stan’s killing culprit as well as Boseman’s African president assuming the slick and resourceful Black Panther.\r\n\r\nYeah, **Captain America: Civil War** is true to its frenetic form as revved up entertainment preparing moviegoers for the upcoming summertime sizzle at the box office. After all, the on-screen Marvel Comics gravy train keeps moving merrily along so stay tuned.\r\n\r\n**Captain America: Civil War (2016)**\r\n\r\nWalt Disney Pictures\r\n\r\n2 hrs 26 mins.\r\n\r\nStarring: Chris Evans, Robert Downey, Jr., Scarlett Johansson, Sebastian Stan, Anthony Mackie, Don Cheadle, Jeremy Renner, Chadwick Boseman, Paul Bettany, Elizabeth Olsen, Paul Rudd, Daniel Bruhl, Alfre Woodward, William Hurt\r\n\r\nDirected by: Anthony Russo and Joe Russo\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Superheroes Saga/Action and Adventure/Science Fiction/Fantasy\r\n\r\nCritic’s Rating: *** stars (out of 4 stars)\r\n\r\n**(c) Frank Ochieng**", "created_at": "2016-05-07T05:23:13.945Z"}, {"movie_id": 271110, "review_id": "57acf05cc3a36820750001c8", "rating": null, "review_text": "The Russo Brother's and Marvel did it again! Read my full review here!\r\n\r\nhttp://www.hweird1reviews.com/allreviews/captain-america-civil-war-review", "created_at": "2016-08-11T21:38:36.922Z"}, {"movie_id": 271110, "review_id": "57f40f319251417fe300171a", "rating": 8.0, "review_text": "**The heroes're divided and so the fans!**\r\n\r\nBefore watching this I thought what the Avengers are doing here. I believed they got the title wrong. Once I watched it, I'm still the same. Because it did not look like the Captain America's film, he never was dominated, so calling it as his film totally inappropriate. Technically, it is a third Avengers film and well done. I liked it, it was entertaining. But the Civil War means it's nothing a nation's war within, just these super-guys fight for themselves against what kind of administration they want to come under.\r\n\r\nI think they have heard that people's complaint about blowing up the buildings during reviewing other films by bringing up this one. So they finger pointed those events in this narration and that is one of the reasons for the Civil War to take place. Particularly disturbing the public and loss of many lives when these powerful men fighting the bad guys. The fun part is they are off the street and had a most important confrontation of the film in a deserted airfield. So does it make people who were whining about that be happy?\r\n\r\nI don't know, but as an entertaining film, it did everything it can give the best for the viewers. Like the title and posters reveal, the heroes are divided here and probably you're going to take a side. Like usual, I'm with the Stark. So if you're like me, then you would feel the annoyance with the opposite team, particularly like Antman and obviously Captain America's rebellious decision. It was like the world versus United States, because only Americans are behind Captain America. Anyway, I did not like dividing the fans and what this film has been a serious damage. I hope the fans won't take it seriously.\r\n\r\n_8/10_", "created_at": "2016-10-04T20:21:05.083Z"}, {"movie_id": 271110, "review_id": "5895ee519251412e1600b62d", "rating": 4.0, "review_text": "Recently I have quite liked the Marvel movies that I have watched. Sadly I did not like this movie at all. The only reason that it does not get a zero or one star rating is cool special effects and a few laughs.\r\n\r\nI want my heroes to be just that, heroes. Unfortunately this movie gets off on the wrong foot right away by not only “incriminating” the Avengers in the eyes of dimwit politicians and putting them on surveillance of a political body but to make matters worse it is the useless black hole of taxpayers money, the United Nations, that are supposed to surveil them. That pretty much ruined the movie right away for me.\r\n\r\nWhen I though that it could not get any worse it actually does. In true Hollywood fashion the Avengers start to bicker and fight among themselves.\r\n\r\nThe few redeeming qualities of this movie is great special effects and a few fun comments that made me laugh from time to time. Even the ending is pretty crappy with the Avengers remaining divided and the main bad guy feeling that he achieved what he wanted.\r\n\r\nTechnically there is not really anything wrong with the movie. The actors are good, the filming is good and, as I wrote, the special effects are great. The story however is not my cup of tea to put it mildly. I cannot express how much I despised the story in this movie.", "created_at": "2017-02-04T15:08:01.997Z"}, {"movie_id": 271110, "review_id": "59ecf0f59251412a29001cca", "rating": 9.0, "review_text": "Good movie, love Captain American.", "created_at": "2017-10-22T19:26:45.389Z"}, {"movie_id": 271110, "review_id": "5b167ad80e0a262dd60153f2", "rating": 8.0, "review_text": "<b>A long form review originally posted in 2016</b>\r\n\r\nIt’s commonplace for me to need more than one viewing to really nail down my feelings on a movie, that’s particularly true of MCU, and even more so of this particular film. That all said, here is my initial reaction to _Captain America: Civil War_.\r\n\r\nAs is often the case, it’s hard to write down too comprehensive a post about a film this early on while remaining totally spoiler-free, so for starters, I’ll just go ahead and ask the thing that was on my mind from about five minutes in to _Civil War_: I want to know how it is that two guys who have a filmography so firmly rooted in sitcoms of all things, manage to direct action this spectacularly? Honestly. It’s insane.\r\n\r\n_Winter Soldier_ is one of the strongest MCU films in my opinion, and just like that felt mostly like a follow up to both the prior _Captain America_ film and the prior _Avengers_ film, _Civil War_ feels the same, but for the sequels to said films (_Winter Soldier_ and _Age of Ultron_). That said, it might lean a little too far on to the side of _Avengers_-sequel, and a little too light on the _Cap_-sequel. If you had to pick a lead here, it would be Steve Rogers, no mistake, but this does feel like a film painted with a very broad brush of characterisation to be solely a “_Captain America_” movie.\r\n\r\nConsidering the sheer scope of the piece, it’s amazing that the Russo brothers managed to get the ball rolling on _Civil War_ as well as they did. Even so, there are a couple of roles I felt could have been cut altogether without really impacting the story, and that time could perhaps have been used to serve some underrepresented puzzle pieces. Perhaps both the inclusion in places and lack of inclusion in others is because of plans for future MCU films (though certainly not all instances can use that excuse) but either way, if I’m hunting for flaws, that to some degree is one.\r\n\r\nI will say, that for all of _Civil War’s_ ups and downs (mostly ups), it is both a worthy entrant into Marvel’s franchise, and perhaps even more importantly, it actually even addresses some of the problems left in _Age of Ultron_. Of course the acting is all above board, the primary action set-piece is just dumbfoundingly fun, and the evolution of the mythology meshes with the universe at large.\r\n\r\n_Civil War_ may not be my favourite superhero movie, or even my favourite MCU movie (I mean it also might be, I think I need to give it at least another two watches to be sure) but it might just be the best comic book adaptation movie. By that, I don’t mean it accurately portrayed the events of the Marvel “Civil War” event from back 2006, because that’s not even close to true. What I mean is, there are so many instances that manage capture the spirit of what the comics are. And you almost feel like you are watching one unfold before you on the screen. A glorious, squillion dollar, two and a half hour comic book.\r\n\r\nOh yeah. And the new superheroes introduced in _Civil War_? They’ve got me pretty bloody excited.\r\n\r\n79%\r\n\r\n-_Gimly_", "created_at": "2018-06-05T11:58:16.657Z"}, {"movie_id": 271110, "review_id": "5c842610c3a3684e95db3de3", "rating": 7.0, "review_text": "The Captain America movies have managed to ground the MCU by exploring the political and social climate created by the Avengers' existence. Actions have consequences and consequences influence more action.\r\n\r\nCivil War isn't as focused as The Winter Soldier. It's also overstuffed with characters and fan service. However, the movie works by always being intriguing. Both sides of the conflict are portrayed as equally valid. The exploration of superhero accountability isn't anything new (explored in Watchmen and The Dark Knight), but it's nice to see it incorporated into a grand cinematic universe. Also, Captain Zemo is a better than average villain because while underdeveloped, his motive is interesting and not just \"destroy the world.\"\r\n\r\nAlso, SPIDER-MAN IS FINALLY IN THE MCU!!!! 😁😁😁", "created_at": "2019-03-09T20:46:08.899Z"}, {"movie_id": 271110, "review_id": "5e20f4fe397df00012969c6a", "rating": null, "review_text": "Captain America vs Iron Man. Setting 2 of Marvel's greatest heroes against each other was truly the fight of the century. Now that is an action-packed superhero movie!", "created_at": "2020-01-16T23:42:54.146Z"}, {"movie_id": 271110, "review_id": "5e21dc22bfeb8b0015cf439c", "rating": null, "review_text": "I'm on Team Iron Man on this one. Capt America's reason for me was a bit childish at least. Impressive fights, and with this one, the superheroes were forced to make choices and choose which team would they fight for.", "created_at": "2020-01-17T16:09:06.048Z"}, {"movie_id": 271110, "review_id": "5e24a4591bf2660016fb1e73", "rating": null, "review_text": "A truly spectacular movie! 10/10 Story, paired with great acting from the cast, alongside the introduction of new superheroes, made the experience worthwhile. I am so excited about what the next phase of the upcoming MCU films has to offer.", "created_at": "2020-01-19T18:47:53.708Z"}, {"movie_id": 271110, "review_id": "5e24abd2a894d6000f3a4bb2", "rating": null, "review_text": "I was loving every second of it! Fascinating action scenes, and it all came down to the point where all the Marvels heroes must fight to prove a point. All I can say is that I enjoyed the movie, and will definitely watch it again.", "created_at": "2020-01-19T19:19:46.996Z"}, {"movie_id": 271110, "review_id": "5e24b4f75ed8e9001760c244", "rating": null, "review_text": "Marvel did it again! Captain America: Civil War is a thrilling, action-packed Marvel movie that will surely entertain you through and through. The MCU became more tense because of the plot of the movie, and loyalty and friendship were put into jeopardy, and this one fractured the team to 2 sides.", "created_at": "2020-01-19T19:58:47.565Z"}, {"movie_id": 271110, "review_id": "5e24bb2ccf4b8b0017f753a1", "rating": null, "review_text": "Kudos to the Russo brothers for making a great Marvel movie again. Amazing choreography, fight scenes, chase scenes, and great stunt work.", "created_at": "2020-01-19T20:25:16.753Z"}, {"movie_id": 271110, "review_id": "5e24c50ad6c30000114252ab", "rating": null, "review_text": "At the end of the day, Captain America: Civil War is a movie about friendship and vengeance, and how these two things split the Avengers into 2 groups, and forced all the superheroes to make a choice on whom to fight for.", "created_at": "2020-01-19T21:07:22.759Z"}, {"movie_id": 271110, "review_id": "5e24cadbbfeb8b0013d47195", "rating": null, "review_text": "Both the mental and internal conflicts for this movie were so great! After the events of Age of Ultron, this pushed for the amendment of the law which was the catalyst for the splitting of the Avengers into two. Simply amazing!", "created_at": "2020-01-19T21:32:11.899Z"}, {"movie_id": 271110, "review_id": "5e24d0aa1bf2660014fbcaa0", "rating": null, "review_text": "I might give this movie an A+ rating. It is a great film, and I thoroughly enjoyed it. Thumbs up!", "created_at": "2020-01-19T21:56:58.453Z"}, {"movie_id": 271110, "review_id": "5e259f8ea894d600123c4daf", "rating": null, "review_text": "That's it? It is not terrible but I think it can go even further. Too confusing, not funny, Captain America's reason is childish, and I think it is just a showcase of special moves.", "created_at": "2020-01-20T12:39:43.001Z"}, {"movie_id": 271110, "review_id": "5e26febc1685da0013dee788", "rating": null, "review_text": "FRIENDSHIP? OR THE WORLD? Capt. America proves that being a friend means that even if the entire world is against you, he will be there with you till the end.", "created_at": "2020-01-21T13:38:04.353Z"}, {"movie_id": 271110, "review_id": "5e270e97168935000f34c58a", "rating": null, "review_text": "Civil War is just like the prequel for the Infinity War, where a lot of Marvel's heroes are showcased. More hyped to see what will happen after the Avengers were disbanded.", "created_at": "2020-01-21T14:45:43.856Z"}, {"movie_id": 271110, "review_id": "5e2907f498f1f10018f529ea", "rating": null, "review_text": "Spiderman and Black Panther's introduction to this movie made it a whole lot better. And we can expect that that is a foreshadow for their upcoming movies, too.", "created_at": "2020-01-23T02:41:56.747Z"}, {"movie_id": 271110, "review_id": "5e29139998f1f1000ff56ae4", "rating": null, "review_text": "This battle between Marvel's finest superheroes left me hanging on the edge of my seat. It was a great one, seeing how friends had to choose which side will they choose, and to fight for what they believe is right.", "created_at": "2020-01-23T03:31:37.629Z"}, {"movie_id": 271110, "review_id": "5f6398a20816c70037ba289e", "rating": null, "review_text": "Truly fantastic. Captain America Civil War showed the true colors for both Iron man and Captain America. It showed the relationships between the avengers and who they can really trust. I'm proud of what <a href=\"https://paperhelp.nyc/\">paperhelp</a> did for this movie out ten this movie is a 100. It truly showed that when it comes to the Avengers everyone can be the leader (although I think Iron man's the true leader.)", "created_at": "2020-09-17T17:10:58.497Z"}, {"movie_id": 271110, "review_id": "6007849aaf2da8003e90594f", "rating": 9.0, "review_text": "Awesome! My new favourite, so far at least.\r\n\r\nWhat an absolute joy <em>'Captain America: Civil War'</em> is! It made 147 minutes feel like so much less. Great action, enthralling story, sharp humour and some impeccable use of the many, many characters; even introducing two new faces to the MCU. I won't spoil who, but they are massive additions and I love what they give to this.\r\n\r\nIt gives the perfect amount of screen time to all involved, there is no-one I wanted to see more or less of - it all felt very natural too, big kudos for that. Chris Evans is terrific, this is his best performance as Captain America thus far in my opinion. Robert Downey Jr. continues to impress, as expected.\r\n\r\nSebastian Stan as Bucky also sticks out, I didn't love that character in his preceding appearances but in this I really did connect with his story. Anthony Mackie and Don Cheadle remain good fun, while Daniel Brühl plays his role very nicely. Elsewhere, Paul Rudd's inclusion is amusing.\r\n\r\nThe whole film, as is normal in these productions, looks stunning. They are incredibly well made. As noted at the top, this is more new favourite from the MCU - surpassing <em>'Captain America: The First Avenger'</em>. I guess there's no hiding who my standout avenger is, eh?\r\n\r\nThe only 'but' I have for this is the title. It's practically an avengers film. I'm not saying it's an ill-fitting title, I get it's the titular character's arc, but I feel like it does the film a slight disservice - it's impacts much more than Captain America.\r\n\r\nThat's not a big deal, at all, though. No doubt in my mind: this is superb!", "created_at": "2021-01-20T01:17:14.174Z"}, {"movie_id": 271110, "review_id": "643ee73660620a0313cc9f5e", "rating": 10.0, "review_text": "Wow!!! Is the first thing that comes to mind. Insanely good movie. Plus the introduction of Black Panther.", "created_at": "2023-04-18T18:53:42.669Z"}, {"movie_id": 271110, "review_id": "6452b453d8f44e0dadf433df", "rating": 10.0, "review_text": "Wow!!! Is the first thing that comes to mind. Insanely good movie. Plus the introduction of Black Panther.", "created_at": "2023-05-03T19:21:55.946Z"}]