[{"movie_id": 521777, "review_id": "5d66fa666082eb0017a58197", "rating": 10.0, "review_text": "walking into the theater i didnt know what to expect from this movie except two things one to atleast laugh a little and two to be in aww by the shocking content but however what i personally didnt expect was to attend the absolute funniest movie ive seen all year long i laughed out loud nonstop i loved the characters as well this definetly isnt for everyone kids included or anyone offended by sex humor but if you can take it i highly recommend seeing this comedy blockbuster", "created_at": "2019-08-28T22:04:22.638Z"}, {"movie_id": 521777, "review_id": "5d7c5d51d5191f2f513e6619", "rating": 8.0, "review_text": "Most of the comedies that I love have an element of emotional weight, and ‘Good Boys’ is no exception. The film has some really bittersweet conversations about losing friendships and growing up that are sure to hit home for a lot of people. It helps push the film to the next level, and was something I really adored. \r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-good-boys-more-than-just-a-young-superbad", "created_at": "2019-09-14T03:24:01.871Z"}, {"movie_id": 521777, "review_id": "5dd9c62b3faba00015fcb2ee", "rating": 5.0, "review_text": "Everything old is new again.\r\n\r\nThree naive six-graders are on a quest to get to their first kissing party, but get detoured along the way. Sound familiar? That's because it's the same plot as \"Superbad\" only with younger kids. From having to score drugs to selling a sex doll, these kids get into all kinds of ridiculous hijinks that provide only a mild laugh now and again.\r\n\r\nMy main problem here is the rehash. Why? \"Superbad\" is a far superior movie, probably because of the knowledge the characters bring to the table. These kids know next to nothing about the world, a fact that's played up to a maximum extent time and again. By the end of the movie, I was ready to throw my hands up in the air saying \"Alright! I get it already.\" And the characters don't really develop to a significant extent. They remain just as naive at the end of the movie as they were at the beginning.\r\n\r\nAs a result, we wind up not just with a rehash of \"Superbad\" but a rather stagnant one at that. It can be cute at times, but overall we learn nothing along with the characters and our lives are not richer for having seen this movie. It's a cute diversion, but nothing else. Take it for what it is, or don't. My recommendation is that if you have anything else to see, you're probably better off seeing that instead.", "created_at": "2019-11-23T23:52:11.819Z"}, {"movie_id": 521777, "review_id": "5e0956455aadc400122eaaa7", "rating": 5.0, "review_text": "It's not very good, and it is very derivative but man, I guess I'm just a sucker for jokes about drug use? For whatever reason I pretty consistently find it genuinely funny. Probably says more about me than it does about _Good Boys_, but whatever, it's fine. \r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-12-30T01:43:33.109Z"}, {"movie_id": 521777, "review_id": "63bf644adf857c009f432752", "rating": 10.0, "review_text": "OK, I'll be honest, I wasn't expecting much and, after seeing the spots on talk shows, I was expecting something far raunchier and with far less sentimentality and heart.\r\n\r\nThe good news is that I was wrong. My expectations were subverted... and not in the Johnson The Last Jedi, we are going to subvert expectations by not making a genre film kind of way... but in the wow, this has a little more depth than expected kind of way.\r\n\r\nNo, no, no, no, no... don't let that ruin it for you. Trust me, if it was a really deep film, I'd be giving it 1 star out of 10 for false advertisement reasons alone.\r\n\r\nIt was still sufficiently raunchy, low brow, and vulgar enough to entertain as advertised. It was as advertised.\r\n\r\nBut, it also had a cuter more innocent story that went along with the sleazy hysterical humor. A story that is actually kind of moving given what you are watching. A story that is actually very moving given how it was advertised... given the genre that it was in... given the highly offensive humor that MOST of us absolutely love.\r\n\r\nAnd whomever edited it, had their head on their shoulders. Watching the cut scenes alone are enough to show you how Good Boys could have gone wrong, by running too long with jokes that weren't as funny, had the deleted scenes been left in.", "created_at": "2023-01-12T01:37:14.770Z"}]