[{"movie_id": 2082, "review_id": "58a24e3f925141539b000526", "rating": 4.0, "review_text": "I don't have a problem with remakes per se. Even though I am not a big fan of the original \"Halloween\" film directed by John Carpenter, I do acknowledge it as a film that started a horror slasher trend and served as an inspiration for many of the films that came after it. Since I am not crazy about the 1978 film, I thought I would be able to enjoy this remake without being too influenced by my love for the original film. After seeing this remake, I started to appreciate the original version a little bit more, since Rob Zombie turned the story and its characters into a vulgar mess.\r\n\r\nThe original film mostly focuses on the life of Laurie Strode going on about her business and interacting with her friends for the most part, while we see the mysterious Michael Myers stalking her, appearing from out of nowhere, and we never really get to know why (without taking the sequels into account). In this remake, Rob Zombie attempts to explore little Michael Myers' psychology, giving our villain a soul and establishing the roots of his evilness, taking away all the mystery and darkness surrounding the character. The results are not good by any means and the only thing it proves, is that sometimes, mystery is scarier and more disturbing than having everything explained, especially if the explanation is as predictable as \"he was raised in a bad environment\". The audience doesn't want to be spoon fed and I think it's clear that one of the main reasons why the original villain was scary, it's because Michael Myers remained as an enigmatic character from the beginning until the end. In the original film, Myers appears to come from a seemingly normal family, but for some reason, he turns out a merciless killer anyway. While the original \"Halloween\" film is not my favorite, as I established before, I do give the film credit for giving us a villain that no one could ever sympathize with. This film basically tries to portrait Michael as a poor little thing who was poorly raised and eliminates any possibility of seeing him as a genuinely dark and fear-provoking character. This overexposure of Michael's early years lasts about 40 minutes, which gets tedious, it makes the villain more pitiful than frightening and in the end, they don't really manage to establish a point about his insanity all that well either.\r\n\r\nOnce again, Rob Zombie casts his wife, Sheri Moon Zombie, who was great in 'House of 1000', playing a Insane, trashy girl… but why did she have to play almost the exact same character here? I don't know what's the deal with Rob Zombie having the need to show us his wife stripping and being sexy all the time, maybe it's some kind of fetish they have and it's all good... but 'Halloween' was not the right choice to show Sherri Moon dancing and showing her body again. Another thing that Rob Zombie seems to borrow from his film \"House of 1000 Corpses\" is the fact that the characters are swearing most of the times and while I have nothing against foul language whatsoever, but I think it sounds repetitive and silly when we hear the f-word every 5 seconds. The amount of stupid lines that could be easily compared to some of the crappiest PG-rated films that came out throughout the last years.\r\n\r\nI'm really disappointed. I didn't think I was going to hate it so much, but I do and it's a shame because I really wanted to like this film. Better luck next time, I guess. My noble advice for all fans of the original 'Halloween' movie is: Don't watch this remake if you're sensitive, because this hurts a lot. I know I felt cheated, even if I'm not a fan of Carpenter's version either.", "created_at": "2017-02-14T00:24:31.861Z"}, {"movie_id": 2082, "review_id": "5a026e6392514111da0087e1", "rating": 7.0, "review_text": "The film’s first act is simply a huge version of the 1978 classic’s opening scene; following Michael Myers as a child through his first murder(s). Though many people found this tedious and far too drawn-out, personally I relished the opportunity to get more than a half a minute of character-development on the antagonist. In fact, we don’t only get to see Michael growing up and being arrested, the film then goes on to show us his evolution in a mental asylum. Once again, I know that was less than appreciated by quite a number of people who saw the film, but I find the sequence fascinating every time I watch the movie. Things like the relevance of the mask and kitchen knife are explored more deeply than the original, and the brutality of the character of Michael Myers is more striking. Though this is not considered good to hardcore fans of the silent bogeyman-characteristics from the original.\r\n\r\nThe protagonist of the piece is a character by the name of Laurie Strode, just as she is in the John Carpenter version, and she has two similar off-siders as the original (one of whom is portrayed by Danielle Harris of _Halloween 4_ & _5_ fame). Where the film does not advance in comparison to its predecessor is the dialogue between these three characters. They use virtually identical language to that of the 1978 film, which felt outdated and artificial even then (I can only hope that this was an intentional throwback by Mr. Zombie). \r\n\r\nThe Ahab to Laurie Strode is Doctor Loomis, Michael Myers’ psychologist, acted by the consistently fantastic Malcolm McDowell. I believe it is his performance that makes me appreciate Rob Zombie’s remake so much. He steals every scene he is in with his overwhelming presence, particularly in the Zone 2 theatrical version of the film (which to my knowledge is unfortunately not available in Australia).\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2017-11-08T02:39:31.601Z"}, {"movie_id": 2082, "review_id": "5aad5733c3a3682f34000108", "rating": 7.0, "review_text": "The critics are wrong…again. Well, at least as far as I am concerned. This remake is not bad at all. A lot of people are comparing it with the original which is understandable. A lot of people says that it is crap compared to the original which is not understandable. At least not by me. This is one of the movies where I have seen the original and it was even one of my favorites at the time. I think this remake holds up quite well.\n\nAt first I was a bit worried that it was said to be a prequel. At least partly. However it is not really what I would call a prequel. It has a bit of extended background in the first quarter or so but that is not really what I would call a prequel.\nI think the movie was pretty much what I expected or perhaps I should say what I hoped for. It is a slasher-movie of course but it resists the temptation to go all overboard. Nowadays you do not really get scared or even shocked by these kinds of movies so I was not really expecting to be. I was just enjoying Michael’s rampage through the town. It is of course a bit scary in itself that you are watching a madman going on a killing spree through a small town and enjoying it but hey, it is all fake!\n\nOne problem with the extended background at the beginning of the movie is that now there is kind of a plot-hole that is a bit annoying. When and, more importantly, how did Michael turn from a deranged kid to a supernatural killer with the strength to carry away one ton worth of tombstone and survive being stabbed as well as shot at?\n\nApart from that I think this movie was not bad at all. Sometimes I actually felt that Michael was behaving a bit too human like when he was stumbling when crashing through walls etc. but on the whole I quite liked this movie. The style is different from the original for sure but I do not feel it is worse or better for that matter.\n\nIt is a bit surprising (well maybe not, the French are bizarre when it comes to scheduling movies and TV-shows) that Cine+ did not schedule this movie for actual Halloween instead of the crap they did show. This one would have been perfect then instead of a day after.", "created_at": "2018-03-17T17:58:11.691Z"}, {"movie_id": 2082, "review_id": "63c21c54df857c00bc21fe30", "rating": 1.0, "review_text": "Well it has Malcolm McDowell, and he delivers in the master of accents kind of way.\r\n\r\nBut....1 star for being a reboot, out of principal, especially a reboot of a slasher film that, well, I always thought the deal with those was to keep adding and adding until you have to look up the Roman Numerals in Encyclopedias to make sure you're numbering them right.\r\n\r\n\"Halloween MCMLXXVIII: This Time it's Easter,\"  You know, that sort of thing.\r\n\r\nBut we will add one for Malcolm McDowell just because, yeah, he delivers.\r\n\r\nSo two stars: ** And then it seems like Zombies idea was to show a lot of nudity and especially a lot of naked women getting killed by a horrible male monster after committing the sin of fornication.\r\n\r\nSo three stars: *** And that is because he MIGHT--with a really big stretch on that--have been trying to do a satire thing of the slasher genre with all the naked murdered women.\r\n\r\nBut...he could have also been going for mainstream snuff porn.\r\n\r\nI'm honestly not sure which way to go on this one...so We are back to two stars: ** Just because it really might not have been an attempt at satire and I sort of want to be sure.\r\n\r\nAnd we can't add any more because well...\r\n\r\nIt was already made and when it came around in 1978 it was moody and atmospheric and, well, it really looked a lot like Halloween, only a nightmare version of it.\r\n\r\nZombie's remake feels more like a cheap version of Halloween and really, the outdoor shots that are supposed to give you the seasonal feel remind me more of Thanksgiving pick-up football games. They look and feel less like a nightmare version of Halloween than Season of the Witch's small Southern Town atmosphere.\r\n\r\nAnd the horror parts, really, ANY slasher movie and, by the way, since when was Halloween about T&A? I thought Friday the 13th owned that stereotype and we went to Halloween for, you know, atmosphere and scares...at least in the first 2 films.\r\n\r\nSo really, I guess my point is that it has Malcolm McDowell and that is slightly redeeming. He's always fun to watch...even in his bad movies...like this one.", "created_at": "2023-01-14T03:07:00.724Z"}, {"movie_id": 2082, "review_id": "653da26be894a600ff16d706", "rating": 6.0, "review_text": "I'm unmoved by this <em>'Halloween'</em> remake.\r\n\r\nI guess that is of little surprise as I'm not someone who overly enjoys the 1978 original, I do like it but it is nought special to me personally. All in all, based on reading back my review of that aforementioned flick and based on my thoughts whilst watching, this is a weaker film in every way.\r\n\r\nThe only true positive I have is the Michael Myers theme, which is just a carry-over from the 1970s release - as ace as it is to hear it again, I would've preferred if they went without it... it kinda feels like they forced themselves to find spots to use it for the sake of using it. This production missed a Jamie Lee Curtis-esque performance, no-one stands out in that regard - Scout Taylor-Compton tries, but to no avail.\r\n\r\nI never found Michael Myers himself all that scary or uncomforting in the original and that is again the case here, even to a further degree in all honesty. Myers just feels so brute-force all the time that there is no intrigue or creepiness about him here in my opinion. Malcolm McDowell didn't do anything for me as Loomis either, though it's cool to see Brad Dourif appear.\r\n\r\nThe opening 50 minutes and the closing 50 minutes felt like a bit of an abrupt switch too, admittedly I might have noticed something that doesn't exist but that's how it felt. It seemed early on like a noticeably different portrayal of <em>'Halloween'</em>, then the latter part felt more like a more standard, by the numbers remake.\r\n\r\nIf not for the name, this would be a very forgettable movie... in my eyes, anyway.", "created_at": "2023-10-29T00:08:11.490Z"}]