[{"movie_id": 446354, "review_id": "5a712c18c3a3685751000083", "rating": 5.0, "review_text": "Firing on all Oscar-bait cylinders, _The Post_ is much more about the facts of the events than an insight into the people involved in them. It has some laughs in it, but it's far from a comedy.\r\n\r\nIt's all \"what\" and no \"why\", but also, _The Post_ is built on this HUGE will-they-wont-they question with massive ramifications (\"Will Nixon and LBJ be exposed\") and it's what the whole 108 minute runtime is building up to, but... We already know. The things that happen in _The Post_ are real events that are common knowledge. So it's kind of... The mystery of the moral quandary was answered before you ever pressed play. I think with the state of journalism and even more so the state of politics the way it is now in America, that _The Post_ was a very timely film, and with a cast like this assembled, obviously nobody in it is bad.\r\n\r\nBut does _The Post_ deserve the awards consideration it has gotten? Personally, I don't think it does.\r\n\r\n_Final rating:★★½ - Not quite for me, but I definitely get the appeal._", "created_at": "2018-01-31T02:38:16.993Z"}, {"movie_id": 446354, "review_id": "5bb9d1b20e0a2634e60239df", "rating": 6.0, "review_text": "The movie is very interesting and clearly very curated in the cast and scenography. It tells an important piece of American history and is an ode to press freedom.\r\n\r\nHowever, I found it rather slow in development and a bit too lost in too many conversations. Lacks a bit of action/movement.", "created_at": "2018-10-07T09:28:18.153Z"}, {"movie_id": 446354, "review_id": "64589efc6c849200e35d849d", "rating": 5.0, "review_text": "**An ambitious film, very solid and with a lot of quality, but which turned out to be forgettable.**\r\n\r\nI've honestly lost count of the movies about Nixon I've seen. And I understand that! In the history of the American presidential institution, few presidents have stirred up as much controversy. He was a president who not only was willing to use his whole power, but also who abused from its use. And the media was one of his biggest and most fearsome enemies. In this film, the point of originality is that the focus is never Nixon or Watergate, but the main figures of The Washington Post in the days before the scandal, when it was sued by the White House. It's not that kind of surprising originality, but it's enough.\r\n\r\nThe script has its flaws, one of which is perhaps the attempt to insert the theme of gender equality in a corporate environment. This appears when we see all those men who are very hesitant about taking orders from a woman, even though she is undoubtedly the boss and owner of the company. The 70s were important for the feminist movement, but it was a young and rebellious layer that led the decade, and the role of mature women, like the owner of the Post, may not have been valued as it should have been. However, the theme seems to be lefting in the film, and it ends up frankly underdeveloped from the moment when she basically says “the newspaper is mine, I am the one who gives orders and I answer for them, and whoever does not want to obey can leave”. This strong attitude simply closes the matter. As for factual accuracy, I'm not the best person to talk, I can't say if the film does justice to the events.\r\n\r\nThe strongest point of this film is, without a doubt, the talent gathering. Steven Spielberg ensures an impeccable direction and manages to give us a solid film, which will always, however, be a considerably minor work in his filmography. In addition, we still have a cast of cast-iron strong actors, led by Tom Hanks and Meryl Streep. And I don't think I need to say that this film isn't a particularly memorable piece of work for either of them. Perhaps, the film represented a good financial fit for them, just as it certainly represented a privilege for the rest of the cast, who had the opportunity to see them work and, eventually, learn something more, some of those things that are not learned in dramatization courses, but through practical experience.\r\n\r\nTechnically, it's a pleasantly warm film. That third cup of tea that waited too long in the pot and ended up colder, but also thicker. It's the best metaphor to let you understand what I think: the environment and the theme give it density and tension, which, however, does not make it unnerving because it is done in a very moderate way, served cold. There is a period re-enactment effort that looks good, but it was necessary and could not be ignored. The soundtrack, by Williams, is forgettable, not to say mediocre (taking into account the composer's ability). There is a certain ambition in the project. The producers knew they were making a strong film, but the final product was not as good as they would have liked, nor was it memorable.", "created_at": "2023-05-08T07:04:28.201Z"}]