[{"movie_id": 13177, "review_id": "6378ce5b5b2f47009ba9518f", "rating": 4.0, "review_text": "**It has some points of merit, but lacks neutrality.**\r\n\r\nI was too young in 1999 to remember this World Trade Organization meeting. However, I am fully aware that this type of summit is usually a rallying point for demonstrators in favor of a thousand ideals: rebels without a cause, anarchists, socialists, communists, environmentalists, conspiracy theorists...\r\n\r\nI don't really know what happened, but there is no doubt that these protests were violent and, to a certain extent, they managed to achieve their objectives, severely disrupting the summit and the life of the city, and becoming a juicier and more relevant matter than the summit itself. In the following summits, there was more care. I could make a series of considerations around the real usefulness of the WTO, or even if there aren't other ways to encourage a greater trade flow and greater ease in commercial exchanges between countries, making it possible to end this, apparently questionable, organization. But one thing I learned in my life: the owners of money usually win these wars, even if they lose some battles along the way.\r\n\r\nThe film is very competently directed by Stuart Townsend. The director does not hide that his heart and admiration are with the protesters in the streets, and the film is not neutral about that. Thus, we witness the glorification of peaceful protests, the demonization of authorities (even though the police are portrayed as men who only do their job) and even the exposure of many of those who, under the cover of protests, broke and burned things just because it seemed a good idea. Personally, I would have preferred a more neutral approach, because if the idea was to demonize the economy and the WTO, it should have been better contextualized.\r\n\r\nThe cast has some well-known names, and Martin Henderson turns out to be one of the actors who deserve our applause. He's done a good job, he's in excellent shape, and he's used the material he's been given very well to give personality and depth to his character. I also really liked the performance of Charlize Theron, in the role of her wife. Ray Liotta is very good in the role of a mayor who is overtaken by events. The rest of the cast, however, I felt didn't stand out, and didn't do much more than they really had to.\r\n\r\nThe film has an extraordinary cinematic beauty, as it manages to recreate very well what was experienced on the streets during those days in December 1999. The way in which everything was recreated is pleasantly aesthetic without losing any kind of credibility or realism. The sets (streets) and costumes also help a lot and the cinematography makes good use of gas fumes and light and shadow effects, in addition to a series of moving camera shots, which transport us to the middle of the action.", "created_at": "2022-11-19T12:38:51.495Z"}]