[{"movie_id": 199575, "review_id": "561a15909251415d31001700", "rating": null, "review_text": "The depiction concerning doomsday dramas in the movies always seem to have a mixed bag reception when tackling its dour subject matter about the possible annihilation of the planet Earth. The scales of dramatic overdrive can be rather preachy and psychologically exhausting or convey over-the-top unintentional hilarity. Thus, only a few end-of-the-world genre films can pull off the genuine angst and realistic vibes about mankind facing its final fate of fury as our jeopardized existences are in considerable question.\r\n\r\nIn the blistering and noteworthy 2003 Australian apocalyptic low-budget film ‘These Final Hours’, writer-director Zak Hilditch delivers a somber and sleek story about mass paranoia and the redemptive vibes of one man caught up in the hysteria of the catastrophic bleakness that persists.  Thoroughly absorbing and telling, ‘These Final Hours’ resourcefully captures the psychological urgency and the humanistic hedonism that exists under such worldwide adversity. Thoroughly absorbing and thought-provoking, the stark ‘These Final Hours’ offers a telling hypnotic depth that more contemporary flashier and fueled fare may fail to carry out in their frenzied translation.\r\n\r\nHilditch’s tense narrative is not necessarily the definitive showcase on saucy doomsday dramas to ever emerge. Still, it has a simplistic and gritty edginess to its message of global despair and destruction that certainly helps its cause as a perceptive and contemplative human horror show. In its own low-key appeal of desperation and doom, ‘These Final Hours’ is undoubtedly powerful and dares to ask introspective questions of its audience pertaining to survival and how one’s final hours would be emotionally shaped as in the limited time of planetary panic.\r\n\r\nSo the pending question at large remains: what is the impact of a vulnerable society upon the wake of Earth’s final run as a planetary playground for an exposed mankind? Well, for one troubled man in James (Nathan Phillips) he is our conflicted tour guide to all the mayhem that persists in the last 12 hours that Earth has to remain whole before an asteroid arrives to obliterate its last pit stop: Australia! The inevitability of endangered lives in James’ region of Perth is a harsh reality so the reactions of the surrounding territory is understandably erratic and laced with fear and in some cases nervous-minded frivolity.\r\n\r\nJames is not what would call a goody two-shoes. He thinks nothing of hopping from one woman to another. He has rowdy and raunchy companions. Basically, James is a blue-collar stud without much going on in a stagnant livelihood. Still, he does has some semblance of consciousness as he boldly confronts a group of weapon-carrying thugs that are adding more unruliness to an already hostile environment or panicking and paranoia. In the process, James becomes the unlikely rescuer for an aimless little girl named Rose (Angourie Rice). He takes the frightened child under his wing as soon the tandem roam the area in the middle of sheer chaos as the critical countdown to eradication continues.\r\n\r\nThus, James and Rose are each other’s comforting cohorts as they travel among the ruins of damaged property, flame-induced vehicles and, of course, the fellow citizens that range from party-hearty rabble-rousers to God-fearing believers praying for salvation as the murky mirror for gloom creates a bigger shadow of sorrow and scorn.\r\n\r\nSadly, James and Rose must shift through the turmoil that is indeed a human tragedy spearheaded by the expected suspense of natural bombastic deterioration. The sense of helplessness and hopelessness is weighing in on the millions of people so distraught and disillusioned that they are powerless to prevent the ultimate demise of a planet destined for extinction. The forged father-daughter dynamic between James and Rose in the face of a dire worldly washout is surprisingly poignant, intense and gently tender.\r\n\r\n‘These Final Hours’ works its soulful and menacing magic because it does not solely concentrate on the grand scale of the horror-induced incidents (shaky buildings, grimy graffiti, burned out cars, a collection of trash can fires, etc) so much as it brings the startling focus to the human psyche, the real centre for the horrific happenings of anxiety and outrage. Hilditch is astute enough to fixate on the inherent ugliness at hand, the inner conflict of human anticipation and aggravation in the event of the massive world’s ending. The film is not afraid to tap into the visual debauchery of the human element as it is prominently punctuated around the impressionable tyke Rose. The fact that this kid’s eyes has to endure the degradation of sex, drugs and brutality gives Hilditch’s twitchy narrative its corrosive credibility.\r\n\r\nThe authenticity behind the mental makeup of ‘These Final Hours’ is productively challenging in that the turbulence of troubled waters is not just witnessing the breakdown of dressy disaster-oriented special effects or even succumbing to Bonnie Elliott’s exquisite cinematography. Instead, Hilditch dares to provide a unique kind of wrecking ball meltdown in the human victims -wicked, wayward or wonderful -and place them as the centerpiece of beleaguered behavior where the true dramatics percolates with refreshing gusto.\r\n\r\nIn short, ‘These Final Hours’ were well spent minutes on the clock in watching this well-structured doomsday drama unfold with intriguing forethought.\r\n\r\nThese Final Hours (2015)\r\n\r\nRoadshow Films\r\n\r\n1 hr. 27 mins.\r\n\r\nStarring: Ethan Phillips, Angourie Rice, Jessica De Gouw, Daniel Henshaw and Sarah Snook\r\n\r\nDirected by: Zak Hilditch\r\n\r\nMPAA Rating: NR\r\n\r\nGenre: Apocalyptic Drama/Action and Suspense\r\n\r\nCritic’s rating: *** stars (out of 4 stars)", "created_at": "2015-10-11T07:53:52.701Z"}]