[{"movie_id": 512, "review_id": "5c6d3b3f0e0a2617779faa78", "rating": 7.0, "review_text": "***Enjoyable mystery/comedy with Scarlett Johansson***  \r\n\r\n\"Scoop\" (2006) is a mystery/dramedy/romance written and directed by Woody Allen. Scarlett Johansson stars as Sondra Pransky, a geeky college journalist vacationing in England. She gets a tip from the ghost of a dead newsman (Ian McShane) on the identity of a local serial killer and proceeds to partner with bumbling magician Sid Waterman (Woody Allen); the tip leads them to the rich son of a prominent lord, Peter Lyman (Hugh Jackman), whom Sondra starts to date to acquire information. Is Lyman the notorious killer or isn't he? \r\n\r\nAlthough fantastical and somewhat goofy, \"Scoop\" is first and foremost a mystery and I did enjoy trying to figure out if Peter Lyman is the \"Tarot Card killer.\" In the story we perceive Peter Lyman largely through the lens of Sondra, who is falling for the guy; hence, the viewer warms up to him.\r\n\r\n\"Scoop\" is a comedy but not in the laugh-out-loud sense of, say, \"Ace Ventura: Pet Detective\"; it's mildly amusing, witty and fun but not knee-slapping funny. So if you're looking for the latter don't bother.\r\n\r\nThe three stars and their chemistry are a highlight. I enjoyed the team-up of Woody (Sid) & Scarlett (Sondra) and their surrogate father/daughter relationship. I knew when I saw \"The Horse Whisperer\" that Scarlett would grow up to be one of cinema's leading beauties, and so she is! Scarlett was 21 while filming \"Scoop\" and the film is worth catching solely for her; just don't expect any raunch or t&a exploitation (although she does have a one-piece bathing suit scene and a nightie sequence, which are rather modest).\r\n\r\nHugh Jackman is a great modern masculine actor, of course, and he does fine here, although I couldn't help wondering if long metal claws would suddenly shoot out of his knuckles! \r\n\r\n\"Scoop\" is an enjoyable mystery/dramedy highlighted by refreshing originality, a quality cast with good chemistry and English locations. I admit that I didn't think I'd like the film during the first 25 minutes or so, but then I caught on to the movie’s vibe. The interactions between the three main characters, their story and the mounting mystery pulled me in and glued me until the end. I also enjoyed the creative zany elements (e.g. crossing the River Styx with the Grim Reaper and the reappearing ghost reporter) and the film's overall refreshing air. \r\n\r\nThe movie runs 96 minutes and was shot in London & the English countryside.\r\n\r\nGRADE: B+", "created_at": "2019-02-20T11:34:23.418Z"}]