[{"movie_id": 120467, "review_id": "55cf28839251412e5100393f", "rating": 7.0, "review_text": "Yet another well crafter Wes Anderson's movie. Fiennes and Revolori perform well and the amount of well known actors and actresses is incredible but we have seen similar ways and scripts in his previous movies.\r\n\r\nIt's entertaining, though.", "created_at": "2015-08-15T11:54:43.324Z"}, {"movie_id": 120467, "review_id": "5b0ae8550e0a260dad009f7d", "rating": 6.0, "review_text": "Wes Anderson's THE GRAND BUDAPEST HOTEL is the director's celebration of Central Europe culture and fashion in the years between the World Wars, and an elegy for what was lost with the rise of fascism and communism. Set in 1932 in a fictional country called Zubrowka, the streets, military regalia and (ersatz) German names we are shown could have come from anywhere between Germany and Estonia. Its protagonist Gustave H. (Ralph Fiennes) is a concierge at the eponymous luxury hotel, the splendour of which disappeared, we are told, with World War II. Gustave H. is known publicly as one of the best concierges in the business, able to dash around the hotel at lightning speed to satisfy the most varied guests of the elite clientele. Privately, he's a rake with a rather foul mouth, and fond of bedding the rich old women who patronize the establishment. When one of those old ladies, Madame Céline Villeneuve Desgoffe und Taxis (Tilda Swinton) dies and Gustave is framed for her murder, he must evade the law and unmask the true culprit, with the help of newly hired lobby boy Zero Mustafa (Tony Revolori).\r\n\r\nThe films of Wes Anderson are known for their immense visual detail, and THE GRAND BUDAPEST HOTEL is no exception. The elaborate framing of shots, the myriad cute items to look at on every set, and the architectural detail are like a diorama blown up to the big screen. Curiously, that visual detail is matched to a real slackness in the human characterization. Anderson has brought in a large number of actors he had worked with before, including Adrien Brody, Jeff Goldblum, Ed Norton, and Bill Murray, for roles that range from the main villain to little more than cameos. These characters are never fleshed out like Gustave H. or Zero Mustafa, and the actors don't even try to pass themselves off as Central Europeans from the entre deux guerres. Instead Adrien Brody plays Adrien Brody, etc.\r\n\r\nThere are two supporting roles that I felt were stronger. William Defoe plays a nearly mute henchman whose look is a nod to early vampire films (Transylvania was Central Europe, too). More remarkable is Harvey Keitel's turn as an old prisoner: when so many handsome leading men try to hide the effects of time after they enter their sunset years, 75-year-old Keitel was not afraid to show the ravages of old age here.\r\n\r\nUnfortunately, I found the 21st-century Americans strutting about (and a few speaking in rough New York accents) in a historical drama to be jarring. I was also disappointed by the resort to Hollywood tropes here, when Anderson's earlier films managed to be very quirky and sui generis. For example, did we really need not just one scene where a character is hanging off a cliff's edge as the villain stands over him, but two? And the amount of plot details that are introduced but never really explained makes one feel that the work was subject to some heavy cuts to please a studio.\r\n\r\nStill, if you liked Wes Anderson's earlier films, you'll find much to enjoy in his dollhouse approach, and it is amazing how every one of his films has a completely new and fresh visual theming even if his quasi-autistic obsession with prettiness never changes. Another thing I liked about the film is its \"story within a story within a story\". The entire plot of Gustave H. is, we are shown, taken from a fictionalized treatment by a writer who met a middle-aged Mustafa (F. Murray Abraham) in the 1960s. Befitting this novelistic layer -- and the work of Stefan Zweig that Anderson credits for inspiration -- this framing story is written in stilted, unrealistic dialogue like an old-time novel. And the aspect ratio changes for each layer of the film, a little treat for cinema anoraks.", "created_at": "2018-05-27T17:18:13.107Z"}]