[{"movie_id": 508883, "review_id": "653b7724bc2cb3012c3074d6", "rating": 6.0, "review_text": "MORE SPOILER-FREE MINI-REVIEWS @ https://www.msbreviews.com/movie-reviews/mini-reviews-2023-edition\r\n\r\nTHE BOY AND THE HERON is a visually captivating film that struggles to balance all of its storylines and themes. Technically, no faults. The visuals are nothing short of breathtaking, with each shot meticulously detailed and rich in storytelling. The animation is a true work of art, drawing viewers into a world of wonder and magic. The sound design and score complement the visuals beautifully, enhancing the overall viewing experience. And finally, the film retains the typical Ghibli humor that fans have come to love, sprinkling lighthearted moments throughout the narrative.\r\n\r\nHowever, Hayao Miyazaki succumbs to his ambition. The filmmaker tries to incorporate too many ideas, resulting in a somewhat confusing, messy narrative, particularly in the transitions between different characters, locations, and story arcs. THE BOY AND THE HERON stumbles in its attempt to juggle multiple ideas, but overall, it still manages to deliver a delightful, enchanting experience for fans of the studio's work.\r\n\r\nRating: B-", "created_at": "2023-10-27T08:39:00.090Z"}, {"movie_id": 508883, "review_id": "65900c2564f71666a28e926c", "rating": 7.0, "review_text": "Maybe it's sacrilegious to say, but I didn't love this latest from the marvellously imaginative mind of Hayao Miyazaki. It follows the adventures of \"Mahito\" who arrives at the home of his factory-owning father amidst WWII. We appreciate quickly that his mother has died and that he is to have a new, expectant, mother in \"Natsuko\". When she mysteriously disappears and \"Mahito\" finds his presence \"requested\" by an enigmatic and beautiful grey heron, he strays into an old abandoned tower on his family estate and is soon embroiled in a world inhabited by people who are alive and, well, not! It seems the heron is not quite what it seemed, either, as he must explore rooms within rooms and endless doors that open into new scenarios. Pursued by giant pelicans, how can \"Mahito\" find his stepmother and return safely to their home? Luckily, along the way, he encounters the benevolently spiritual \"Kiriko\" as he finds himself the subject of some clever manipulation between the outwardly benign \"Grand Uncle\" who draws the power of life from a giant sacred stone he wishes to leave in the custody of our young explorer and the ambitious \"Pelican King\". You simply cannot fail to admire the vivid imagination of Miyazaki - the ideas and apparent randomness of the threads that gradually come together is hard enough to follow sometimes even when you have seen the denouement, and that's what makes these intricately drawn and characterised stories usually more intriguing and enjoying. Somehow, though, this was just a little too unstructured and meandering for my little brain. I've seen it twice now and maybe I just didn't engage with \"Mahito\" in the way I did with \"Howl\", \"Totoro\" or 'Chihiro\" or, indeed, with the story. It's still a glorious watch on a big screen and is certainly well worth watching. Just not sure it is in his top five, though!", "created_at": "2023-12-30T12:25:09.621Z"}]