[{"movie_id": 913673, "review_id": "64c4240f41aac4013b028c9b", "rating": 10.0, "review_text": "**Not sure if it's a good Christian movie, but it's a great horror movie**\r\n\r\nGreat movie, even though in a way it sets itself up for failure, because a Christian audience doesn't usually appreciate a good psychological horror movie and horror fans usually don't like a movie made by Christians promoting Christian values.\r\n\r\nSo there is no big demographic that really appreciates a movie like this and it's obvious that the makers of this movie knew that too and were doing it to simply make a good movie for those who can appreciate it (no matter how few there might be).\r\n\r\nSo I am not sure if it even really wants to be a good Christian movie or a good psychological horror movie, but either way it does succeed at being both.\r\n\r\nFor a movie about demonic possession it's also surprisingly realistic. And I say that as someone who has worked as a guard in prisons and mental institutions. There are a few extremely minor inaccuracies but these are necessary for the plot or are for safety reasons (after all, not everyone needs to know what exactly the actual safety measures in a prison actually look like in detail).\r\n\r\nThere actually already is an almost identical German movie called \"Der Totmacher\" (The Deathmaker). Though I am sure no one involved in this movie saw it, even though it's essentially the same movie and that's because that German movie's entire script simply consists entirely of the actual transcripts of an actual psychological evaluation of an actual serial killer. But that's how close to reality this all actually is.", "created_at": "2023-07-28T20:24:47.762Z"}, {"movie_id": 913673, "review_id": "65a6d1b1cedac4012e7fd2b8", "rating": 6.0, "review_text": "When hardened psychiatrist \"Martin\" (Jordan Belfi) arrives at the prison, he is charged by the warden (Tom Ohmer) with certifying that a prisoner is mentally fit. Mentally fit to be electrocuted, that is! Opposite him, shackled to the table is a man (Sean Patrick Flanery) who proves extremely problematic for the normally ordered and structured analyst. That's not least because he claims to be possessed by the eponymous demon and that he has made enough use of this body and so wants to be killed so he can move on! Preposterous we all think, but this orange-suited man knows things he shouldn't, and soon his comments are unsettling and discombobulating \"Martin\". Now the performance from Flanery is actually quite good here. There is something almost compellingly maniacal about his delivery. The dialogue - well that's another matter. It could be considered thought-provoking or it could be considered banal. You certainly can't ignore it, or the curiously extreme and frequently contradictory doctrines being espoused and countered during what passes for their frankly rather contrived debates. If that's it's purpose, then it's worth a watch. As any sort of light-horror concept, though, it's derivative and unremarkable and it misses the target.", "created_at": "2024-01-16T18:57:53.855Z"}]