[{"movie_id": 529203, "review_id": "5fd2b373f92532003daae946", "rating": 6.0, "review_text": "With cinemas starving for content - especially family content these school holidays - 'The Croods: A New Age' is your best bet. It's the perfect holiday escape for the whole family, with big laugh-out-loud moments, epic fight sequences, and of course a great message about getting along and working together.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-croods-a-new-age-a-fun-family-prehistoric-escape", "created_at": "2020-12-10T23:46:59.538Z"}, {"movie_id": 529203, "review_id": "6593c04251a64e020af591d5", "rating": 7.0, "review_text": "Somewhat nomadic after the conclusion of their 2013 adventure, the caveman \"Croods\" are still searching for a place to call home. It's not just the quest that intrepid leader \"Grug\" must manage, he's also got the constantly hormonal \"Eep\" and \"Guy\" to contend with too! Anyway, they stumble upon a positively Elysian land of lush green grass, waterfalls - and bananas - and that's where they encounter the pretty supercilious \"Betterman\" family. They'd be the posh \"Flintstones\" with all the bamboo mod cons - even the original picture window! It's soon clear, though, that these two families are facing a bit of a culture clash and as tempers mount, \"Grug\" commits an unmentionable sin - and they are descended upon by a marauding gang of punch monkeys determined to feed them all to their Kong-esque king. Now they must but aside their trivial differences and work together else they will all end up as banana fritters! It's quite a fun little adventure film, this. It pokes fun at vanity and intolerance, keeps the story simple and engaging enough before an ending that, though predictable, reminds us of the values of working together rather than apart. The animation is standard, high-end, Dreamworks fayre and it's entertainingly scripted passing ninety minutes effortlessly.", "created_at": "2024-01-02T07:50:26.181Z"}]