[{"movie_id": 392044, "review_id": "5ad834500e0a26434500cea2", "rating": 4.0, "review_text": "I am a great fan of Agatha Christie in general and Hercule Poirot in particular. When yet another remake of Murder on the Orient express came out I was somewhat hesitant. After all, the one with David Suchet was perfect.\r\n\r\nI guess I was right to be hesitant. This is another one of those remakes where you just wonder…why? As a movie it is not too bad but as a Hercule Poirot movie, the classical Murder on the Orient Express no less, it is like buying a piece of prime filet of beef and discovering that the butcher gave you chicken drums when you open the package. Edible but not at all what you paid for.\r\n\r\nTo me this movie was a blatant attempt to make an Americanized version of Hercule Poirot. It was poorly done by a clueless scriptwriter and director and it was deeply disrespectful to the original character.\r\n\r\nThe movie starts of by introducing Hercule as the pedantic, somewhat weird, person that he is but the attempt is just dumb and silly. Apart from the scene more or less making Hercule look like a jerk, these people apparently know him, why would they serve two eggs of different sizes in the first place? Oh right, because the director thought the audience was too dumb to make that reflection.\r\n\r\nThen there are some things that Hercule simply do not do. Like walking on the roofs of train cars, climbing around and chasing criminals as if he was some action hero. He even gets shot and more or less just shrugs it off for Christ sake!\r\n\r\nAnd do not get me started on that grotesque moustache! As I said, an Americanized version of Hercule Poirot. Unfortunately bigger is not always better.\r\n\r\nI can go on for some time here so let’s move on.\r\n\r\nTechnically the movie is not that bad. The scenes, the decor, the acting in general etc. can even be said to be good. Unfortunately, for me, this was constantly overshadowed by the brutal slaughtering of my beloved Hercule Poirot character.\r\n\r\nPart of this is probably due to the movie trying to focus so much on Hercule that most of the other actors almost feel like … props, even though they themselves are doing quite a good job of their roles. One reviewer wrote that “The actors seem to have been invited, not to play characters, but to watch Kenneth Branagh act.” and there seems to be some truth in that.\r\n\r\nThe movie ends with a hint of further moves. Personally, I hope there will not be a continuation of this train wreck (pun intended).", "created_at": "2018-04-19T06:16:48.609Z"}, {"movie_id": 392044, "review_id": "620b1b9e9b8616002da29d74", "rating": 5.0, "review_text": "I have always loved this story and was looking forward to seeing this adaptation but afraid it was going to be Branagh'd, especially when finding out he was playing Poirot himself and cast Johnny Depp as Ratchett. \r\n\r\nWhen a director wants to put their own stamp on something, they usually screw it up. Branagh dipped both of his shoes in poop (symmetrical, yes?) before stamping Christie's work. Let the story take the film where it needs to be. CGI is not where it wants to be. There's nothing wrong with a dialogue-heavy movie no matter what the studio thinks.\r\n\r\nCasting Grade: D\r\n\r\n* When I heard Depp was going to be in it, I assumed he'd be Poirot and Branagh as Ratchet. Depp would have been a terrible choice too but would have made more sense then Henry V himself. Depp did not fit the Ratchett part at all. Richard Widmark's portrayal in the 1974 film was dead-on. This time an Ed Harris would have been perfect. If he weren't available, Charles Dance. Dance may be too British rather than Italian/American but he still can shoot daggers with his eyes. JK Simmons would work and potentially Sean Bean or Viggo.\r\n* Poirot - This is a tough role to cast, no doubt. Suchet IS Poirot and Finney, though exaggerated was entertaining. Branagh is not tall but this movie seems to film him as larger than his character is. He's supposed to look like a \"funny-looking little Frenchman.\" Yes I know he's Belgian. But also little and funny-looking. All the upward angles make Branagh look bigger, not smaller. Not quite the star power and I wouldn't buy a ticket just to see Daniel Bruhl, he might work.\r\n* Michele Pheifer as Ms. Hubbard was great. The best of the casting, so points here.\r\n* I think Cruz and Dench were fine, as was Dafoe. Only problem here is that even as a red-blooded American male I don't remember much about Cruz's performance. That is criminal underuse. Bergman won an Oscar in this role! It's tough to live up to but still, Ken.\r\n* Josh Gad? Fine as an actor, awful in this role. Eddie Marsan maybe? Martin Freeman? Perkins was perfect so let's go more in that direction.\r\n* Bouc? Bouc is not and should not be 28. Yes they said he's the son of the director of the line but that's dumb. Make him a bit more of a Poirot contemporary so the chemistry is there as if they'd been friends for years.\r\n* Ridley and Odom. This problem is more with the story \"updates\". Daisy's fine and Odom's acting is fine though. \r\n* The rest of the cast is ok- meh and nothing more. The Suchet one wasn't super star-studded, but with an ensemble cast, more of the cast should have been better known.\r\n\r\nStory itself - Here's the fun - \r\n\r\n1. Why does the opening sequence in Syria take 20 minutes? The first question here though is \"is Branagh trying to introduce Poirot to a new audience?\" I would venture to guess that the vast majority of the audience knows Poirot, at least somewhat. The Syrian intro is roughly half of a chapter in the book, a quick few minutes in Suchet's version and not even really dealt with in Finney's. You can also do the egg thing on the train when he orders breakfast. That's enough.\r\n2. Shootout? What? Why?\r\n3. Arbuthnot. Why combine the Col and Doc characters? The 2 should be separate, either because the doc is completely removed from the subjects (book and 1974) or is a separate suspect himself (Suchet). Having them combined just seems pointless especially when you add sharpshooting to his repertoire and the inter-racial reasoning for the quiet romance with Mary. That's a lot, especially since it's 1935. \r\n4. Moustache. Ridiculous but not in the good Poirot-image sort of way. In fact he looks more like Wyatt Earp. HP is vain and his hair would not be shown as gray - it would be dyed black and a fantastic shape, not a ridiculous rug. Again, Suchet has it beat.\r\n5. Hanging outside. Huh? It's a snow drift in the mountains and they're outside hanging out in clothes they were wearing on the train. Winter clothes but not warm enough to have a picnic in. The Suchet version definitely got it right - the passengers were COLD. They showed that with the bundling up, the atmosphere, etc. Also, people from other coaches could be mingling. Whole point was to not let people come in or go out of the Calais coach and dining car.\r\n6. The train tunnel ending roundup. No. Bad Kenneth, bad. Dining car, keep it there. Don't try to be clever, it didn't work nor should it. Cramped in the dining car, trapped with HP's monologue. It works.\r\n7. Gun. Again, what's with the guns? The one under Ratchet's pillow is the only one necessary. His reasoning doesn't make sense either - Bouc is still there and he knows about the plot so they'd have to kill him too, not just HP. \r\n8. CGI - just stop. Video trains. Not hard. \r\n9. The Daisy note - neat trick being able to see the ENTIRE note clear as day and not just a few letters or a word or two.\r\n\r\nOverall - 5/10 is generous. More of a 4. I really wish we could start over here but with Death on the Nile out now I hope 2 is all Branagh does. At least Nile is not one of AC's better stories. Lets wait 10 years and start again. Works for superheroes, why not one with just brains but no braun? Evil Under the Sun perhaps??", "created_at": "2022-02-15T03:18:54.582Z"}, {"movie_id": 392044, "review_id": "6212f2f703f0b600688056dd", "rating": 9.0, "review_text": "Beginning with Kenneth Branagh's second decade as a filmmaker, I suggest he became an industry workhorse. He acted in many films and directed several, all with varying results in quality. Most pointedly, few felt like they were personal projects for 15 years.  For example, his direction of **THOR** is at the pleasure of Kevin Feige, the head of Marvel Films. I argue that **MURDER ON THE ORIENT EXPRESS is personal**. I believe that the \"Shakespeare\" guy believed he could create the \"Agatha Christie\" equivalent of the Marvel Universe. As of this writing, he has returned a second film, **DEATH ON THE NILE**.  There are at least 30 more Hercule Poirot novels remaining for potential sequels.  Likely, we won't see a third unless the second proves to be successful.\r\n\r\n_ORIENT EXPRESS_ received a lukewarm reception - a tepid selection of both audience and critics who find the film neither superior or horrible.  But I am committed.  I find this classic story delivered through modern technology is beautiful, fun and entertaining. It remains quaint and intimate even as computer generated matte paintings create the stunning atmospheric vistas.  I even find the film quite open to repeated viewings.\r\n\r\nThe beautiful color and imagery is supported by a score by Branagh's friend and musical voice, Patrick Doyle. The two feed off each other - Doyle's assertive and aggressive compositions uniquely mimic Branagh's earnest storytelling.  In other words, it is rarely quiet.\r\n\r\nStarting with **MUCH ADO ABOUT NOTHING**, Branagh does a lot of stunt casting. This time may just take the cake.  Every performer is an A-player and each is given at least one scene to chew a bit of the scenery. Make no mistake about it, this story is a tour de force for the role of Hercule Poirot. Branagh's performance of the Belgian super-sleuth is quite fun, beginning on one of the greatest character introductions in the decade.\r\n\r\nIf critical and box office is a good reflection, its a fifty fifty shot whether you will enjoy Branagh's **MURDER ON THE ORIENT EXPRESS**.  To be fair, most of the negative reviews I see are written by someone who is comparing this film to the 1974 star-studded telling.  Those would rather you look up that version (where you will likely not know many of that _star studded_ cast)", "created_at": "2022-02-21T02:03:35.314Z"}, {"movie_id": 392044, "review_id": "6458c454fe077a01398ca856", "rating": 5.0, "review_text": "**An effort worthy of merit, but which did not result in a really good work.**\r\n\r\nKenneth Branagh is one of those actors/directors who doesn't seem to be afraid of a challenge, and I respect him for that, even if his choices aren't always the wisest. Bringing the greatest book of Agatha Christie's work to the cinema is a considerable challenge, not only given the richness of the material and characters, but also taking into account the relevance of the work and the admirers who remain faithful to the author's books (I am one of them). I can't help but say: for me, she is one of the greatest writers of the 20th century. She not only helped to cement the police narrative, but also substantively developed it. Therefore, I must absolutely condemn the recent news about the revision of her books, whose new editions will be stripped of any term, word or minimally offensive mention. In the 16th century, books were burned. Today, despite the justifications, we refine the practices, but maintain the line of thought and the similarity in attitudes towards books that can offend us.\r\n\r\nThe “Orient Express” has already been adapted for the screen on several occasions. The first, in 1974, was a real show and is full of stellar actors. However, one cannot ignore the television adaptation starring David Suchet, an actor who, in a tour-de-force of many years, embodied Poirot in an impeccable way, difficult to match.\r\n\r\nThe film has its merits, which are based essentially on the visuals. The cinematography makes intelligent use of light, the spectacular snowy landscapes and the vintage elegance of the train, which replicates the real Orient Express, a train that, despite numerous business mishaps, still exists. The costumes and props are also magnificent and help to recreate the era, the 1930s. A special note for the way in which the film manages to give us the perfect sensation of the smallness of the spaces. Another peaceful point is the performance of the cast. I won't be being unfair in saying that each one did a good job with the material received. Unsurprisingly, Branagh is the protagonist and gives us a Poirot that gradually becomes more human. He starts out as a weird individual, a deduction factory applied to solving crimes, and ends up with another perspective on truth and justice. That is the focal point of the book. The work of Judi Dench and Michelle Pfeiffer also deserves a special note. The others – and the film is impressive for having such a heavy cast – seem to be there just to be able to say that they worked with the director and that they were part of the project.\r\n\r\nThese are all good things! However, the film is not without serious problems. The biggest and most blatant are the action scenes. Poirot is a dandy, a maniac, a genius, but he was never an action figure or a brawler. In the books, he leaves that to the police or loyal friends like Captain Hastings or Chief Inspector Japp. Seeing him in action scenes doesn't seem like something he would do. Branagh got it wrong here, just as he got it wrong with that unkempt, tasteless mustache. The books have several descriptions of Poirot's mustache and none of them fit the hair accessory used in this film, which looks more like a dead rat. The character is also stripped of most of her many obsessions, limiting itself to a craze linked to boiled eggs. It's absurd! Branagh, who did not even stop to think that he is not at all similar to the character, did not consider the shape of Poirot's head, which is described as \"ovoid\", and did not even try to reproduce the character's gait, which walked in small steps. And considering the elegance and refinement that characterize Poirot, the clothes Branagh wears and the almost absence of a hat are unspeakable details. The film – which focuses on Poirot – also makes a very shallow use of each character's material. Some of the ones that most dialogue with the detective in the book, like Debenham, are almost absent here. Finally, we have Johnny Depp, a casting error, turning Rachett into a kind of hateful amateur mobster.", "created_at": "2023-05-08T09:43:48.438Z"}]