[{"movie_id": 41110, "review_id": "63026dbc21118f0094548844", "rating": 1.0, "review_text": "**Despite Swinton's powerful performance, Luca Guadagnino proved it a mistake to put narrative at the service of technique.**\r\n\r\nWhat is the origin and focal point of cinematographic art? It's a question that seems rhetorical, but which, for me, is fundamental to understanding the problems of this film. Why? Because for me, the essential point of cinema, what is most important, is to tell a story. This means that aesthetics, style and art must serve the narrative, not the other way around. And what this film does is, precisely, use a narrative for an exercise in aesthetics and style.\r\n \r\nThe script had everything to work, with a dramatic story that, despite not bringing anything new (there are lots of movies about adulteries, mature women dissatisfied with their lives, rich families that work badly, etc.), at least had everything that it needed to entertain us. Basically, it's the story of a Russian woman who married an Italian textile tycoon and had three children. She is not necessarily unhappy, but lives a monotonous existence, at the whim of social and family conveniences, so she ends up finding excitement and pleasure in a torrid affair with a friend of one of her sons. And of course, when all this comes to light, the family's life is shaken.\r\n\r\nThe film has its value for the narrative and the script, even considering that there is a lot of cliché and predictable melodrama. But director Luca Guadagnino doesn't seem to give relevance to the story he wants to tell. He is not interested in entertaining us with a film that blends art and entertainment harmoniously. Guadagnino just wants to show off and show everything he has learned about cinema, all the technique, the mastery of cinematography, the use of the soundtrack, sound and image. This film is simply a vain exercise in technique and style.\r\n\r\nTilda Swinton cleverly took the opportunity to, in open collaboration with the director, build for herself a character tailored to what she needs and knows how to do. It was a work that took several years, but it leveraged the project to its happy conclusion. And we have to admit that Swinton is wonderful and gives us a deep and powerful interpretation of the main character. Unfortunately, she is the only actress who stands out in this film on a positive note. The rest of the cast, mostly Italian, is quite average, with empty and disinterested interpretations, and there are really annoying and tiresome characters.\r\n\r\nAs I said above, it is in the technical aspects that Guadagnino really bets, and tries his best to stand out, and we have to admit that he knows how to use cinematography and film work very well. The film makes good use of the filming locations used in Milan and elsewhere in Italy, and manages to convey the pleasure of eating a good meal. In fact, it even conveys the pleasure of gluttony more easily than the pleasure of sex, because all sex scenes, however intense, are manifestly artificial and exaggerated. The feeling that everything is over the top becomes even more latent due to a very slow pace, which makes us numb, and due to the intrusion of an irritating histrionic soundtrack.", "created_at": "2022-08-21T17:39:08.355Z"}]