[{"movie_id": 300671, "review_id": "576d82049251414105002546", "rating": 8.0, "review_text": "> In an unfriendly environment they got 13 long hours to survive and resist the attack.\r\n\r\nIt is an action-thriller-war version of the 'Argo'. Based on the true story where the most of the film was the 13 hour long armed battle event took place in Libya, 2012. I remember the middle-east's protest over the western films, this story is set in the same time when the islamic terrorists targeted the American diplomatic compounds in Benghazi, but six brave men stood and fought against the uprising.\r\n\r\nIt is an American patriotic film, but because of the hatred over their own countrymen Michael Bay, they're surely missing a nearly a war masterpiece. The rest of the world saw it as a fine film and appreciated that. If you haven't seen it yet, I say just don't ignore it. It was a well made realistic war film, the actors were amazing and the scenes were suspenseful to spectacular. Definitely one of the best in this theme.\r\n\r\nIt was simply focused on the armed conflict between the two forces, so it won't reasons out us how and where it all began, because that might take another film to tell the tale. That's really a very clever writing. In this 150 minute long film, the first act was full of characters and story development. Then begins the gun fight that commences from the dust hours till the dawn breaks out. With many twists in the narration during confrontation, surely not a film to be missed.\r\n\r\n8/10", "created_at": "2016-06-24T18:55:00.997Z"}, {"movie_id": 300671, "review_id": "57cbb526925141420e00102b", "rating": 4.0, "review_text": "If you fancy yourself a big swingin' dick yank, then I'd recommend you watch _13 Hours_, but of course, you already have.\r\n\r\nI can move past the xenophobia and jingoism pretty easily, even the typical Bay tropes don't ruin a movie for me, but what I find difficult to abide is boredom, and with _13 Hours_, I personally found that in spades.\r\n\r\nThough it doesn't make a whole lot of sense, though I didn't care about any of the characters, and though I am giving this film a negative review, I can still say it's Michael Bay's best work in years.\r\n\r\n_Final rating:★★ - Definitely not for me, but I sort of get the appeal._", "created_at": "2016-09-04T05:46:14.093Z"}, {"movie_id": 300671, "review_id": "640b2de43a4a1200b6eac4c7", "rating": 7.0, "review_text": "\"13 Hours: The Secret Soldiers of Benghazi\" is a 2016 war film directed by Michael Bay and based on the non-fiction book \"13 Hours\" by Mitchell Zuckoff. The film recounts the true events of the attack on the American diplomatic compound in Benghazi, Libya, on September 11, 2012. Starring John Krasinski, James Badge Dale, and Dominic Fumusa, the movie focuses on the six members of a security team who valiantly defended the compound against overwhelming odds.\r\n\r\nMichael Bay is known for his expertise in crafting intense and visually striking action sequences, and \"13 Hours\" is no exception. The firefight scenes are visceral, chaotic, and capture the intensity of the real-life events they depict. The use of practical effects and minimal CGI enhances the realism.\r\n\r\nThe film features impressive cinematography by Dion Beebe, who captures the harsh, war-torn landscape of Benghazi with gritty realism. The use of handheld cameras during action sequences adds to the immersive and chaotic feel of the combat.\r\n\r\nThe cast delivers solid performances, with John Krasinski, known for his comedic roles, convincingly portraying a seasoned and determined military contractor. James Badge Dale and Dominic Fumusa also shine in their respective roles, bringing authenticity to their characters.\r\n\r\nThe film successfully conveys a sense of camaraderie and brotherhood among the security team members. It emphasizes the dedication and sacrifices made by individuals in service to their country, fostering a strong sense of patriotism.\r\n\r\nWhile the movie focuses on the immediate events surrounding the Benghazi attack, it largely avoids delving into the broader political context that led to the situation. Some viewers may find the lack of a comprehensive geopolitical background unsatisfying.\r\n\r\nThe characters, while based on real individuals, are at times simplified and stereotyped. This can lead to a lack of emotional depth, making it challenging for the audience to connect with them on a personal level.\r\n\r\nWith a runtime of over two hours, the film may feel lengthy to some viewers. The pacing, especially in the first half, can be slow as the narrative establishes the characters and setting. This may test the patience of those expecting a faster-paced action thriller.\r\n\r\n\"13 Hours: The Secret Soldiers of Benghazi\" is a compelling and intense portrayal of a tragic real-life event. While it excels in its action sequences and captures the heroism of the individuals involved, it falls short in providing a nuanced exploration of the political complexities surrounding the Benghazi attack. The film, however, serves as a tribute to the bravery of the men who fought against overwhelming odds. Rating: 7/10\r\n\r\n\r\nWritten and Reviewed by RSOliveira", "created_at": "2023-03-10T13:17:24.138Z"}]