[{"movie_id": 287947, "review_id": "5c9cfb4792514124dc3145be", "rating": null, "review_text": "Growing up I was a regular viewer of the Shazam and Isis “Super Power Hour” on television. Back before the days of mega-budgeted Super Hero movies; we had to content ourselves with cartoons and low budget television offerings which did their best to capture the look and action of comic characters within the budget and technology limits they had to deal with.\r\nWarner Bros. has brought their latest DC hero to the big screen with “Shazam!” and it looks to launch a new franchise for the studio and build on the success of “Wonder Woman” and “Aquaman” following some earlier disappointments with their planned hero franchise films.\r\nThe film follows the story of young Billy Batson (Asher Angel), who has grown up in and fled several Foster Homes after being lost at a Carnival years earlier and unable to find his mother. Billy has never stopped trying to find her and even takes extreme measures to try to find her that has gotten him in trouble with the law.\r\nWhile trying to stick up for a family member at his latest Foster Home; Billy is forced to flee from some local goons and finds himself facing an ancient Wizard (Djimon Honsou; who tells him he will now have superior powers when he speaks his name as he is now a guardian against the forces of evil.\r\nBilly does not believe this but upon uttering the name; he transforms into a powerful hero in adult form. Zach Levi plays the title hero and soon finds himself eager to test his new powers and his Super Hero obsessed Foster Brother is more than happy to mentor him and make all sorts of viral videos of his efforts and training.\r\nTheir efforts soon draw the attention of an evil individual (Mark Strong), who covets the power Billy has for himself as along with the Seven Deadly Sins; he looks to become an unstoppable force for evil and sets out to destroy all that stands in his way.\r\nThe film is aimed more for a younger audience as much of the humor is squarely focused on Middle School level jokes. There are more than a few references to “Big” along the way which does sum up a good portion of the backstory as when he is in hero form; the young boy without a family is a popular and dynamic adult.\r\nIn many ways this was one of the more odd aspects of the film. Billy is a dour and untrusting individual most of the time; however when he is hero form he is a jovial and goofy individual who acts like a teenager. I could see an increase in confidence but it is odd considering that they are the same person.\r\nLevi is very energetic in the part and goes all in and he does a great job of conveying a kid in a man’s body. The biggest issue with the film is that there is mostly a lot of humor aimed at a much younger audience and large gaps with minimal action which made sitting through numerous childish antics a bit tedious at times.\r\nDespite this; the film was entertaining and one of the better adaptions of a comic. The door is wide open for future adventures and I look forward to seeing what they come up with next.\r\n3.5 stars out of 5", "created_at": "2019-03-28T16:50:15.688Z"}, {"movie_id": 287947, "review_id": "5ca624e20e0a2657cc9fd65b", "rating": 8.0, "review_text": "If you enjoy reading my spoiler-free reviews, please follow my blog :)\r\n\r\nFirst of all, I didn’t know anything about Shazam. What his powers were, what story did he have … Basically, I didn’t know who he was. This is what David F. Sandberg‘s movie does best: introduce the audience to a new DC superhero, by delivering an uncommonly well-structured comic-book screenplay, packed with laughter and entertaining action. Zachary Levi is undoubtedly the standout! Not only is he hilarious, but he perfectly captures the childlike personality that a kid-turned-adult would have. His expressions of absolute surprise and awe of his powers are extremely precious, and he effortlessly carries the more lighthearted tone on his shoulders.\r\n\r\nAsher Angel is brilliant as Billy Batson. His character has a notably well-written and well-explored backstory, which eventually justifies the person he has become. It’s the most emotional and heartfelt subplot of the film (probably the only one, really), and Henry Gayden did a fantastic job writing its script. It doesn’t feel cliche or over-the-top, it actually feels grounded and quite realistic. Jack Dylan Grazer plays his best friend, Freddy Freeman, and he’s the primary source of self-aware comedy. He knows all the cliches regarding superheroes and supervillains, so his jokes constantly land and play seamlessly into the last act.\r\n\r\nUsually, villains tend to be hollow characters with paper-thin motivations, but since a few years ago, this issue has gradually been corrected. The latest comic-book movies have incredibly well-developed villains, who carry a compelling backstory that entirely supports their beliefs, but not their actions. This type of villains work because not only the audience can understand where they come from, but in some cases, they can even connect with and care about them. Dr. Thaddeus Sivana is not exactly someone the audience ends up caring about, but his backstory is emotionally powerful enough for us to understand where his motivations originate from. Mark Strong delivers a menacing performance, and his costume/make-up looks pretty badass.\r\n\r\nThe first act is kind of a mixed bag. It starts in a very captivating way, and once you understand who’s the character at the center, it gets even better. However, the film’s tone takes long to establish itself, and the beginning of the movie struggles to find which jokes land and which don’t. The humor is on-point throughout the rest of the runtime, but those first few jokes not so much, which threw me off a little bit. The action sequences are amazing, and the sound design allows the audience to feel every punch, kick, a fall on the ground or a Superman-ish take-off. The fight sequences are seamlessly edited, and you know how much I love well-choreographed or well-edited action scenes.\r\n\r\nShazam‘s search for his powers provides the funniest and most entertaining moments of the film. Each test that he puts himself through is both hilarious and informative. This is another aspect of the screenplay I love so much: they had several ideas of how to approach this segment, and they nailed every single execution. From the pop-culture references to the hero-villain cliches, Sandberg did a terrific job exploring those concepts, and he executed them flawlessly. The best jokes are the ones that can be funny on different levels for different people. If people can laugh at a particular scene solely due to it, but other people can laugh even more because that moment means so much more to them, that’s when you know a joke is perfect. Shazam is not only funny for comic-book fans, everyone can leave the theater entertained and jolly.\r\n\r\nIt’s still a straightforward superhero movie. There’s still a villain to defeat, and the film goes through all of the cliches that it makes so much fun of. Everyone knows how it’s going to develop, plot point by plot point, a few minutes in. Not that I consider this a flaw, it’s just … It is what it is. The final battle drags too much, and it keeps ending and restarting every five minutes. It does have a pretty cool conclusion, but it takes a bit too long to get there. Also, and I know that this is one of those logical nitpicks that CinemaSins are known for digging, but the flashbacks and time-jumps could have received better treatment concerning the age of the characters. One thing is to think that the characters would look much older/younger than what they display on-screen, but when they make them look exactly the same in the span of 30/40 years … Not so acceptable.\r\n\r\nAll in all, Shazam is a blast! It’s the most entertaining movie I’ve seen so far this year, and it’s freaking hilarious. It continues the comic-book films trend to change how villains are written, by delivering a well-developed bad guy, menacingly portrayed by Mark Strong. Every member of the cast gives a strong performance, but Zachary Levi steals the show. His whimsical attitude, reckless personality, and rich facial expressions are guaranteed to entertain you for most of the runtime. Asher Angel and Jack Dylan Grazer are outstanding as the young kids, and the former’s backstory carries emotional impact which passes on to the big guy he transforms himself into.\r\n\r\nThe action is packed with beautifully-edited sequences, powerful sound design, and cool, unique moments, but the supposedly climactic final battle drags too much. The first act struggles to find its rhythm and its tone, but once it gets going, it’s an exceptional journey. The best praise I can give Sandberg‘s movie is that I didn’t know anything about Shazam before entering the theater, and now I can’t wait for its sequel. Well-directed, well-written and remarkably entertaining. What more can I ask? Go see it!\r\n\r\nRating: B+", "created_at": "2019-04-04T15:38:10.842Z"}, {"movie_id": 287947, "review_id": "5ca978bbc3a3683f4c608458", "rating": 7.0, "review_text": "It's entertaining, it has heart, and it's joyful. It has been proven time and time again that these things are what is required for a good Superhero film.", "created_at": "2019-04-07T04:12:43.931Z"}, {"movie_id": 287947, "review_id": "5ce9c4f20e0a261bcfcb7b82", "rating": 3.0, "review_text": "After the spiderman movies, this has to be the most annoying superhero movie I've seen to date. It took nearly an hour for the movie to actually get interesting and during that whole time one is treated to 2 super annoying teenagers.\r\n\r\nHonestly, I'm glad I didn't go to the cinema for this otherwise I'd constantly be reaching for remote to press the fast forward button. About the only redeeming quality of this film was the picture and acceptable acting from everybody involved. Pity everything else was bad.\r\n\r\nThere's no way I'd willingy watch this again. No way.", "created_at": "2019-05-25T22:42:58.963Z"}, {"movie_id": 287947, "review_id": "5d150db2bbd0b01bd8c0c4e4", "rating": 6.0, "review_text": "Definitely has its moments, bit in total the movie feels inconsistent which kills most of the buzz. It switches from rather serious scenes where people actually get hurt to PG-6 compatible simple humor back and forth a few times.\r\nWith ever transformation the whole character changes, Shazam acting more like a 5 Year old than the 15 Year old Teenager he's supposed to be.\r\nFreddy sometimes acts downright malicious, which is not a problem per se except that everyone else doesn't really seem to be bothered much by it.\r\n\r\nStill not a bad take on the comic, but it feels inconsistent and left me wondering what age the target audience is supposed to be ...", "created_at": "2019-06-27T18:40:50.915Z"}, {"movie_id": 287947, "review_id": "5d3711e8ab684974f5858039", "rating": 6.0, "review_text": "The titular Shazam and has alter-ego Billy Batson feel like completely different characters. This is not unheard of for a superhero by any stretch, but when accompanied by a change of actor, it's a pretty jarring situation. I also have a hard time figuring out who the target demographic is with this thing. Seems all over the place.\r\n\r\nBut! at the end of the day, the most important question is \"Did I enjoy _Shazam!_?\" and to that the answer is still somehow yes. Probably the best that the DCIThoughSheWasWithUniverse has to offer (with the glaring exception of _Wonder Woman_).\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-07-23T13:55:52.290Z"}, {"movie_id": 287947, "review_id": "5d45b22aa0be280014a2fa25", "rating": 6.0, "review_text": "Zachary Levi is a hoot in this super-hero comedy reminiscent of the now classic Big with Tom Hanks. We get a solid first half, even two thirds, but why oh why do these movies almost always seem to revert to formula in the 3rd act? Been there, done that...", "created_at": "2019-08-03T16:11:22.980Z"}, {"movie_id": 287947, "review_id": "5d67018212c60400136f2e88", "rating": 7.0, "review_text": "Second viewing and my feelings pretty much remain the same. Fun moments and Zachary Levi was very good in the leading role and although not terribly memorable, Mark Strong made for a fine villain, that said, some of the humor wasn't for me, although I did enjoy some of director David F. Sandberg's more horror-centric style shined through with the Seven Deadly Sins.", "created_at": "2019-08-28T22:34:42.029Z"}, {"movie_id": 287947, "review_id": "62bdf9660cd32a0051046ed5", "rating": 8.0, "review_text": "Shazam! is a heartwarming funny origin story for kid struggling with family, friends, and his new gifted superpowers. I had a lot of fun with this film, whether it was kids buying beer with their new appearance, the crazy fun training montage, or the humor that surprisingly hit more often than not. Zachary Levi and Jack Grazer had really awesome chemistry, and I loved every minute they were on screen together. Although the same cannot be said for Asher Anger, not that his scenes were bad they just didn't do much for me and felt flat. I felt that they lingered on for too long and I just wanted Shazam back which led to some pacing issues. The villain was nothing to write home about either. He had a very generic motivation and suffered from the classic villain trope of bad guy with the same powers as the heroes. Overall, the negatives were nothing that distracted from the fun you can have with this film.\r\n\r\n**Verdict:** _Great_", "created_at": "2022-06-30T19:28:38.640Z"}, {"movie_id": 287947, "review_id": "63bf767edf857c008140d23a", "rating": 10.0, "review_text": "Well, this is diversity done right. I want to get that out of the way, probably the most diverse cast in any super hero movie to date and... no one complained. No one really even noticed. But that's because, unlike a lot of diversity driven movies, the creators didn't get on a soapbox and shout \"like it or else! If you criticize any part of it your a (insert popular woke accusation)!\"\r\n\r\nThe result was that they made a hysterical and totally entertaining movie lots of people loved. The plot was fun and entertaining, the characters were fun and entertaining, they were deep, they had struggles, they overcame the struggles, and they developed over the course of the film.\r\n\r\nIn other words, they told an actual story and they did it with grace.\r\n\r\nIt is a fun adventure film. It's funny and dramatic. The cast is brilliant. The story actually, well, it actually tells a story that relies on more than special effects.\r\n\r\nThe only real issue is that it was released at the wrong time.", "created_at": "2023-01-12T02:54:54.475Z"}]