[{"movie_id": 864168, "review_id": "64a9f276d1a89300adbee69c", "rating": 8.0, "review_text": "Bawdy, raunchy humor generally isn’t my style, but, when it’s done with wit, creativity and no-holds-barred originality, it gets my attention quickly, which this filmmaking debut from writer- director Adele Lim captures from the very first line of the picture (and never lets go thereafter). This rapid-fire screwball comedy follows the exploits of four young Asian women (Ashley Park, Sherry Cola, Sabrina Wu, Stephanie Hsu) on an outlandish road trip through China that steadily deteriorates but routinely places them in a host of raucously hilarious, debauchery-riddled situations. In doing so, the film steadily serves up huge laughs in a story that’s accurately being billed as a release unlike anything that moviegoers have seen before. While it’s true that the narrative stretches credibility a bit at times and the film has its share of predictable and sweet but sappy moments, those minor faults are vastly overshadowed by its many strengths, including its fine ensemble cast, balanced pacing, and vibrant, colorful, superbly crafted production design. Because of the nature of the humor, however, sensitive viewers may want to skip this one (though it’s truly hard not to laugh, no matter how conservative one’s views might be). “Joy Ride” may not have received much fanfare or pre-release publicity, but it’s one of the funniest comedies to come along in quite some time, and it’s handily one of the best offerings of what has thus far been an otherwise-stunningly disappointing summer movie season. Indeed, get ready to seriously laugh your ass off with this one.", "created_at": "2023-07-08T23:34:14.346Z"}, {"movie_id": 864168, "review_id": "64ba487c11386c00caf81cf3", "rating": 7.0, "review_text": "When I saw the trails for this, I was not very enthusiastic. Now I am glad to say that this is more of a failing of the teaser makers than of the film itself, which is actually at the better end of the genre. It all centres around the high-flying \"Audrey\" (Ashley Park) who is on for a partnership at her firm if she can travel to China to seal a lucrative deal. Rather stupidly, she agrees to take her rather unpredictable pal \"Lolo\" (Sherry Cola) and, well you can just guess how messy it all gets. For the most part this is quite a pithy and earthily written, end-to-end, comedy drama with some engaging performances from these two as well as from Stephanie Hsu's \"Kat\" - a soap star with a few secrets to keep - and the occasionally scene-stealing \"Dead Eye\" (Sabrina Wu) who has many of the best lines as the story unfolds and the adopted \"Audrey\" seeks out her birth mother. It's the latter stages of the film that rather let this down. It can't resist a wallow in cheesy sentiment and the pace drops off a cliff for the last twenty minutes which is a shame. Still, it's a genuinely entertaining film that puts four quite plausible friends through drinking games, plenty of adult fun and games - with an entire basketball team; and makes some decent attempts at characterisation. I really quite enjoyed it.", "created_at": "2023-07-21T08:57:32.062Z"}, {"movie_id": 864168, "review_id": "64cca43ee04d8a3aaa07930a", "rating": 5.0, "review_text": "A sweet story about family, friends, and learning to love the person you are is wrapped up with a big, vivacious, raunchy bow in director Adele Lim‘s “Joy Ride,” a raucous comedy that celebrates women embracing their inner naughtiness. This diverse, explicit, sex-positive movie is going to make a lot of people (especially misogynistic-leaning men), very, very uncomfortable, and audiences should be there for every delicious second of it. Perhaps a better title for the film would’ve been “Crazy Horny Asians.”\r\n\r\nA once-in-a-lifetime international adventure is at hand for four Asian-American friends when they find themselves traveling across China in search of one of their birth mothers. There’s the straight-laced Audrey (Ashley Park), a career-minded legal associate on an important business trip who has stretched the truth to her boss that she is fluent in Mandarin. Needing a translator, she enlists the aid of her foul-mouthed, free spirited, irreverent bestie, Lolo (Sherry Cola), to tag along. They’ve always been an odd couple since they first met on the playground as kids, and their friendship is as strong as ever.\r\n\r\nThe group grows even larger when Lolo decides to pay a visit to her former college roommate turned popular Chinese soap star Kat (Stephanie Hsu) as well as her eccentric cousin, Deadeye (Sabrina Wu). These women couldn’t be more different, but their epic adventure becomes a bonding journey like no other.\r\n\r\nThe cast is terrific and they work well together. Each woman brings something unique to the table, and they are a delight to spend time with. Each character has something viewers can identify with, no matter how outlandish the situations get. The screenplay was written by three women (Cherry Chevapravatdumrong, Teresa Hsiao, and Lim), and their knack for finding the perfect balance between humor and sincerity sets the tone for the entire film. This is a female-forward project both in front of and behind the camera.\r\n\r\nThe film depicts diverse representation in a natural but refreshing and modern way. It’s not often you get to see women having fun, being bawdy, and participating in (and most of the time, instigating) all forms of debauchery. These friends are sex-obsessed and body-positive, and they aren’t held back by shame or societal standards. This translates to a film that contains explicit sexual content and language, so prudes should steer clear.\r\n\r\nWhile the comedy is mostly hit or miss, the core of the story feels highly personal and heartfelt. There’s an unexpected warmth that’s buried beneath all the saucy bits, but it’s so strong that it emerges as the real star of the narrative. There are several touching moments and discussions about identity and culture, and the message about friendship and family feels universal.\r\n\r\n“Joy Ride” doesn’t invent the classic road trip movie, but it does showcase a contemporary and progressive spin that should be welcomed by moviegoers.", "created_at": "2023-08-04T07:09:50.781Z"}]