[{"movie_id": 290595, "review_id": "57ed838fc3a3686cfa0002a3", "rating": 6.0, "review_text": "**The Huntsman and his romance caught between the two evil sisters.**\r\n\r\nThis is a sequel as well as a prequel to the 2012 film 'Snow White and Huntsman'. It opened with the earlier story where and how the Huntsman grew up, especially the journey of his innocent childhood to a great fighter that covers in the first half an hour. And then it skips for about 7 years where the original film takes place, but immediately begins where it had ended in the first half, as well as the first film. Actually, not a bad film as I have heard of it, but same as the previous film that stands just above the average and slightly loses some decibel rating.\r\n\r\nThe actors were good though. Emily Blunt, Jessica Chastain and Charlize Theron, wow, super hot women, but sadly they are in fairytale costume. Their performances were great, but the characters, particularly the two sisters resemble the 'Frozen's Anna and Elsa. You can feel how desperate was the filmmakers to avoid such comparisons by viewers, so they developed the story very far from any string attached to that famous animation. In the end these things are unavoidable, since the story is not fresh enough to claim its independent status.\r\n\r\nChris Hemsworth was okay, I hope he won't return for the third film. It is a decent watch, and I think it will remain as an duology, for right now it seems a good idea. The problem is it was being made a dark-fantasy to appeal the grown ups, particularly men. But it should have been a children's film where adults too can enjoy like the Disney's 'Maleficent'. Except the opening the rest of the story seemed very ordinary. Though the action sequences were enjoyable and so the film with a low expectation, or the purpose of the watch is the timepass.\r\n\r\n_6/10_", "created_at": "2016-09-29T21:11:43.197Z"}, {"movie_id": 290595, "review_id": "58b830b5925141272a009d77", "rating": 8.0, "review_text": "This is kind of a prequel and a sequel to Snow White and The Huntsman. It is not as impressive as the first movie but quite good anyway. I would call it a nice family movie although probably not for the youngest members of the family.\r\n\r\nThe story is partly before and partly after the events in Snow White and The Huntsman. It is a good adventure with plenty of magic and special effects and a fair bit of action. It is a fairly straightforward story without much in terms of surprises.\r\n\r\nThere is a bit of comical relief in particular by the dwarfs, especially when the two dwarfs following the huntsman encounters the grumpy female one and her friend.\r\n\r\nApart from the classical Snow White setting, quite good special effects and quite decent action this is a fairly normal fantasy adventure movie. It is about two hours of good fun but does not really reach wow-status.", "created_at": "2017-03-02T14:48:21.982Z"}]