[{"movie_id": 245891, "review_id": "558ba0dcc3a3687e68002721", "rating": 9.0, "review_text": "This is very much my kind of movie. Straightforward, lots of good action, our hero never waivers from his path and no social or emotional nonsense. Those who have watched the movie might wonder why I claim that there is not emotional nonsense since the entire plot is driven by John Wick’s very emotional response to his wife’s death and the subsequent killing of the dog that he received as a last present from her. What I mean with “no emotional nonsense” is that John Wick is never second guessing himself, the movie never really tries to portray him as an “ordinary” guy having second thoughts about killing the bad guys and he doesn’t go into some silly “oh should I really pull the trigger” trance and drops the gun in the worst possible moments as is done in a lot of movies. Sure, there are emotions in this movie. Rage and thirst for revenge in particular with the addition of a healthy dose of fear from the bad guys…eventually that is.\r\n\r\nThe plot of the movie is, as I wrote, quite straightforward and classical. Retired hit man gets wronged by idiot son of big bad guy. Hit man gets pissed off and goes on a quest for revenge. People die (a lot of them). Hit man and big bad guy have a show down at the end. In terms of story that is about it. However, such a story can be told and presented in a good and entertaining way and in a less good and entertaining way. As far as I am concerned the way the story is told in this movie is very, very entertaining.\r\n\r\nKeanu Reeves is quite good as the hit man. So are the big bad guy and most of the other actors of any importance. During the course of the movie we get more than a few glimpses into John Wick’s former life and it is a quite cool background that have been elaborated. The secret world that John Wick was once part of and how it works and operates would be worthy a good old-fashioned James Bond movie.\r\n\r\nThen of course there is the action. It is an action movie so you do expect quite some expenditure on the action and this movie do not disappoint. There are lots of action and it is good action. Sure, the ease by which John Wick picks off his opponents waiving his gun(s) in all direction without hardly looking is sometimes a bit over the top but it is still done with a fluidness and grace that just makes it … so cool. The gun fights are generally mixed up with some equally good martial arts close combat stuff and it is really well woven together.\r\n\r\nOne thing that I really like with this movie is that John Wick is the cool, cold, determined, not to be pissed off, killing machine from start to finish. There are really no slow parts or “obligatory” scenes of doubt and self-recrimination. It is “the bad guys will pay” all the way. This of course gives the opportunity to include some other elements that I quite like in a story like this. For instance the parts where the spoiled total idiot son of the big bad guy slowly gets his arrogance replaced by some good, honest to God, fear. Fear of death and fear of the guy he so carelessly pissed off.\r\n\r\nNeedless to say, I enjoyed this movie a lot when I sat down to watch it with my oldest son yesterday.", "created_at": "2015-06-25T06:34:04.317Z"}, {"movie_id": 245891, "review_id": "55c8b6c4c3a3686a820008c9", "rating": 6.0, "review_text": "I don't get why this movie has such good reviews. It simple and quite uninteresting. Lots of actions and well known faces (many from TV series), but nothing else. The same old brainless plot to justify tons of bullets.", "created_at": "2015-08-10T14:35:48.329Z"}, {"movie_id": 245891, "review_id": "570421099251415bbb000866", "rating": 7.0, "review_text": "Woof!\r\n\r\nKeanu Reeves is the John Wick of the title, a grieving one man army who gets tipped over the edge when gangsters kill his dog. Carnage ensues.\r\n\r\nThe paying public do like a good revenge flick, there have been plenty this last couple of decades, and they do go down well. Once the set-up has been staged - Wick grieves at the loss of his loved one - gets some small joy via a pet - only to have that snatched away from him, then the film becomes a joyously unstoppable actioner.\r\n\r\nWick, in good hands with a moody and beefy Reeves (face fuzz strange, though) strong in presence, cuts a swathe through the gangland eastern blockers. And that's pretty much it! Characterisations are thin on the ground, it's a bit nutty and of course preposterous, but boy is it fun. There you go, a box office winning actioner without pretensions. Enjoy. 7/10", "created_at": "2016-04-05T20:33:13.951Z"}, {"movie_id": 245891, "review_id": "58b11e62c3a368075a00616a", "rating": null, "review_text": "~NO SPOILERS~\r\n\r\nJohn Wick is an excellent revenge action movie that raises the bar with its excellent lighting, cinematography, and martial arts displays from Keanu.\r\n\r\nMr Wick spends the rest of the film getting even with a mob boss for the actions of his son who killed his dog and stole his car.   As far as the plot goes, its pretty simple but there is a lot of depth to the world.\r\n\r\nReeves displays a decent amount of acting range here, but his real talent is bringing bad guys down one headshot at a time. Its glorious to see him smack a guy over the head, hold him down while reloading, and then take him out.\r\n\r\nThe best thing about this film is the lack of shaky cam-- you can see all the action happening clearly. This is made possible by the dedication of the actors in their martial arts training.\r\n\r\nSupport films like this, they are a rare breed these days!", "created_at": "2017-02-25T06:04:18.793Z"}, {"movie_id": 245891, "review_id": "590b27ecc3a36843a1016ec9", "rating": 8.0, "review_text": "**Pure unadulterated action**\r\n\r\nJohn Wick - it's that kind of a character whose name is enough to inflict terror in the minds of people. And whoever isn't terrified doesn't mean that they're better, it just means that they don't know JOHN WICK.\r\n\r\nIt definitely isn't the first character of it's kind, but very few characters of this kind convince you that they are what they are supposed to be. Let's just say that John Wick kicks a** and he is pretty awesome at that.\r\n\r\nI can't think of anyone else to be John Wick other than Keanu Reeves, the guy's living the character on screen. The hand to hand combat, usage of knives and guns, the action, it all seems poetic at times. The thing I loved the most is that there wasn't too much noise, no Boom Boom, just the Bang Bang, exactly what you'd expect from a hit-man.\r\n\r\nThe cinematography, dialogues, background score, direction, action, everything was just what a movie like this needs. It ticked all the right boxes for me and I think every action movie fan would lap this one up.\r\n\r\nIt is a great action revenge movie that never runs out of steam throughout it's course. So, everyone who loves to see bullets flying all over the screen, or to quote it better, say hitting just the right spots, go treat yourself to this movie. You'd be glad.\r\n\r\nAn 8 out of 10", "created_at": "2017-05-04T13:09:00.246Z"}, {"movie_id": 245891, "review_id": "5d86ad6f172d7f000d47943a", "rating": 7.0, "review_text": "It's cheesy, formulaic, and hammily acted. It's also stylish, high energy, and generally just a fun popcorn movie.\r\n\r\n\"John Wick\" is a retired hitman who gets brought back into the life by a personal attack (no spoilers here, but if you're squeamish about animal cruelty, be warned). Okay, we've heard this story dozens of times.\r\n\r\nWhat's different is the world in which this takes place. There's a secret criminal underground that seems to have their hands in everything, and there's a specific code and honor among thieves. Actually, come to think of it, we never really meet anyone who isn't involved or in the know somehow, so it's implied that this society is very widespread and possibly runs everything. This film actually seems to have more in common with the \"Wanted\" comic book than the \"Wanted\" movie did.\r\n\r\nPart of the style and identification with the near superhuman Keanu Reeves as Wick is that he isn't a perfect action hero. He gets hurt. A lot. Unlike Neo, he's not invincible. He's simply very well trained and determined, which makes the combat sequences more interesting because, even though you know the outcome, there's always this little part in the back of your mind that wonders if he'll come out in one piece, making them gritty and...semi-realistic. Let's be honest, a lot of the action moves are very theatrical and wouldn't have much practical value in the real world.\r\n\r\nGiven the implications for how big this criminal underworld probably is, it seems to have been set up to be a franchise from the start. From background characters like Ian McShane's Winston (who keeps referring to Wick as \"Jonathan\" even though the name is John; different spelling means it isn't a shortened version of his name) to Lance Reddick's hotel manager (who I would swear there is more going on with this character and hopefully gets explored later), there's a lot of ground to explore. It's not a smart or challenging film, but it is fun and not a bad way to spend a couple hours if you like action movies.", "created_at": "2019-09-21T23:08:31.893Z"}, {"movie_id": 245891, "review_id": "63002af8dfe31d007b8205a1", "rating": 10.0, "review_text": "**The mastery of stunt choreography and world-building make John Wick the new standard of action films.**\r\n\r\nJohn Wick is a master class on taking every movie trope and delivering an incredibly fresh and innovative franchise that delights avid action fans and casual observers alike. Chad Stahelski and team break free from the now overused shaky cam to hide mediocre acting and push their stars and stunt team to give us some of the best action sequences in film since The Matrix. But to take this movie even further into brilliance, Stahelski prefers to show and not tell the audience about the world in which John Wick lives. As a result, everything is mysterious, leaving viewers intrigued, questioning, and wholly immersed in this assassin-filled world. The unusual gold coin currency, the legend and fear of John Wick, the enigmatic Continental hotel that forbids any assassin \"work\" on the premises, and much more sweeten a typical action revenge story into a cinematic treasure.", "created_at": "2022-08-20T00:29:44.713Z"}, {"movie_id": 245891, "review_id": "63b44f00c56d2d0096d57e25", "rating": null, "review_text": "Keanu Reeve’s very best since the Matrix!!!", "created_at": "2023-01-03T15:51:28.648Z"}, {"movie_id": 245891, "review_id": "63be11605be00e00e7a2839f", "rating": 10.0, "review_text": "My wife made me watch the John Wick series when #3 came out... and I started with #3. She was pretty sure that I needed to watch the first two to understand what it was about... I was pretty sure that I didn't.\r\n\r\nTurns out I was right. You don't need to watch 1 and 2 to understand everything that is going on in 3. You don't have to watch 1 to understand 2.\r\n\r\nYou can really jump in anywhere you want, and be up to speed withing a few seconds. The plot is really that paper thin.\r\n\r\nYou've seen movies with plots like this before. The tough guy that is the best at what he does goes out for revenge. It could be the plot from Taken... from any movie really.\r\n\r\nThe plot doesn't matter.\r\n\r\nWhat matters is stylized nonstop action. The action is hard, fast, and it looks really, REALLY cool.\r\n\r\nThe story is absolutely nothing to write home about, but it's not important to the movie anyway. That's not where the fun is. Everything is paper thin, everyone knows it is paper thin....\r\n\r\n... because we all realize that this is a start-to-finish action extravaganza and things like plots and stories in movies like this only really get in the way. Too deep and the movie starts to stink.\r\n\r\nSo, what you have is really fun, really exciting, really cool looking action... and it's entertaining. It's OK to admit that it's low on plot, because.... it is what it is, and what it is is super fun and super entertaining.", "created_at": "2023-01-11T01:31:12.122Z"}, {"movie_id": 245891, "review_id": "63daad2585702e05753c7ba3", "rating": 8.0, "review_text": "John Wick is the definition of a blockbuster action film, with big set pieces and visceral stunt work that will leave audiences gasping. While the story and performances are lacking, the creators make attempts at establishing a greater world around the characters. There are some really creative services and lore that go into the assassin underworld that is simply brilliant. The acting all around is quite lackluster. I love Keanu Reeves as a man, but he cannot deliver dialogue well. I know he is supposed to be very emotionless, but there is just a robotic nature to his line delivery that is quite awkward. His performance does not take a ton away from the movie but could have elevated it if he were a bit better. The main conflict of the story is a bit cheesy and did not totally work for me, but at the end of the day, it is just a vehicle for the action and does enough to propel the story forward. The main focus of these films is the brutality of the choreography. John Wick stacks up a large body count with ease executing opposing assassins with a plethora of weapons and tactics. There are some creative kills in the movie, but most are just headshots delivered by a pistol. I would have loved to see a little bit more variety, but it was so in-your-face and absurd that I still had a great time with it.\r\n\r\nScore: 79%\r\nVerdict: Great", "created_at": "2023-02-01T18:19:17.566Z"}, {"movie_id": 245891, "review_id": "63efc09535818f0085ea0fa3", "rating": 8.0, "review_text": "Pure entertainment, this.\r\n\r\nHappy to have finally got around to watching this franchise! I expected sheer enjoyment and that's what I got. <em>'John Wick'</em> is good fun! It is more hammy than I thought it would be, not that that's a criticism. Some characters duck out surprisingly abruptly too (justice for Clarke Peters!), even when the one who should get taken out immediately somehow manages to stick around for a while.\r\n\r\nKeanu Reeves is always a pleasure to watch act. His character is a badass, that's for sure. If I'm being truthful, none of the others stood out to me too much - not in a negative way, just moreso they are all on the same level as each other behind Reeves. Willem Dafoe is the best of the rest, though.\r\n\r\nI look forward to checking out the sequels, which I'm expecting positive things from - especially with, presumably, bigger budgets.", "created_at": "2023-02-17T17:59:49.161Z"}, {"movie_id": 245891, "review_id": "645a95ae6aa8e000ff5be484", "rating": 10.0, "review_text": "Simply a cool character doing a lot of very bad things for all the right reasons. Immensely slick and incredibly fluid action in this movie. But the subtleties and nuances of world details are what make this story so addictive. Even after more than a hundred watches I still have to skip that puppy scene.", "created_at": "2023-05-09T18:49:18.906Z"}, {"movie_id": 245891, "review_id": "64a6c17a07faa2011e0331c3", "rating": 8.0, "review_text": "Reeves is such a great actor. Another action packed filled movie. He nuts on everyone all because they killed his dog.", "created_at": "2023-07-06T13:28:26.073Z"}]