[{"movie_id": 423899, "review_id": "5e87390daf58cb0015e304fa", "rating": 7.0, "review_text": "I wouldn't say this is a memorable historical film, but it was interesting and entertaining enough to hold my attention. I researched the background a little bit, and I am not sure why they made some of their changes to how the unlikely friendship actually transpired. I assume it was to simplify the story. \r\n\r\nAnd as it happens, It is surprising that the story has gotten told at all. Apparently extreme measures undertaken by the royals after to obliterate any record of the unlikely friendship after Queen Victoria's death. anyone who has read about the history of British monarchs will recognize this attempt to control the narrative of the royals as they guard the parameters of the succession.\r\n\r\nBut it is worth a watch regardless about exactly how accurate the details are. History is written by the ones in control, and this is a cool exception.", "created_at": "2020-04-03T13:24:29.489Z"}, {"movie_id": 423899, "review_id": "62c637108ec4ab01ab3cdf9f", "rating": 9.0, "review_text": "**A good movie, on almost every level.**\r\n\r\nI really like films with a historical background or those linked to the monarchy, which has a lot to do with my personal life, my birth family and also with my work as historian. I was very curious about this movie, and today I finally got to see it. And I can say that it was really good. I can't say that everything is fine, there are several scenes and moments that seem too imaginative to have actually happened, but the overall picture is quite positive.\r\n\r\nThe relationship between the mighty Queen Victoria and this personal servant of hers was surely the subject of harsh criticism and enormous misunderstanding. The British court was then, like most of Europe, deeply prejudiced, racist and Eurocentric. There was really a belief that Europe was civilization and that the colonizing and imperialist efforts of the European powers would take some of that civilization to a barbaric world, with strange customs, lacking in Christian religion, education, manners, modern infrastructures that only white Europeans could manage. This was the British stance in India, and elsewhere in its empire. For us this may be shocking, and we have seen a wave of destruction of statues and monuments linked to the European colonial past because of this general feeling of shock and repudiation… but history will not disappear just because we sweep it under the rug. It is with the teachings of history, inside and outside the classroom, that we learn, and erasing the visible traces of a past that offends us (or that offends other peoples) is useless. I think we shouldn't be ashamed of having been empires, and of having been present in other countries, or having dominated other peoples. For better or worse, this marked both sides (dominators and dominated), and the cultural exchanges that took place helped shape the countries and peoples we know today. I think it is much more productive to learn from all this: to learn not to make the same mistakes, and on the other hand, to make the best use of the bridges and links that this common past has established between different nations from several parts of the world. Sorry for the rant, but I think it comes in handy.\r\n\r\nAs the respectable reader has already noticed, the film explores the relationship between two very different people: the queen of the greatest empire of her time and a humble clerk who happened to serve her, becoming one of her favorites and shocking the racist and futile court. Much of what we know of this connection has been lost because the letters and documents were overwhelmingly burned after Victoria's death, but I think the film really captured the essence of what happened there. Judi Dench is a great actress, who curiously has already given life to Victoria in an older film, and is perfectly suited for the role and manages to establish a very positive chemistry with Ali Fazal, who is charismatic, friendly and captures our interest and our affinity. There are several characters in the film that seem sketchy and uninteresting, and most royal court figures fall into this group. I liked, however, the performance of Michael Gambon, Tim Piggot Smith and Eddie Izzard. The end of the film is particularly touching.\r\n\r\nOn a technical level, I have to highlight the judicious and intelligent choice of filming locations, in particular Osborne House, a former royal residence closely linked to the monarch. The film uses that footage well, captures color and light very well, and builds an elegant, warm cinematography that's pleasing to the eye and very engaging. Being a period film, an extra effort was put into the sets and costumes, and I can say that I haven't noticed any major errors or problems here. The biggest criticism I can make is the difficulty I felt in understanding the passage of time: it would be difficult, for someone who didn't know the story well, to say if the action of the film takes place in the course of just a few days or the course of several years. Also, the score by Thomas Newman, written for the film, turned out to be excellent.", "created_at": "2022-07-07T01:29:52.805Z"}]