[{"movie_id": 559, "review_id": "5c8428b3c3a3684e8cdad205", "rating": 3.0, "review_text": "After the success of the first two Spider-Man films, Spider-Man 3 represents Sam Raimi's inability to overcome the biggest hurdle of a third movie, a hurdle that Alien 3, The Godfather Part 3, RoboCop 3, and the list goes on could not: studio interference.\r\n\r\nAlthough I wish that would be the only thing wrong with Spider-Man 3. But almost every storytelling decision - from the creation of Sandman to Peter instantly falling in love with his new costume to that thing that was never actually called Venom - is just plain stupid. Right from the get go you hate Peter Parker.\r\n\r\nStudio interference did not mandate the jazz bar dance scene. It did not have the Green Goblin 2 storyline make absolutely no sense whatsoever. It did not create that stupid love triangle between Gwen and Mary Jane, betraying everything Peter Parker is supposed to be about.\r\n\r\nThese were fundamental issues in the script and direction the film took. These were issues that doomed the film for failure. That's why this movie sucks, not just because they butchered Venom.", "created_at": "2019-03-09T20:57:23.625Z"}, {"movie_id": 559, "review_id": "5dc330999d893900183427d9", "rating": null, "review_text": "This movie is about Spidey's revenge and  transformation to bad Spidey. It has a dark feel to it that I found one of the most appealing factors to this movie. Because we've all gotten used to Peter Parker being \"your friendly neighborhood Spider-Man,” having him turn to the dark side for some time and watch him get out of it was a whole new experience.", "created_at": "2019-11-06T20:44:09.258Z"}, {"movie_id": 559, "review_id": "5dc38a807d2bc100133d082d", "rating": null, "review_text": "Tobey Maguire makes such a great Spider-Man, hands down. We've seen him at his best, but in this movie,  we saw him at his worst, and although I must say I wasn't that big of a fan of how cheesy he looked with that emo cut, it was still enjoyable for me watching him beat the \"venom\" out of him.", "created_at": "2019-11-07T03:07:44.477Z"}, {"movie_id": 559, "review_id": "5dc393c1470ead00138cec4d", "rating": null, "review_text": "So much emotion in this movie! What a way to end a trilogy!", "created_at": "2019-11-07T03:47:13.874Z"}, {"movie_id": 559, "review_id": "5dc399ad9d89390015350f29", "rating": null, "review_text": "The third and final film to one of the few trilogies we have that are actually good. Tobey surely gave a whole new meaning to Spider-Man and set the bar high for the other Spider-Man movies that came out.", "created_at": "2019-11-07T04:12:29.389Z"}, {"movie_id": 559, "review_id": "5dc56f70ab1bc70015ff0aac", "rating": null, "review_text": "I know this is supposed to have a darker tone than the normal Spider-Man movies we see, but I found it more comedic to see Peter take on an entirely new character. Loved it though!", "created_at": "2019-11-08T13:36:48.726Z"}, {"movie_id": 559, "review_id": "5dc57a5b7d2bc100134084c4", "rating": null, "review_text": "My wife isn't that big of a superhero fanatic but after watching this whole trilogy with me, I can say that she's still not a superhero fan! Still, I know she was able to enjoy the movie and how the creators told the story.", "created_at": "2019-11-08T14:23:23.860Z"}, {"movie_id": 559, "review_id": "5e00ef3475110d0018d86c28", "rating": null, "review_text": "It still puzzles me to this day why this felt like two movies crammed into one.", "created_at": "2019-12-23T16:45:40.062Z"}, {"movie_id": 559, "review_id": "5e0102c80284200019af5240", "rating": null, "review_text": "Now that I think about it, this film just had too much going on. Compared to the first two which were both hyper-focused on just one storyline, Spider Man 3 lacked that distinct characteristic which I know most of us will agree on.", "created_at": "2019-12-23T18:09:12.758Z"}, {"movie_id": 559, "review_id": "5e011b99d236e60010921cfe", "rating": null, "review_text": "Out of all the Tobey Maguire Spider Man films, this one had the best effects. But with that, the overall quality of the movie in terms of the plot greatly decreased. I wish they would've stuck with the same strategies they had for the first two films.", "created_at": "2019-12-23T19:55:05.333Z"}, {"movie_id": 559, "review_id": "5e02869cd1a89300128f67ca", "rating": null, "review_text": "I was satisfied, but that already was a disappointment. Spider Man 2 was a great sequel and I had high hopes that they would outdo themselves again this time, but sad to say third time's not gonna be the charm for Spider Man.", "created_at": "2019-12-24T21:43:56.529Z"}, {"movie_id": 559, "review_id": "5e0906924c1d9a0013e5c776", "rating": null, "review_text": "Although I'd say that Sandman's acting was pretty on point, I still feel like he could've been cut out from the movie and it still would've made sense.", "created_at": "2019-12-29T20:03:30.511Z"}, {"movie_id": 559, "review_id": "5e09243f26dac1001776f6ca", "rating": null, "review_text": "Spider Man 3 is still pretty good but when you compare it with its other two predecessors, you can see that there is a huge step down in the overall quality of the film.", "created_at": "2019-12-29T22:10:07.694Z"}, {"movie_id": 559, "review_id": "5e09c56500508a0012969b61", "rating": null, "review_text": "Man I wish they didn't have to kill off Harry so quickly after he had just reconciled with Peter. That scene broke me so much.", "created_at": "2019-12-30T09:37:41.896Z"}, {"movie_id": 559, "review_id": "5e0e0ccd9974ee0017a62375", "rating": null, "review_text": "They had too many concepts that they tried to cram in one movie that it ended up being an awkward mess.", "created_at": "2020-01-02T15:31:25.662Z"}, {"movie_id": 559, "review_id": "5e0e16e668b1ea00157f82fa", "rating": null, "review_text": "Tobey Maguire isn't good at being bad. Don't get me wrong, he played a great Spider-Man in the first two films but he just isn't cut for being evil.", "created_at": "2020-01-02T16:14:30.008Z"}, {"movie_id": 559, "review_id": "5e0e21236dc6c000154cce8b", "rating": null, "review_text": "I really tried my best to not hate it but it's hard not to compare it to the first two successful Spider-Man movies.", "created_at": "2020-01-02T16:58:11.872Z"}, {"movie_id": 559, "review_id": "5e0e2ba0c2f44b00132ff408", "rating": null, "review_text": "It felt like a totally different Spider-Man. It's such a shame because they had such a good storyline that connected the previous films.", "created_at": "2020-01-02T17:42:56.562Z"}, {"movie_id": 559, "review_id": "5e0e47dd6dc6c000184d567a", "rating": null, "review_text": "Great action sequences and character development is lost when you try too hard to cram too many things into one 2-hour movie.", "created_at": "2020-01-02T19:43:25.243Z"}, {"movie_id": 559, "review_id": "5e0e530fc2f44b0011307856", "rating": null, "review_text": "Yes, there was too much to process, but I still think it's a great ending to an epic trilogy.", "created_at": "2020-01-02T20:31:11.801Z"}, {"movie_id": 559, "review_id": "5e0f0e776818880014596fec", "rating": null, "review_text": "This still is a great movie even if it felt like two separate movies stacked on top of each other. This would've worked really well if maybe they had more time to put everything together.", "created_at": "2020-01-03T09:50:47.802Z"}, {"movie_id": 559, "review_id": "5e0f41a0d64ac200185e3561", "rating": null, "review_text": "Tobey Maguire isn't that great of an actor when it comes to playing a bad guy, but it still was enjoyable for me to see him take on a different role. We've gotten so used to seeing him the friendly neighborhood that he is. It was nice to see him change up things a bit.", "created_at": "2020-01-03T13:29:04.654Z"}, {"movie_id": 559, "review_id": "5e107f46d64ac2001460ab06", "rating": null, "review_text": "I'm not hating on the studio for doing a bad job on this one but this is just what happens when you try to please everybody. It's such a shame that the original Spider Man franchise had to end like this. I wanted it to be so much more memorable.", "created_at": "2020-01-04T12:04:22.822Z"}, {"movie_id": 559, "review_id": "5e121a8ce78e2d0017769f05", "rating": null, "review_text": "There's just simply too much going on. You can't have romance between two main characters, a conflict between best friends, an inner battle with the protagonist, and two villains each having their own storyline all in just one film. It's just spread out too much that no one really gets a chance for character or story development.", "created_at": "2020-01-05T17:19:08.693Z"}, {"movie_id": 559, "review_id": "5e124ca3e78e2d00157766e7", "rating": null, "review_text": "Sure the fight scenes were cool and all but wouldn't it have more sense to just follow a single storyline rather than having 4-5 plots colliding with each other?", "created_at": "2020-01-05T20:52:51.747Z"}, {"movie_id": 559, "review_id": "5e12680c9020120018b69b9b", "rating": null, "review_text": "I love Spider-Man but this has got to be the worst film out of the three original films.", "created_at": "2020-01-05T22:49:48.158Z"}, {"movie_id": 559, "review_id": "5e126832d8af670014bd67ed", "rating": null, "review_text": "I love Spider-Man but this has got to be the worst film out of the three original films.", "created_at": "2020-01-05T22:50:26.676Z"}, {"movie_id": 559, "review_id": "5e12c628d8af670012be2da7", "rating": null, "review_text": "I love it as much as the first two films!", "created_at": "2020-01-06T05:31:20.121Z"}, {"movie_id": 559, "review_id": "5e12ca425907de0012dee1be", "rating": null, "review_text": "It was way different than the first Spider-Man films but I appreciate it for what it is - a darker, more complex film.", "created_at": "2020-01-06T05:48:50.398Z"}, {"movie_id": 559, "review_id": "5e12ce3c8741c400123da338", "rating": null, "review_text": "I'm just happy that we have such a great ending to an epic trilogy. Even though it wasn't what we expected, it still holds up.", "created_at": "2020-01-06T06:05:48.839Z"}, {"movie_id": 559, "review_id": "5e12d2afd64ac20014651720", "rating": null, "review_text": "There are a couple of flaws with this film but I believe that they didn't entirely destroy the movie.", "created_at": "2020-01-06T06:24:47.933Z"}, {"movie_id": 559, "review_id": "5e20d75120af770014376534", "rating": null, "review_text": "If only they could've done a better job with Spider Man 3. It would've been up there together with Matrix as one of the few trilogies that didn't suck.", "created_at": "2020-01-16T21:36:17.563Z"}, {"movie_id": 559, "review_id": "5e20e0bd8f26bc001371e6a4", "rating": null, "review_text": "Even though Spider Man 3 was not as good as the first two, I still want to thank Tobey Maguire and everyone else for putting out a lot of effort to give us an ending to the first Peter Parker.", "created_at": "2020-01-16T22:16:29.035Z"}, {"movie_id": 559, "review_id": "5fc0de75ac8e6b003d34d275", "rating": 10.0, "review_text": "An actually good superhero film that is barely topped nowadays-- even compared to the moneymaking machine that is the MCU. A few exceptions are The Dark Knight, The Dark Knight Rises, Man of Steel, and Spider-Verse, that's about it really. A really underrated and overhated film.", "created_at": "2020-11-27T11:09:41.042Z"}]