[{"movie_id": 522162, "review_id": "5dc5a360ab1bc70013ff7b68", "rating": 5.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nWith all due respect to Roland Emmerich and to his fantastic Independence Day, his movies never quite reach their potential, ending up in constant disappointments. It doesn't matter if he has excellent casts or amazing VFX teams, his films' screenplays are almost always stuffed with narrative issues. Midway is simply another installment in his saga of letdowns. Without knowing the director, anyone who looks at this movie will feel instantly captivated. From the unbelievably talented cast to the impressive visuals, it has two attention-grabber ingredients, which can result in a remarkable film… only if the two pillars of any cinematic production are decent enough: story and characters.\r\n\r\nThese are the main issue with Emmerich's movies. His characters are not compelling or intriguing enough, and his screenplays lack creativity and excitement (whether these are written by him or someone else). When I noticed that Midway had such an acclaimed cast and that it was about the Battle of Midway, I immediately got excited. War epics are a genre that I sincerely appreciate. However, when I checked who was \"running the show\", I instantly lowered my expectations. Honestly, it's exactly what I expected it to be: visually gripping, but emotionally hollow.\r\n\r\nI don't want to understate it. The CGI work in this film is jaw-dropping. The actual war is riveting with astonishing aerial sequences and powerful sound design. Even at a regular screening with the usual 7.1 Dolby surround speakers, the floor was rumbling with the explosions and the planes. This is why I think audiences will definitely enjoy this movie. Maybe not a vast majority, but surely most people will leave their theaters feeling it was good entertainment. It has a long runtime, and it's hard to get through the exposition-heavy story, but in the end, I bet the general public will appreciate the war action enough to give the whole thing a thumbs up.\r\n\r\nNevertheless, it's still a very superficial flick. While it's very respectful to everyone who fought in the war (including the Japanese) and to the historic event on itself, it lacks emotional attachment to its characters. Dunkirk was praised by both critics and audiences all around the world, but its main criticism connects to what I just wrote. Christopher Nolan's film also didn't have any compelling characters. However, there's a big difference between these two movies. Both their marketing and their ultimate goal are distinct. Dunkirk was all about showing the actual war. It never marketed itself as a character-study or that it would even have a significant focus on some of the heroes that fought there. Nolan repeated several times: it's about the war and the war only.\r\n\r\nIt's genuinely one of the best, if not the best, *pure* war film I've ever seen. When it comes to depicting the claustrophobic, unbreathable, restless, bloody, loud event that a devastating war is, Dunkirk is so realistic it can even become uncomfortable with just sitting in your chair (at least, I did in IMAX). On the other hand, Midway's marketing was about paying homage to \"people who fought in the Battle of Midway\". Hence the stellar cast compared to Nolan's just competent actors (with obvious exceptions like Mark Rylance or Tom Hardy). It spends most of its screentime trying to develop the actual people that helped win that battle, not with the action itself. Therefore, these characters need engaging scripts and emotionally resonant arcs.\r\n\r\nWes Tooke delivers a screenplay packed with so much exposition that a lot of it looks clearly unrealistic. Characters discuss specific topics that don't make any sense of being in a conversation at a particular time and place. Throughout the runtime, there are dialogue sequences with the sole purpose of explicitly telling the audience what we need to know to understand the story, which ends up turning the narrative confusing, convoluted, and lacking faster pacing. It's tough to get through the non-action periods, and I can't even imagine how dull it would be without such an impeccable cast. Ed Skrein remarkably portrays Dick Best, the only character who's genuinely compelling and carries a complete, well-developed arc.\r\n\r\nUnfortunately, I didn't feel invested in any other character. Only the best movies of every year can have a numerous and talented cast while giving each and every actor an exciting role. Midway has too many characters for the story it wants to tell. In addition to this, it has to stretch its runtime because you can't get Woody Harrelson or Dennis Quaid playing secondary roles and not giving them more than just a couple of lines. As time goes by, Emmerich's storytelling structure gets needlessly more and more complicated to follow. It's yet another film added to the \"wasted potential\" list…\r\n\r\nPotential due to how truly magnificent the action sequences can be. It's undeniable that these are entertaining, gripping, and exciting. The dive bombers' scenes are packed with so much tension that I was getting more and more frustrated every time they missed their target, and a bomb went into the sea. I wanted them to succeed so bad, and this feeling can only be triggered by something extraordinary. Midway's war is as close to epic as it could be, but as with every other cinematic production, if its story and its characters are not up to par with the action, there are no outstanding VFX that can save a lousy screenplay.\r\n\r\nAll in all, Midway is a respectful homage to the people who fought in the Battle of Midway, but it fails to deliver an engaging story with compelling characters. With more characters that what it needed, the runtime is stretched beyond its limit due to the numerous acclaimed actors who would never be in a movie if they didn't have more than a couple of lines. Roland Emmerich has to thank his VFX team for presenting the closest war action we could ever get of the famous battle. Truly epic visuals with tense and riveting aerial sequences, plus a powerful sound design, get your teeth biting the nails. Unfortunately, except for Ed Skrein's character, I didn't feel invested enough to appreciate the non-action moments due to the confusing, convoluted, and exposition-heavy narrative. It's a shame that a visually impressive film possesses such an emotionally dull story. However, I still recommend it for anyone who enjoys war epics and \"based on a true story\" adaptations.\r\n\r\nPS: it doesn’t hurt to research a bit about the Battle of Midway. I didn’t and I’m sort of regretting that now. Don’t make the same mistake. Going in with basic knowledge of what, how, and why it happened will only help you enjoy this movie more.\r\n\r\nRating: C+", "created_at": "2019-11-08T17:18:24.954Z"}, {"movie_id": 522162, "review_id": "5dda195628723c0014593266", "rating": 8.0, "review_text": "***Just the facts, Jack***\r\n\r\nIntelligence officer Edwin Layton (Patrick Wilson) warns that a Japanese attack is imminent, but his advice is disregarded and the Japanese use their carrier fleet to attack Pearl Harbor on December 7, 1941. Admiral Chester Nimitz (Woody Harrelson) swiftly assumes command of the heavily weakened US Pacific Fleet. After the Doolittle air raid on Tokyo & Honshu 4.5 months later, \tevents lead up to the Battle of Midway on June 4–7, 1942. Ed Skrein plays cocky pilot Dick Best while Dennis Quaid is on hand as carrier commander William \"Bull\" Halsey. \r\n\r\n\"Midway\" (2019) tackles the Battle of Midway and events leading up to it without throwing in a dramatic fictional story, like the love triangle of “Pearl Harbor” (2001). While I loved “Pearl Harbor” and proudly stand by it, “Midway” chooses to stick to the facts and is thrilling from beginning to end. The main cast members are all real-life figures and there’s a tribute to each at the close.  \r\n\r\nThis is superior to the 1976 movie because Roland Emmerich had the CGI technology to pull off the battle scenes which take place in & above the Pacific Ocean near the atoll of Midway, which is located a little over a thousand miles west of Hawaii. The flick successfully takes the viewer right into the midst of the fight on the water, in the air and under the water. It’s exciting, horrific and revelatory.   \r\n\r\nThe film runs almost 2 hours and 18 minutes.\r\n\r\nGRADE: A-", "created_at": "2019-11-24T05:47:02.414Z"}, {"movie_id": 522162, "review_id": "5e3269d5c56d2d0018521ffa", "rating": 3.0, "review_text": "War stories are only worth retelling in film if you're doing something new and interesting with the genre. Otherwise, it's just a retread of 'Pearl Harbour' or 'Fury' or any of the dozen other thematically-empty, explosion-happy extravaganzas from the last ten years. There's a compelling, nuanced, and affecting film to be made about Midway. This is not that film.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-midway-sound-and-fury-signifying-nothing", "created_at": "2020-01-30T05:29:57.522Z"}, {"movie_id": 522162, "review_id": "5e56c7f735811d00135d3dab", "rating": 8.0, "review_text": "Admittedly I have a love for anything involving World War II and although the dialogue was a bit spotty and some of the visual effects were okay at best, I still found this to be a pretty good war movie and nice performances all around. Probably doesn't rank all that high compared to others about Midway and Pearl Harbor, yet still found it to be worth checking out. **3.75/5**", "created_at": "2020-02-26T19:33:11.410Z"}, {"movie_id": 522162, "review_id": "5ea38739af432400259ff3dc", "rating": 4.0, "review_text": "Click here for a video version of this review: youtu.be/2Mr6XRF4GR4\r\n\r\n_Midway_ is an ambitous film that sets out to follow the United States entry into World War Two, from the attack on Pearl Harbour through to the Battle of Midway. To tell this story it focuses on two main characters who are also based on real life people. There's Ed Skrein playing Dick Best, a pilot on the USS Enterprise, and Patrick Wilson playing intelligence officer Edwin Layton.\r\n\r\nAs you might imagine jamming seven months of war into just over two hours is a big task, and while they did manage to pull this off, the result is a movie that feels rushed, where we can't get to know all the many characters, and which probably requires a pretty strong knowledge of this time period in history to understand all the things that are rapidly being thrown on screen.\r\n\r\nI actually had a lot of trouble telling who was who in many of the scenes involving the pilots. Apart from Ed Skrein and Luke Evans the rest of the pilots and rear gunners are such a copy / paste of each other and they come and go so fast on screen that you have zero time to have any kind of emotional connection to them, even though the movie tries to make you feel for them. For a lead actor, Skrein is very wooden and uninspiring, and I don't think has shoulders big enough to carry his part of the film.\r\n\r\nThen, as if the 10,000 mile an hour story is not bad enough, this movie relies very heavily on visual effects. Apart from close-ups, everything you see that involves a ship or a plane is entirely CGI and it is woefully bad 99% of the time. I've used the Playstation analogy a lot, and this is another example. I feel like if they had cut back the story to not cover so many fights and battles, there would have been a lot less visual effect shots. And with less shots to create and render, perhaps those remaining would have come out looking more realistic. As it is, it really takes you out of the movie - the planes move like they are weightless and defy the laws of physics, the explosions look they were made in AfterEffects, and each scene on a ship has that horrible green screen glow about it.\r\n\r\nIn summary I think this movie suffers from trying to do too much all at once. This came off feeling more like a trilogy of movies about Pearl Harbour, The Doolittle Raid, and The Battle of Midway had been edited down to one single movie. The end result is a rushed film that is hard to follow, whose characters are difficult to connect with, and whose visual effects are video game level at best. This will not go down in history as a great war film.", "created_at": "2020-04-25T00:41:29.987Z"}, {"movie_id": 522162, "review_id": "6028f9213a48c500410d73ed", "rating": null, "review_text": "This movie was a bit of a positive surprise. I was actually prepared to not like it that much but Hollywood actually made a decent war movie without pushing their usual left wing political propaganda and woke SJW bullshit.\r\n\r\nIt’s really a good movie in pretty much all aspects.\r\n\r\nFirst, I liked that it covers quite a bit more than “just” Midway. It actually starts before the attack on Pearl Harbor. Then it covers the attack on Perl Harbor and also the famous Dolittle raid on Tokay to finally end up with the battle of Midway. All of it is more or less historically accurate. We also get to see a fair amount of the history from the viewpoint of the Japanese. Whether that bit of the story is actually entirely accurate I guess no one will ever know of course.\r\n\r\nI also liked that they took the effort to get all Japanese actors (or Japanese looking at least) playing the Japanese side and that they spoke Japanese all the time. That’s the kind of thing that gives the right atmosphere for those parts of the movie.\r\n\r\nThe acting was overall good on both sides. I quite liked Woody Harrelson as Nimitz. Ed Skrein was probably the actor I felt made the most mediocre performance but that might just be me.\r\n\r\nOf course there can be no war movie without things going boom and this movie didn’t disappoint on that. It has plenty of action, lots of flight scenes and lots of thing being blown up and it was overall well made. The effects when large ships got torpedoed, bombed or when their munitions exploded was quite realistic. You could see the ships shuddering and the effect on the water around it.\r\n\r\nIf I should complain about something it was that the movie is too short. Given the large time period it covers there is so much material that it could easily have been longer. It almost felt a bit rushed. There could have been much more suspense around the battle of Midway itself and the part of how they got Yorktown operational, and hid the fact from the Japanese, in time for the battle was altogether left out for example.\r\n\r\nThe movie was 2 hours 18 minutes long which is respectable but not that long by today’s standards. All three of the extended Lord of the Rings movies was three and a half hours long and this one could easily have been as long.", "created_at": "2021-02-14T10:19:13.669Z"}, {"movie_id": 522162, "review_id": "642f77df67203d007785bc05", "rating": 8.0, "review_text": "I am not a fan of war movies (and therefore not an authoritative reviewer) so I can only say that I thought it was fairly entertaining. Woody Harrelson and Dennis Quaid were as good as I would expect them to be and the large cast certainly held their own.\r\n\r\nI felt there were some war movie cliches here and there, but the Japanese were portrayed with respect and, I assume, realism. The battle felt like a very near thing to me, like it could easily have gone the other way with a bit less bravery and persistence on the part of the American fliers. Plus it showed only two planes returning in the end, but someone said they lost half their men. Perhaps the rest landed on different carriers and was just unclear. But as I said, I knew little of the details of the battle going in.", "created_at": "2023-04-07T01:54:40.021Z"}]