[{"movie_id": 8358, "review_id": "5591911cc3a36807fd001c0f", "rating": 7.5, "review_text": "We live and we die by time. And we must not commit the sin of losing our track on time.\r\n\r\n*** This review may contain spoilers ***\r\n\r\nJetting off on yet another important task, FedEx whizzer Chuck Noland leaves his girlfriend Kelly Frears (Helen Hunt) behind just before Christmas. Disaster strikes during the flight and the plane crashes into the ocean. Managing to free himself from the sinking jet, Noland is washed up on an uninhabited island. Without basic modern comforts and fighting solitude daily, Noland must live in hope that one day he might be saved before he loses his mind or the will to live.\r\n\r\nTom Hanks (Noland) re-teams with director Robert Zemeckis after their hugely successful collaboration on 1994 awards stealer, Forrest Gump. Though Cast Away didn't win any awards (the usual cry of it being Oscar bait had preceded it) it can be argued to be Hanks' best performance. Few actors in the modern era could carry the film the way that Hanks does. Beguiling and drawing us into his loneliness, Hanks, with minimal dialogue (his only company being a volleyball that washed up with a few other FedEx parcels) excels with facial and bodily acting. Zemeckis, who should be applauded for the middle section and the terrifying plane crash that precedes it, puts Hanks' Noland through the mangler. The convenience of said parcels washing ashore aside, Noland is bumped bruised and dentally challenged, the Robinson Crusoe clichés exist of course, but Zemeckis and a heartfelt Hanks put us there on the island as well, with a pat on the back due for the excellent work by the sound department I might add.\r\n\r\nSadly Cast Away is bookended by not so great work. The opening character introductions are unremarkable but just about good enough for the plot set up, but the ending lacks emotional punch and defies what has been built up. Things aren't helped by Helen Hunt's lack of chemistry with Hanks, but that in turn is not helped by the writing from William Broyles Jr. since it's only really now that it's Noland that we care about. It's a bit churlish to complain too much though, because Zemeckis kept us on the island with Chuck, there was no cutting back to grieving family or fruitless rescue attempts. With that it was a truly fine one man show, even if that is something that ultimately renders the ending something of a let down. 7.5/10", "created_at": "2015-06-29T18:40:28.268Z"}, {"movie_id": 8358, "review_id": "6324a567ae6f09007f281127", "rating": 5.0, "review_text": "**Cast Away is a brilliant movie in many ways, but some disappointing story and character decisions keep it from being a personal favorite.**\r\n\r\nIt all began on Christmas Day. Many people forget that Cast Away is technically a Christmas movie. The fateful plane crash that strands Tom Hanks on an island alone with his volleyball best friend, Wilson, takes off and leaves his new fiance alone on Christmas Day. There are some fantastic aspects to this film. Tom Hanks once again gives an Oscar-worthy performance committing himself entirely to the role that honestly carried the film. Everyone loves Tom Hanks, so stranding him on a deserted island fighting for survival gets everyone involved. The directing and setting of the film were well-crafted. There are two reasons Cast Away receives such a low rating:\r\n\r\n> 1. Despite Hanks' incredible performance, the film was mostly one guy all alone talking to himself. It made the story drag and get a little boring.\r\n> \r\n> 2. Call me a romantic but the fact that he battles and finally makes it home to his fiance only to find out she moved on was extremely disappointing. Sure he abandoned her during the holiday season but still, he returned to her against all odds, only to be rejected. Ouch! I guess she sort of… cast him away. 🤭\r\n\r\nI agree with anyone who says Cast Away is an amazing movie, but it's not a personal favorite.", "created_at": "2022-09-16T16:33:43.909Z"}, {"movie_id": 8358, "review_id": "64662a26d1857201619045bf", "rating": 7.0, "review_text": "Tom Hanks excels in this well put together depiction of the archetypal, rather fastidious, business executive who finds himself stranded - after his plane crashes - on a remote tropical island. Completely ill-suited for life without any modern conveniences, but not without a brain cell or two, he has to adapt à la \"Robinson Crusoe\" to his new life of coconuts and whatever fish he can catch. The story takes it's time but that all contributes well to the effectiveness of his performance as he must deal with the physical, logistical and increasingly psychological challenges his predicament throws at him. Loneliness and despair fight against his human nature to thrive and to survive - and cause his creation of \"Wilson\", a sort of hybrid between a volleyball and a pineapple, for company! It was a Fed-Ex plane, which allows Robert Zemeckis to introduce some brief flashes of humour to lighten the mood - it's astonishing what people think to send to each other - and there is even a role for some ice skates to serve as a dentistry aid! As it progresses, we know that rescue is unlikely so are not surprised when his thoughts turn to venturing into the great, and turbulent, unknown - on a raft held together by plant threads and video tape. There isn't a great deal of jeopardy so the ending isn't really in doubt, but the effort here by Hanks and some solid writing and directing create quite a compelling and at times un-nerving film to watch. I've never really been one for the tropical island experience - I'm certainly not now!", "created_at": "2023-05-18T13:37:42.806Z"}]