[{"movie_id": 376867, "review_id": "58b3413392514177d100bc2e", "rating": 6.0, "review_text": "**Blue is the warmest colour.**\r\n\r\nThis is an exceptional film, but only from one perspective and that is, LGBT. I totally respect that, because I'm a big supporter. But apart from that, particularly from the filmmaking aspect I did not like it. I felt like this film took place somewhere in Africa, but the accent was American. Because I could not find a single white or any other race people, even in the background.\r\n\r\nThe happy parts are, it is surprisingly a very interesting theme. I loved the storyline. The three phases of a man's life. How things around us can influence to build a personality. Sometimes in a good sense, but according to this film, there are some dramatic turns. Though the end was very simple, but I liked the first episode. It had potential to be a message film, but the later parts turned differently. Most importantly realistic narrative.\r\n\r\nMore like it is about the life cycle. Feels like a short and suburban version of 'Spring, Summer, Fall, Winter and Spring'. All the actors were so good. The screenplay was adapted from a book. Looks like it's a breakthrough for the director. I hope he keeps up the momentum and gives us the best products in the future. This film is not for everyone, mainly because of the theme. Initial parts were okay, but the latter developments were unexpected. It is one of the good films of the year, not the best.\r\n\r\n_7/10_", "created_at": "2017-02-26T20:57:23.947Z"}, {"movie_id": 376867, "review_id": "659440c81cac8c64970c6a8b", "rating": 7.0, "review_text": "It's the third segment of this that's the most interesting but the preceding two are essential in helping us to understand the situation in which the young \"Chiron\" (Alex R. Hibbert, then an effective Ashton Sanders as a troubled teenager before finally, by this latter point, Trevante Rhodes) finds himself. Initially we see a young boy living in Miami with his crack-addicted mother \"Paula\" (Naomie Harris). He grows up being shunned and bullied at school with his search for some sort of stability and guidance through life coming largely from his pal \"Kevin\", neighbourhood dealer \"Juan\" (Mahershala Ali) and his generously spirited girlfriend \"Teresa\" (Janelle Monáe). It's these people that put him on a path - a twisting and uncomfortable path - to his own self-discovery and a start in believing in himself and in his own identity. It's a coming of age drama, sure, but it carefully and delicately looks at the life of a young boy who evolves amidst an environment of indifference, confusion and intolerance. Of a lad who is coming to terms with his own sexual identity with little if any peer support to assist with this complex process of maturity. His grasp on decency and integrity is sorely challenged all through his life, but he never loses a sense of what is right and the last half hour is as poignant a tale of manhood as you're likely to see on screen. The acting across the board is pretty top drawer, as is the powerfully delivered but sparingly written dialogue. This is not a festival of endless chatter, but a presentation of scenarios that we can assess as \"Chiron\" grows up and we share in his life choices. It's emotional and engaging, not without a little humour to lighten it at times and we maybe even get the start of a love story? Well worth a watch a few times, i'd say.", "created_at": "2024-01-02T16:58:48.613Z"}]