[{"movie_id": 982271, "review_id": "6461ede1a6725401221296f2", "rating": 6.0, "review_text": "This appears to be a good excuse for four actors, who seem to get on quite well together, to get someone to fund an all expenses paid trip to Italy to make a movie underpinned by the thinnest of plots. That plot sees the group emerging from lockdown when they finally manage to meet for their routine bookclub. It's at this get-together that \"Vivian\" (Jane Fonda) announces that she - a lifelong opponent of the institution - is to marry \"Arthur\" (Don Johnson). \"Carol\" (Mary Steenbergen) comes up with the idea of a hen trip to Italy and after a bit of scepticism from \"Diane\" (Diane Keanton) and the timely death of the cat of judge \"Sharon\" (Candice Bergen) they embark on their trip of a lifetime. What now ensues is a rather predictable and lightweight comedy drama that starts off entertainingly enough but runs out of steam quickly and permanently. The last twenty minutes take us into cheesy territory that really did have me looking around the cinema at the ceiling thinking - \"oh, just get on with it\". There are a few fun contributions from Giancarlo Giannini as the rather dishevelled police chief and a few cameos from Andy Garcia, but for the most part this is just four folks having a jolly time whilst those of us sitting down remember (or discover) just how beautiful Venice is. It's all instantly forgettable stuff, this, but Bergen has her tongue firmly in her cheek and Jane Fonda just seems to look more android the more films she precariously totters through nowadays.", "created_at": "2023-05-15T08:31:29.214Z"}, {"movie_id": 982271, "review_id": "64cca532764b9900e3ba3a18", "rating": 3.0, "review_text": "The first question I asked myself after leaving the theater after screening “Book Club: The Next Chapter” was “wait a minute, did this movie even have a script?” The story is so paper-thin that it seems like a long improv session between four of the most charming actresses over 70. The sad (or great?) thing about this is that it doesn’t really matter, because co-writer and director Bill Holderman unapologetically made this movie for a target audience that will gobble it up and leave wanting more.\r\n\r\nAll facing different milestones in their lives, four best friends Diane (Diane Keaton), Vivian (Jane Fonda), Sharon (Candice Bergen), and Carol (Mary Steenburgen) decide to take their book club to Italy for the fun girls trip they never had. With the news that one of their own has recently gotten engaged, the gals use it as an excuse to have a whirlwind bachelorette party. The relaxing vacation turns into a cross country journey that takes them from Rome to Tuscany and beyond on an adventure of a lifetime.\r\n\r\nThere isn’t much substance to this senior citizen fluff, and just because it’s watchable does not mean it’s entertaining. There are a lot of vapid scenes that do nothing to further the narrative, and the film has close to zero story or plot. Astute viewers (to be honest, even those who have only seen a handful of Hallmark movies) will figure out the big surprise long before its overlong reveal, leaving most of the audience bored, trying to savor the lovely scenery of the Italian countryside.\r\n\r\nThe cast is terrific, but I wouldn’t call what they’re doing “acting.” It’s more like a camera has been turned on a group of old friends having fun together. They’re drinking wine and eating mountains of pasta, spinning yarns and puttering around Italy. Co-screenwriters Holderman and Erin Simms pander to their demographic with plenty of old lady one-liners and slightly raunchy wordplay that’ll make grandma blush.\r\n\r\nIt’s so nice to see older actors getting work, and Craig T. Nelson, Don Johnson, Andy Garcia are well cast and provide a little testosterone to the story (although all of the men are portrayed as hopelessly romantic, and their grand gestures are laughable). This one is all about the ladies, though, and each one is irresistible in their own way. Their chemistry is believable and authentic, which makes these characters part of group to which we’d all love to belong. If not for the charisma of the cast, this film would sink even harder and faster.\r\n\r\n“Book Club: The Next Chapter” is not a good movie. It’s dumb, predictable, and lacks sophistication. Despite it all, the film reaches its ultimate goal of being a sweetly enchanting fairy tale for moms and grandmas everywhere.", "created_at": "2023-08-04T07:13:54.940Z"}]