[{"movie_id": 777270, "review_id": "61d8736d5c5634001c2edcbe", "rating": 4.0, "review_text": "I wanted to like this more than I did. It's fine, but it just doesn't resonate terribly well with me. Not to mention it feels a bit like a stage-play, taking place all on one street. I understand it's supposed to be the world through a child's eyes, but there's not much there. Conversations and issues feel breezed through, and yet 'Belfast' sags in the middle around the third time they have the same set of conversations. It's good enough, but I couldn't recommend it to anyone.", "created_at": "2022-01-07T17:07:57.122Z"}, {"movie_id": 777270, "review_id": "62059923e640d6004346dfba", "rating": 8.0, "review_text": "A swell little film, this.\r\n\r\nI may not have a connection to the events portrayed onscreen, but <em>'Belfast'</em> is - despite the not so good true events that it's retelling - is a pleasant film to watch. With a perfectly timed length of around 90 minutes, this 2021 flick holds a lot of heart - it's also rather funny, it had me laughing a fair number of times.\r\n\r\nThe star of the film is undoubtedly youngster Jude Hill, who is an absolute joy in the role of Buddy - some performance from the 11-year-old! Buddy's connections with every single character are lovely, especially with those played by Ciarán Hinds and Judi Dench - wait... that was Judi Dench?! I legit didn't even notice until the end credits, which shows how convincing her performance as a Northern Irish grandmother is... or perhaps I need my eyesight tested, who's to say.\r\n\r\nJamie Dornan and Caitríona Balfe also merit props, in what is a very good release from Kenneth Branagh & Co. The target audience, along with others of course, will adore it, I'm sure. Also... love the choice of black-and-white, fwiw.", "created_at": "2022-02-10T23:00:51.252Z"}, {"movie_id": 777270, "review_id": "63099f89944a57007a65056a", "rating": 8.0, "review_text": "Belfast is packed with powerful images — shot in Haris Zambarloukos’s majestic black-and-white cinematography (except for a handful of color shots at key moments, notably the escapist windows that film and TV offer the characters) — beginning with an early scene in which the young protagonist, Buddy (Jude Hill), armed with a wooden sword and a shield/dumpster lid, confronts a mob of unionist protestants who come to attack the houses and businesses of Catholics on Buddy’s Street.\r\n\r\nIn an inferior movie, Buddy would be foolish enough to think that his makeshift weapons could measure up to the rioters’ Molotov cocktails; here, however, it marks precisely the beginning of the end of childhood innocence — a point driven home later by a reading of chapter thirteen of the First Epistle to the Corinthians (\"When I was a child, I spoke as a child, I understood as a child, I thought as a child; but then I became a man and left childish things behind”).\r\n\r\nThe film’s depictions of violence are doubly effective because Branagh resorts to them sparingly, and when he does, he shoots them in a realistic style; when a car explodes in the middle of the street, you can bet your sweet ass it doesn’t just go up in CGI flames.\r\n\r\nThe most striking images, however, are those whose composition evokes an air of domesticity; several of them have in common the background presence, as if detached from the action, of Judi Dench. Branagh, who has collaborated with her on almost a dozen productions, knows very well that the veteran actress is able to conjure, simply by virtue of being there, enough gravitas to anchor a scene in the real world (now, this is not to say that Dench is reduced to prop status; quite the contrary, her character provides the emotional center of the history).\r\n\r\nThese images stay with us because they are all about what is at stake in the film: a fragile lifestyle in which “We have known this street and all the streets around it all our lives. And every man, woman, and child that lives in every damn house, whether we like it or not. And I like it. And you say you have a little garden for the boys? But here, they can play wherever they want, because everyone knows them, everyone loves them, and everyone cares for them.” Establishing this delicate way of life is the reason that the threat of violence is so much more effective in creating tension than the violence itself.\r\n\r\nAll things considered, Belfast is an episodic slice-of-life-seen-through-a-young-boy’s-eyes that isn’t, believe it or not, a million miles removed from A Christmas Story, and indeed the script introduces a placid, elementary sense of humor that nicely counterbalances the more dramatic material.", "created_at": "2022-08-27T04:37:30.002Z"}, {"movie_id": 777270, "review_id": "632db39fcede69009233dfa2", "rating": 10.0, "review_text": "This is the kind of cinema that we always hope to see - brilliantly fresh, tight script, beautifully shot, amazing performances, an autobiographical-based story of the directory himself, Sir Kenneth Branagh, and ... Van Morrison soundtrack. In essence, it's a coming-of-age movie of an adolescent, set against \"The Troubles\" of Northern Ireland. Buddy has a special love for movies and theater, encouraged by his cranky, old grandmother (Dame Judi Dench). The beautiful relationship between the grandfather and grandmother is mirrored perfectly in the mother and father, and then again in Buddy's budding romance with Catherine. There's so much going on in the film that it's very nearly a tone poem.", "created_at": "2022-09-23T13:24:47.420Z"}]