[{"movie_id": 82992, "review_id": "51c2850e760ee359400fda6d", "rating": null, "review_text": "> Good Movie !!", "created_at": "2013-06-20T04:29:02.436Z"}, {"movie_id": 82992, "review_id": "5201a4d2760ee35dc108214f", "rating": 9.5, "review_text": "Amazing movie!These Fast & Furious movies keep getting better and better! I recommend you go see this movie and hopefully seven comes out!", "created_at": "2013-08-07T01:37:22.188Z"}, {"movie_id": 82992, "review_id": "533f9d9cc3a36830f3000a27", "rating": 7.0, "review_text": "This is a good movie. It is pretty much what you would expect from a Fast & Furious movie. It could have been a great movie but it is unfortunately dragged down by some of the not too unusual Hollywood stupidity and arrogance towards the viewers.\r\n\r\nVin Diesel and Dwayne Johnson are perfect in their roles as old-fashioned, hard-hitting, fast-driving macho guys. Michel Rodriquez is doing a decent enough job as well but then I do like Michel Rodriquez so… These guys are making a lot of the movie for me. The rest is not bad but more like filling out some empty space compared to Vin and Dwayne.\r\n\r\nThis is of course a movie about fast driving, action and special effects. In those areas it does not disappoint. There are lots of fast driving and lots of action and special effects. Not all of it is entirely realistic of course. This is rather expected and I can live with it as long as it doesn’t go to far into the realm of ludicrously unrealistic which it, sadly, did towards the end. Although the effects and fights themselves were quite cool the entire flight escape scene was just ludicrous. They were driving at take-off speed, both on the ground and in the air, for how long? 20 minutes? That must have been the worlds longest runway. This is what I call Hollywood arrogance towards the viewers. Do they really think the viewers are so stupid that they will just buy this? Or is it that they themselves are so utterly stupid that they do not realize how utterly wrong the entire thing is? For me this really dragged down an otherwise great movie.\r\n\r\nOtherwise the movie is a nice blend between macho talk, action, lots of fast driving, some humor, some more action, some more fast driving and lots of chars getting smashed. In short all the things that make up a good fun action movie. The story itself? Well, as far as I am concerned, fairly standard issue which held the action together reasonably although the basic idea and technical aspects, especially this “EMP chip”, where not very believable.\r\n\r\nOn the whole, it was a good and enjoyable movie which good have been great if it were not dragged down by Hollywood stupidity.", "created_at": "2014-04-05T06:07:24.791Z"}, {"movie_id": 82992, "review_id": "6461e953a6725400e3d261c4", "rating": 6.0, "review_text": "I really quite enjoyed F&F5 (2011), but this one has sunk back into the routine car chase and endless pyrotechnics series of scenarios and despite retaining the stalwarts in Vin Diesel (\"Dom\"), Paul Walker (“O'Conner”) and the more recent arrival \"Hobbs\" (Dwayne Johnson) it is all very so what? The germ of the plot is that the gang travel to London to find \"Letty\" (Michelle Rodriguez), long thought to be dead. Now it appears she is working with the nasty \"Shaw\" (Luke Evans) - but is she? Who can trust whom? It is refreshing to see that the Metropolitan police are no better at stopping the streets of their city being used as a race track - with carnage ensuing all around; even some big red buses take a hit. We have some fun with a tank, and a plane - indeed it's really only an ocean liner that is missing from this quickly paced, action effort. Sadly for me, Evans is not in the least menacing and the ending just goes on for far, far, too long. I did quite enjoy it on big screen, but I can't think I would ever bother to watch it again.", "created_at": "2023-05-15T08:12:03.699Z"}]