[{"movie_id": 670292, "review_id": "6517e3b99b861600ff692a91", "rating": null, "review_text": "I love it.\r\n\r\nIt's visually stunning. Not just the cinematography itself, but everything you see in the frame: the characters, the real locations, the visual effects (A.I. robots, simulants, the NOMAD, etc.).\r\n\r\nThe acting is great across the board – especially, especially by Ms. Madeleine Yuna Voyles. I have no idea how she did it. I was moved to my core. I have not been so rocked by an actor's performance since Mckenna Grace's performance in _Gifted_. Speaking of...\r\n\r\nIt's emotional and moving. And it's thought-provoking. This is one of those movies that sat with me afterwards.\r\n\r\nAnd Hans Zimmer's score? Phenomenal.\r\n\r\nAlso, the sound design team did an amazing job as well. I thought the sound effects for the variety of fictional weapons, ships, etc. were visceral and natural and (I'm not sure the right words, but) unique and perfectly fitting.\r\n\r\nI'm 100% sold on this movie. I was moved the first time I saw it, and even more so this time.", "created_at": "2023-09-30T09:00:41.640Z"}, {"movie_id": 670292, "review_id": "651abc34c50ad2012c19e9ad", "rating": 7.0, "review_text": "MORE SPOILER-FREE MINI-REVIEWS @ https://www.msbreviews.com/movie-reviews/mini-reviews-2023-edition\r\n\r\nTHE CREATOR is an incredibly immersive cinematic experience, packed with captivating audiovisual elements, and featuring a powerfully cathartic conclusion that will leave no one indifferent. Gareth Edwards delivers a story about AI that's more timely than unique or thought-provoking, lacking a better tonal balance, thematic depth, and impactful dialogue.\r\n\r\nThat said, it's an epic sci-fi blockbuster that deserves to be seen on the big screen, if only to witness the best child performance of the century by Madeleine Yuna Voyles.\r\n\r\nRating: B+", "created_at": "2023-10-02T12:48:52.777Z"}, {"movie_id": 670292, "review_id": "651bb97ac50ad200ad81e60c", "rating": null, "review_text": "The Creator is one of the most visually stunning movies of the year, and created on a relatively modest budget, but the story leaves something to be desired.  Or maybe not.  \r\n\r\nListen to the Awesome Friday Podcast for more:\r\n\r\n- Home: https://awesomefriday.ca/2023/10/podcast-flora-and-son-the-creator/\r\n- Apple: https://podcasts.apple.com/ca/podcast/awesome-friday/id480100293?i=1000629874981\r\n- Spotify: https://open.spotify.com/episode/5th1Yd7u4tfly0gO8FUMto?si=4T-qXU8VQ-yyUHAWLBV84w\r\n- YouTube: https://www.youtube.com/watch?v=om0s1ymsJAc", "created_at": "2023-10-03T06:49:30.257Z"}, {"movie_id": 670292, "review_id": "651e7e18c50ad2014dd05ee5", "rating": 7.0, "review_text": "The subject of artificial intelligence has been all over the news in recent months, with much of the coverage (save for what’s in the business/finance pages) presented in an often-troubling, cautionary light. So, from this, it’s easy to see how it  didn’t take long for this topic to make its way into the world of entertainment, as evidenced in writer-director Gareth Edwards’s latest feature offering. This tale about a brutal war between Asia and America over the future of this controversial technology leads to a series of epic revelations, including some that shift the prevailing view of the evils of AI (most notably exposing where the real source of concern about this technology lies). It also serves as a poignant metaphor for the nature of East-West geopolitical relations, the underlying tensions of the conflict represented by the superficial reasons cited as the cause of combat. And all of the foregoing considerations grow progressively stronger and more impressive as the story plays out. However, in the film’s prologue and opening act, the narrative comes across like an uninspired amalgamation of sci-fi tropes culled from an array of other movies and TV series, including “Blade Runner” (1982), “Edge of Tomorrow” (2014), “Oblivion” (2013), “I, Robot” (2004), “The Terminator” franchise and the rebooted version of Battlestar Gallactica (2004-2009), among others. Also, the story, much of which consists of an involved high-stakes pursuit, is overly stretched out at times, a quality that could have been improved upon with some judicious editing. To its credit, though, the picture features excellent special effects, a fair amount of smartly written comic relief and a surprisingly good cast for a sci-fi release (particularly protagonist John David Washington and youthful newcomer Madeleine Yuna Voyles, despite a seriously miscast Allison Janney in a supporting role as an overwrought member of the military brass). “The Creator” is indeed more insightful and thought-provoking than what many of its detractors have said, though it’s understandable how its periodic lapses in originality and inventiveness may be seen as undermining these strengths. Nevertheless, these shortcomings should be taken with a grain of salt, and the film should be given a fair shot for what it has to say about something that’s becoming an increasingly more significant aspect of our lives, something that we had better to learn to understand and live with if we hope to make friends with it as part of our existence going forward.", "created_at": "2023-10-05T09:12:56.764Z"}, {"movie_id": 670292, "review_id": "6522a9ccc50ad2014dd27bec", "rating": 6.0, "review_text": "Right, well I was really disappointed with this. It's like a precursor to the \"Terminator\" films with \"Joshua\" (John David Washington) charged with tracking down and destroying a super-weapon being devised by the AI that mankind developed to keep it safe, but that turned the tables on us all and now robots are ruling the Earth. Sound familiar? Well, the whole thing is pretty derivative with only a few, fleeting, scenes from Gemma Chan and a frankly implausible effort from the usually reliable Allison Janney sporting a militaristic haircut as \"Col. Howell\" - the soldier charged with managing our hero on his trek to eliminate whom we quickly learn is \"Alphie\" (Madeleine Yuna Voyles) who has a whopping great hole between it's ears. It's just all been seen and done before and though this does introduce a degree of humanity and sentiment as the story progresses, it is all just a bit, well - been there, seen that and got Will Smith to sign my T-shirt. To be fair, it does move along well enough with plenty of pyrotechnics, explosions and lasers but the story is thin and predictable and the denouement could have been on the drawing board after about ten minutes. Bet it cost a fortune, but it's all just a bit forgettably lacking.", "created_at": "2023-10-08T13:08:29.003Z"}, {"movie_id": 670292, "review_id": "65542b4853866e011c06ca9b", "rating": 10.0, "review_text": "Perhaps the greatest thing this remarkable film brings to the table is value of love and life, over war and death.\r\n\r\nI am surprised this film was made, in so much, as it shows exactly what the US military industrial complex, stands for. That is callous cruelty, violence, intolerance and death. \r\n\r\nIn a sense then this film could be said to be set in any of the battlefields, in any Asian country, the US has invaded. The fact it has a futuristic overlay, does not detract from powerful and often moving, anti-war, pro peace message, it compellingly conveys. It could not be more timely either, given the US's attempts, to light wars across the world.\r\n\r\nI rarely call a film \"inspired\" in its honesty and its humanity, but The Creator meets that definition, in every sense. A truly emotional, compelling watch. ", "created_at": "2023-11-15T02:22:00.380Z"}, {"movie_id": 670292, "review_id": "655ccd9bea84c710930413a8", "rating": 5.0, "review_text": "A dystopian sci-fi set into 2065 directed, written and produced by Gareth Edwards (Rogue One, 2014's Godzilla) were AI already a part of humany sets a nuke warhead to explode in LA in 2055, causing a world division into the West and New Asia (far Asia and southern asia), were AI robots, humans, ans hybrids cohabit in peace.\r\n\r\nTo counter against this threat US military develops a suborbital station called USS NOMAD (North American Orbital Mobile Aerospace Defense). The movie moves around John David Washington as Sergeant Joshua Taylor, that haves a prosthetic robotic arm and leg lost in the nuclear explosion. \r\n\r\nBack then he involved himself with an asiatic woman called Maya (Gemma Chan), that the learns to be the one called Nirmata (Creator) the founder of the AI of New Asia, through the daughter that they had together, a robotic simulant called Alphie that possesses powers toward machines. \r\n\r\nThe positive: the visual both at scenes, characters or settings are just EXPLENDID, well done CG - just imagine Rogue One, but into this Asiatic setting that mixtures basic living and hi tech. All this was done with $80 million (box office: $101.8 million) a low budget compared to most of todays movies. \r\n\r\nThe visual effects were provided by Industrial Light & Magic, SDFX Studios, Yannix, Virtuos, Weta Workshop Folks VFX, MARZ, Misc Studios, Fin Design + Effects, Outpost VFX, Lekker VFX, Crafty Apes, Jellyfish Pictures, Proof, Territory Studio, Atomic Arts and VFX Los Angeles are top notch, and surely must have an indication for an Academy Award.\r\n\r\nThe negative: thought it have a good base to work with, the story is just too weak - the inspirations from \"Blade Runner' and 'Apocalypse Now', with a bit of \"Avatar\" thought other movies, just turned to be too shallow and predicable and we don't engage so much with the characters till the very near end. It's just...isn't developed enough. At some moments it even reminded me of \"Elysium\". Don't be fooled by the names cited here, they just shows what could be done.\r\n\r\nThe music is by Hans ZImmer - good, but not outstanding, and the cinematography by Greig Fraser (Dune) and Oren Soffer are good, but outshined by the visual effects.\r\n\r\nThe movie had a great potential, but was broke in the ain point, the story. But I consider that it is something to be watched because of the digital effects and production, as a basic that no movie must cost more than $ 100 million to have stellar visuals. \r\n\r\nFor me the score is 6,0 out of 10,0 / B - C+.  The stars are for visual effects only.", "created_at": "2023-11-21T15:32:43.314Z"}, {"movie_id": 670292, "review_id": "655dbd2726677800ca535eff", "rating": null, "review_text": "\"The Creator\" is a new film directed by Gareth Edwards, whose credits include 2014's \"Godzilla\" and \"Star Wars Story 1\". Will his new work go down in the annals of sci-fi cinema in gold?\r\n \"The Creator\" begins with a newsreel informing us that in 2055, a nuclear warhead was detonated in Los Angeles by an artificial intelligence. This prompted the US to ban the use and development of AI. However, not every country approaches AI in the same way. In Asia, AI is not banned. Fifteen years later, the military is on the hunt for Nirmata, the mysterious creator of artificial intelligence, who has now developed a new weapon that could turn the situation against America. Sergeant Joshua Taylor (John David Washington) is sent to the Republic of New Asia in search of Nirmata and the weapon, but is more eager to find his lost love Maya (Gemma Chan). Accompanied by soldiers, he finds neither Maya nor weapons - only a 'simulant' (the most advanced form of AI) in the form of a child with unique powers. Despite his hatred of AI - his family were killed in the LA explosion - Joshua has no choice but to pair up with this young girl, whom he calls Alphie, in the hope that she will lead him to his beloved Maya.\r\n\r\n\r\nWatching The Creator, if you have experienced sci-fi cinema before, you will quite often have a sense of déjà vu, as the filmmakers have stitched together elements from numerous previous works of the genre. You will therefore find the spectre of plot ideas from such productions as Blade Runner, Akira, The Terminator, District 9 and even Apocalypse Now, Leon the Professional and Terrence Malick's The Thin Red Line. And these are just a few examples. At the same time, the authors of \"The Creator\" have managed to put these elements together in such a skilful way that the whole is an independent, original achievement, although every now and then it is reminiscent of its great predecessors.\r\n\r\nWhat we have here is a war with AI, road cinema, the story of a chosen one who is to save the world, or at least change the fate of the conflict. In the background, tragic love. Along the way, there is no armchair-pressing twist waiting for us, so 'The Maker' is, for all intents and purposes, a basically predictable work. But also fresh enough to hold the viewer's interest. At least in theory. The visuals are excellent (although too many of the spectacle scenes were shot in the dark - a constant problem for Hollywood, which thus solves the problem of costly fine-tuning of CGI effects). Edwards and the team have created a world of the near future that looks realistic. The action is largely set in Asia, which also adds to the exoticism of the whole thing and takes us away from the standard sci-fi cinema images. There's a kind of visual poetry and sensibility in 'The Creator' that you don't often find in this genre of cinema (and watching it on big IMAX screens, if you have the opportunity, only enhances this). The problem begins, however, when we get to the script. Because skilfully piecing together a script from classic sci-fi tropes (and more) is one thing, but creating an engaging and full-blooded story out of it all is another. I, unfortunately, did not find great layers of emotion in The Creator, although the filmmakers were clearly trying to emotionally engage the viewer.\r\n\r\nI am sorry to say that I did not care about the fate of the main character. The problem lies partly in the script, but also partly in John David Washington himself, who plays him. Denzel's son may not be a bad actor, but he doesn't have even half the charisma of his father, on top of which his roles so far have been waspish every time, even when his characters weren't meant to be that way at all. I don't believe him when I see him concerned, scared, angry, loving. For me, he's an actor fit to play cold mercenaries in war films. There is a kind of indifference, an absence in his gaze. On top of this, the heart and soul of 'The Creator', as I understand it, was supposed to be in the forming relationship between Joshua and Alpha, but unfortunately I found it hard to believe in the emerging bond between them, as it was presented unconvincingly, rather rushed and a bit more along the lines that the viewer is just supposed to believe at some point that the two have taken a liking to each other, although we don't really see on screen when this happened or why. Also, the finale, while most impressive, feels chaotic, rushed and not entirely satisfying. Other than that it was easily predictable.", "created_at": "2023-11-22T08:34:47.529Z"}, {"movie_id": 670292, "review_id": "6587b9ae4da3d463f541c94c", "rating": 10.0, "review_text": "The ensemble cast delivers commendable performances, with standout moments from supporting actors like _**ken watanabe**_, who portrays a father of AI developer, and Madeleine Yuna Voyles, who brings a magnetic presence to the role of Alphie. The chemistry among the cast adds layers to the characters, grounding the film in a relatable human experience amid its futuristic setting.", "created_at": "2023-12-24T04:55:10.446Z"}, {"movie_id": 670292, "review_id": "6589dfb0688cd057eb856a06", "rating": 6.0, "review_text": "Movie had a solid start, but got bogged down in the last half. Kind of a waste since it looked pretty cool.", "created_at": "2023-12-25T20:01:52.515Z"}]