[{"movie_id": 456740, "review_id": "5cb5b93592514108cef3c677", "rating": 4.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nGuillermo del Toro's pair of Hellboy movies were always pretty acclaimed by both critics and audience. So, if a reboot was in the works, it had to be way different from the originals or, at least, capable of separating itself from them. Neil Marshall's film is definitely distinct, but not in a good way. Sadly, this is one of the worst movies of the year, so far. David Harbour tries super hard to bring this story to safe haven, but his outstanding performance can't fight back all of the painfully long and repetitive exposition dumps, an editing worthy of a Razzie Award (if they had such a category), and cringe-worthy comedy bits.\r\n\r\nThe trio of writers failed in almost everything. Even Hellboy, as a character, becomes a caricature of himself at one point. Milla Jovovich, who is not a bad actress at all, offers such an over-the-top display that only comes off as cliche, cheesy, and the complete opposite of menacing. Obviously, her extremely villainous script doesn't help. Sasha Lane (Alice) is the only one who actually portrays a likable character (excluding the protagonist) and delivers a compelling performance. Daniel Dae Kim is also good as Ben Daimio. Unfortunately, a talented cast is not enough to overcome the undeniable screenplay issues, which tells a convoluted story, filled with heavy exposition through annoying flashbacks (I lost count of how many there are).\r\n\r\nThe rock'n'roll score doesn't always work, becoming uneven and making some transitions just weird. However, credit where credit is due, it does make the action sequences a lot cooler. There are some great action moments where Hellboy shines, but overall they are ruined by sloppy editing. Honestly, I don't know how Marshall can direct such beautiful one-take fights (or \"stitched one-take\" sequences, like one towards the end) and horribly edited ones in the same film, so many times. The visual effects disappoint as much as they impress, but Hellboy's makeup and costume are, at least, on-point. In the end, the story and the characters are the two pillars of any movie, and Hellboy fails to deliver a well-written and captivating adventure, as well as compelling characters.\r\n\r\nAll in all, Hellboy is a huge misstep in Neil Marshall's filmmaking career and he's going to have to work hard to get another opportunity at a blockbuster. His film is already suffering losses at the box-office, which proves that the interest in the reboot of this franchise is not big enough to warrant a sequel. Admittedly, it has its good moments and David Harbour embodies his character seamlessly, carrying the movie for as long as he can. Nevertheless, a good cast and some occasionally cool action sequences are not enough to fight back writing issues, uneven soundtrack, cheesy comedy, heavy exposition dumps, and the worst editing I've witnessed this year, so far. It's a headache that most people might not find worthy of the price of admission...\r\n\r\nRating: C-", "created_at": "2019-04-16T11:15:01.063Z"}, {"movie_id": 456740, "review_id": "5d5d92536743fa0016703c4b", "rating": 8.0, "review_text": "Despite the less than stellar ratings this movie has received I have to say that I quite liked it actually. It is a much more violent, gory and adult movie than the previous Hellboy movies and this is probably contributing a lot to my appreciation of it. I so dislike when they dumb down a story or character just because the bean counters think they can get more kids to watch it and thus make more money. Or worse, because they want to cater to the easily offended whiners.\r\n\r\nThis movie starts off already in the first scene where the language make it clear the easily offended should have stayed home. It continues in the same manner. It is indeed a quite violent movie with a lot of gory effects. At least for a movie based on a “regular” US comics book character. When the big demons are released towards the end of the movie and the human casualties mount the movie becomes quite inventive in the various gory ways a human can be killed.\r\n\r\nThen we have the scene with the “birth” of Hellboy which is, luckily, fairly true to the original story and shows not only Nazis but doesn’t resort to any SJW dumbassery and tries to obfuscate parts of the Nazi uniforms. Instead the swastika is displayed as it should be. That should be enough to get most SJW whiners to shit themselves. Needless to say there is not much politically correct preaching in the movie either which is a relief.\r\n\r\nThe story is fairly okay. Nothing really to write home about but not really bad either. The action is, obviously, quite good. Hellboy himself is played fairly well by David Harbour and Ian McShane is not bad at all as Professor Broom. Milla Jovovich never really shined as The Blood Queen though.\r\n\r\nThere are a few things that where not stellar as well though. That warthog looking changeling which played a central part of the movie was often just ridiculous and the outburst by Hellboy and rant about why humans and demons could live in piece or something was completely unnecessary. Also, I felt that Hellboy was on the receiving end of the clobbering a bit too much. It was really not until the six-month-after scenes at the very end that he really displayed the self confident ass-kicking character that I would like to see him as.\r\n\r\nAnyway, I quite liked the movie and it’s a shame that it didn’t get better ratings. That Rotten SJW tomatoes gave it shit ratings was expected of course although even with their new censored user rating system they didn’t manage to get their “audience” to get in line with their “critics”. 17% critics rating while over 50% of the audience gave it a rating of six or more. Big fail again RT.\r\n\r\nThe after scenes made it quite clear that they hoped for a sequel but with the poor performance I do not think that will happen. A shame if you ask me.", "created_at": "2019-08-21T18:49:55.645Z"}, {"movie_id": 456740, "review_id": "5d620d4854f6eb34db9b4773", "rating": 5.0, "review_text": "I don't really get the intense vitriol directed at the 2019 _Hellboy_. I mean it's not especially good, it's certainly worse than both del Toro movies, but the absolute dogpiling it got doesn't seem 100% warranted to me. There does seem to be a lot of mismatches in the developmental process that are very apparent in the final product though. \r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-08-25T04:23:36.079Z"}, {"movie_id": 456740, "review_id": "5d6701a82790bf0010325089", "rating": 4.0, "review_text": "I may not be a big fan of Guillermo Del Toro (talented filmmaker but I don't stand at attention with his every project), yet his visual flair was on display with 2004's Hellboy, something that was sorely lacking in this reboot. Also lacking was Ron Perlman's stellar charm, something David Harbour, fine actor and all, didn't possess underneath the comic-accurate make-up and prosthetics. But beyond all that, this was an ugly movie with no creativity and, quite frankly, outright dull at times even during the action scenes. It was only two hours but felt so much longer, happy to see it flopped at the box office.", "created_at": "2019-08-28T22:35:20.081Z"}, {"movie_id": 456740, "review_id": "5dcbd79579a1c30013444adf", "rating": 3.0, "review_text": "If Guillermo del Toro’s version of Hellboy is the imaginative grand symphony, this version is the discordant heavy metal little brother. Based on “The Wild Hunt” and “The Storm and the Fury” storylines in the comics doesn’t save it, either.\r\n\r\nLacking the Del Toro’s vision, the character and monster designs are pedantic at best. David Harbour plays the titular infernal hero and while at first the costume design seems grittier than Ron Perlman’s Hellboy, it becomes clear very quickly that, while Perlman became the character and almost seemed to meld with his costume, Harbour seems to be fighting his costume. It’s like watching one of the most uncomfortable and anxiety-ridden wrestling matches one can imagine. I kind of felt sorry for Harbour as he’s a good actor with the right material, but he got handed such terrible material to work with. To his credit, it’s clear that he does try to sell it, but when you’re selling crap, it’s still crap.\r\n\r\nThe characters come off more as caricatures. Their relationships are so basic and one-dimensional even if they exist that we find that we don’t really care. And that’s the major problem. The stakes aren’t built up enough to make us care. It’s a good versus evil comic-book film and we don’t really care whether the good guys live or if the bad guys win. Making the audience care and identify with the characters should be the bread and butter of “Hellboy.” Instead, we’re given a cracker and told to run along and play.\r\n\r\nDon’t bother unless you are a major fan of the comics or the actors and simply HAVE to see it. Even then, you might want to consider steering clear as it could taint your love for these.", "created_at": "2019-11-13T10:14:45.539Z"}, {"movie_id": 456740, "review_id": "62dfae32d2b2090055ca2b95", "rating": 9.0, "review_text": "I went into this movie with low expectations. Ron Perlman was my perfect Hellboy. David Harbour was so good I hardly noticed a difference which is saying a lot. I think David put in a lot of research and work into trying to be a little bit like Ron but he also made this part very much his own. I actually found myself liking his version so much better because it felt more solid. It captured the spirit of what hellboy is supposed to be. I truly did enjoy this movie from start to finish. Beautiful visuals, story was very decent, the lore was very interesting... I would recommend this movie for anybody who liked the previous Hellboy movies even if you like Ron as Hellboy please consider giving David a chance because he kills it in so many good ways.", "created_at": "2022-07-26T09:04:50.339Z"}, {"movie_id": 456740, "review_id": "63bf8740a5743d00890f7bb0", "rating": 1.0, "review_text": "Horrible.\r\n\r\n\"If humans didn't kill monsters, maybe monsters wouldn't be that bad.\"\r\n\r\nI guess, maybe, the good thing I can say about this movie is that, if you are part of the \"everything has to be political all the time,\" crowd...it injects the obligatory The Last Jedi woke politics...just to make sure everyone won't complain that there wasn't a political injection in a super hero movie.\r\n\r\nBut then, that's kind of a trope of all bad movies lately.\r\n\r\nReally though, from the start it makes a point to bore the audience to death with not one, but fiver separate introductions that drag on for far to long and introduce us to concepts and characters that have, well, absolutely nothing to do with the movie.\r\n\r\nAnd then to rush it's way through the second act--that the audience probably would have been interested in if they hadn't rushed their way through it, assuring that, by the time the conclusion comes around everyone is sufficiently bored and irritated enough not to care or really even be amused at what should be the bulk of the action and the most exciting part of the film.\r\n\r\nIn other words, it's the type of movie that people are tempted to walk out of.", "created_at": "2023-01-12T04:06:24.054Z"}]