[{"movie_id": 10739, "review_id": "608aea0b2588230026912005", "rating": 6.0, "review_text": "_**What it's like to have a nutty, morally loose girlfriend in New York City**_\r\n\r\nJerry (Jason Briggs) is a fledgling writer in the Big Apple with an inept agent (Danny DeVito). As Jerry starts a relationship with a loose girl (Christina Ricci) he gets counsel from an older writer with a great vocabulary named Dobel (Woody Allen), usually while walking Central Park. Stockard Channing plays the girl's irritating mother and a young Jimmy Fallon has a cameo.\r\n\r\nWritten & directed by Woody Allen, \"Anything Else\" (2003) is a dialogue-driven romantic comedy that reflects on the mysteries, absurdities and ironies of life while focusing on the attraction and power of a nubile woman. Briggs is a quality protagonist and I enjoyed Jerry and Dobel's mentee/mentor relationship. Dobel uses a lot of obscure terminology so I recommend using the subtitles to keep up with it, as well as the low-key humor, which is quite entertaining. It's also nice to see Erica Leerhsen in a small role.\r\n\r\nChristina looks great and is a fit as can be, but her morally loose character is a mass of conflicting impulses. Her actions are controlled by whether or not she's excited by her sexual partner and, of course, only a new partner excites her, which means no sexual relations with a man once he becomes \"old hat.\" While she's looking to find excitement elsewhere Jerry does everything he can to keep the relationship going, which is hard to do when the girl's obnoxious mother is living in the same apartment. \r\n\r\nNot only is it frustrating for Jerry to deal with this situation, it's frustrating for the viewer as well. No doubt these types of aggravating people and relationships are the point of the movie, and it IS amusing to a point, but it naturally makes the viewing experience aggravating as well. Plus sympathy for Jerry only goes so far; after all, he's the fool who dropped his perfectly suitable mate (KaDee Strickland) to pursue the sexy-but-unfaithful new girl. In short, he's sleeping in the bad he made.\r\n\r\nNevertheless, the movie’s witty, thought-provoking, well made and performed. It’s one of Tarantino’s 20 favorite flicks from 1992-2009.\r\n\r\nThe film runs 108 minutes and was shot entirely in New York City.\r\n\r\nGRADE: B-", "created_at": "2021-04-29T17:16:59.615Z"}]