[{"movie_id": 8870, "review_id": "55880401c3a36837e9006290", "rating": 6.5, "review_text": "Here comes a billion dollar campfire. At least it's good for something.\r\n\r\nThe second of the Mars based box office bombs released in 2000, Red Planet is maybe - just maybe - worth a revisit by some who were irritated by it back on first viewing. Once knowing that this is not going to be some action packed alien movie, that it's a survivalist drama that tips its hat to 1950s sci-fi schlock, that cares about its characters, then there's a decent popcorner experience to be had here. \r\n\r\nThis is not to say it's a genius entry in the sci-fi pantheon, because it's not, the same problems still exist; Terence Stamp is woefully under used (seriously they could have got any low paid character actor to play his role), some things either don't make sense or are left unanswered, and of course it still drags in the middle as the boys chatter away on Mars whilst Carrie Anne-Moss is up at base station fretting and suffering erectus nippleus.\r\n\r\nYet there's fun to be had here, some nutty science marries up with nice photography and splendid set design, and the makers know what sort of picture they want to make. Where Mission to Mars sunk under the weight of its own pretensions - trying to go all elegiac and important, Red Planet nudges and winks and asks you along for the ride. So get on board and take it for what it is, a pretentious free zone with good human drama at the core. 6.5/10", "created_at": "2015-06-22T12:48:01.003Z"}, {"movie_id": 8870, "review_id": "5ec39501d2147c0023b96122", "rating": 4.0, "review_text": "_Red Planet_ has so much going on, and it doesn't have control of any of it. Not a single actor fits their character, except possibly Carrie-Ann Moss, who spends basically the entire runtime too benched to really count as a character in 99% of the story anyway.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2020-05-19T08:12:49.798Z"}]