[{"movie_id": 304410, "review_id": "559d782392514125120003ac", "rating": 9.0, "review_text": "> When the singing bird flies away from the nest...\r\n\r\nLooked like a normal drama, but I had a lot of laughs in the first half. And it was a completely opposite in the second part where it touched me deeper. It has been months I haven't had tears in my eyes for a movie. This was an excellent family movie with lots of good things about life and family in it. This was the closest one I ever got to one of my recent favourite music-drama from the Canada, 'Gabrielle'. There's no major comparison between the two, but similar movies with different characters and settings. The theme wise it was another version of 'Billy Elliot' for sure.\r\n\r\nThis was not about your typical rural family. It was a rarest where they are going to witness the next stage of the life's journey as a united family as well as individually. Being a member in a deaf family, especially when everyone somewhere, somewhat depends on you is a task needs devotion. But when you realise you are gifted with something valuable, what will you do and how your the family reacts. That's what the story is and illustrated with excellent bunch of characters.\r\n\r\nLike I said earlier, the end scene will test your emotional level, but hard to hold it back, especially you are a kindest in nature. If you are having it with a numerous disturbances and lost concentration, then it will become an ordinary movie. One of the reasons for the mean people to say 'I'm a grown up man'. Does not mean men won't cry, but some they just hide it, that's all. In a such occasion when you are uncomfortable showing your emotions, then I recommend you go for it alone and have a good time.\r\n\r\n> \"Being deaf does not excuse everything.\"\r\n\r\nIt is not unusual for a movie to have the flaws, some will be neglectably small, but some will be strongly visible. It was the sign language that leaves a blank page as an invisible dialogue that we never get. I had a tough time understanding some parts of the movie. Instead, understanding the lines that said with gestures, I managed to follow the situation of the story and the scene. It would have been the same even it was an English language movie, hardcore subtitle would have been a better solution.\r\n\r\nIn the middle, the narration failed to keep up the momentum. Barely any interesting stuff occurs. It was a time when in the storytelling to take place a leap. Apparently only for that instant, but once you complete your watch, it does not seem much affected portion in the film. Interesting, the story began to break into multiple and tried to move in all the direction. Election campaign, brother's crush on his sister's friend, like that. But cleverly held back to the one line for the sentimental conclusion.\r\n\r\nDoes not feel like it was the first film for the lead girl Paula. She might have missed the title in 'The Voice' competition, but she has won an award for her lovely role in this movie. I am not a French nor English nor from the other Euro zone, and I don't know the songs from the movie, but loved them all. The lyrics were so good, especially that final song. A highly recommended movie for the families.\r\n\r\n9/10", "created_at": "2015-07-08T19:21:07.709Z"}]