[{"movie_id": 960206, "review_id": "6437e96bab684901261999a3", "rating": 7.0, "review_text": "Fr. Lucas (Elliott Crosset Hove) is despatched by his bishop to a remote settlement in Iceland where he is charged with building a church and establishing a parish. Upon arrival, he is met by \"Ragnar\" (Ingvar Sigurdsson) - a rather unwelcoming man, who is tasked with guiding him to the hamlet many days trek away. Their journey tests the mettle of the young priest. The hostility of the environment, the indifference of his travelling companions, the cold, the wind, the rain - all of these make him consider seriously what he is doing and whether he actually has the faith. His exhaustion causes him to finally fall from his horse and upon wakening we discover that he has luckily arrived at his destination and is being nursed by \"Anna\" (Vic Carmen Sonne). He is broadly welcomed and the construction of his church proceeds but he is not a man at ease with his surroundings, his new-found parishioners and but for an increasingly close relationship with \"Anna\" would be an inch from despair. Is this a place where he can settle and live? The cinematography is gorgeous - make sure you take a jumper when you watch it. The sheer inhospitableness of this island. It was hardly a place for the indigenous ponies, it is certainly not a place for a clergyman used to home comforts now reduced to sleeping in a thin canvas tent! He was a photographer - and the film is inspired by a small collection of his photographs that were found. it was possibly this photography that he felt gave him a purpose as the man we see at the end bears little resemblance to the one we meet in Denmark at the beginning. This features a very strong performance from Hove. He manages the transformation of his character well and that encourages us to feel invested in him and his conflict. I did not enjoy, nor really understand, the last fifteen minutes. The story takes a turn for the brutal and the tragic in a way that seemed to me unnecessary and somewhat inexplicable. Cause and effect - but why? Perhaps I missed something? Anyway, this is well worth watching and though a bit long, is quite thought-provoking at times.", "created_at": "2023-04-13T11:37:15.111Z"}, {"movie_id": 960206, "review_id": "649f4f2b4a52f800af1170f4", "rating": 7.0, "review_text": "What is God? Is it a reasoned, rational civilized entity or a wild, untamed force full of untamed power in search of being reined in? And, in light of that, then, what kind of relationship are we supposed to have with this elusive divine enigma? That’s one of many unexpected challenges put to a young Lutheran priest (Elliott Crosset Hove) who’s charged with building a church in a small community of Danish immigrants transplanted from the homeland in late 19th Century Iceland, the so-called “unforgiving island.” But, rather than sail directly to his new future home, he chooses to land on the island’s southeastern coast and cross the diverse terrain to his destination, partly to get to know the land and its people but also to indulge his hobby as a pioneering photographer. Once there, however, he gets more than he bargained for, given the difficulty of the journey and the many extreme differences in language, sensibilities and rugged lifestyle compared to the more genteel Denmark he left behind. This combination of elements tests his wits, his patience, and, above all, his faith, as events unfold in unforeseen and potentially disturbing ways. It’s an evolutionary journey for which he’s unprepared and often unable to fathom, prompting him to question much of what he believes and how he conducts himself. The result is a thoughtful meditation on these issues, featuring positively stunning cinematography, fine performances and superb production values. The pacing is surprisingly well balanced, too, especially for a film with a 2:23:00 runtime, though some of the picture’s montages – as beautiful as they are – probably could have been dialed back somewhat without significantly impacting the finished product. Writer-director Hlynur Pálmason’s fact-inspired tale is arguably his best work to date, but be sure to give this one the time that it deserves to thoroughly appreciate and enjoy it, both for its sheer beauty and for everything it has to say about the divine and the place it occupies in our lives.", "created_at": "2023-06-30T21:54:51.320Z"}]