[{"movie_id": 87421, "review_id": "5233fae8760ee323d10f66ba", "rating": null, "review_text": "nice movie", "created_at": "2013-09-14T05:58:00.232Z"}, {"movie_id": 87421, "review_id": "527b01ef19c2952a090e6077", "rating": null, "review_text": "After trying to move the character to more epic levels in ‘Chronicles of Riddick’, and failing to capture an audience, this third installment in the series, simply titled ‘Riddick’,  is a return-to-basics for director David Twohy. It quickly sets itself loose from the baggage of ‘Chronicles’ and pursues a more clear-cut survival action story that might as well be titled ‘Pitch Black 2‘.", "created_at": "2013-11-07T02:58:55.470Z"}, {"movie_id": 87421, "review_id": "56ee01bb9251416a2a001166", "rating": 7.0, "review_text": "Maybe you're all scared of the wrong thing.\r\n\r\nUnsurprisingly reactions to this, the third outing for Vin Diesel's sci-fi based anti-hero, has been very mixed. In truth it's hardly a great film of the \"must see\" kind, and it does in fact cleave very close to Pitch Black, the first and most superior of the Riddick trilogy. However, there's a whole bunch of science fiction fun to be had here.\r\n\r\nPlot has Riddick left for dead on a inhospitable planet, where he finds himself up against some alien creatures. His only hope of getting off the planet is to bring notice of his whereabouts, which brings two ships to where he is. Both with crews who have differing reasons for wanting to capture the enigmatic convict...\r\n\r\nAnd thus we get a beautifully filmed sci-fier that features beasties of both the human and alien kind. Action and moody histrionics are never far away, and Diesel is wonderfully muscular, macho, course and scary. Some of the CGI is weak, and naturally much of the film's coincidences and contrivances have to be forgiven if one wants a popcorn and beer good time of it. 7/10", "created_at": "2016-03-20T01:49:47.353Z"}, {"movie_id": 87421, "review_id": "5bacc7e2c3a3683aaa03ba7c", "rating": 6.0, "review_text": "**(Note: This review is of the theatrical version, I have seen the uncut version and it is an improvement, but have not reviewed that edition)**\r\n\r\nIn this latest incarnation, Riddick goes boldly goes where no previous entry has gone before: Nowhere.\r\n\r\nSay what you will about the previous film (_Chronicles of Riddick_) at least it had the guts to take some risks. Sure, almost all of those ended up being complete misfires, but they were still taken. Riddick on the other hand plays it safe. It’s a path not entirely without benefit, but one that was not expected from the series spawned by Australian cult-classic _Pitch Black_.\r\n\r\nShoot me for saying it but I’m actually a huge fan of Davind Twohy (_The Arrival, Waterworld, G.I. Jane, A Perfect Getaway_) so I actually sort of hoped for more from the piece. Sure _Chronicles_ was silly and disjointed, sure _Dark Fury_ was totally unnecessary and _Dark Athena/Butcher Bay_ were only intermittently decent, but overall the Riddick franchise will always be compared to _Pitch Black_, and against this prodigy, the latest movie is simply subpar.\r\n\r\nThe Necromonger storyline has been all but dropped, any connections to previous characters (sans Riddick) are completely unbelievable and the events are a shameless rip off of the first film. Seeing a more “survivalist” and intelligent Riddick is nice, as it’s always been sort of more insinuated than outright shown. The entire world that the events of the film take place on is even moderately interesting, and none of the actors or characters are outright let downs, but overall Riddick falls much closer to the “barely watchable” category than the “brilliant” one.\r\n\r\nIt’s “cool”, it’s pretty and it’s most certainly entertaining, but it’s not new, it’s not clever, and it’s most certainly not as good as _Pitch Black_.\r\n\r\n66%\r\n\r\n-_Gimly_", "created_at": "2018-09-27T12:06:58.816Z"}, {"movie_id": 87421, "review_id": "5f98efca048638003821272b", "rating": 8.0, "review_text": "The third Pitch Black film \"Riddick\" is much more focused than its predecessor and a welcome return to the formula that worked so well for the original movie. Riddick is a bad-ass survivalist fighting an extinction level event that threatens everybody, with an assembly cast that is colorful and fun to watch.", "created_at": "2020-10-28T04:12:58.782Z"}]