[{"movie_id": 9740, "review_id": "5ee0e2fbf36a32001e8cdc5a", "rating": 6.0, "review_text": "Certainly the weakest of the Anthony Hopkins _Hannibal_ movies. Having read the books before I watched the movies, that actually does sort of track, as the first two books were better than the third. Even so, I actually think _Hannibal_ does the worst job of adapting the source material too. Looks pretty good and there's quite the cast list (although I don't think many of them are exactly giving career-defining performances here), Julianne Moore is fine as Clarice Starling (although not as good as Jodie Foster), and the story isn't **bad**, but if I'm being honest, I typically give this one a skip whenever I'm revisiting the Lecter mythos. \r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2020-06-10T13:41:15.266Z"}, {"movie_id": 9740, "review_id": "64f2e505caa508014c8c94bd", "rating": 6.0, "review_text": "As sequals go, this isn't a bad one - but somehow we are a bit more sanitised to the evil of Sir Anthony Hopkins' \"Hannibal Lecter\" in this; and Julianne Moore doesn't quite have the intensity of Jodie Foster as FBI agent \"Clarice\". The story is also a bit too contrived: Millionaire Gary Oldman (\"Verger\") tries to use \"Clarice\" to lure, for motives of revenge, \"Lecter\" out from his secret existence as a museum curator in Florence. Once she discovers where he is, she alerts the carabinieri to keep an eye on him; one of whom quite fancies the reward so tries to take matters into his own hands... Hopkins returns to the US with only one aim in mind, and a cunning game of cerebral chess ensues. It comes across as more of a compendium of short stories rather than as a flowing narrative; there is still plenty of gruesomeness, but without the subtlety - the script isn't at all sophisticated; and though there is plenty of classical music trying to replicate some of the class of \"Silence of the Lambs\" (1991) it just doesn't quite work. It's a good enough effort, but just lacks that je ne sais quoi.", "created_at": "2023-09-02T07:32:21.267Z"}]