[{"movie_id": 22825, "review_id": "556b0561925141540800253f", "rating": 6.0, "review_text": "If you push the button, two things will happen.\r\n\r\nThe best quote I ever saw as regards Richard Kelly's The Box, was that it is a Marmite movie. Marmite is a food substance that people either love or hate, The Box is a Marmite movie. \r\n\r\nCameron Diaz and James Marsden star as a couple who are visited by a mysterious stranger (Frank Langella) who has a bizarre offer. The Box now in the couple's possession has a button (Langella's mysterious Arlington Steward informs them it's called the Button Unit), they are told that if they push the button then a complete stranger will die, they will then receive a life changing amount of money. What to do?. \r\n\r\nBased on a Richard Matheson short story titled \"Button, Button\", The Box is an ethereal mind meld of a piece. Morals and ethics are married up to a whole bunch of twists and other worldly ideas, which goes some way to explaining that where once there was a more than adequate half hour \"Twilight Zone\" episode (Profile in Silver/Button, Button 1986), there is now a near two hour movie crammed to the brim. It's this that hurts an otherwise stylishly produced and potentially thoughtful picture. \r\n\r\nAfter the raves and craves for his \"Donnie Darko (2001)\", Richard Kelly appeared to believe the press praise, that here was a new surreal director on the block. Where \"M. Night Shyamalan\" had success with the twist gimmick and couldn't let it go until his career went in the swamp, so to Kelly who kept straining to make movies that were needlessly over complex, trying to be smart when it isn't needed (\"Southland Tales (2006)\" is a car wreck of a movie). The Box does have intelligence and lots of good ideas, but a two hour film it does not make, with the attempts at weaving all the threads together proving to be too problematic come the finale. Incredulity a most appropriate word, plausibility is not. \r\n\r\nThe Box, an intriguing - attractive - failure, but some do and will love it. If you haven't seen it then roll the dice and good luck. 6/10\r\n\r\nFootnote: We have yet to actually get an adaptation to screen that contains Matheson's original literary ending!", "created_at": "2015-05-31T12:58:09.863Z"}]