[{"movie_id": 347026, "review_id": "596796ce9251413418003e04", "rating": 8.0, "review_text": "**The story of two kingdoms.**\r\n\r\nIt got the mixed responses from all the quarters, but I had a little doubt that did I watched the same film! Because it was much better than what I have had heard from them. It's a biographical romance- drama from the director of 'Belle'. And like the inspiring life stories of Gandhi, Mandela, Martin Luther King Jr. et cetera, this one falls in the same line. All of their life events set in different kind of geopolitical scenario, so do this man's. But it was like differences in the family, which led to geopolitics. Anyway, the history book says, all the great struggles began with some game changing incidents like in this story.\r\n\r\nSeretse Khama, a king to be to a Southern African nation, now known as Botswana. His/this story was not filled with any violence. In fact, there were none, but political tension was at high. More or less, everything depicted in the film was like a chess game. Each opponent had their time with their pawns moved in the right direction to check their opponents. So he had to play accordingly for his nation and its people. I think he handled so well without any violence and that's why this film was merely a simple drama rather than packed with full of twist and turns and stunts.\r\n\r\nLike any biopic, it is an inspiring film. The implementation of non- violent tool to fight back was at its best in a film I've seen. Though, he was not like the most intelligent man, fighting it on his way, but an average man with a good education and character. The film opened with his final days in London as his law practice is coming to end. Then, unexpectedly, he meets a white woman. After going out with her for a few dates, they find love for each other. The real hurdle comes between them when the Britain government tries to break their relationship because it would affect their interest in his resourceful nation in Africa and peace with their neighbours.\r\n\r\n> ❝Let us not allow the ugliness of this world to take our joy away from us.❞\r\n\r\nAs he was banished from returning to his native, separated from his family, how he works hard to bring the peace and stability to the region, especially to come out of the British oppression was the rest of the story to focus on. An amazing film. I liked it because it was not about heroism or working under a spotlight since he comes from the royal family. His simplicity of life and approach to all the problems was uplifting. I never heard that a nation ever got its independence without spilling a drop of blood. This is the one, at least for me. I mean no guns, or any other kind of weapons, except small, small protests impacting big way. But the big sacrifices were made in other ways. That's the major reason for I love it.\r\n\r\nBased on the book, 'Colour Bar'. The screenplay was slow, but it required to slow down to impact the atmosphere of passing time as the film spans with just important events for 4-5 years. So, assuming the film lacked depth is a misconception. Shot in both England and Botswana. The two different continents and its landscapes tell the story of its own. I mean the long distance between these two nations and distinct between the cultures, their own agenda to fight what's right for them. The initial part was like a pure romance film, and then suddenly the political tension takes the centre stage. Between the romance and politics, the narration keeps its flow without much progression in the middle section. Yet, impressive.\r\n\r\nAs for me, Seretse Khama was a much, much better role than Martin King Luther Jr. that the David Oyelowo has played. But that role was more popular as it was an American. So this film needs a big uplifted, since the film has not reached a wider audience. Felt like I'm seeing Rosamund Pike after a long time. She was excellent as Ruth. The rest of the cast in the small parts were not bad. It was an Oscar product, but no one ever mentioned that. If you are interested in history of Botswana, particularly in the time surrounding its independence, you should try it. But I think it is a must see film, one of the best films based on a king, a freedom fighter and a husband.\r\n\r\n_8/10_", "created_at": "2017-07-13T15:50:38.208Z"}]