[{"movie_id": 31011, "review_id": "571fe63192514152e7000835", "rating": 5.0, "review_text": "Quite a disappointment. I was expecting much more from this movie but the story is just boring and uninteresting. Jared Leto makes a good performance (the movie is just tailored for him) and they are also good Kruger and, specially, Regbo and Temple.\r\n\r\nHowever, as I said, the story is quite pointless. The movie finishes and you just feel like you have watched a bad joke without purpose.", "created_at": "2016-04-26T22:05:37.402Z"}, {"movie_id": 31011, "review_id": "61a3e3b06332f7002b28cf4e", "rating": 10.0, "review_text": "Really awesome movie. It's kite hard to understand at first and will require 1 or 2 rewatches to pick it up.\r\n\r\nIt's the kind of movie that doesn't hold spectator's hand to explain what's happening, but it's also not the kind of movie that messes up and nothing makes sense. All the info we need is presented, just not on a clear way. Some ppl may even need to do some research on physics concepts, entropy, etc.", "created_at": "2021-11-28T20:16:48.043Z"}, {"movie_id": 31011, "review_id": "638366bd1b157d00c9f876f4", "rating": 7.0, "review_text": "I always find Jared Leto very easy to look at, but rarely does his acting ever amount to very much. Not so, here. This is quite a quirky and innovative drama that sees his life as \"Nemo\" depend on one simple decision he must make. Ought he to stay with his separating mother or father? This choice will, naturally, impact on how his life and the life of many others will pan out as we soon discover that scientific advances have ensured that he has survived to become the last \"mortal\" centenarian left on Earth. These permutations that ensue vary from the pedestrian to the surreal, and the characterisations offer us a little more depth to the scenarios as we all experience the consequences of his actions, and those invite a bit of thought, even philosophising, as the ramifications affect not just him, but \"Elise\" (a strong contribution from Sarah Polley) and \"Anna\" (Diane Kruger). Toby Regbo bears quite a striking resemblance to Leto which helps his engaging representation of the fifteen year old \"Nemo\" and, indeed, all of the children who take on the junior years of the key roles deliver well, here. It is not a straightforward story, some of it made sense to me, some of it suggested that auteur Jaco Van Dormael had been sitting too close to the glue pot, but there is an effective intensity to the performance from Leto (and his wonderfully expressive eyes) as we embark on this roller-coaster ride. I did not love the conclusion - but don't know that I could have improved upon it either - you ought to give it a try and see what you think. It is long, and maybe that will deter some people as the pace isn't always consistent, but I'd say this is the best I've seen from this star.", "created_at": "2022-11-27T13:31:41.590Z"}]