[{"movie_id": 335988, "review_id": "59c0e2fec3a368044a00f6aa", "rating": 1.0, "review_text": "The _Transformers_ franchise has never been good. Some say that the series is \"Dumb fun with good action and cool explosions. To me, that could maybe be used to describe only the third movie. The first one is promising and has a certain \"child-like-wonder\" appeal. But neither of them are truly **good**. The second _Transformers_ is meaningless garbage.\r\n\r\nBut when _Age of Extinction_ was released in 2014, the franchise hit new, abysmal lows. Watching _Transformers_ wasn't just a chore, it wasn't just boring, it was excruciating. It was so bad I felt nauseous. I was aggravated to the point of brimming with feelings of genuine anger. They say that if a film makes you feel something, that is a victory in itself. Be it sadness, excitement, intrigue, joy, hope, nostalgia, hysteria, love, fear, warmth - whatever - I tend to agree with that statement. What I felt in _Age of Extinction_ was not a victory. It was a failure. A Guinness Book of World Records level failure.\r\n\r\n_Transformers: The Last Knight_, is at least that bad again.\r\n\r\nArguably worse.\r\n\r\nI guess it didn't dedicate an entire character to being a justification for paedophilia, so it has that up on its predecessor.\r\n\r\n_Final rating:½ - So bad it’s offensive. I may never fully recover._", "created_at": "2017-09-19T09:27:26.499Z"}, {"movie_id": 335988, "review_id": "5a071b36c3a3687847015698", "rating": null, "review_text": "Not surprisingly I expected this, the fifth installment, of the Transformers franchise to be pretty much crap. Especially after the abysmal fourth installment. To my great surprise I found it to be much less crappy than I expected.\n\nI honestly do not understand why so many people seems to think this is one of the worst movies ever. The critics sure, especially the ones at Rotten Tomatoes, but I do not really care about those self proclaimed \"critics\". Ordinary viewers is another matter. \n\nI mean, this is a transformers movie and it is directed by Michael Bay. That pretty much defines the movie from the start so what the heck did all those people complaining actually expect? That Michael Bay should suddenly care about things like script and stuff or anything else except big robots, special effects and explosions?\n\nPersonally I quite enjoyed this movie. Well, enjoyed in the context of watching a Transformers movie that is. I enjoyed the special effects, the robots, even the lousy jokes.\n\nI did enjoy the tie in to the Pendragon myth and I thought the somewhat bizarre Sir Edmund Burton and his even more bizarre robot butler was great fun.\n\nI laughed outright when I saw the World War 1 tank transformer. I was expecting the submarine transformer to actually transform though.\n\nMaybe all those detractors of this movie are missing the bimbo with two and a half brain cells (yes I am being generous now) that used to be the lead female character in the Transformers movies but personally I quite liked that the leads in this movie was much more mature and actually showed some evidence of intelligence.\n\nThe story? Well, for a Transformers movie it is quite good. In any other context it would be somewhat...lacking. It did screw quite a bit with the Transformers timeline established in the first movies though. Oh, and for some nitpicking, the maximum operating altitude of those airplanes they used is 21 000 feet, not 12 000 feet.\n\nBottom line, I had great fun when watching this movie. With my low, and I mean LOW, initial expectations I was very pleasantly surprised. It is definitely a huge improvement over the fourth instalment.", "created_at": "2017-11-11T15:45:58.296Z"}, {"movie_id": 335988, "review_id": "5a92b386c3a368250201d898", "rating": 1.0, "review_text": "Soulless garbage. Must have been written in less then 15 minutes. How hard can it be to write an entertaining film about transforming alien robots? If you're Michael Bay, very hard indeed. And the jokes. Wow. The jokes. I cringed after each and everyone. So many attempts at humour falling flat on their faces and smashing all of their teeth on the floor. The makers of this movie should be forced into exile.", "created_at": "2018-02-25T13:00:54.604Z"}, {"movie_id": 335988, "review_id": "6469edb72bcf670172b1ba14", "rating": 5.0, "review_text": "You know what? I didn't hate this one. Indeed I think it might actually be my favourite! Naturally alarm bells go off when you think your hear Sir Anthony Hopkins doing the narration. Surely not? As this latest outing for the unidentifiable mechanised battle-mongers takes shapes, though, there is actually a bit more of a story underpinning it. Of course there is a secret, all-powerful gizmo for them to discover and fight over and this time we drag in Arthurian legend, Stonehenge and a belted earl in the form of Sir Anthony. This film does have a sense of imminent conclusion to it too as \"Optimus\" sets off in search of his duplicitous creator \"Quintessa\" (Gemma Chan) with a view to a showdown that will secure the future of Earth for ever. Meantime, \"Cade\" (still Mark Wahlberg) and \"Lennox\" (a well past his best Josh Duhamel) are going through the combat motions as the legendary staff of \"Merlin\" has to stay out of the hands of the dastardly \"Decepticons\". This has more of it's tongue in it's cheek, it's less intense and takes itself less seriously than some of the others in the series. We still have to endure the rather supercilious monologues from the increasingly pompous \"Prime\" but this, for me at any rate, had more of a substantial sense of adventure to it. As usual, the casting - Laura Haddock is terrible - isn't up to much but keep an eye out for Stanley Tucci who clearly couldn't get enough after the last film and so comes back for a brief cameo here. It's rotten, forgettable and ought to be the last of these - but I still rather grudgingly engaged with it a bit more.", "created_at": "2023-05-21T10:08:55.344Z"}]