[{"movie_id": 10865, "review_id": "5f0cf735d5dbc20037e38adf", "rating": 8.0, "review_text": "Excellent.\r\n\r\nI had previously heard a fair bit of hype down the years regarding <em>'Atlantis: The Lost Empire'</em> and now, finally, I can understand why. It is very good. My favourite part of it is the animation which is exquisite, especially across acts one and two with the great amount of detail. The characters are cool, while the premise is pretty fascinating.\r\n\r\nMichael J. Fox is a superb cast as Milo, he is fantastic in the lead role. Honestly, none of the other voices stand out to me but that's not always a bad thing - especially in this film. There are no huge individual performances, away from Fox, but they all bounce off each other nicely.\r\n\r\nThe plot is very interesting, brought to life brilliantly by James Newton Howard's terrific score. It's not near the top of my Disney animated favourites, just through process of elimination really, but it certainly isn't majorly far off. It's a fun experience, one I'd recommend you see for yourself if you haven't done so already.", "created_at": "2020-07-14T00:07:17.390Z"}, {"movie_id": 10865, "review_id": "64f2e99e5f2b8d00e12b6bf3", "rating": 6.0, "review_text": "We start off watching the destruction of the legendary city before advancing several thousand years to meet \"Milo\" - a rather geeky young man whose grandfather had been obsessed with the mystery surrounding the lost continent. Gazillionaire \"Preston Whitmore\" recruits him on a perilous expedition to try and find the truth - so equipped with a submarine and a crew you just know have another agenda, off they go. The first forty minutes of this over-long adventure is much more reminiscent of something from Jules Verne, only spent on elongated character establishment scenarios, some borderline slapstick humour and by the time the film gets anywhere near it's sharp end, I could already feel a sense of ennui setting in. Michael J. Fox does inject some character as the young lad, and James Garner has his tongue firmly in his cheek as the completely untrustworthy \"Rourke\", but that can't really inject enough to create any sense of pace into this competently, but unremarkably, animated feature. The style of the artistry, though colourful, is clearly computer generated. The animations lack depth or texture and coupled with a really average storyline leaves this in a sort of Disney limbo. It is certainly not as bad as some that were produced ten years earlier, but it is still factory-style output that lacks for imagination and any of the traditional uniqueness that this studio used to deliver. It is watchable enough, but pretty forgettable.", "created_at": "2023-09-02T07:51:58.103Z"}]