[{"movie_id": 366080, "review_id": "5791f22dc3a368577d0006a8", "rating": 9.0, "review_text": "Kabali is a themed action pack movie with family bondings and wiping of villains. Kabali is old but he is still powerful with his strength. Kabali wins the heart of viewers through \"Rajni's\" themed dialogues and styles. A bit lag we feel here and there but still it doesnt stop looking at screens. Kabali is unique and its return of the king from caverns. Main villain (Tony Lee) has no special role rather than some dialogues and a final death push by Kabali even kishore also same. Movie goes for mass audience as expected and kabali moves like fire...", "created_at": "2016-07-22T10:15:09.781Z"}, {"movie_id": 366080, "review_id": "57ba6b6fc3a3687d8400243b", "rating": 6.0, "review_text": "The project Kabali evinced interest among the hordes of die-hard fans of Superstar Rajinikanth and other movie buffs right from the beginning - for, they were sure that this wasn't going to be 'another' Rajini film with the star playing to the gallery, with his successfully tried-and-tested histrionics. With Pa Ranjith, who won appreciation from all quarters for his previous film Madras, it isn't an exaggeration to say that Kollywood was waiting to witness an all-new Rajini, nay, in fact, the old Rajini, which many people felt they have been missing for many years. As his legions of fans were disappointed with his previous outing, Lingaa, which had the star trying to please his admirers with unconvincing romance, comedy and action, Kabali, undoubtedly, was going to be a 'do or die' game for both, the star and his fans. Has he made a 'comeback' ('payback' is the word fans have chanting for a while) this time, with more than enough reasons for his millions of fans to cheer? Let's check out. \r\n\r\n\r\nKabali: Official teaser\r\n\r\nKabali: 'Neruppu Da' song with lyrics\r\n\r\nKabali: 'Ulagam Oruvanukka' song with lyrics\r\n\r\nKabali: Official dialogue teaser\r\n\r\nKabali: Telugu trailer\r\n\r\n\r\nKabaleeshwaran aka Kabali (Rajinikanth), who was born somewhere in Dindigul, is the messiah of Tamil labourers who work in Malaysia, after he fights for their primary rights and wages. His rise to an influential person in the society, in a short span of time, is now giving sleepless nights to a few, which further fuels jealousy and enmity towards Kabali. Veera (Kishore) is one among those jealous, and keeps hatching plans to destroy Kabali's gang, and defame him publicly. He convincingly brainwashes an aide of Kabali and successfully turns him against the latter. After a violent gang war, which takes place unexpectedly, Kabali, being convicted of various false charges, ends up in jail. \r\n\r\nReleased after two-and-a-half decades, Kabali goes in search of his wife Kumudhavalli (Radhika Apte), who was pregnant when destiny separated them. He seeks the help of his old gang, including Ameer (John Vijay), who are more than happy to help him. Jeeva (Dinesh), an overly enthusiastic youngster, too, joins him as a loyal aide. Thamizh Kumaran (Kalaiyarasan), the son of a yesteryear aide of Kabali, who backstabbed the latter, is another person who promises to help the old Kabali, but is confused. Meanwhile, Veera is ruling the roost in the town, with his own empire and Tony (Winston Chao), one of the dreaded gangsters is his business partner. Will Kabali get his wife back? Will he be able to make up the years that he lost in jail? The suspense continues... \r\n\r\nThough, with Kabali, most of the audiences were expecting a 'Ranjith film which has Rajini', it is the Superstar, like in most of his previous films, who carries the entire film in his shoulders, even though other actors shine in their respective roles. His scores of fans, needless to say, are in for a treat, watching him in, probably, the most stylish and dapper avatar in his recent outings. His majestic screen presence and the fast movements in intense sequences make the film watchable. Radhika, who has been cast opposite him is apt and their chemistry, their combination scenes, though only few, are convincing. Watching Yogi (Dhansikaa) is a delight, given her stylish makeover and ease in fight sequences. The climax of the film, however, is something that one least expects from a Rajini film. Just when viewers erupt with joy, with Thalaivar finishing off the baddies in style, there comes an unconventional twist. \r\n\r\nAs Ranjith isn't a run-of-the-mill director, and is considered as someone whose screenplay and dialogues have hidden meanings, comparisons with his previous films are but in order. In Kabali, one shouldn't expect the freshness in script and making style which his Madras offered. The flashback portions, on occasions, test one's patience, and lack evenness. The songs by Santhosh Narayanan are soothing to watch on screen, too. The stunt sequences and shoot-out scenes choreographed by Anbarivu, with Rajini putting his best foot forward, is sure to give adrenaline-rush to his fans, and are, in fact, among the things that work in favour of the film, in addition to an emotional scene. The story, perhaps, needed a tighter screenplay, but watch it for 'Thalaivar athiradi'. Nothing more, nothing less!", "created_at": "2016-08-22T03:03:11.808Z"}, {"movie_id": 366080, "review_id": "5851a80e9251416fad019d5c", "rating": 8.0, "review_text": "**The clash of two gangs over Malaysian underworld.**\r\n\r\nOne of the most expected film of the year. It did break many records, before and after releasing. That was expected for the Rajinikant films, especially this one was directed by a young filmmaker Pa. Ranjith who was just a two films old. So the responsibility was big to handle a top brass from the Kollywood, as well as to deliver success. I think he did great, handling the pressure, the result and the numbers say it all.\r\n\r\nHe knows well how to mix the commercial elements to the parallel cinemas. He did that earlier, but here he had gambled where the lead actor is known for his style and mass appeal. In this, those clichés were reduced completely, I mean completely. Even for Rajinikant, this looks a new territory to step in. I have never seen him like this before, not in the last 20-25 years of my watch. So this is something new in Tamil films.\r\n\r\nThank god, the songs are what I always had trouble in Indian cinema and in this they have reduced, but not completely erased. Especially the 'Neruppu Da' track was a massive hit, even before the release and I too loved it. Like usual, they wrapped up everything about the film tightly, so I did not know what kind of film it was till I saw. I anticipated kind of film 'Baasha', and I only surprised to catch up a completely different type of film.\r\n\r\nThe 'different' means, it kind of looked like a live recorded audio, so the appeal was like a mix of documentary and feature film. It was actually inspired by a real life gangster boss, the struggle for equal rights and respect since the British colony ended in Malaysia. The story takes in the capital city, Kaula Lampur, where a man named Kabaliswaran was being released after 25 years of prison. He was advised not to go back to his old life by the officials, but he gets out with an agenda, and then decides to meet a few people who were the reason for his jail.\r\n\r\nMeanwhile, the flashback reveals 25 years old events. By then you will learn everything about him, but his future plans remain mystery. Soon his new quest to find his lost family members takes a full coverage from onwards. He had to go to different places, countries, but the trouble follows. His old enemies fear his existence is a threat to their business. So between the personal journey and fighting the enemies follows in the rest of the parts.\r\n\r\n> \"Flying is its nature. Let it go. Free it. Let the bird decide whether to rise high or die trying.\"\r\n\r\nLooks like this film is not for hardcore Indian film fans, especially if you had loved the lead actor's heroism from all his previous films, you might end disappointing a bit. He retained his style, only somewhat, same goes to the punchlines, but his heroic acts were exterminated and brought the reality like how people react to situations in the actual world. So my advice is to you is don't expect mass appeal, but the pace was excellent, even for this over a two hour long narration.\r\n\r\nI mean he used to fight for the people against the corruption and corrupted officials and politicians in all his previous films. Whenever he sees there's something wrong, he right away steps in, so his fans go crazy. In here his character simply neglects those situations. I totally stunned to witness a different kind of him. But that's natural and I loved it, this is what an international film looks like. Thanks to everybody who involved in the filmmaking, particularly Rajinikant and Pa. Ranjith for taking all the risk.\r\n\r\nThis is entirely about Indian enthic's fight in Malaysia. They were brought into the land by the British to cultivate vast untapped land. Many years later, now the minorities, between Chinese and Indians a clash happens. One to take over the underworld market and the other to cease the illegal activities completely. I think it was a good theme, a message film, but told with a violent path. Since it is a gangster flick, that is inevitable.\r\n\r\nGreat locations, the mix between blue/green screen and the real ones were so good, especially where the finale takes place. I'm very interested in Auroville after learning about it and I think this is the first film to shoot at that location. But disappointed for not fully utilising it. Not just the stunts, but there are some fun with a limited quantity. No romance, Rajinikant did the role, according to his current age, but the narration has the family sentiments. Other than gangster elements, the family plot exploited, particularly in the mid segment.\r\n\r\nAn Indian film debut for the Taiwanese actor Winston Chao. He was not bad despite this is a different kind of experience for him. Everyone were praising Radhika Apte, but she was just fine for me. Dhansika as Yogi was the surprise among the characters. Even in a small supporting part, Kishore was so good. No need to say anything about Rajinikant, he was phenomenal. Overall, I did not find any fault in the casting section.\r\n\r\nWith this success, there's already talk for a sequel, but they yet to confirm it. I am in favour of it which might happen after the '2.0'. Meanwhile, watch this film, especially if you are a non- Indian, because it was nothing like the regular Indian film. Though it was not a masterpiece, still can be watched once for being different. Particularly, it reveals Indian minorities struggle in Malaysia. That makes Indian must see. But this is a gangster film that balanced between action, crime and drama that mostly good for grown ups. Finally, it is a Neruppu da!\r\n\r\n_8/10_", "created_at": "2016-12-14T20:14:06.336Z"}]