[{"movie_id": 451048, "review_id": "61009e5b0d5d85005ef66953", "rating": null, "review_text": "Ask anyone who has ever spent time at a Disney park what attractions they enjoy riding and chances are good that the Jungle Cruise will be amongst them. The project was a labor of love for Walt Disney and has thrilled millions of guests with the scenic cruise, animated animals, and the cringe-worthy puns and jokes from the captains who have made it an enduring legend.\r\n\r\nSince attractions ranging from “Pirates of the Caribbean”, “The Haunted Mansion” and “The Tower of Terror” have made their way to screens along with others over the years; it was not much of a shock to hear that The Jungle Cruise was next in line to make the leap to the big screen. Despite several release date changes and then a lengthy delay due to Covid; the film has finally arrived backed by a star-studded premiere at Disneyland.\r\n\r\nWhen Doctor Lilly Houghton (Emily Blunt) with the help of her high-maintenance brother MacGregor (Jack Whitehall) desire to find a mythical item and gain entry into a prestigious organization; they are hampered by the sexist views of early 1900 England and forced to steal an artifact and race to the Amazon.\r\n\r\nWith a dangerous foreigner; Prince Joachim Jesse Plemons and his goons in hot pursuit, Lilly and her brother find themselves in the company of a boat captain named Frank (Dwayne Johnson); who in dire need of money uses all sorts of methods to gain a charter and take Lilly and her brother into a dangerous area.\r\n\r\nAlong the way, all manner of humor, action, and dangers arise as everything from hostile natives, animals, rapids, and of course, The Prince stands in their way. If this was not bad enough; there is also a matter of a curse that must be factored in which presents an even bigger danger than before.\r\n\r\nIn a race against time, Frank and Lilly must learn to trust and work with one another and decipher the clues to save the day and keep the forces of evil from winning.\r\n\r\nThe film takes a bit of time to get going as while there is some action and great scenery and sets; early on it does seem to be unsure of what type of film it wants to be and what type of story it wants to tell.\r\n\r\nIs it a madcap adventure with a dash of romance? Is it an FX-laden action spoof? Perhaps it is an over-the-top action film that recalls the fabled cinematic adventures of old?\r\n\r\nIn reality, the film is a combination of all of the above. I had flashes of “The African Queen”, “Romancing the Stone”, “Raiders of the Lost Ark”, “Pirates of The Caribbean”, and “The Mummy”  during the film.\r\n\r\nWhile the MacGuffin element of the film may be a bit confusing for some with more questions than answers; Blunt and Johnson work very well with one another and Whitehall provides a wider element to his character making him more than the comic relief in the film.\r\n\r\nThe FX are very enjoyable and the film mixes the humor with the action well including some of the best jokes from the attraction.\r\n\r\nWhile it may at first glance be considered just a routine adventure film; the movie blends a strong and enjoyable cast with a fun adventure that recalls the thrilling cinematic tales of old but does so with a fresh and modern twist.\r\n\r\n4 stars out of 5", "created_at": "2021-07-28T00:01:31.079Z"}, {"movie_id": 451048, "review_id": "6104e8d117c443005d4f0ac0", "rating": 8.0, "review_text": "This movie was never short of laughter.  It incorporated the same types of jokes heard while riding the attraction of the same name.  The movie was a mix of Pirates of the Caribbean, Indian Jones, National Treasure, and Raiders of the Lost Ark.  It follows similar plot to each of these movies.  People want treasure > Bad people want the same treasure > They both find the treasure at the same time > The good people manage to get the treasure.  Even though it's a recycled Disney movie, the jokes throughout the movie make it worth a watch.", "created_at": "2021-07-31T06:08:17.828Z"}, {"movie_id": 451048, "review_id": "6106471e6517d6005e3ed9eb", "rating": 7.0, "review_text": "I had a good time watching Jungle Cruise because the thrills just keep on coming. As someone who likes adventures on reel, Jungle Cruise met all my lofty expectations: mythology and legend, a smart-aleck skipper, an Englishwoman and her sweet-faced brother, and the Amazon rainforest. Give it a go even if you are not familiar with the Disney link.", "created_at": "2021-08-01T07:02:54.937Z"}, {"movie_id": 451048, "review_id": "6108ca7df96a39007437ea4b", "rating": 8.0, "review_text": "Things That I Liked Most In The Jungle Cruise Movie!!\r\n\r\n1) Perfect Casting Dwayne \r\n\r\nJohnson and Emily Blunt were electric together. They both bring so much fun to the movie. I love their chemistry. \r\nBesides the main hero and heroine, the character of Jack Whitehall was excellent. He played the role of Emily's brother & he rocked it with his performance. He brought so many comedic moments. \r\n\r\n2) Great Comedy And Action \r\n\r\nThe action & comedy were moving along at about the right pace, never dwelling too long on any of the plot points. \r\n\r\n3) World-Building \r\n\r\nThe sets, costumes, animals, vibrant colors, darker elements of Amazon, the intro of main characters, every single thing was beautiful enough to maintain the classic atmosphere.", "created_at": "2021-08-03T04:47:57.640Z"}, {"movie_id": 451048, "review_id": "611105ca3876510048b6107d", "rating": 10.0, "review_text": "**Provided You -_SURVIVE_- All The \"OVERKILL🤮 Mud & Slime, & The HUNDREDS Of Bugs|Bees🐝 IN The Slime\" . . . . . . . You'll Find That The Film's Long, Enthralling Buildup🌺, And Its Eventual GRAND FINALÉ . . . Are Indeed . . . Absolutely, Positively SPECTACULAR💥😃 .**\r\n\r\nA \"Good, Old Fashioned\", **-{ _B I G_ }-** Screen Full Length Review . Viewed around August 02, '21 .\r\n______________________________________________________\r\nFrank Wolff : \" Hey , McGregor ! . . . Had a girlfriend once, she was cross-eyed. Didn't work out. We could never see eye to eye ! \" .\r\n______________________________________________________\r\n\r\n**1. \" What A Ride 👏❗\"** : This is a journey filled with Colour, Beauty, Awe, Drama, _Massive_-Spectacle, but **Most of all , \" T O N S . . . OF _HEART_ \" .** And then of course, there's all the **_Humour_.** Now, I like to think of myself as a person who has a ( fairly ) high bar when it comes to the funnies, so I just -_have_- to say, Dwayne Johnson's 'Frank Wolff' delivers so **MANY -{ _GENUINELY_ }- RIB TICKLING 'SPUR-OF-THE-MOMENT' PUNS** in Jungle Cruise ( 'J.C', for short ), that I -_Honestly_- couldn't help but get \"drawn in\", & to the fullest, at that . . . almost '_Every-Single-Time_'. Not to mention all the masterfully executed _Slapstick_ humour 😂 { a little taste of which is in the movie's -\"Official Trailer 1\"- ( August 2020 ) }. All in all, expect Two-hours-and-seven-minutes of Non-stop **\" Lavish, Wholesome, -FAMILY - \" entertainment .** \r\n\r\n**2. So, Does He Still Charm, Endear, & Delight ?** Short answer : **YES . . .** he can , & -_Does_- , still ( well and truly ) \"Rock\" The Boat. **HOWEVER,** I sincerely urge you not to expect any particularly 'Oscar-worthy' sort of performance from 'The Man' himself, Mr. Dwayne \"The Rock\" Johnson. Meaning { things like } : you're just going to get the 'Same-Old', run-of-the-mill _American Accent_ from him yet again . . despite him playing the role of a _Spaniard_ . . living in -Brazil_. ( Although to be fair, this was almost _Certainly_ a directorial-Call by the picture's absolutely **_OUTSTANDING_ 🌠** Director, Jaume Collet-Serra ; for reasons I -Shan't- disclose, for fear of giving away '_too much_' ). Simply -{ _Expect_ }- to see him put in a **\"Thorough & Dedicated Performance\",** with a few _impressive_ \"Surprises\" sprinkled in to the mix, for what it's worth. And inasmuchas the sister-brother duo of Emily Blunt's 'Lily Houghton' & Jack Whitehall's 'MacGregor Houghton' are concerned, ready yourself for an incredibly **'FUN'** journey with these two \"_Effusive, mega-Talented Stars_ \", and veterans of Film and Telivision, respectively. In the \"nascently Post-Victorian\" setting of J.C, you are likely to find theses two characters to be nothing less than \"sheerly \" . . . **ADORABLE, CHARMING, & DELIGHTFUL.** \r\n\r\n**3. \"Jesse Lon Plemmons\" Was The Marvellous \"Shock \"...** of this huge movie { well for _-Me - _ ateast, that is to say }. He portrays the tyrannically _'Monstrous''_ German **\"Prince Joachim :** _your worst nightmare straight outta World War 1_ \", in Jungle Cruise. In real life, he's the partner to bubbly, adorable global **'Giga-star', Kirsten Dunst** { _ALL_ the 'Spiderman' films ( _the ones with with Tobey Maguire, that is_ ) 2002-2007 }. So here's the thing. Not much having been a big afficionado, for the most part at least, of the whole **'Breaking Bad'** thing, { arguably his first 'REALLY, REALLY' big-break ( _as 'Todd Alquist', 11 Episodes, 2012-2013_ ) }, I'd somehow managed to let his **\"WHOPPING💥\" _Sixty-Three Acting Role Career_ ( _Thus_-**far, at least ) ; somehow slip under the radar, with the sole exception being his ( relatively ) \"Diminutive\" -yet \"tremendously enjoyable\"- part as the genuinely likeable 'Jimmy -Ordy- Ord' in 2012's massive blockbuster, 'Battleship'. And _Now_, to see him { almost as though } \"coming out of nowhere\", take on this _Way_ larger-than-life kind of part ; & play it with Utter, Consummate , **\" C L A S S \"** . . . . ( oh, & don't even det me -Started- about his _German Accent_  ). . . . suffice to say that his performance was 'Gloriously, Gleefully And  Mischievously',  well . . . . **\" _IMMACULATE_ \" .** \r\n\r\n**Summation :** It certainly bears mentioning, just before you & I part ways ...that I actually -_went_- on the **\"_REAL-LIFE_ CRUISE\"** ( that this veritable cinematic gargantuar gets its name from ) at the \"_ANAHEIM_\"-Disneyland... with my late, & **Super-Beloved Dad 💙,** on his 50th Birthday. Only problem is, I was very much younger at the time, & can -_Barely_- remember it. So, needless to say, this picture had a very special resonance for me. And indeed, if not for the all the titularly referenced, **\"GROSS-OUT\"** _Mud|Slime|Bees,_ I might just have given this film my { _trademark_ **;)** } 12 or -even 13- out of 10, ( reserved **-_Exclusively_-** for films that I REALLY, REALLY, REALLY enjoy ). However, as that stuff -_DID-_ actually bother me a fair bit, **( SORRY, BUT THAT'S JUST _-ME_-  )** . . . It's going to remain a **Solid 10 Marks Out Of 10.** Still \" not too shabby , eh \" . . . \" _Wouldn't 'Ya Reckon_ 😅 💥❓\" .", "created_at": "2021-08-09T10:39:06.749Z"}, {"movie_id": 451048, "review_id": "611f63c0ac41610045a82522", "rating": null, "review_text": "**_very nice movie. Rocks ✌🏻✌🏻👌👌_**", "created_at": "2021-08-20T08:11:44.415Z"}, {"movie_id": 451048, "review_id": "614f987b2f8d09006124fa9c", "rating": 10.0, "review_text": "Awesome movie, lots of adventure and humor. A must see for everyone. This one is a keeper. ⭐⭐⭐⭐⭐", "created_at": "2021-09-25T21:45:31.783Z"}, {"movie_id": 451048, "review_id": "616c6b61894ed60042f33fa5", "rating": 9.0, "review_text": "To me this was great entertainment. A really nice rollercoaster of adventure with healthy dose of humour and fantasy.\r\n\r\nDwayne Johnson is indeed one of my favourite actors these days and he makes a good performance as the somewhat crazy riverboat captain which is (a lot) more than he seems.\r\n\r\nThis movie is meant to entertain and nothing else. I am quite happy that, despite it being a new Disney production, there’s really not much in terms of woke bullshit preaching in there. A little bit rubbish, especially at the end, but it’s bearable. Maybe Disney has learned the lesson as to how much that crap actually hits the bottom line.\r\n\r\nThe movie is really a non-stop (almost) rollercoaster of action a ‘la Indiana Jones and Tomb Raider but with a more humorous slant to it. Some people complain about God knows what from the music score to the jokes to the camera movement to whatever. It’s a movie that are just supposed to entertain from start to finish without having to be deep, realistic or delivering some sort of message and there’s absolutely nothing wrong with that. Rather the inverse actually. It was great to just disconnect and watch the adventure and action.\r\n\r\nAs I said, Dwayne Johnson did his role nicely as the riverboat Captain, Frank Wolff, but most of the rest of the main characters was quite okay. Sure, Frank’s jokes were cringeworthy but then, they were meant to be. MacGregor Houghton was at times a bit annoying but at times quite hilarious. I quite liked when Frank threw his ridiculously large luggage overboard although it was of course quite predictable.\r\n\r\nThe weakest character was probably Prince Joachim who was mostly silly. He wasn’t far out enough to be a really noteworthy crazy psychopath but not “normal” enough to be taken seriously.\r\n\r\nIf I should complain about anything it would be that the manoeuvres that wreck of Frank’s performed was, well, not very realistic although it was not as bad as that “handbrake turn” the idiot script writer wrote into Battleship. That one pretty much ruined the movie. Then, there’s also no way the Amazon river is deep enough for a bloody submarine.\r\n\r\nI watched this movie with my kids and girlfriend and we all had a really good time watching it.", "created_at": "2021-10-17T18:28:49.884Z"}, {"movie_id": 451048, "review_id": "62b0be2f90cf51008d4ec5d0", "rating": 4.0, "review_text": "Full review: <a>https://www.tinakakadelis.com/beyond-the-cinerama-dome/2021/12/28/its-brutal-out-here-jungle-cruisenbspreview<a>\r\n\r\nAdapted from one of the original Disneyland attractions, _Jungle Cruise_ is Disney’s attempt at another family-friendly adventure movie. It’s hard not to draw comparisons between the franchise adapted from another Disneyland attraction, Pirates of the Caribbean. However, where _Pirates of the Caribbean: Curse of the Black Pearl_ still stands as one of the finest examples of action movies 18 years after its release, _Jungle Cruise_ falters at the starting block.", "created_at": "2022-06-20T18:36:31.272Z"}, {"movie_id": 451048, "review_id": "6313868f9408ec007becb23e", "rating": null, "review_text": "Jungle Cruise takes ample liberties with the legend of Lope de Aguirre in particular, and with Reality as we know it in general (and, I assume, with the attraction on which it is based; how else to explain that a seven-minute ride turns into a two hour-plus movie?).\r\n\r\nAguirre had previously inspired Werner Herzog's Aguirre, The Wrath of God and Carlos Saura's El Dorado, searching in both for the mythical city from which the latter takes its title. In Jungle Cruise, the 16th century Spanish conquistador (Édgar Ramírez) is in search of the Tears of the Moon, a tree whose petals can cure any disease, heal any wound and lift any curse — including a kind of eternal youth, in light of which director Jaume Collet-Serra and screenwriters Glenn Ficarra, John Requa, and Michael Green should have used Ponce de León instead of Aguirre.\r\n\r\nNow, the names Herzog and Saura will surely be foreign to a person who watches Jungle Cruise willingly, in which case this hypothetical viewer will be unaware that in the two films mentioned above, the characters sail real rivers in real jungles and interact with real animals.\r\n\r\nIn Jungle Cruise, Captain Frank Wolff (Dwayne Johnson) fights a tiger so phony-looking that it could be a cereal mascot (definitely not what William Blake had in mind when he spoke of \"fearsome symmetry\" in \"The Tyger\"); this scene is awkwardly choreographed and has a predetermined outcome — not unlike what Johnson used to do in WWE, except that even in the ring he was facing another being of flesh and blood, not a tiger that, like all other animals in this film, belongs to the genus computatrum generatae.\r\n\r\nNow, I’m fully aware that Aguirre, The Wrath of God, and El Dorado are dramas, while Jungle Cruise is, at least nominally, a comedy. However, I don't think this exempts it from achieving a modicum of realism; the saying 'it’s funny 'cause it’s true' is not a cliché for nothing.", "created_at": "2022-09-03T16:53:35.275Z"}]