[{"movie_id": 339403, "review_id": "59566daec3a368138806de2b", "rating": null, "review_text": "This was the most fun I’ve had watching a movie in a long time. It has everything I’m looking for in a summer blockbuster: nonstop action, amazing soundtrack (best soundtrack of the year), and hilariously funny. Oh and it’s an Edgar Wright film which has never been a let down. I’ve never seen the star, Ansel Elgort, in anything before but I know he was in the running to play Han Solo and now I’m extremely sad he didn’t make the cut – he even dresses like Solo for most of the film. Read more of my review here: https://imdgflicks.wordpress.com/2017/06/30/baby-driver-is-the-best-music-video-since-tron-legacy/", "created_at": "2017-06-30T15:26:38.301Z"}, {"movie_id": 339403, "review_id": "59d8902992514124eb021e5c", "rating": null, "review_text": "Let it never be said that \"Overrated\" equates to \"Bad\".\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2017-10-07T08:28:25.912Z"}, {"movie_id": 339403, "review_id": "5a771345c3a3686b5101ed7d", "rating": 8.0, "review_text": "**Don't mess with this Baby!**\r\n\r\nOne of the stylish film of the year. There's nothing special about the story, but the way it was made looks intriguing. The individual characters, music, stunts, obviously car chases. Not the best role Ansel Elgort has ever played, but in his short, beginning of the career, it quite possibly defines he's ready for the tough roles. Then the British filmmaker known for some wonderful action-comedies, one more addition to his hit kit.\r\n\r\nA youngster who is a getaway car driver for heists, working under a criminal mastermind, is often teamed with a different crew. One of his latest job takes an unexpected twist, leaving his yet to bloom romance with a waitress in peril. His attempt to come out of that, the risk he takes, changes his life forever. The tale ends with an action packed finale.\r\n\r\nThis is the first Kevin Spacey film I'm seeing after all the allegation against him. I blame everyone equally who had let him do it all these years. But that's nothing to do with this film. He was fine as an actor as always. It's just fine to be as one-off film, but the way everything had happened looked like it could have been a great franchise. As of latest news, it is on. The sad part is, all the good characters won't return. Anyway, it is one of the must see from the year T17.\r\n\r\n_8/10_", "created_at": "2018-02-04T14:05:57.044Z"}, {"movie_id": 339403, "review_id": "5b28eaf09251412c6c004504", "rating": 7.0, "review_text": "Extremely stylish, anime inspired superb action film. Edgar Wright knows what he's doing.", "created_at": "2018-06-19T11:37:20.299Z"}, {"movie_id": 339403, "review_id": "5e3fd9413dd126001453720f", "rating": 9.0, "review_text": "Baby (Elgort) is a quiet, unassuming young man, who looks after his ailing foster parent, listens to music both out of his love for it, and a need to block out the tinnitus ringing in his ears that he was afflicted with due to a tragic accident that also took his parents. Baby also has a specific skill set, one that has him doing the bidding of a crime boss Doc (Spacey) to pay back a debt.\r\n\r\nBaby's skill is driving, but not just any driving, the kind of skilled driving that gets Doc's crew of armed bandits away from the scene of bank hold-ups very fast, and then leads crews of police cars on a merry dance, and dodges every trick up their sleeves with a few of his own set to a killer music soundtrack from his iPod.\r\n\r\nWith light at the end of the tunnel, Baby has a chance encounter with cute diner waitress Debora (James), where the chemistry between the two is instant. He sees this as his road to freedom, and a bright new future. This new future is brought to rude halt by Doc who was not yet done with Baby.\r\n\r\nThis film is all about the music soundtrack, and what a soundtrack indeed. With songs like Nowhere to Run by Martha and the Vandellas, to the quintessential driving song Radar Love by Golden Earring, you'll be tapping your toes as well as being thrilled by the action, plus the classy, and slick driving by Baby.\r\n\r\nThe performances in this film are all stand out, relative new comers Elgort, James, and González do really well in their respective roles. The scene stealing performances by Spacey, Hamm, and Foxx are great in support to Elgort. While Spacey, as he generally does, plays cool, and mellow. Hamm, and Foxx do it with charm, and evil menace as Buddy, and Bats. Jon Bernthal's cameo as the suspicious, and hot-headed Griff was also a delight to watch.\r\n\r\nWritten, and directed by cult favourite Edgar Wright, this film has all the elements that make this a great addition to the tradition of other heist films like Drive, The Getaway, and Heat.\r\n\r\nBaby Driver is probably the most fun I had at the cinemas this year along with Wonder Woman, and Spider-Man Homecoming.", "created_at": "2020-02-09T10:04:49.416Z"}, {"movie_id": 339403, "review_id": "5e6e3769357c00001943bbf5", "rating": 8.0, "review_text": "The moment you catch feelings is the moment you catch a bullet. \r\n\r\nBaby Driver is written and directed by Edgar Wright. It stars Ansel Elgort, Jon Bernthal, Jon Hamm, Jamie Foxx, Kevin Spacey, Flea, Lily James and Eiza González. Music is by Steven Price and cinematography by Bill Pope.\r\n\r\nIn debt to a crime boss, a young getaway driver with tinnitus finds himself taking part in a heist that could spell doom for all involved.\r\n\r\nLets get it out the way, I'm a big fan of Edgar Wright, I find him refreshing for still shooting on film. That he has beautiful camera actions and for the fact his cutting is smooth and not a incomprehensible video game mess like so many other action movie directors these days. So obviously I love Baby Driver for sure.\r\n\r\nThe choreography is high quality, the stunt work equally so, while the varied soundtrack (given to us via Baby's personal player) is one of the best in many a year. Cast are bang on form, where naturally they are given a zinger of script to work from (it pays to watch more than once to catch some lines again). While the thrill of the extended action scenes are joyous.\r\n\r\nIt was a film long in gestation for Wright, and you can see he has given it his undivided attention. He may be divisive as per his output, but the monster success of Baby Driver (both critically and commercially) speaks volumes about the quality of the work on show. One of the best films of 2017. 8.5/10", "created_at": "2020-03-15T14:10:49.241Z"}, {"movie_id": 339403, "review_id": "60ea3200194186002fee7609", "rating": 6.0, "review_text": "Lots of slick driving and action, but slim on plot, and very unrealistic ending.\r\nNo explanation of HOW he becomes an expert driver.", "created_at": "2021-07-10T23:49:20.357Z"}, {"movie_id": 339403, "review_id": "62f66db75c564e0083210ee1", "rating": 9.0, "review_text": "Baby Driver stands out as a brilliant, unique, and fun piece of cinema art with its outstanding writing, perfect cast, exceptional stunt work, bold colors, and so much more. This movie gets everything right. However, this film's most impressive feature lies in its soundtrack. The music is a character of the movie interacting with other characters - its beats matching and punctuating what is happening on screen throughout the entire film. One of my favorite heist movies and probably one of my favorite movies of all time.", "created_at": "2022-08-12T15:11:51.901Z"}, {"movie_id": 339403, "review_id": "630016735ab81a009631ea81", "rating": 9.0, "review_text": "**Overall : Everything about Baby Driver is fresh, fun, and unique. Don't let this one get away!**\r\n\r\nBaby Driver stands out as a brilliant, unique, and fun piece of cinema art with its outstanding writing, perfect cast, exceptional stunt work, bold colors, and so much more. This movie gets everything right. However, this film's most impressive feature lies in its soundtrack. The music is a character of the movie interacting with other characters - its beats matching and punctuating what is happening on screen throughout the entire film. One of my favorite heist movies and probably one of my favorite movies of all time.", "created_at": "2022-08-19T23:02:11.651Z"}, {"movie_id": 339403, "review_id": "6309acb3bb070d007c55e49d", "rating": 1.0, "review_text": "There is an episode of Tales from the Crypt wherein the protagonist’s conscience sounds just like – and is played by – Sam Kinison. OH! OH! AAAUGH! This is only slightly worse than tinnitus but still slightly better than Baby Driver, the story of an idiot savant who is the best getaway driver in Atlanta – with the caveat that he needs to listen to his iPod; when at the mercy of FM radio, Baby (Ansel Elgort) becomes Tyrone from Snatch. Baby suffers from tinnitus. To drown out the ringing in his ears, Baby constantly listens to music – which is like putting out a fire with gasoline – even when fleeing at full speed from the scene of a crime. Right. Children, do not play loud music on your headphones while driving a vehicle.\r\n\r\nBaby is in love with a waitress named Deborah. The coffee shop where Deborah works must be worse than the Carson McCullers’s Sad Café; how else can you explain her piss-poor decision-making? Deborah has no problem running away with a guy who 1) she practically just met, 2) like Cameron Diaz's brother in There's Something About Mary, loses his sh*t when someone touches his precious earphones, 3) associates freely with criminals, 4) is himself a criminal, 5) has “every clean and dirty cop” after him, and 6) constantly puts her in danger (Deborah is willing to wait five years for Baby to get out of jail. She had to make a living somehow during that time, so I guess the cafeteria wasn't so bad after all).\r\n\r\nMaybe it's true that women like “bad boys” – which Baby most certainly is, regardless of how innocent the movie wants us to think he is. During the third act Baby is directly or indirectly responsible for four deaths; almost five when he uses Deborah as bait to distract the psychopathic Buddy (Jon Hamm). And speaking of psychos, Bats (Jamie Foxx) is basically Motherf---er Jones from Horrible Bosses on crack – in spite of which he is the only sensible character in the film (“The driver must be the eyes and ears, not just the eyes”).\r\n\r\nOn the plus side, there is an admittedly funny moment concerning a discussion about the difference between a Halloween (as in the horror film) mask and a Mike Myers mask. Moreover, Kevin Spacey is a delight as always, and to no one’s surprise he and Foxx have the best lines – or at least the best delivery.", "created_at": "2022-08-27T05:33:39.562Z"}, {"movie_id": 339403, "review_id": "63bf67298efe7300a0e9ed6b", "rating": 10.0, "review_text": "I guess this is one of those movies that you're not supposed to like because meh politics and meh hipster and meh outrage culture and... reasons that really make no sense and are ultimately meaningless.\r\n\r\nAt least that is what a good bulk of the negative reviews say.\r\n\r\nSo let's not talk about meh politics and focus on the movie instead.\r\n\r\nMy wife put it on, and I have never heard of it. I, legit, thought she was talking about Simon and Garfunkel when she started talking about it. \"Do you want to watch Baby Driver?\"\r\n\r\nHonest mistake, she's part Guatemalan, her English isn't all that great... watch, listen to, whatever.\r\n\r\nAnyway, I was in the kitchen cooking and I missed the first part... but I was digging the music.\r\n\r\nIn fact I was digging the music so much that I started going to and from the living room, just because the soundtrack was that compelling. A great mixture of old and new.\r\n\r\nAnd then it was Kevin Spacey and Jamie Foxx, and you really want to see that. Both of them can turn a theatrical trick or two when they want to, and it always kind of seems that Spacey always wants to... and the soundtrack.\r\n\r\nAnd then when I finished cooking and we started eating in front of the television, I really started noticing the ringing when the music wasn't playing. And that was irritating... until my wife filled me in on the back story and then it was an \"ah-ha,\" moment of coolness. It was fairly compelling that they did that, and ran with it like they did.\r\n\r\nAnd, I can't be absolutely positive, but it didn't like it had that much CGI, and that is a plus. It looked incredibly real, like the good old days, so even through you are watching a movie filtered through an Ipod... it had an authentic action movie feel to it.\r\n\r\nOver all, it was incredibly enjoyable fun... and that is why you watch movies like this, right? Because they are fun?\r\n\r\nSo, 10 stars, mission accomplished, it was one heck of a fun film.", "created_at": "2023-01-12T01:49:29.671Z"}, {"movie_id": 339403, "review_id": "6467d3efa4af8f01577f4aad", "rating": 9.0, "review_text": "Like music beats? Like movies? You've never seen the two combined like this before. On the surface, this is an action-heist movie. But look again...with your ears. The visual beats are in time with the soundtrack. It's utterly mesmerising.", "created_at": "2023-05-19T19:54:23.510Z"}]