[{"movie_id": 335787, "review_id": "620d165467e0f70042a80db7", "rating": null, "review_text": "After numerous attempts which saw talent attached only to depart before filming began, “Uncharted” has finally arrived on the big screen.\r\n\r\nThe movie is based on the hit Playstation series of games by Naughty Dog and stars Tom Holland as Nathan Drake, a young man who is as adept at history as he is with pickpocketing which he uses to offset his income from Bartending.\r\n\r\nNathan’s brother fled the law years earlier and aside from Postcards has had no contact with him over the years.  Things change when Victor Sullivan (Mark Wahlberg) arrives and recruits Nathan by showing him that he used to work with his brother. Despite misgivings and unresolved feelings; Nathan joins with Victor and finds himself in a daring caper to steal a valuable object that could unlock the key to a gold supply that has been lost for over five hundred years.\r\n\r\nNaturally, there are others who want the money, and Nathan, Victory, and their dubious partner Chloe (Sophia Ali); as they rush around the world in one adventure after another to solve the ancient puzzles and stay one step ahead of some very deadly individuals.\r\n\r\nThe movie has elements of “National Treasure” and “Raiders of the Lost Ark” in terms of the quests to find ancient treasures mixed with action but keeps things in a simpler context. The focus is not on plot development, character development, or plausibility but considering the film is based on a video game, it does a good job with the source material.\r\n\r\nThere has been some controversy about the casting of Holland as Nathan is older in the game series, but he goes all-in with his performance even when the acrobatic action sequences does offer many reminders of his Spider-man role.\r\n\r\nThe action in the game is fun and over-the-top and more than once I thought I should be pushing my X and Square button to help him make the moves necessary to complete the task and survive.\r\n\r\nThe post-credit scenes offer some great possibilities for future adventures and those would be more than welcome for those looking for some no-brainer escapist entertainment.\r\n\r\n3.5 stars out of 5.", "created_at": "2022-02-16T15:20:52.890Z"}, {"movie_id": 335787, "review_id": "6211102b4c259200434c6735", "rating": 4.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/uncharted-spoiler-free-review\r\n\r\n\"Uncharted is an action-adventure flick, but despite a more entertaining last act, it fails to break the curse of videogame film adaptations due precisely to the lack of said action and adventure.\r\n\r\nEven though Tom Holland and Mark Wahlberg offer good performances, as well as convincing arcs by the two protagonists, Ruben Fleischer delivers an extremely generic and formulaic narrative based on endless exposition. Additionally, the secondary characters become irrelevant due to the irritatingly repetitive betrayals and constant shifts of the true antagonist.\r\n\r\nIn the end, the general feeling is that it would be much more interesting to be controlling the characters than simply watching them. It may be enough for fans of the franchise, but for the average moviegoer, it's \"just one more\".\"\r\n\r\nRating: C-", "created_at": "2022-02-19T15:43:39.925Z"}, {"movie_id": 335787, "review_id": "626db10a24b3330050fbfcf0", "rating": 6.0, "review_text": "I'm just an ordinary joe.  I've never played the game this movie is adapted from but from what I hear it's pretty fun.  The movie itself is okay for a treasure hunting movie.  The action is good and keeps flowing, and the actors, Holland (latest Spiderman) and Whalberg seem to have good chemistry.  Even the female protagonist did well in her \"diverse & inclusive\" part.  \r\n\r\nIf I had any cons to put forth about the movie, I'd say the lead villian being a female (thanks to Woke-Hollywood's influence) has been thoroughly worn to the point of irritation.  This woke trope is tired and worse, but oh-so-true to the core, it is dubious at best; especially so when it comes to fight scenes between the protagonist and villain.  It is time for Hollywood to hang up its Woke-cape.  There is no need for \"inclusivity\" when you can just give someone the job because it works for the story instead of politics.  I wouldn't complain on this aspect so much if Liberal (woke) Hollywood had the ability to write good characters and therefore good scripts.  But that is not possible when you are reaching to tick off checkboxes.\r\n\r\n**Somewhat Spoiler & complaints:** If the movie had simply begun with a female villain and had her demostrate certain abilities in combat, then her fighting men would be more believable.  It also would establish WHY her people would follow her.  But the female antagonist's action scenes do not come across as pertinent as they should because her profession is not established in the movie.  I struggled to get a handle on whether she was a fellow treasure hunter since she knew Walberg's character personally and was there to advise the rich villain, or if she was a hired mecenary.  Turns out she was the later, but that still did not help  her character gel.  I kept thinking, \"Why on earth would anyone follow her?  She's hasn't done anything to prove she's more than any other run-of-the-mill killer.\"  If the movie failed in any way it was this one glaring aspect.  Henry Cavill made an EXCELLENT head henchman in Mission Impossible: Fallout, because men fighting men is believable; villains have menace.  But without that special training I mentioned for a female villian, any interaction between her and men in fight scenes comes across as purely contrived.  The actress, Tati Gabrielle, did very well as a villain but this women fighting men is just not believable; and that matters to the male viewing audience.  Instead of sitting on the edge of your chair wondering who's going to win, you're sitting back with a finger to your temple wondering what bullcrap Hollywood is going to make of this fight scene.  \r\n\r\nIf I have to rate this movie on a whole I give it 3.5/5 stars.  It's far removed from _National Treasure_ or _Indiana Jones_, but it's better than _Red Notice_, if only just.", "created_at": "2022-04-30T21:58:34.791Z"}, {"movie_id": 335787, "review_id": "627898f072d8551308daedf4", "rating": 7.0, "review_text": "Good adventure-thriller in the vein of Tomb Raider. Visual effects for the most part were decent and liked seeing Tom Holland in a lead role other than Spider-Man (where he excels) and he's good here. Now this is coming from someone who has never played the game but I thought as video adaptations go, it was fairly entertaining though nothing exceptional. **3.5/5**", "created_at": "2022-05-09T04:30:40.533Z"}, {"movie_id": 335787, "review_id": "631c3dca0bb0760080232889", "rating": 7.0, "review_text": "This movie was pretty much what I expected or rather hoped for. It was a fun adventure/action rollercoaster plain and simple. This is one of those, rare nowadays, movies that are meant to entertain plain and simple. Two hours of adventure, action and twists barely held together by a rudimentary story and no woke rubbish or bullshit preaching. The latter is probably what rendered it a 40% rotten “critics” score on woke tomatoes while the audience gave it a 90% fresh score. As almost always a rotten score on woke tomatoes is an indication that it is a movie worthwhile watching.\r\n\r\nThe story, as can be seen from the movie blurb, is a treasure hunt a la Indiana Jones. It starts off by introducing the main character, Nathan, in a few brief scenes where Nathan bungles up a heist being perpetrated by his brother after which they are involuntarily separated.\r\n\r\nQuick forward to present time and the main story takes off with Nathan being persuaded by Sullivan to embark on a hunt for an immeasurable treasure. Not exactly the newest or freshest of stories but if it works don’t fix it.\r\n\r\nPretty much everyone in this movie is a self-centered scoundrel with little to no care for anyone except themselves. Thus the action and treasure hunting is regularly interrupted by twists and betrayals. No one will claim that this movie has an elaborate and intelligent story. It does not have to. It is just meant to hold the action together.\r\n\r\nI quite liked the main actors. Sullivan did a good job of being the blasé, self-centered scoundrel, Nathan of being the somewhat naive wannabe treasure hunter and Braddock was quite cool, and sexy (hey, I’m a guy), as the baddie. Antonio Banderas was Antonio Banderas although I was saddened by his premature exit from the hunt.\r\n\r\nOverall the action was nice although the scenes in, and out of, the airplane was the usual unrealistic Hollywood action. Although that was overshadowed with the ship carrying helicopter scenes towards the end which was taking unrealism to new levels. But I didn’t really care because it was fun silliness. The moment they started to carry those ships away I started to hope that the writer would go for the silly and obvious stunt involving black powder. Yes unrealistic but there is no denying the coolness factor.\r\n\r\nAs far as I am concerned this was two hours well spent. The ending scene clearly suggested that the producers hoped to make a sequel. I would definitely watch it but with all the people lamenting the fact that someone dared to make a movie simply for entertainment without a profound (and boring) story or bullshit preaching in it that might not happen. It did make about four times its budget at the box office though so maybe.", "created_at": "2022-09-10T07:33:30.672Z"}, {"movie_id": 335787, "review_id": "631fa73967dcc90082828d5a", "rating": null, "review_text": "Fun, but flat!\r\n\r\nNeat adaptation of the games, the character of Nathan feels distinct enough that I wasn’t bothered by a lot of the world-building choices and changes. Both the story and scene structures are a bit odd at times, but it stays pretty light throughout. Criminal waste of Antonio Banderas though.", "created_at": "2022-09-12T21:40:09.147Z"}, {"movie_id": 335787, "review_id": "6349a170072166008dca7882", "rating": 7.0, "review_text": "_Uncharted_ was perfectly predictable. I had a general idea of what to expect going into the film and got most of everything I wanted. While it is not groundbreaking cinema, it does offer so very great action set pieces that are pulled straight from the games I grew up loving. The story is very reminiscent of an adventure Nathan Drake would take during the games and the environments were diverse and engaging. My one big critique is the performances. While they were fine, I did not really think the casting was done in terms of the characters themselves but more for the star power. Tom Holland plays a character that is an edgier Peter Parker, he still has the charisma of Nathan Drake but there is something about him that still feels naïve and less sure of himself. I understand this is early in Nathan Drake's career, but it still felt to overly Spider-Man for me. There is really not much to say for Mark Wahlberg either, he plays pretty much the same character as every one of his other films. Sophia Ali, Tati Gabrielle, and Antonio Banderas all do a fine enough job in their roles but never do anything that make their performances stand out. Overall, this movie is fun if you sit back, relax and enjoy some great action and exploration. It is not great, but it definitely passes the time and is good time.\r\n\r\n**Score**: _68%_ | **Verdict:** _Good_", "created_at": "2022-10-14T17:50:40.835Z"}, {"movie_id": 335787, "review_id": "63c25492a5743d00961ef496", "rating": 5.0, "review_text": "**Uncharted overdid the action, cheesy performances, and selfish betrayals while leaving the story behind.**\r\n\r\nUncharted mixes National Treasure, Tomb Raider, and The Other Guys into a disappointing cocktail that leaves a bland taste. Several sequences and setpieces were lifted directly from the games, which is a fabulous treat for fans of the series, but that is about where the similarities end. Although a fantastic actor, Holland was a younger choice than many expected for the role, making Uncharted Nathan Drake's origin story. Unfortunately, this was less origin and more Mary Sue, as Drake already had all the knowledge and skills to navigate this outrageous movie. The CGI was obvious, and the stunts and action were so unbelievable for a character that started the movie as a bartender that it made it difficult to enjoy. All the characters were so unlikeable and duplicitous, with almost every interaction ending in another \"surprising\" betrayal. Mark Wahlberg's performance didn't fit in the movie either. He felt like he was just playing himself with goofy quips and fast-talking rather than trying to play a character in this universe. I was hoping for so much more, but this franchise-launching film was dead on arrival.", "created_at": "2023-01-14T07:06:58.056Z"}]