[{"movie_id": 445571, "review_id": "5b91213b0e0a2665a000e70e", "rating": 7.0, "review_text": "Massive win from _Game Night_, had no expectations going in, but it ended up totally thrilling not just me, but the whole group I watched it with. One of 2018's stronger entries thus far. Always a pleasure to get that sort of a feeling, but especially happy that it came from a non-franchise movie.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2018-09-06T12:44:43.345Z"}, {"movie_id": 445571, "review_id": "5ff216681d3563003f0d2f6c", "rating": 10.0, "review_text": "This is one of the funniest movie I have watched in a long time. It starts out a little low key and slow, giving you no idea what is coming. I wanted to try it because of Jason Bateman from Ozark, so I didn’t read reviews or watch a trailer. I suggest you watch it cold too if you have a choice.\r\n\r\nWe found the plot to be continuously engaging and full of laughs. There was one scene that made us lose it and laugh like we haven’t done for a movie since the burning dog scene in There’s Something about Mary. I won’t give it away, but will just mention to pay attention when they introduce the squeaky toy.\r\n\r\nOkay, a couple of the characters seem rather stereotypical, but even one of those turns out not to be as he seems. I am definitely setting this one aside to watch again at some point.", "created_at": "2021-01-03T19:09:28.203Z"}, {"movie_id": 445571, "review_id": "6048378690fca3005a88cdda", "rating": 8.0, "review_text": "Very fun, and surprisingly refreshing.\r\n\r\n<em>'Game Night'</em> is definitely worth a watch. It actually features a fairly simple premise but it's one that is brought to life splendidly. The humour is strong, as are the majority of the cast. It has some neat camerawork, also.\r\n\r\nJason Bateman (Max) and Rachel McAdams (Annie) make for a terrific pairing, they bounce off each other very well. Jesse Plemons (Gary) low-key steals the show though, his character is so basic but Plemons plays him to perfection - he made me laugh with just the smallest bits of comedy. Jeffrey Wright also appears, as does a certain Mr. Morgan.\r\n\r\nThere are rumours of sequels potentially being a thing. I mean, I'd check them out for sure but I kinda hope they don't... I think they would be overdoing it, meaning it would become stale fast. Who knows, though.\r\n\r\nCheck it out if you get the opportunity.", "created_at": "2021-03-10T03:05:42.319Z"}]