[{"movie_id": 37834, "review_id": "51059619760ee3609268b7ed", "rating": 3.0, "review_text": "OMFG! I thought MIssion: Impossible 2 was the worst movie I would watch from Tom Cruise ... I was wrong.\r\n\r\nThere's only one thing in Knight and Day that is not that bad as in MI2, and it is that the movie doesn't take seriously itself, something that MI2 does.\r\n\r\nAbout the mixing of Spanish stereotypes and festivities in Seville ... no comments :(", "created_at": "2013-01-27T21:03:21.144Z"}, {"movie_id": 37834, "review_id": "63b242b357530e008502118a", "rating": 6.0, "review_text": "**Knight and Day is a forgettable but still entertaining Tom Cruise spy action comedy.**\r\n\r\nKnight and Day has all the elements of a Tom Cruise action movie: motorcycle chases, quippy one-liners, frequent explosions, and lots of running. It’s a fun formula that I have watched many times. Knight and Day provides all that, along with exceptional director James Mangold and incredible talent with Cameron Diaz, Viola Davis, and Paul Dano, but sadly underwhelms a little. Don’t get me wrong. It’s not a bad movie, but the CGI and green screen throughout the film were distractingly obvious, and much of the dialogue and plot twists oozed with cheese and cliche. But you can’t keep that Tim Cruise charisma from taking a mediocre film and charming it up a little more with all kinds of stunts, jumping, running, and smirks.", "created_at": "2023-01-02T02:34:27.453Z"}, {"movie_id": 37834, "review_id": "645fc259a672540164dd977d", "rating": 10.0, "review_text": "This is one of those subtle movies people just don't seem to get. Your average Joe just expects an action flick, so that's all Joe watches it for. WRONG! Well, right, yes it's got lots of action but if that's all you expect from it then you're missing the brilliance of all the nuances Tom brings to this character. There are so many subtle moments throughout this adventure I couldn't begin to count. Just a couple of the main ones are, Roy is a spy who doesn't lie, he also has the morality of an untainted youngster. You need to watch this movie without action-tinted glasses.", "created_at": "2023-05-13T17:01:13.402Z"}]