[{"movie_id": 119450, "review_id": "53c3dde60e0a26158500c754", "rating": null, "review_text": "Very epic movie, strong storyline and also stunning graphics.. This is very recommended movie to watch with entire family.", "created_at": "2014-07-14T13:40:54.632Z"}, {"movie_id": 119450, "review_id": "53f51eefc3a36833f70022fd", "rating": 8.0, "review_text": "The story may not be the most original, with its Shakespearean turn overs, but it is well shaped and  Serkis performance is remarkable.\r\n\r\nThe animation of the apes, which was already superb in the previous movie, finally reaches a level in which you can believe they are more real than the human actors.\r\n\r\nMaybe a bit too long, but a good time for a not totally dumb movie.", "created_at": "2014-08-20T22:19:27.508Z"}, {"movie_id": 119450, "review_id": "647ef70d17497300fb3c82ca", "rating": 7.0, "review_text": "Following the outbreak of \"Simian Flu\" that has all but wiped out human civilisation, an exploration into the jungle to inspect the remnants of an old dam introduces \"Malcolm\" (Jason Clarke) - rather aggressively - to the apes that occupy the woods. \"Caesar\" (Andy Serkis) is their leader, and keen to ensure a peace so he makes it clear that each should stick to their own territory, and leave each other be. It seems the folks need the dam, though, and after a bit of toing and froing, they manage to convince the apes to allow them to try to make the dynamos work - before what's left of their city runs out of power. This uneasy truce has opponents on both sides, but it's the scheming \"Koba\" (Toby Kebbell) who finally takes a step that ensures that war cannot be avoided. Which will win out in the end? Will either side actually win at all? Matt Reeves plays his cards really well here. He manages the sense of menace between the two parties with an expert hand, allowing the initial feelings of partnership and hope that turn into fear, betrayal and malevolence to enthral us. The characterisations - especially amongst those long fed up of living at the whim of humanity - deliver effectively too. \"Koba\" exudes an almost evil persona, an unscrupulousness and ruthlessness that would make the original Caesar blush. The photography is cleverly directed using the ruined urban and similarly dense forest scenarios to add richness and peril to the pyrotechnics, the superbly authentic looking visual effects and the general look of violence and chaos that descends as the film reaches what is clearly just the end of part one. It's a solid, characterful, story that isn't necessarily an improvement on the originals, but is certainly a strong and worthy successor.", "created_at": "2023-06-06T09:06:21.949Z"}]