[{"movie_id": 768362, "review_id": "63daac9f955c6500ce0e4c40", "rating": 8.0, "review_text": "Missing takes the same formula of Searching and expands on it in every single way. There were so many new folds in technology that were used in the film based on a younger character's perspective and technological innovations since 2018. The editing was fantastic with some very creative mashups of different apps in certain montages. While the acting is not as good as the original, mainly due to the absence of John Cho, everyone does enough to maintain a sense of believability in the plot. This film for me was much more gripping than the original, the pace and tension was amped up creating a very streamlined viewing experience. I looked at my phone thinking the movie was only 30 minutes in, and it was over an hour, it flew by. There were plenty of twists in this film, some I could see coming and other that I was completely blown away by. Towards the end, a certain plot point was introduced that almost lost me, but it turns it self around and saves it from ruining the entire experience. I wish the ending would have been better, but overall it was great film that improves on the original. \r\n\r\nScore: 81%\r\nVerdict: Great", "created_at": "2023-02-01T18:17:03.442Z"}, {"movie_id": 768362, "review_id": "63daaca285702e051c443092", "rating": 8.0, "review_text": "Missing takes the same formula of Searching and expands on it in every single way. There were so many new folds in technology that were used in the film based on a younger character's perspective and technological innovations since 2018. The editing was fantastic with some very creative mashups of different apps in certain montages. While the acting is not as good as the original, mainly due to the absence of John Cho, everyone does enough to maintain a sense of believability in the plot. This film for me was much more gripping than the original, the pace and tension was amped up creating a very streamlined viewing experience. I looked at my phone thinking the movie was only 30 minutes in, and it was over an hour, it flew by. There were plenty of twists in this film, some I could see coming and other that I was completely blown away by. Towards the end, a certain plot point was introduced that almost lost me, but it turns it self around and saves it from ruining the entire experience. I wish the ending would have been better, but overall it was great film that improves on the original. \r\n\r\nScore: 81%\r\nVerdict: Great", "created_at": "2023-02-01T18:17:06.647Z"}, {"movie_id": 768362, "review_id": "645645cbdaf57c01703d105f", "rating": 9.0, "review_text": "Okay. Damn. Woah. What? Come again?\r\n\r\nThis was brilliant. The twists, the turns, plot twist on top of plot twist, everything hit the mark and I am just ASTOUNDED. The writers did amazing with this, and I cannot believe ho well it all connected. I am just... astounded. I don't have much to say other than goddamn, I actually want a sequel to this. I don't want a sequel to this because it would likely absolutely ruin the charm of this.\r\n\r\nThis wasa wild ride from start to finish, and I cannot state enough how good this is. Give it a go; easily one of the best movies of this year.", "created_at": "2023-05-06T12:19:23.024Z"}, {"movie_id": 768362, "review_id": "6458de0e77d23b00fccac134", "rating": 6.0, "review_text": "Storm Reid (\"June\") wakes up a bit the worst for wear one morning only to find she is meant to be at the airport picking up her mother and her boyfriend who are returning to the United Sates after a trip to Colombia. Oddly, the pair are no-shows and soon she is caught in a mystery that could involve kidnapping and the FBI as the young woman tries to find out just where \"Grace\" and \"Kevin\" have gone! What now ensues is actually quite a scarily effective treatise on just how easy it is for an internet-savvy teenager to use some fairly basic navigational skills and a fair degree of common sense too use the web to acquire a comprehensive knowledge of the missing couple. For me, too much of this happens on hard to follow busy laptop or phone screens, and the story itself has one or two pretty substantial holes - those becoming annoyingly evident and implausible as the plot develops. Still, it's a decent effort from Reid and is an effectively paced drama that just about keeps the interest for the almost two hours it takes us to reach the really rather convoluted and far-fetched resolution.", "created_at": "2023-05-08T11:33:34.028Z"}, {"movie_id": 768362, "review_id": "64702ea3c5ada500c1a32cbf", "rating": 8.0, "review_text": "Aneesh Chaganty made an immediate impact with his 2018 feature debut Searching. While the Google alumnus was not the first to use the screen life format (that is, telling a story only through what we can see on computer screens and digital devices), Chaganty certainly popularized it with a compelling story of a father looking for his missing daughter.\r\n\r\nIn 2023’s Missing, Chaganty produces and gets a ‘story by’ credit but hands the screenwriting and directing to Will Merrick and Nick Johnson. This spiritual follow-up to Searching again revolves around someone who vanishes. The roles get reversed in Missing, replacing a parent who has to fumble his way around social media as the primary searcher with the very tech-savvy June Allen (Storm Reid), a teen who is looking for her missing mother, Grace (Nia Long).\r\n\r\nWhile Aneesh Chaganty isn’t at the helm this time around, his influence is still very apparent in Missing. We don’t see June all that often, but as in Searching, we get a sense of what the character is feeling when we watch her type a message in a chat box but doesn’t send it, letting the cursor blink for a few moments before erasing the text and typing a revised message that’s more thoughtful. Anyone who has used computers would be able to relate to moments like these where we write off the top of our heads, sometimes in a very emotional state, only to catch ourselves and think better of what we’ve said. In lieu of seeing facial expressions or hearing line readings, this approach to conveying emotion and giving insight into a character’s thoughts is one of the keys to a screen life narrative, giving the story a beating heart when it could easily lean too much into the technical side and become cold and soulless.\r\n\r\nAnother wrinkle that Merrick and Johnson’s film introduces is the lack of money for the protagonist. Being a high schooler, June doesn’t have much in the way of financial resources and is entirely dependent on the money her mother left prior to going down to Colombia on vacation. This presents a challenge when the FBI’s investigation into Grace’s disappearance doesn’t make enough headway for June, forcing her to hire someone down in Colombia to help find clues.\r\n\r\nWith June’s limited funds, she isn’t able to hire a private investigator and is only able to afford the services of Javier (Joaquim de Almeida), an online platform worker. The inclusion of this character grounds the story as Javier is the type of ordinary person one would expect to come across in today’s gig economy. Being a father himself, Javier connects with June, understanding her desperation to locate her missing mother. The burgeoning relationship between Javier and June is one of the highlights of this film, helping to build the emotional resonance that the story needs to keep viewers engaged.\r\n\r\nWith the twists in the narrative and rock-solid performances from Reid and de Almeida, Missing is one of the rare films that manages to equal the trailblazer that came before. Merrick and Johnson’s movie doesn’t have the novelty of Searching, but their take on an online missing person search changes enough elements to make it feel fresh. This film is a great ride and anyone who enjoyed Searching should give it a look.", "created_at": "2023-05-26T03:59:31.868Z"}, {"movie_id": 768362, "review_id": "6564f90ea6c10400c40b243f", "rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/missing-mini-review\r\n\r\n\"Missing may not surpass the original, but it stands as a compelling standalone sequel. The screenlife storytelling technique remains fascinating, as debutants Will Merrick and Nick Johnson bring an insane level of mind-blowing detail to every single digital frame.\r\n\r\nThe tense, twisty narrative holds a generic yet efficiently developed mother-daughter emotional core. accompanied by a wonderful score, smooth pacing, excellent performances, and high entertainment value. Believability is stretched a tad too much in a crazier screenplay, and the screenlife format poses a challenge in conveying the more dramatic moments.\r\n\r\nMinor issues that won't change an inevitably fantastic reception from a broad audience.\"\r\n\r\nRating: A-", "created_at": "2023-11-27T20:16:14.084Z"}]