[{"movie_id": 484468, "review_id": "5d397796ab68496bf785866d", "rating": 2.0, "review_text": "Me and my kids where shopping for other stuff at FNAC in Geneva, our go to store for not too advanced stuff in audio, video and computer gadgets, when we found this movie.\r\n\r\nI made a quick search on IMDb and it looked like it might, finally, be a good French made movie. Apart from Louis de Funès comedies that is, I really love most of those.\r\n\r\nWell, it turned out to be a huge disappointment. I guess I should have checked a bit more. For instance the fact that the oxygen wasting “critics” at Rotten SJW Tomatoes gave it a 100% rating should have been a red flag. Or maybe the ludicrous non-descriptive one liner description of the movie. I mean, it’s like buying a car from a dealer that says “It’s a cool car”.\r\n\r\nWell, in my gaming days I was a great fan of submarine simulators, especially WW2 ones, so I guess I got suckered.\r\n\r\nFor starters, the premise of the movie itself, once you start watching that is, is nonsensical. One, I say ONE, missile is fired against French territory, it is assumed to be nuclear, no real evidence, and France decides to retaliate while said missile is still in flight. Seriously?\r\n\r\nThat’s something that North Korea would do. Not a civilized country and despite the fact that France right now has the worst president in modern history I would still say France counts as a civilized country.\r\n\r\nThe the movie starts with some “action” and here we are immediately shown that the writer is totally clueless as far as any form of military procedures, strategy or … well.. whatever. A nuclear submarine surfaces, the captain, the CAPTAIN, goes up in the conning tower and fires a hand held SAM on a chopper sent from a destroyer nearby. Oh, by the way, he forgot to remove the safety on the first try. The destroyer does absolutely nothing during this exchange. You’re fucking kidding me ???\r\n\r\nThen the movie spends a shitload of time with the hero moping and moaning and being unfairly treated by the hierarchy. The film got really boring at this point. The one good part is that the superior officers, at the end, is actually the most competent characters in the movie.\r\n\r\nWhen the action finally starts again it’s … well the same crap as before. Utterly unbelievable and totally unrealistic. Even the dumbass president Macron would, hopefully, known that a nuclear strike cannot be called off just like that. And when it finally comes to blows, for some reason, the “enemy” submarine has all kinds of countermeasures while the “good guys” never launches any. As I wrote before, the writer is clueless.\r\n\r\nIt’s just a incredibly bad movie. Full stop!", "created_at": "2019-07-25T09:34:14.288Z"}, {"movie_id": 484468, "review_id": "5e70024481140f001736dfbe", "rating": 6.0, "review_text": "There is a large section of the film set out of the water, but once back under the waves it moves more quickly, the story putting all its weight on Chanteraide's ears. If you're howling for a slice of Tom Clancy-esque military action cheese, you'll enjoy 'The Wolf's Call'.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-wolfs-call-suspense-silliness-and-sonar-sweeps", "created_at": "2020-03-16T22:48:36.171Z"}]