[{"movie_id": 1259, "review_id": "501d3a5819c2950d2c004e0e", "rating": 6.0, "review_text": "This is one of those films like a great pasta dish where everything is just right but somehow you still don't feel the restaurant is justified charging $21.95 for a plate of noodles and tomato sauce. The direction is top notch, Cate Blanchett as Sheba Hart is great and Bill Nighy supporting just works. As much as I usually adore Judi \r\nDench's acting, I thought she was a little too one-dimensional in this role. But given her choice, she executed the role with the usual Dench precision.\r\n\r\nThis is a twisted love triangle story with very real characters. If you're the kind that picks up the dirt rags in the checkout line at the supermarket, you'll probably love the story. I gave it a 7 on my scale. It won't blow you away, but you won't feel like you've wasted your time either.", "created_at": "2012-08-04T15:06:00.000Z"}, {"movie_id": 1259, "review_id": "63fb03ba57176f007cfd3c9d", "rating": 9.0, "review_text": "**Lust, loneliness and bitterness in an engaging film with two great actresses.**\r\n\r\nI was very impressed with this film, which combines two huge and very talented actresses and a script full of tension and very well developed. It's not something new or original, and there are a lot of relatively tense films that are set in a school environment. I can quote one that I saw recently, and that I remembered while watching this film: “The Children’s Hour”. Alright, the movie is about a hypothetical lesbian relationship between teachers, it's a different kind of scandal than what we have in this movie, but somehow it came to my mind. It is not an award-winning film, but it was nominated for two BAFTA, three Globes and four Oscars. Moreover, it was a competitive year, with several great films competing.\r\n\r\nThe script is very loosely based on a real case in which a female teacher had a sexual affair with a minor student. The situation is scabrous and criminal, despite the fact that it is also a type of frequent sexual fantasy to be found. However, the film is not about that, but about the tortuous relationship between the young teacher and an older colleague, who discovers the secret. Lonely, bitter, critical, psychologically unstable, with serious problems relating to other people and, eventually, a strongly repressed lesbian, the elderly woman creates an abusive relationship where she subjugates and blackmails her supposed friend, mercilessly manipulating her to obtain almost exclusivity of your attention.\r\n\r\nIn addition to a really good story, the film has an excellent cast and two great actresses who do a superb job. Judi Dench deserves a standing ovation for the work she leaves in this film: in addition to the sarcastic, almost cruel way in which she narrates the story, the actress was huge and impressive in the way she brought the character to life and played opposite Cate Blanchett. This one, in turn, was also very good, and does an equally good job, but it does not manage to have the magnetism of Dench. The two characters are also very different: Blanchett has on her hands a softer, more one-dimensional, less complex character than Dench, who is given more challenging, more complicated material, and a character who is really challenging to play convincingly. Despite being young, and having a minor role in the film, I also enjoyed Andrew Simpson's contribution.\r\n\r\nTechnically, it is a discreet film, with excellent cinematography, with dark notes of great skill, which help to thicken the tense environment in which the film develops. With good sets and costumes, but within the predictable, and a relatively good soundtrack that was composed by Phillip Glass (not as good as the one he made in other films, however), the film is discreet, but competent, and gives us excellent production values.", "created_at": "2023-02-26T07:01:14.450Z"}]