[{"movie_id": 501979, "review_id": "5f4d1de41684f70037713b43", "rating": null, "review_text": "It has been 29 years since Bill (Alex Winter), and Ted (Keanu Reeves) took their Bogus Journey and after years of rumors and scripts; “Bill and Ted: Face the Music” has arrived. The film like many others had to contend with the Pandemic and opted for theatrical release where allowed and Video on Demand.  Some chains have opted not to carry the film due to the simultaneous release on VOD but viewers can now see the film.\r\n\r\nBill and Ted find themselves struggling to make Wyld Stallions a success as after starting out with a #1 hit; subsequent offerings were largely ignored by the public which caused them to slide further into mediocrity and have family suggesting that perhaps it is time to give music up and get real jobs.\r\n\r\nTheir inept career has also caused tension with their Princess wives and they have gone to couples counseling although to the dismay of their therapists Bill and Ted insist that all four members take part at the same time.\r\n\r\nThe only thing going well for the two are their daughters Thea (Samara Weaving), and Billie (Brigette Lundy-Paine) who truly are chips off the block and not only embrace their father’s offerings but are inseparable themselves.\r\n\r\nWhen a courier from the future (Kristen Schaal), arrives and takes Bill and Ted into the future they learn that they are in danger of failing their destiny as the Universe is falling apart and they have yet to write the song that will save the universe and have only 77 minutes to do so.\r\n\r\nThe duo then decides to travel to the future in their old Phone Booth and take the song from their older versions. Naturally this does not go as planned and Bill and Ted find all sorts of disturbing versions of themselves and precious little to help them achieve their destiny.\r\n\r\nSadly after the setup the film loses momentum fast and becomes a series of what new and crazy look and personas can Bill and Ted be put into with some very laborious pacing as it seems more like a series of improve sketches than a scripted film as scene after scene fail to go anywhere of note and joke after joke does not deliver.\r\n\r\nIt almost became tedious watching the second half of the film. There was a killer robot thrown in but it did little to advance the story forward beyond being a token bad guy and becomes annoying as the film goes on. Thea and Billie take on the role of their dads from the first film and gather a collection of musicians from the past in order to back their dads but the entire finale falls flat. What really bothered me was that the film in many ways undermines the two prior films as it was clearly established that the music of Bill and Ted was their legacy; not one specific song and the way it is ultimately revealed is very underwhelming and reduces their significance.\r\n\r\nIt was nice to see the duo back but sadly the film cannot build upon nor sustain the solid premise it establishes. In the end “Bill and Ted: Face the Music” has a few laughs and some fun nostalgia but disappoints and does not reach its potential.\r\n\r\n2.5 stars out of 5\r\nwww.sknr.net", "created_at": "2020-08-31T15:57:24.541Z"}, {"movie_id": 501979, "review_id": "5f507a6b439be100336a72eb", "rating": 8.0, "review_text": "Like its message, 'Bill & Ted Face The Music' is for everyone. If you didn't watch or like the originals because they were “crude“ or “dumb“, while this movie still has those moments, it has been toned down. If you're a die-hard fan, this will fill your hunger for content as well as serve as a beautiful conclusion to the characters. Even if you've never seen the originals, I highly recommend it to everyone: it's rated PG so literally (while socially distancing) take the whole family, have an truly excellent and much-needed laugh, and enjoy the so totally rad music.   \r\n\r\nBill and Ted said it best: “Be excellent to each other and party on, dudes!“\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-bill-and-ted-face-the-music-the-totally-excellent-most-bogus-return-of-80s-icons", "created_at": "2020-09-03T05:08:59.175Z"}, {"movie_id": 501979, "review_id": "5f636f5b84448e0037648779", "rating": 10.0, "review_text": "While Bill and Ted haven't changed over the years, their daughters are just like them!\r\n\r\nThis movie was just EXCELLENT! I mean, sure Reeves looked weird without his beard, but it was totally RAD to see him and Winter reprising their iconic roles.\r\nIt really was just awesome. Made me feel all positive after.\r\nAnd the final scene...truly the greatest song ever performed!\r\nIt just makes you forget about all the recent crap that happened this year.\r\n\r\nThe most entertaining movie of 2020. *doing the iconic Bill & Ted pose*", "created_at": "2020-09-17T14:14:51.524Z"}]