[{"movie_id": 6637, "review_id": "5d7cc013d5191f2f513f0623", "rating": 8.0, "review_text": "Joyous boys own yarn full of the serial silliness of movies past, present and the first movie!\r\n\r\nAs with the enormously successful first film, this sequel irritated as many people as it entertained. It's just the nature of the family friendly blockbuster, that some film fans refuse to accept them as viable fun family fare, whilst others can easily run with it and have a great time. The highbrow versus the lowbrow? Well maybe if you want to really be speaky arty about it... \r\n\r\nNational Treasure: Book of Secrets made over $450 million at the worldwide box offices. Now we are told that financial success is no marker for quality of product, that's fair enough, but what is undeniably true is that it means there were considerably \"a lot\" of happy paying punters! From way back in the day when we had the likes of Gunga Din, Beau Geste and The Adventures of Robin Hood, there has been a considerable market for the action adventure movie. Some are better than others, some are even more brainy, but mostly they deliver a set pattern of what many people want.\r\n\r\nThe makers of this sequel just go bigger than the first film whilst following exactly the same formula. Nicolas Cage's treasure hunting Benjamin Franklin Gates has to follow clues to treasure again, only this time it's to clear his family name since his granddaddy has been implicated in the assassination of Abraham Lincoln. Justin Bartha and Diane Kruger are again along for the ride, while Jon Voight gets more screen time as Daddy Gates. Helen Mirren joins the fray as the estranged Mommy Gates, Ed Harris slots in for villain duties and Bruce Greenwood adds class as the president of the USA.\r\n\r\nThe stunts and set-pieces are humongous, the traps and clues more elaborate than before and the photography (Amir Mokri and John Schwartzman) once again is gorgeous. It hurtles along at a nifty pace, stopping only to explain the various plot machinations to younger viewers, and the comic by-play between all the principal players is set in stone. Is it full of implausibilities, insulting history and credulity stretching beyond belief? Yes! Of course, that's why many of us action adventure fans escape into such high energy nonsense. Those expecting cerebral tickles or those offended by basic family blockbusters should quite simply stay away. 7.5/10", "created_at": "2019-09-14T10:25:23.552Z"}, {"movie_id": 6637, "review_id": "64611402dbbb4200fc87aa3a", "rating": 7.0, "review_text": "Well, what do you know, a sequel that's pretty much the same story as the original. But so what? This movie isn't as good as the first but it's just as enjoyable. So let's get on board and find some treasure. Just one thing, can someone explain to me why Nicolas Cage got so loud in this one?", "created_at": "2023-05-14T17:01:54.074Z"}]