[{"movie_id": 412656, "review_id": "603fc326a843c1006e3fad13", "rating": null, "review_text": "Adapting a series of books into a movie is often a daunting task. As anyone who has seen many Stephen King adaptations can attest; plot complexity, characters, and depth are removed in order to condense the story into a two-hour or less run time.\r\n\r\nThe rise of streaming services has allowed many books to be adapted into series without having to cut much of the adult content in the books which would make it difficult for network television.\r\n\r\nAs such it makes adaptations such as “Chaos Walking” a delicate undertaking. The film is based on a series of books and stars Tom Holland as Todd; a young ma living on a distant world where there are no women and people can hear and see each other’s thoughts by a process known as “Noise”.\r\n\r\nTheir rustic colony is run with a firm hand by their Mayor (Mads Mikkelsen); who keeps those around him from seeing his thoughts which gives him a big advantage over those who rule.\r\n\r\nWhen a landing craft from a mothership filled with a new wave of colonists crashes on the planet; Todd is shocked to find that the only survivor is a woman named Viola (Daisy Ridley) whose arrival disrupts the community.\r\n\r\nThe Mayor wishes to keep her from contacting her ship so they can seize it when it lands to maintain control of his empire as he sees the arrival of new individuals as a threat to his power.\r\n\r\nTodd and Viola escape trying to reach a distant colony where she hopes to find a way to warn her ship about the danger the Mayor and his men present and they pursue the duo to keep this from happening.\r\n\r\nThe film lightly touches on the native race that Todd believes killed all the women of their colony but they are not visited save for a brief appearance. It is clear that the Mayor is hiding something and the reveal of what and why is fairly underwhelming which reduces him and most of his followers as thinly developed stock characters.\r\n\r\nThere is also the mystery as to why the Mothership does not bother to do any sort of follow up when they did not hear from their lander and like many aspects of the film; require the audience to simply go along with things and not ask too many questions to make things work.\r\n\r\nThankfully the two leads are interesting enough and they hold attention even when the story is slowly moving along with scene after scene of rivers, woods, and a little conversation.\r\n\r\nOne big issue with the film is the Noise as the visualization of thoughts as well as hearing them mixed in with verbal communication can get very confusing as it is like multiple voices in a crowded room.\r\n\r\nDespite the issues, the potential is there and I found myself wondering what was next for the characters and hope that they do adapt future books in the series.  While the film on its own does not work as a fully developed story’ as an introduction to the series it does enough to peak the interests for more.\r\n\r\n3.5 out of 5", "created_at": "2021-03-03T17:11:02.602Z"}, {"movie_id": 412656, "review_id": "603fca74c072a2004333aaa7", "rating": 3.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nAfter decades of experiencing so many films and understanding the respective industry, I rarely get extremely excited for an original sci-fi movie starring famous actors. I wouldn’t be surprised if Chaos Walking is the most anticipated film of the month for thousands of viewers, which isn’t an easy decision having in mind March is releasing tons of highly expected movies, such as Raya and the Last Dragon, Cherry, Zack Snyder’s Justice League, Godzilla x Kong, amongst others. It’ almost impossible not to feel remotely interested in watching a film with such a phenomenal cast - Tom Holland (Spider-Man, The Devil All the Time), Daisy Ridley (Star Wars, Murder on the Orient Express), Mads Mikkelsen (Doctor Strange, Rogue One: A Star Wars Story), Demián Bichir (Land, The Grudge), Cynthia Erivo (Widows, Bad Times at the El Royale), and more.\r\n\r\nAdd Doug Liman (The Bourne franchise, The Edge of Tomorrow) as the director and screenwriters with tremendously successful credits as Patrick Ness (A Monster Calls) and Christopher Ford (Spider-Man: Homecoming), what could go wrong? Well… almost everything. I possess no knowledge of the source material, but from what I could gather, the book trilogy of the same name was very well-received, which I don’t doubt for a second. If there’s one thing no one can take away from Chaos Walking is its incredibly captivating concepts and imaginative visual ideas. From the premise of people being able to hear men’s thoughts (noise) to the actual visuals of said brain activity, I felt deeply invested during the first act.\r\n\r\nThe futuristic setting is somewhat familiar, but the production/set design definitely set an engaging atmosphere. The score (Marco Beltrami, Brandon Roberts) also features interesting tracks that create a sense of wonder in this new world. Unfortunately, this is as far as I can go compliment-wise. Sure, the cast offers remarkable performances, especially Holland and Ridley, who obviously share most of the screentime as the underdeveloped protagonists, but sadly this is one of those movies where it’s hard not to find a significant flaw with everything. The lack of proper characterization is one of the main issues. While Holland’s character misses a regular arc - he has no evolution whatsoever, ending the film with the exact same defects as in the beginning - Ridley’s character raises dozens of questions that remain unanswered about herself, her past, her abilities, and her origins.\r\n\r\nThe new world presented to the viewers packs hundreds of unquestionably innovative and exciting ideas, but none reaches even a fraction of its potential. The “superpower” of hearing thoughts is rarely seen in a different manner other than chaotic, annoying noise, which is hugely disappointing, having in mind the scarce showings of its real power. Nevertheless, the most frustrating component of the narrative is the introduction of massively important story elements that are completely forgotten by the end of the movie, namely - without getting into spoilers - an entire native population that remains as one of the most fascinating aspects of the screenplay that wasn’t remotely explained.\r\n\r\nNowadays, people have more knowledge and understanding of how much studios impact the production of any film. Honestly, I don’t know if this is one of those projects ruined by awfully dumb corporate demands or if Doug Liman and his team of writers screwed the pooch. One thing is for sure: director, screenwriters, and/or producers, they’re the people to blame for such a frustratingly terrible adaptation. I apologize to Doc Crotzer, but this is one of the worst editing jobs I’ve seen in years, though I want it to be clear: Crotzer is far from being the sole or main culprit of such a horribly put-together movie. The camera work is also all-over-the-place (Ben Seresin).\r\n\r\nFinally, I don’t know if this following story detail is as explicit and barely explained in the source material as it is in this film, but due to the lack of any decent explanation besides “because”, I strongly dislike the whole “everyone can hear men’s thoughts, but no one can hear the women’s”. To be clear, my issue isn’t related to the idea but to its evolution in this movie. Men, especially Holland’s character, are shown to think like a primate with sexual thoughts concerning women and offenses to everyone and everything. Men’s thoughts represent them as utter pigs. However, the whole “women’s thoughts are hidden from everyone” can easily be interpreted as “women don’t have brains”, especially considering the film’s failed attempt at elaborating this concept.\r\n\r\nChaos Walking will end up as one of the most disappointing, frustrating movies of the year. In addition to this, it’s also another entry in the list of “films with innovative, interesting concepts that fail to reach half of their potential”. Besides the engaging production design, a cool score, and decent performances, any viewer will struggle not to find a massive flaw in every single aspect of the narrative. From the dozens of unanswered questions regarding Daisy Ridley’s character to the lack of a proper arc for Tom Holland’s role, the underdeveloped protagonists are just one of many screenplay issues. Critical plot points and story elements either miss an explanation or are entirely forgotten by the end of a horrendously edited movie. Transitions between cuts are very choppy and make zero connection between storylines. The whole “men’s thoughts are seen by everyone, but women’s thoughts are not” is depicted in a way that leaves men portrayed as pigs and insinuates women have no brains. I genuinely don’t know if this massive disaster is due to studio interference and/or to the director and screenwriters team-up, but one thing is for certain: personally, it's one of the worst films of the year.\r\n\r\nRating: D+", "created_at": "2021-03-03T17:42:12.118Z"}, {"movie_id": 412656, "review_id": "60a02e6980729800584a0250", "rating": 6.0, "review_text": "It should first be noted I have never read (or even heard of) the novel this was based upon, so I don't have any preconceptions or expectations on how the adaptation was handled. With that out of the way, I found this to be... fine. A little messy in narrative and structure but I suppose moderately entertained. I also liked Tom Holland in the lead for the most part and Daisy Ridley grew on me though her character isn't very well developed. It's probably worthy of a rental but doubtful I'll revisit this very soon other than to listen to the commentary by Doug Liman considering the behind-the-scenes issues and major re-shoots. **3.0/5**", "created_at": "2021-05-15T20:26:17.225Z"}, {"movie_id": 412656, "review_id": "631597569408ec007bed4f6a", "rating": 1.0, "review_text": "In 2257 AD, the colonists of the planet New World, all men, have been afflicted with a condition called the Noise, which causes everyone to see and hear each other's thoughts. Judging by the level of intelligence the characters exhibit, this ought be a deafeningly silent planet. \r\n\r\nPeople who colonize a new world and literally call it \"New World\" can't have much in their minds (perhaps they should have called it Planet Faulkner, since everyone here seems to think in an uncontrollable stream of consciousness and/or has the mental faculties of a Benjy Compson). When sort of halo envelops their heads when they 'think,' it’s like the light is on but no one’s home. \r\n\r\nThe only one here who manages to avoid appearing like a complete idiot is Mads Mikkelsen, and only because the Danish actor is too smart to play this dumb; his character, David Prentiss, is not particularly brilliant, but one can at least give him the benefit of the doubt — after all, he’s more insane than he is inane. \r\n\r\nPrentiss is the only one who has learned to control his \"Noise\", which shouldn't be too difficult; ever heard the expression 'think before you speak?' I don’t think it’d really be all that hard to 'think before you think;' these characters, however, are mentally incontinent. \r\n\r\nEither director Doug Liman and screenwriters Patrick Ness and Christopher Ford are as dumb as the movie they've made, or they assume the audience is. For some reason, women can see and hear men's thoughts, but men can't see and hear women’s — making the “Noise” nothing more than a clumsy allegory for female intuition.\r\nThis actually has to do directly with the lack of women in Prentisstown (of which, as the name suggests, Prentiss is the mayor), in a twist preposterous enough to make M. Night Shyamalan himself scratch his head in disbelief.", "created_at": "2022-09-05T06:29:42.708Z"}, {"movie_id": 412656, "review_id": "6535b6cb42d837010ba9433b", "rating": 6.0, "review_text": "Fairly close to being a good film, for me at least.\r\n\r\nI could see something positive coming from <em>'Chaos Walking'</em> at differing moments, though unfortunately all in all it does end up being a pretty underwhelming 109 or so minutes. It holds an interesting concept and I was very much willing it to come to fruition in an entertaining manner but it never does.\r\n\r\nThe 'inner' monologue thing does get a tad annoying, it isn't amazingly implemented via special efforts nor audio - less would've been more, especially of the phrase \"control your noise\" which is said too often for my liking. The characters, including the main two, could've been far stronger as well, though the acting talent themselves actually do OK.\r\n\r\nDaisy Ridley and Tom Holland are good names to have attached, though I didn't sense enough onscreen chemistry between the two. Mads Mikkelsen is alright, David Oyelowo's character is probably the only one who didn't intrigue me from the main bunch; the filmmakers could've utilized him better.\r\n\r\nNo surprise to see that this has been received poorly. I didn't dislike it, though I can't really defend it all that strongly either.", "created_at": "2023-10-22T23:56:59.577Z"}]