[{"movie_id": 10192, "review_id": "5662813a9251412ad3002731", "rating": 7.0, "review_text": "Dreamworks play safe and sign the series off with dignity.\r\n\r\nAfter the monstrosity that was Shrek the Turd, the Dreamworks team behind the Shrek franchise woke up and realised what made the series so popular in the first place. Shrek Forever After is not a particularly great film, but it finds some firm footings to appease the adults and children alike.\r\n\r\nThematically it's as safe as houses, it pitches Shrek into a \"It's a Wonderful Life\" scenario, where the big green ogre gets to spend a day away from the life he didn't realise he was happy with in the first place. Making a deal with the nefarious Rumpelstiltskin, Shrek finds a world of darkness for ogres, a world ruled by a psychotic who has an army of flying Margaret Hamilton's to do his bidding. Worse than that, Fiona doesn't know him, she's the leader of the resistance and has no time for some big green ogre love. Donkey is all mangy and Puss in Boots literally has become a fat cat, it's a horrible life, man!\r\n\r\nThe action and graphics whizz past the eyes in what is a perfectly pitched time frame of 90 minutes. It never reaches the heights of the first two movies, but it doesn't strain for laughs or narrative cheek (Pied Piper as a bounty hunter? Genius), or more crucially, it's never dull, something part 3 can't safely claim to not be. It bows out with head held high, not so much in a blaze of glory, but with a dignified recognition of the fact it's time to retire to the swamp and chill out. Take it easy Shrek and the gang. 7/10", "created_at": "2015-12-05T06:16:26.804Z"}, {"movie_id": 10192, "review_id": "589c43da92514124d80037e9", "rating": 7.0, "review_text": "Didn't really want to watch this. I mean, 4th movie??? Please stop already. But then it's hot and we have nothing else to do so ok. Shrek it is. \r\n\r\n\r\nThe story is a little bit of continuation from the Shrek trilogy. But then of course, the story was crazy, going back to the past just so they can have a story from it and make another movie from it. Just seeing the trailers always make me say \"Please stop making Shrek movies.\" But after seeing this movie I realized, I was entertained. It still had those funny moments although the first 3 were definitely funnier than this one. \r\n\r\n\r\nMy rate for this movie is B+.", "created_at": "2017-02-09T10:26:34.177Z"}]