[{"movie_id": 986054, "review_id": "64eef41677d23b012e894e7b", "rating": 6.0, "review_text": "When \"Joan\" (Amy Sedaris) unfortunately has a seizure caused by the strobe lighting (or perhaps the singing) at an am-dram performance of \"Bye Bye Birdie\", her profiteering and none-too-bright son \"Troy\" (the Channing tatum-esque Jimmy Tatro) finds himself in charge of her summer camp for would be, young, theatricals. This school is largely held together by \"Amos\" (Ben Platt), \"Rebecca-Diane\" (Molly Gordon) and the technical factotum \"Glenn\" (Noah Galvin). Next door there is a much more exclusive operation and they have their eyes on the valuable land, so when foreclosure looms they all must rally round to raise some cash and save the place from demolition. Can they? Do we actually want them to? I don't come from a nation where there is much of a summer \"camp\" culture, and so much of this just came across as an overly contrived concept with all of the precociousness of \"Glee\" but none of the character of \"Fame\". The kids are largely just annoying, as is the dithering storyline between the two adult principals. There is one decent song but you have to wait a while for that, otherwise the POV documentary style of photography offers an intimacy into the lives of some professional no-hopers charged with instilling some semblance of hope into these youngsters that just didn't engage me. I was on my own in the cinema when I watched this - it's better than that, but only just.", "created_at": "2023-08-30T07:47:34.554Z"}, {"movie_id": 986054, "review_id": "65063c10fa27f4010c4a1216", "rating": 6.0, "review_text": "Films in the mockumentary genre can be thoroughly satisfying entertainment experiences when done right, as seen in such examples as “Zelig” (1983), “This Is Spinal Tap” (1984) and “Fear of a Black Hat” (1993). But the key, as noted above, is in doing them right, something to which this latest such offering from writer-directors Nick Lieberman and Molly Gordon can’t lay claim. The problem here is that the picture is too hit or miss on too many fronts: When it’s on, it’s brilliant and genuinely hilarious (especially in the film’s final act); however, when it’s not, it tries too hard to be funny and often ends up falling flat. That’s unfortunate, since the picture’s high points – as good as they are – simply aren’t enough to make up for the low ones. This faux look into life at an Adirondack theatrical-themed summer camp for youngsters and teens has a few too many diverse story threads that stray from the picture’s central premise. Then there are the characterizations, which are truly well developed but focus more on the camp’s adult staffers than on the characters that should matter most – the campers themselves. What’s more, the narrative relies heavily on the use of graphics to move the story along, but they frequently stay on the screen for unduly short durations, a practice that becomes progressively irritating over time. In all, this is a production that feels half-finished, one sorely in need of tidying up to make it work as well as it might have. Perhaps that’s due in part to the picture’s volume of material – 70 hours of footage – but that abundance of images likely wasn’t culled as effectively as it might have been. It feels as if the film aspires to be like one of Christopher Guest’s mockumentary projects (most notably “Waiting for Guffman” (1996)) but just doesn’t quite come up to the same level, despite a strong underlying basis that should have leant itself well to this format. To be sure, this is by no means an awful release; it makes for a modestly pleasant at-home streaming option for a midweek evening. It’s just regrettable that it doesn’t live up to what it could have been.", "created_at": "2023-09-16T23:36:48.644Z"}]