[{"movie_id": 930564, "review_id": "65224768c50ad2012c1d82ae", "rating": 7.0, "review_text": "I was quite nervous when I saw this. I was expecting a sort of hybrid of \"Another Country\" meets \"Brideshead Revisited\" as the story of \"Ollie\" (Barry Keoghan) and his aristocratic pal \"Felix\" (Jacob Elordi) unfolds. Both are at Oxford university, but the former man is very much a poor relation of his well-heeled contemporaries. One afternoon, though, he comes to the aid of \"Felix\" lending him his bike, and what now ensues is a friendship that sees the two gradually start to bond and for the latter to invite his new friend to his eponymous stately pile as a guest of his mother (Rosamund Pike) and father (Richard E. Grant). Tagging along throughout this experience is the slightly malevolent and jealous \"Farleigh\" (Archie Madekwe) as their summer vacillates from the hedonistic and enjoyable to the ghastly and tragic. It's a bit of a slow starter, but once we arrive at the ancestral pile the story starts to gather pace and \"Ollie\" proves to be quite adept at navigating - even manipulating - the frequently quite treacherous environment in which he finds himself. It is definitely too dialogue heavy, but Keoghan is good here and there is quite an effectively building degree of menace as we start to realise that maybe things aren't all quite what they seem. I found Madekwe also rather good as the odious hanger-on (only a posher one) and Carey Mulligan walks quite a characterful tightrope too. The photography and aesthetic of the film along with Anthony Willis's score all add a degree of richness to a story that isn't as derivative as I feared. I can't think it's a film I will remember in a few years, but it is well worth a watch as Mr Keoghan continues on his journey to what must be greater success.", "created_at": "2023-10-08T06:08:40.929Z"}, {"movie_id": 930564, "review_id": "6574fcdaa84a4700ab871577", "rating": 3.0, "review_text": "Sometimes you come across a filmmaker whose works you just don’t like. And now, after two features in, I can honestly say that about writer-director Emerald Fennell. I didn’t care much for her debut outing, “Promising Young Woman” (2020), and I can say the same (and more) about her follow-up effort, “Saltburn.” This alleged thriller about a seemingly awkward but quietly sinister Oxford student (Barry Keoghan) who ingratiates himself into a family of wealthy English aristocrats features a story and characters about whom, quite frankly, I couldn’t care less. (Think “The Killing of a Sacred Deer” (2017) with a cast of eccentric old money cronies and a wolf in sheep’s clothing.) This assemblage of utterly reprehensible characters living utterly reprehensible lives and zealously adhering to utterly reprehensible values fails to engender viewer empathy, interest or even connection. Much of the narrative is predictable and glacially paced, incorporates sequences that are included for little more than forced shock value, features monodimensional and blatantly obvious (almost trite) character development, and frequently stumbles in attempts at humor that are wedged in largely for the sake of convenience or calculatedly timed comic relief. It’s the kind of picture that prompts regular looks at one’s watch to see how much more one must endure and delivers welcome sighs of relief when the end finally comes. What’s more, given the combined talent pool for this production, it’s a genuine shame to see the likes of Rosamund Pike, Carey Mulligan and Richard E. Grant relegated to supporting roles in which their abilities are sorely underused. And then there’s the excessively hammy performance of Keoghan, who’s quite obviously (and knowingly) acting and not disappearing into the bona fide portrayal of a character. In all, this offering feels like a picture that tries awfully hard to see how much it can get away with, especially when seeking to invoke dropped jaws among audience members, much as this director’s cinematic predecessor attempted to do. Save your money, and don’t waste your time on this vastly overrated release from a vastly overrated filmmaker.", "created_at": "2023-12-09T23:48:42.237Z"}, {"movie_id": 930564, "review_id": "658bab8e6728a86e2f27dcf9", "rating": 8.0, "review_text": "Has a case of the samesies on the final chapter. I think we get it. I liked the people. Fun characters outside of you know who. Does anyone really say the vampire line? Great character reveal in the slurp. For me, the explanation station took away from the experience. Feels sloppier the more you see. But then you see it all. Giant slopfest.", "created_at": "2023-12-27T04:43:58.503Z"}, {"movie_id": 930564, "review_id": "65926e111495656189da5199", "rating": 7.0, "review_text": "**Overall** **Entertaining** \r\n\r\nThis movie was a refreshing experience. Well directed with tight plot. Leaving the viewer always wondering what’s going to happen next?\r\n\r\nThere are some potholes and forced nudity (incongruent), but the good plot makes up for these minor shortcomings.\r\n\r\nOverall, I enjoyed this movie 7/10", "created_at": "2024-01-01T07:47:29.153Z"}, {"movie_id": 930564, "review_id": "659367a5a58902717f970334", "rating": 8.0, "review_text": "Black comedy / psychological drama of Amazon, directed and written by \r\nEmerald Fennell (from the magnificent promising Young Woman and Barbie). This one is a bit tricky one to review without spoilers so if want to see the review stop right here.\r\n\r\nIt tells a story about the scholarship student Oliver Quick (Barry Keoghan) early in the 2000 that struggle to be accepted into the high class Oxford University. He manages to met Felix Catton (Jacob Elordi) a popular student and befriends it being closer and closer in friendship with him, till he shares his sad family story background. Then he is invited to be at vacations at Saltburn, an magnificent summer place in the fields of England where he meets the eccentric and decadent family of Felix, Rosamund Pike (Lady Elspeth Catton, Felix's mother), Richard E. Grant (as Sir James Catton, Felix's father), Alison Oliver (as Venetia Catton, Felix's sister) and Archie Madekwe (as Farleigh Start, Felix's annoying cousin).\r\n\r\nWith a solid production structure with cinematography by Linus Sandgren (I must highlight this one how it works adjusting to the mood of the unfolding story), edition by Victoria Boydell and music by\r\nAnthony Willis, the movie have it greatest merit in an area that Fennel already showed before - the script. \r\n\r\nSimplifying all things the story that have some sordid sex scenes and gives hints that Ollie isn't so nice in the head as he seems, it develops almost like Promising Young Woman, to a revelling ending of a serial killer and social alpinist in the last 30min of the movie. Not something that we wouldn't foresee by the attitudes of the protagonist and background of the director / writer but nice anyway. So much that seems that I enjoyed it more than most of the people I follow.  \r\n\r\nGuess that we maybe have another contender for Academy nomination of screenplay, director and acting here. A Solid 7.9 out of 10.0 / B+ here.", "created_at": "2024-01-02T01:32:21.125Z"}, {"movie_id": 930564, "review_id": "65a3084ffcec2e0121d58fc0", "rating": 8.0, "review_text": "**It's been a long while since I stumbled upon a film that wasn't painfully predictable.** \r\n\r\nWhat struck me the most was this bizarre yet fascinating connection I developed with a psychopath. It sounds odd, but the film masterfully reels you into this vortex of the character's emotions and psyche. And then, somewhere along the line, it cleverly severed this connection, leaving me... adrift.\r\nHowever, what really resonated with me was the cinematography. The camera work, grading, lighting – everything seemed meticulously crafted to enhance the narrative and the mood of the film. There were moments where I was simply awe-struck by the beauty of a single shot.\r\nWorth watching.", "created_at": "2024-01-13T22:01:51.381Z"}, {"movie_id": 930564, "review_id": "65a72867aa7898012e62373d", "rating": 9.0, "review_text": "I'm disturbed. Outstandingly disturbed, mind you.\r\n\r\nIt is very out there as it features some uncomfortable moments, but that's never a bad thing if it's done right... and boy is it here. The film does an excellent job at making it all fit, which is actually quite impressive. Main plot-wise, it's not a hard one to predict... or at least not quite as unpredictable as the film possibly thinks it is based on the 'reveals' (?) at the end, but again: never a bad thing if done correctly. The main takeaway from all this is certainly the unsettling stuff.\r\n\r\nThis 2023 production also holds fantastic cast performances. Barry Keoghan is top notch, I've seen various people online rave about him as an actor but I hadn't really seen it until now. Jacob Elordi merits praise too, as does Rosamund Pike - another one I haven't previously been too keen on, though she is fun here. In fact, on paper it's an iffy cast to me. In reality, the cast are perfect. Credit also to Richard E. Grant, Alison Oliver and Archie Madekwe.\r\n\r\nNo doubt, <em>'Saltburn'</em> is a great movie! A must-watch, I'd say. Emerald Fennell is two for two with me now, after I also highly enjoyed <em>'<a href=\"https://letterboxd.com/film/promising-young-woman/\" rel=\"nofollow\">Promising Young Woman</a>'</em> <em>(same rating, fwiw)</em>.", "created_at": "2024-01-17T01:07:51.405Z"}]