[{"movie_id": 458576, "review_id": "5fec1fb61d1bf4003f13a633", "rating": 2.0, "review_text": "Now you might assume that I'm probably not the kind of person predisposed to like this film. Daniel doesn't have fun. He writes pages waxing lyrical on a film like 'Roma' that starts with a five-minute sequence of someone cleaning up dog poo, or 'A Hidden Life' that's 60% glorious shots of landscapes. But hey! I can have fun! I loved 'The Meg'! I lost my mind in the first Transformers film! When The Rock rode up a tsunami, avoiding an oil tanker that then took out the Golden Gate Bridge in 'San Andreas', I was on my feet in the cinema cheering! This film though? This isn't fun. It's too loud, too hard to follow, too bonkers to be appealing, and not anywhere near bonkers enough to be charming or good for a laugh. It's a film that basically yells at you for an hour and a half in the most aggressive, hyper-masculine way, and leaves you feeling like you've been stuck in a corner at a party for three hours having some guy tell you all about the screenplay he's going to write that will finally, finally be a good video game adaptation and never taking the hint you want a drink or a pee or a change in conversation or to run screaming from the room. I went into Paul W. S. Anderson's latest film (the guy who made 'Mortal Combat' and 'Death Race', not 'Boogie Nights' and 'Punch-Drunk Love') totally prepared to have a blast, but it gave me no time, space or inclination to do so. And then this stupid film that doesn't know whether it wants to be a bad 'Godzilla' or a shitty reimagining of 'The Dark Tower' has the audacity to set itself up for a sequel! (But hey, we're in the End Times, so it only makes sense that we would get a sequel to this trash instead of another season of 'Mindhunter'). I'm sure some people are going to get a kick out of this saga about Artemis (Hunter, of Monsters, titular) fighting big asshole spiders and being the saviour white woman to a far more impressive person of colour and crying over some ring (it was for “forever“, remember). For me? The whole thing is too loud and aggressive and dull to be the best kind of dumb fun.\r\n- Daniel Lammin\r\n\r\nRead Daniel's full article...\r\nhttps://www.maketheswitch.com.au/article/review-monster-hunter-a-meandering-mundane-monstrosity", "created_at": "2020-12-30T06:35:34.591Z"}, {"movie_id": 458576, "review_id": "608f0e892b531d006e35c5a9", "rating": 9.0, "review_text": "It appears that this movie is either quite hated or quite liked. I guess it is not that surprising though given that it is based on a video game with a very strong following so if the movie is deviating from canon, and I understand that it does, it will not matter how good or bad a movie is.\r\n\r\nWell, I have never played the game so I am not burdened with Monster Hunter canon so I have to say that I very much liked this movie. It does not really hurt that I quite like Milla Jovovich as well of course. Ron Perlman is also a favourite of mine and I really wish that he would have been in more of the movie. As it was he was only present briefly at the beginning and then a little bit at the end.\r\n\r\nAnyway, this is a fantasy, action movie of my liking. Clash of cultures, huge monsters and lots and lots of shooting, slicing, kicking and stabbing action. The story is rather simple but not really bad at all. The ships navigating the sand was a bit weird and those huge weapons they were dragging around a bit silly but then those are part of the canon.\r\n\r\nAt first I got a bit annoyed by Artemis and Hunter starting to fight each other and thought, oh no, not another one of those silly, illogical stories again, but that sorted itself out rather quickly. And the bait jokes were rather funny actually.\r\n\r\nThe CGI and the monsters were great, as far as I am concerned. When I first saw the diablos I thought that they had kind of copied the sandworms from Dune but when they, or it rather since we only got to see one actually emerge, it was quite different.\r\n\r\nThe part where Artemis is thrown back to Earth and followed by the big fire breathing beastie is probably not liked at all by the fans of the video games since it is probably not very canon but I definitely liked it. I whish they would have done a bit more surprise, what the f… and mayhem scenes there actually.\r\n\r\nThe ending didn’t really leave that much of a conclusion but, unlike what some people seems to feel, I didn’t think it was a bad ending. It certainly prepared the field for a sequel and I for one really hope one will come.", "created_at": "2021-05-02T20:41:45.134Z"}, {"movie_id": 458576, "review_id": "60ce6bc8967cc7005841f0d4", "rating": 6.0, "review_text": "Good watch, could watch again, and can recommend.\r\n\r\nI'm not a real fan of the video game, so I think I can safely say that you don't need to know anything from the game other than it has \"big monsters\".\r\n\r\nThe only thing I really see from the video game world is that the characters sort of \"level up\" as the movie progresses.  I guess it sort of does world building in the same way by having \"levels\" or areas, but that's much more subtle.\r\n\r\nThe movie uses isolation in several different ways and has some clever uses of limited resources to solve problems, but it is quite a bit of just fighting big monsters.\r\n\r\nI can't say that you'll enjoy this if you're into Kaiju movies, even though it has quite a bit of creature feature aspects to it.\r\n\r\nWorth the watch, but not exactly the most substantial story.", "created_at": "2021-06-19T22:12:24.188Z"}, {"movie_id": 458576, "review_id": "625e4983f10a1a31c1f570c8", "rating": null, "review_text": "Okay, what to say?  It's not the worst I've seen, and I think it could have been better.  The Resident Evil chick is a consistantly above average action star.  I put her up  there as a female Bruce Willis or Jason Statham.  And she delivered in this movie the same pazazz as her other action flicks.  \r\nThe Story, like the budget, was not that deep.  And if there was significant money put into this movie, then I don't think it measured up to expectations; producer nor fan.  Again, the movie was not terrible, but I didn't exactly move to the edge of my seat either.  \r\nThe fight between her and her soon to be friend, was a bit...contrived.  To me, it was his world, she wasn't an elite soldier, and he was an experienced hunter, so while their fight was well coordinated, I had an especially difficult time believing she could keep up with the  hunter in a fight; had to mark it up as movie-magic or \"it's in the script.\"  \r\nSpecial effects were good for what they were and the actors did a good job of acting.  I don't think the star spent enough time interacting with the Monster Hunter world.  I get they were out in the middle of nowhere, but having her go through a city or market to find a 'macguffin' to help with getting her home, might have added a bit more submersion for the audience.  But just putting her in a set of Monster Hunter armor and spending 5 minutes on their sand-ship felt like what it was, cheap or 'shot-on-a-budget.'  \r\nThe ending was okay too.  I like how the dragon took out the modern aircraft, and was impressed how they were able to shoot everything in the daytime and still make it look feasible to the action. If there is a sequel, then I hope they get a bit more Conan-ny with the overall feel; i.e., more Monster Hunter world & residents. (no pun intended)\r\n\r\nThe movie is not terrible, but I won't be rushing out to get a copy, nor looking for it online.  It's entertaining for a Netchix n' Chill night.", "created_at": "2022-04-19T05:32:51.734Z"}]