[{"movie_id": 511809, "review_id": "61dfbb8b441b03001c970c78", "rating": 8.0, "review_text": "West Side story: Gritty morality tale with an emotional punch. 85%\r\n\r\nNot having seen the stage production of \"West Side story\" or its first film version, which I understand is regarded as a classic, I really don't have a point of comparison for this new film version of the long-running musical theatre staple. Of course, with the US being so effective at exporting its pop culture around the world, I was aware of songs and scenes from the original Hollywood film, which had positive associations for me, even though I live in Australia.\r\n\r\nThe story was inspired by a much earlier tale, which I won't mention here because...spoilers. In any case, the second film version (presumably...at least as far as US film versions go) of this story is set in a slum in New York in the 1950s (the \"West Side\" of the title). The setting is very nicely established, with an opening shot of some partially destroyed buildings which a sign states are being demolished to make way for the gentrification of the area. The flats in the high-rise buildings nearby have a suitably \"slummy\" look without the aesthetic being overdone. From out of this no man's land emerges what turns out be a gang of Anglo background, known as \"The Jets\". You can tell that they they are bad because they soon terrorise the neighbourhood with dancing and singing, with no one daring to stop them. It has to be said, at this point, the realisation of a musical in the modern era hasn't lost my interest. Fit young blokes dancing and singing and clicking their fingers in time in the streets of a big city doesn't seem all that ridiculous now.\r\n\r\nWe soon learn that The Jets have a rival group which they want to remove from 'their turf', a gang known as \"The Sharks\", which are of Puerto Rican ethnicity. The basis of The Jets' animosity to The Sharks is basically an issue of race (and that is also the basis of the police department's animosity towards The Sharks as well). The Sharks do not 'belong' in the US and they should 'go back to where they came from'. The first encounter we see between these two rival gangs is a violent one and it's pretty clear that things will escalate from here between them.\r\n\r\nIf you're thinking that nothing thrown into this tinderbox could make it any more flammable, well...enter Tony (played by Ansel Elgort) and Maria (Rachel Zegler). Tony is the co-founder of The Jets but after a stint in prison for a shocking beating he gave to an Eyptian man, he is trying to be a better person, now holding down a steady job and no longer involved in his gang's activities. Maria is the sister of Bernardo (David Alvarez), a man who is trying to fight his way out of the slum (literally). Bernardo has a chip on his shoulder about the Anglos, who make life difficult for his community. He plays the father-figure at the flat that he shares with his girlfriend and Maria. The prospect of Maria dating a \"gringo\" is unacceptable to him, as we later find out when...Tony and Maria meet at a dance event and...instantly fall in love. He is also the leader of The Sharks.\r\n\r\nThat moment when Tony and Maria fall in love at first sight is very sweetly done. Maria, as played by Zegler, seems like an old-fashioned Disney princess at first, being very timid but then being quite forward...perhaps like a (modern day?) Disney princess? (Since I'm not well-versed in Disney films about princesses, I'll have to defer to the judgement of people more informed than me on this subject.) The lyric from the song \"Hurts so good\" by John Cougar comes to mind about her: \"you ain't as green as you are young\". Zegler/Maria is very attractive in a winsome way. Director Steven Spielberg has really captured a winning performance from her. It occurred to me after writing down my initial thoughts on this film that Zegler would be a worthy nominee for \"Best actress\" at awards time. Even though I haven't really seen many 'quality' films this year, I think I know a quality performance when I see one and I don't think that a best actress award for her would be undeserved.\r\n\r\nIf you think that Maria couldn't be any more adorable, well, you should hear her sing. She has a lovely voice, in my view. To me, she's the standout voice of the musical. Elgort tends towards falsetto at times. On the subject of the music, I'd say that I'm pretty sure that if you just wanted to listen to the musical on CD or whatever, then there would be better versions of that from previous productions of this story, whether on stage or screen. By that I mean perhaps the music elsewhere is bolder, brassier or arranged more pleasingly (to my ears, at least) and that would apply to the vocal performances as well. However, since I haven't heard other versions, I can't recommend one for you.\r\n\r\nIt also later occurred to me how similar Tony and Bernardo are (which I've retrospectively alluded to in my earlier comments about how both of them plan to get out of the slum). Another point of comparison with Bernardo would be The Jets' new leader, \"Riff\" (Mike Faist). They both mirror each other as far as attitudes to \"the other\" goes.\r\n\r\nIn any case, just when Tony thought he was out, Riff pulls him back in again, as far as gang activities go.\r\n\r\nI liked this film and had moments of recognition with it, with regards to clicking fingers and many songs. One event which did jar with me was how Maria reacted to Tony when she heard some fateful news about him. It just didn't ring true to me. Maybe with a greater passage of time it could have worked. Later, when the police officer goes over the whole timeline, the short duration was a shock too.\r\n\r\nThe film was on track for a score of 80% from me but since the drama near the end of the film elicited emotion from me, I added another 5% to my score to reflect that.\r\n\r\nRandom notes:\r\n\r\n*Is the ending different to previous versions of this story? If it is, you can either read it as a return to sanity as far as character motivation goes or as a Steven Spielberg tendency.\r\n\r\n*There is some realism to the violence, so not suitable for very young children, I don't think.\r\n\r\n*I couldn't quite tell if there was some strong swearing at times or if it was toned down.\r\n\r\n*Curios: 5c for a Milky Way chocolate bar, $15 for a fashionable store scarf, I think.", "created_at": "2022-01-13T05:41:31.197Z"}, {"movie_id": 511809, "review_id": "622edcd4cddbbc004738d129", "rating": 4.0, "review_text": "Good production. I liked the performers, except Ansel Elgort as the lead male, Tony, who I found to be uninteresting. I never got into the story or the songs. \r\n\r\nA couple of other thoughts: \r\n\r\n* Carefully choreographed Broadway-style dance routines severely diminish the menace of street gangs.\r\n* Love at first sight is a myth and is a very bad reason to kill or be killed. (Intense attraction, curiosity, and lust at first sight, sure, but love takes longer.)", "created_at": "2022-03-14T06:12:36.602Z"}, {"movie_id": 511809, "review_id": "62b0bce477b1fb0093b08597", "rating": 9.0, "review_text": "Full review: <a>https://www.tinakakadelis.com/beyond-the-cinerama-dome/2021/12/28/it-all-begins-tonight-west-side-story-review<a>\r\n\r\nThis film is a still (sadly) all-too-relevant story about how hatred infiltrates communities and the struggle to find a place to belong. West Side Story is about creating a home, however, you choose to define the word. Unfortunately, the miscasting of Tony brings down what could have been a near-perfect movie. His role is simply too large to be ignored and impossible to compare to his co-stars’ formidable, sublime performances.", "created_at": "2022-06-20T18:31:00.608Z"}]