[{"movie_id": 329805, "review_id": "59bd92829251413561019871", "rating": 7.0, "review_text": "**The fast approach romance, fades away slowly.**\r\n\r\nI knew it was a romance film, but totally unexpected what I just saw. It was different, that's all, other than that there are many similar films that were already made. The film's focus was not the characters, but the phases and the pace of a romance. The love at the beginning and the same love at some time in the latter. The differences what the film highlights. But it's impossible without the characters and their perspectives. So, from the beginning to the end, how a romance can evolve, how it influences other around, all the fun, crazy stuffs, is the film.\r\n\r\nThe film was partially inspired by the director's own married life. Nice casting and performances. I felt like there was no depth in narration. Depth means, you can't understand the characters fully. Everything it lets you know are the events from where the film begins. So basically it is all about the romance and nothing else. Not even their professions, or the friends and any side incidents, except those topics were used in places in a small quantity to fill the void and make a clean flow of the story. The whole two hours is like about an insane romance. Again, that part divides into two, the first half of the film and the next half.\r\n\r\nIn the first half, it's all about the initiation. Girl meets boy, instantly fall in love with each other and do crazy things to build the character. It seems like any romantic film, but it all necessarily designed to manage what follows in the later part. Apart from the two who are well positioned from their professional level, it looked kind of like a rich guy meets an economically average girl. Then entering his world, and beginning to taste the royal lifestyle, as well as a sweet romance. The story was mainly told from the woman's perspective. The narration had double layer, going back and returning to present, the two timeline story was revealed to us.\r\n\r\n> ❝I prefer not to be in love and not get hurt.❞\r\n\r\nThe woman seems intentionally met with an accident in the opening, and she begins to remember her recent past. Her unexpected crazy romance with a rich playboy. While recovering from the knee injury, she makes some friends and they all help each other to come out of their struggle. On the other side of the narration, revealed everything she went through. Not just a happy love story, but struggles over the time pass by. Having a child, being parents, the life drastically changes for both of them. Yet their love and care for each other remains somewhere in the deep of their hearts. Then there is a life, every moment is unpredictable. So how it ends was not that I surprised, because of its realistic.\r\n\r\nAt one point, I thought it could be the French 'The Notebook'. It did not have emotional end. I'm not saying about sad or happy ending, but the film was honest to the real world. How the second half turned out was the excellent twist in the narration, but done with slowly. This was about the people in their late 30s or 40s. That makes the film is mainly for middled aged people. Otherwise, if the characters and their generation were brought down to like the 20s, the film would have been totally another level. And would have had a more target audience. That's what most of the Hollywood films focus on these days.\r\n\r\nThe same film in Hollywood would have been one of the frontrunner for the Oscars. The performances were really great. Particularly Emmanuelle Bercot was awesome. As usual, Vincent Cassel showed his class, proved why he's one of the top stars in France. I thought two hours was a bit long, but the writing was good, they had filled the film nicely with the events that helped further to grow stronger in the following scenes.\r\n\r\nDespite I consider it a nice film, I don't think everybody would enjoy. They might like it at the end, enjoy watching is not that comes along. Because it is not an entertainment film, nor an art. As I said before, realistic about the relationship and its maturity in the modern world. The other options for the relationship, despite putting all the efforts to save it like people did in the previous century. So, all I say is choose it wisely.\r\n\r\n_7/10_", "created_at": "2017-09-16T21:07:14.165Z"}]