[{"movie_id": 287903, "review_id": "5729fb2ec3a3682aa6001480", "rating": 7.0, "review_text": "> A creepy Christmas tale of a family.\r\n\r\nProbably no one would have anticipated it, this is a surprise movie, especially being an anti-Christmas theme. Possibly the one last time I enjoyed was a Finnish film called 'Rare Export', that's the name came in my mind after watching this. I also could not believe this rated PG13, well it differs in other countries. Of course, there are plenty of intensified frightening scenes, even for the adults, but no gores. The violence parts were well edited/shot, yet it makes sure they're still part of the story without showing them. I think it was a smart filmmaking keeping in mind the family audience. So in the end, I guess it paid off well.\r\n\r\nI did not know the plot, as well as a few words that referred in the movie. But while watching it, I was worried about the graphics, because this is not a big budget film. Even the cast was not from the top league. Overall, it achieved a good result, that's the point. There are no major flaws as well, and the small ones can be easily ignorable. Because on the other side the movie provides a good suspenseful entertainment that makes you not to move the body or the eyeballs. After I'm saying all these, you should at least consider giving it a shot. But remember there's no story in it, it was constructed on a panic situation during the heavy blizzard when one after another begin to disappear.\r\n\r\n7/10", "created_at": "2016-05-04T13:37:50.429Z"}, {"movie_id": 287903, "review_id": "5fe014595cc11d003e310f48", "rating": 6.0, "review_text": "A mixed bag.\r\n\r\n<em>'Krampus'</em> has a lot of potential, based on the dark themes we see. However, unfortunately, it dumbs itself down in festive family gathering melodrama. I also didn't rate the ending that much, not that it's bad per se - it's just meh to me.\r\n\r\nAdam Scott is alright in the role of Tom, though is bettered by Toni Collette as Sarah; albeit minorly. The most interesting character is Krista Stadler's Omi, though they don't delve as deeply into her as I expected/wanted. Elsewhere, David Koechner's character, Howard, is kinda lame, but Koechner himself is solid. Of the younger actors, Emjay Anthony (Max) and Stefania LaVie Owen (Beth) are OK.\r\n\r\nIt does do positive things. Some of the tension building is good, even if their eventual pay-offs are a little underwhelming. The antagonists look cool, especially the gingerbread men and the jack-in-the-box. It works Xmas music vibes into the score well, also.\r\n\r\nNothing terrible, but it didn't work out all that enjoyably for me personally.", "created_at": "2020-12-21T03:19:53.563Z"}, {"movie_id": 287903, "review_id": "61c6230a63a6950019d9d683", "rating": 6.0, "review_text": "Heard some good things about this rendition of the forklore and while not bad with some funny moments and a decent cast, I wasn't totally enamored with this one. The effects were alright and the horror elements were fine, but never really was fully engaged. I don't know, not exactly a horror Christmas classic and not much desire to revisit anytime soon. **3.25/5**", "created_at": "2021-12-24T19:44:10.105Z"}]