[{"movie_id": 516329, "review_id": "618c05a6ddd52d008a0b64e2", "rating": 6.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/antlers-spoiler-free-review\r\n\r\n\"Antlers is a cleverly shot, character-driven horror story with effective jumpscares and a captivating narrative that ultimately fails to reach its true potential.\r\n\r\nWith the help of experienced producers, Scott Cooper is able to generate a rich atmosphere and offer an intriguing monster, blending practical effects with minimal CGI perfectly, despite the low budget.\r\n\r\nAccompanied by gorgeous cinematography, Keri Russell leads an interesting storyline focused on her traumatic past, but it ends up far too underdeveloped. The main plot features more generic plot points and a somewhat underwhelming yet visually satisfying ending.\r\n\r\nOverall, it's a nice watch, but one that I probably won't come back to.\"\r\n\r\nRating: B-", "created_at": "2021-11-10T17:47:18.180Z"}, {"movie_id": 516329, "review_id": "62404733c740d9005d711d54", "rating": 6.0, "review_text": "For the first half hour, this isn't that bad. A couple of men stripping an old mine hear some curious noises, next thing we are in a school with a young \"Lucas\" (Jeremy T. Thomas) seemingly distracted, a little dishevelled and only when his teacher \"Julia\" (Keri Russell) decides to investigate, do we realise that what came out of that mine was a hell of a lot more rapacious than what went into it... Sadly, though, the rest of it all quickly becomes a bit too routine and the ending though quite well built up, is really a bit too predicable, brief and flat. The \"monster\" is seriously under-used by director Scott Cooper. A lot is left to our imagination, and to an extent that works - but unfortunately, regular fans of this genre will probably have far gorier fantasies that those we are eventually offered here. It's not a terrible film, it is decently paced and the young \"Lucas\" holds it together quite well, but sadly it offers very little for us (or the beastie) to get our teeth into.", "created_at": "2022-03-27T11:14:59.904Z"}, {"movie_id": 516329, "review_id": "62cc327e9566581bc0408de0", "rating": 8.0, "review_text": "Good story, good cast. It's enjoyable.\r\n\r\n<em>'Antlers'</em> sets the right tone throughout and delivers in serving up a satisfactorily creepy flick. Keri Russell, Jesse Plemons and youngster Jeremy T. Thomas all give strong performances, they make for an interesting trifecta to watch - even if they aren't as fully fleshed out ss they could've been.\r\n\r\nThe horror aspects are done really well, as expected with Guillermo del Toro involved behind the scenes along with director Scott Cooper & Co. I also love films that make the locations come alive, where the place feels lived in and gritty, and this passes that particularly test with flying colours in my eyes.\r\n\r\nAs usual with the genre, a follow-up is seemingly set at the end - which I'd be up for, sure, though do feel like this being a one-and-done would fit better - but we'll see.", "created_at": "2022-07-11T14:23:58.841Z"}, {"movie_id": 516329, "review_id": "63daaad4955c6500a84355a5", "rating": 4.0, "review_text": "Antlers was a pretty big disappointment. The acting was lackluster, Keri Russell did okay, but I felt that Jesse Plemons was going through the motions delivering a poor performance. For a horror movie, this did not really feel scary at all. There is some cool characters designs during the transformation but the creature was pretty bad due to the heavy use of CGI. For a rated R film, there was not a lot of gore. I felt a lot of the kills were cut short or done off camera. This works when tension is built, but it wasn't and the payoff fell short. The story was generic and very predictable, character decisions were incredibly dumb in order to progress the plot. Combine all those issues with poor pacing and you get a tough movie to watch.\r\n\r\nScore: 38%\r\nVerdict: Poor", "created_at": "2023-02-01T18:09:24.737Z"}, {"movie_id": 516329, "review_id": "63f1c02a5249780084f68882", "rating": 5.0, "review_text": "Cliched and not at all scary. And I scare easily!!\r\nPredictable at every turn. I wasn't expecting much going in (based on its score) and my expectations were met. ;-)", "created_at": "2023-02-19T06:22:35.008Z"}]