[{"movie_id": 15708, "review_id": "64f4cbac9e458600c6d09019", "rating": 6.0, "review_text": "This is a rather insubstantial film that appears more intent on taking a swipe at religious intolerance - especially at the bigotry of the Church of Latter Day Saints - of homosexuality. Wes Ramsey \"Christian\" is a good looking Lothario who sails through life working as a waiter then seducing and shagging his way through his nights. When a group of 4 young Elders move in to an adjacent apartment, he bets his team in the restaurant that he can seduce one of them. He sets his sights on tall, handsome Steve Sandvoss \"Aaron\" and off we go... The film does try to address the emptiness of Ramsey's existence and broaden it to a wider comment on promiscuity and shallowness, but mostly it's an over-long love story that takes an age to get anywhere, then ends in really rather predictable way. The plot has more holes than a string vest - and for reasons that do not appears clear at all to me, Jacqueline Bisset crops up from time to time as the almost angelic owner of the restaurant. Sandvoss is very easy on the eye, which does make it watchable - but otherwise, it's just another love story with a sticky start...", "created_at": "2023-09-03T18:08:44.700Z"}, {"movie_id": 15708, "review_id": "65537d61903c52011b6ad1e8", "rating": 6.0, "review_text": "I first saw the film years ago and rewatched it this weekend. I ended up with a few conflicting thoughts. One, the movie doesn't necessarily hold up well (in terms of writing, acting, pacing, story, etc.) but in many ways that doesn't matter in terms of whether it's worth watching. It's probably a more important film than it gets credit for. It's hard to understate how groundbreaking this film was for the time, offering  onscreen representation and voice to several underrepresented segments and experiences in society. By today's standards, the romance feels a little Hallmark and Lifetime movie-esque, but in the moment, it was unheard of for a movie like this to have the reach it did with the message it had. I recommend this film to anyone interested in gay cinema, independent cinema, and the journey these industries have taken over the past 30 years.", "created_at": "2023-11-14T14:00:01.941Z"}]