[{"movie_id": 16996, "review_id": "5424ae4e0e0a263b7700468d", "rating": 7.0, "review_text": "It's a classic transformation story. Are you now or have you ever been a Norse God, Vampire, or Time Traveling Cyborg?\r\n\r\nAnother in what is a long line of body swap comedies, 17 Again is fun, frothy and full of warmth; just like all the other ones really! There's nothing new here, it's the same old format as a grown up Mike O'Donnell (Matthew Perry) rues how his life has grown to miserable proportions but magically gets to be a high-schooler again and grasp that second chance. Back in his 17 year old bod (Zac Efron looking like a young Rob Lowe), Mike oversees the trials and tribulations of his two kids who attend the same school, whilst also forming a \"special\" bond with his future wife Scarlet (Leslie Mann) who is going to divorce him! Cue much high-school pranks, perils and near misses and a few worthy messages in the narrative.\r\n\r\nTailored towards a certain demographic with the casting of Efron, who is very likable and a worthy lead here, the film thankfully doesn't lack for good performances elsewhere. Both Mann and Melora Hardin as the hot principal make their roles stand out, while Thomas Lennon as Mike's uber rich man child buddy steals the movie. It's rich in clichés of the formula and the predictability of outcome robs us of a surprise, but these are not actually irritants, for this is a very enjoyable movie. One where the teens hot for Zac can stare lovingly, and one where the adults can nod in knowing agreement at some plot dynamics. 7/10", "created_at": "2014-09-26T00:07:42.694Z"}, {"movie_id": 16996, "review_id": "64a0293fd5191f00c5061482", "rating": 6.0, "review_text": "Just watched it just so I can say I watched it. It turned out to be funny and liked the story similar to 13 going on 30.", "created_at": "2023-07-01T13:25:19.334Z"}, {"movie_id": 16996, "review_id": "65270e25cedac400e2131cd7", "rating": 8.0, "review_text": "**_A high school dramedy/body swap flick with heart_**\r\n\r\nA dispirited 37 year-old man (Matthew Perry) is about to lose his wife and high school sweetheart. Through a \"spirit-guide\" (Brian Doyle-Murray) he is miraculously able to become, you guessed it, 17 again. His younger self is played by Zac Efron, who's actually the star of the movie. Leslie Mann plays his soon-to-be former wife while Thomas Lennon appears as his geeky best friend. Sterling Knight & Michelle Trachtenberg are on hand as his kids struggling through the teen years. Melora Hardin plays the attractive principal while Nicole Sullivan has a glorified cameo.\r\n\r\n\"17 Again\" (2009) is magic from beginning to end, with few missteps. It's both a high school dramedy and a second chance fantasy. There are elements of films like \"Back to the Future\" (1986) and \"Peggy Sue Got Married\" (1986), but the uniqueness here is that the protagonist doesn't go back in time, but rather stays in the current day and appears to his family & friends as 17 years-old, even though he's really 37. With one exception, no one knows who he really is.\r\n\r\nEfron, who was only 21 during filming, easily carries the film while Mann is one of the most winsome women to walk the Earth. Lennon's amusing character is akin to the Big Bang Theory guys. Best of all, the film has heart, effectively conveying the triumphs and tragedies of the high school experience in all its glory and awkwardness. I know it's clichéd, but \"you'll laugh, you'll cry.\"\r\n\r\nThe movie runs 1 hour, 42 minutes, and was shot in Santa Monica (Hayden High School), Van Nuys & Los Angeles, California. The script was written by Jason Filardi.\r\n\r\nGRADE: A-", "created_at": "2023-10-11T21:05:41.373Z"}]