[{"movie_id": 862965, "review_id": "6213e5603f4833001c9aeeb8", "rating": 5.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/other-films-watched-spoiler-free-review-sundance/#emily\r\n\r\n\"Emily the Criminal boasts two phenomenal performances from Aubrey Plaza and Theo Rossi, but its by-the-numbers crime-thriller narrative lacks sufficiently creative ideas to make it more than just an average viewing.\r\n\r\nThe actress proves her immense talent once again, but it's actually the actor who surprises in a more grounded role that breaks many stereotypes related to this particular type of character.\r\n\r\nA good ending may leave the audience with an opinion more positive than what the film warrants, but it's admittedly entertaining and interesting enough... for a home release.\"\r\n\r\nRating: C", "created_at": "2022-02-21T19:17:52.573Z"}, {"movie_id": 862965, "review_id": "62fd276362f335007a131428", "rating": 8.0, "review_text": "Emily the Criminal is a brilliant look at the stakes a person will go to in order to dig themselves out of crippling student debt. I had a really good time with the film, Aubrey Plaza is fantastic as the lead, she carried this movie and made it an absolute treat to watch. The story hits on a lot of elements that the resonant with millennials while exploring them in a way that feels genuine. The plot is pretty good, although the main story points are almost all revealed in the trailers, which was a bit disappointing. There were times where I was having a hard time believing she could continue to get away with all the illegal activity she was getting up to without even raising suspicion, but I was able to turn my mind off and still have a solid experience.\r\n\r\n**Score:** _75%_ \r\n\r\n**Verdict:** _Good_\r\n\r\n**Theater Verdict:** _See It_", "created_at": "2022-08-17T17:37:39.597Z"}, {"movie_id": 862965, "review_id": "632d30afcede69007b86ee63", "rating": 5.0, "review_text": "**Emily the Criminal's intriguing story and committed performance from Aubrey Plaza brought great high notes, but slow sections and a sad conclusion added some low notes.**\r\n\r\nEmily the Criminal chronicles a woman's impossible struggle to find work and survive with the insurmountable burden of her criminal record standing in the way. Eventually, honest employment seems impossible, so she turns to a more lucrative but more illegal method of income. Her path to success in the credit card fraud racket was interesting, with all the dangers of her new work and the pressure of avoiding getting caught. Unfortunately, the plot's pacing ebbed and flowed between long sections of an engaging and exciting story and long sections of slower, less interesting content. The title's meaning transformed as the movie progressed and the characters developed, but the final moments just saddened me. The character growth came at the expense of others and kept me from being able to cheer for where everything ended.", "created_at": "2022-09-23T04:06:07.521Z"}, {"movie_id": 862965, "review_id": "633f8a8c0143250082a54e42", "rating": 6.0, "review_text": "Solid film, very cool to see Aubrey Plaza in more serious roles (I'm mostly familiar with her through *Parks and Rec*). Ending didn't really give me the resolution I was looking for, however, and mirroring the way Emily started (except now in South America) felt a little too easy from a storytelling point of view.", "created_at": "2022-10-07T02:10:20.974Z"}, {"movie_id": 862965, "review_id": "6354b4c399c9640079b09b6d", "rating": 7.0, "review_text": "While “Emily the Criminal” isn't for everyone, it does succeed on many fronts. It's not your run-of-the-mill crime flick; instead, it's an in-depth look at the mind of its main character and examination of criminal behaviour. The film's overall noir vibe appeals to me, and I think its effectiveness as a small-scale thriller stems from its commitment to staying grounded, scaled down, and focused. Additionally commendable is Plaza's performance, and given that this is John Patton Ford's directorial debut, he, too, is deserving of recognition for his efforts. Yet, despite its entertaining nature, the film fails to make a lasting impression.\r\n___\r\n**Rating**: 7.0/10 _(Good)_", "created_at": "2022-10-23T03:28:03.898Z"}, {"movie_id": 862965, "review_id": "6455049cd48cee00e1344662", "rating": 7.0, "review_text": "Aubrey Plaza is very good in <em>'Emily the Criminal'</em>.\r\n\r\nI've predominantly seen her in comedic roles, so it's good to see her act in something thriller-ly. I enjoyed her performance from beginning to end, no complaints whatsoever. Theo Rossi also puts in a strong performance, while the rest of the cast are solid.\r\n\r\nIt's an entertaing story, one that wraps up in a different way to what I would've predicted - but that's not a bad thing. Elsewhere, the music is decent - even if one bit of the score sounds straight out of 2011's <em>'Drive'</em>. The run time is pleasantly short to boot. Rewatchable, in a word.", "created_at": "2023-05-05T13:29:00.266Z"}]