[{"movie_id": 451955, "review_id": "5cbdce9ec3a368136986c091", "rating": 5.0, "review_text": "**_Not nearly as smart as it thinks it is_**\r\n \r\n> _His tone is both apologetic and defensive. Molly continues to stare at him, amazed. She sees again in her mind's eye that other Jonathan as as he'd materialised on the street - sees again the way he merely glanced at her, unseeing, uninterested, as he passed her by. As if they didn't know each other and were not lovers and of course they didn't know each other, were not lovers...Molly recalls speaking his name as if it were a magic talisman that might make things right: Jonathan. But the man's name was James._\r\n\r\n- Joyce Carol Oates; _Lives o__f the Twins_ (1987)\r\n\r\nFrom prolific French auteur François Ozon (_Sous le sable_; _8 femmes_; _Frantz_), _L'amant double_ [_Double Lover_] is partly a study of sexual obsession, partly an oneiric mystery (think Neil Jordan's _In Dreams_), and partly a conventional thriller (more whoisit than whodunnit). \"Freely adapted\" from Joyce Carol Oates's 1987 novel _Lives of the Twins_ (published under the pseudonym Rosamond Smith), and written by Ozon and Philippe Piazzo, the film tells the story of Chloé (Marine Vacth), a woman with a fragile mental state, who falls passionately in love with her psychoanalyst, Paul (Jérémie Renier). Within a few months, she has moved in, however, as time goes by, she slowly starts to learn of a significant part of his identity which he has been concealing.\r\n\r\nImagine, if you will, _Vertigo_ (1958) remade by someone like Gaspar Noé or Lars von Trier, and you'd be some way towards getting a handle on Ozon's latest; completely barmy (you know you're in strange territory when the second shot of a movie is, quite literally, an internal shot of a vagina). As one would expect from Ozon, the aesthetics are solid - the film is built upon an inventive visual style employing juxtaposition, pseudo-split screen, and copious amounts of shots with one person in the frame proper, and the person to whom they're talking only visible in reflection. The sound effects are also excellent and really jolt you out of your seat on a couple of occasions. Similarly, the acting is strong, with both Vacth and Renier unrecognisable in their respective roles.\r\n\r\nHowever, the melodramatic and self-congratulatory plot is an absolute mess. Many of Ozon's standard tropes are here; a dissection of the academic middle class/intelligentsia, an examination of the schism between appearance and reality, an attempt to elucidate the mind of a complex woman, a psychoanalytical bedrock, the mutability of identity etc. But it's all diffused through an utterly farcical narrative, which fails to get even the basics right. For example, sex is a central theme, but by the time we get to the fourth or fifth sex scene, it has completely lost its potency (compare, for example, Abdellatif Kechiche's infinitely superior _La vie d'Adèle – Chapitres 1 & 2_, (2013) where sexuality is just as central, but which features only two sex scenes). The same goes for the increasingly ridiculous plot twists, once you get to three or four and you're still in the first half of the movie, you just stop caring. Ozon has always been hit and miss, for every _Sitcom_ (1998) and _Swimming Pool_ (2003), there's an _Angel_ (2007) and a _Ricky_ (2009), and _L'amant double_ is, in the end, a rather pointless film that seems to think it's saying something exceptionally profound about desire and identity. It isn't.", "created_at": "2019-04-22T14:24:30.210Z"}]