[{"movie_id": 153518, "review_id": "57b501cc9251410a71002850", "rating": 7.0, "review_text": "> What makes the birds to get so angry?\r\n\r\nVideo games to films is an old topic to discuss it now, but the fans from the original source are always in the high hope when they hear news like this. Because 'Angry Birds' game is one of the mainstream games which is originally from Finland. Despite the mixed reviews, it is a box office success and definitely a sequel on the card. After lots of animal themed films, now in the line of underrated animation 'Free Birds', another the bird's quest begins with this.\r\n\r\nI'm not much into this game, but I was looking forward to the film since it was first announced. Now I'm here after the watch and I think is a good film, but better suitable for children than the adults. That did not stop me from enjoying it. The target audience might be the kids with those cute film characters, as well as the story, but there are some dialogues that are written keeping in mind the grownups. Anyway, most of the adults won't feel they are in a wrong cinema hall if they regularly watch animation films, especially in the present world animations are accepted as for all ages.\r\n\r\nSo this is the story about the Red, an orphan bird lives in a small house on the sea shore. The kids from the island loves him, but the adults stay away from him for his bad anger attitude. One day a ship of pigs arrives on the bird's island offering friendship, but their intention was later known once the valuables things were stolen from them. So the revenge and rescue operation begins which stretched with full of action-adventure in the remaining parts.\r\n\r\nFilled with lots of fun moments, it was much better than I expected. Sometimes it looked cute, but you know our angry bird, Red with his companions makes it not to stay that way. Peter Dinklage as Might Eagle was one of the highlights of the film and the rest of the cast did well too. It is definitely a great directional debute for the two experienced animators. Makes a bit sad how the film was received, but after seeing it myself I think its fine. Different people have different opinion. In my perspective, it was a good watch so I surely suggest it, especially for animation fans and obviously children.\r\n\r\n7/10", "created_at": "2016-08-18T00:31:08.476Z"}, {"movie_id": 153518, "review_id": "63001b8f7d41aa007e386f8c", "rating": 5.0, "review_text": "**I had no expectations and was still disappointed.**\r\n\r\nNot sure what I was expecting from a movie based on a game that consists solely of slingshotting birds at pigs. Unfortunately, the humor was more annoying complaints than clever quips, but it had its moments.", "created_at": "2022-08-19T23:23:59.784Z"}]