[{"movie_id": 310307, "review_id": "59dbeaa8c3a3686200066925", "rating": 7.0, "review_text": "**Veni, vidi, vici!**\r\n\r\nI anticipated another inspiring biopic about a man who built an empire. That's partially true, because this was inspired by the right kind of wrong thing. I mean it was not actually about the McDonalds' story, the McDonald brothers, but the fast food chain McDonald, how the franchise got rapidly spread across the globe and the person behind it. With the film having both good and bad side, it stayed mostly neutral. But due to the main character, you would see too much lean on what seems the reason behind the McDonald's today's popularity.\r\n\r\nSo it's like another typical American founders' story like Apple, Facebook. I mean not the one who found the company with all the hard works, but the one who dived in and took all the credit. Ray Kroc was a traveling salesman and he's not doing any good. But one day he meets the brothers who had started a modernised kitchen and its fast food service. He shows lots of interest in it and so he joins hands with them. With his new ideas, how he makes a fortune out of it and the future of the company, all revealed in the later part.\r\n\r\nAn enjoyable film. Particularly for Michael Keaton. Well directed film as well. Film wise it was a good one, but the story wise not morally right. It was about the flaws in our society, our system. Some men can do anything like pulling others leg to climb the success ladder. It's not them to blame completely, because they had struggled enough to understand their future path. So definitely for some people, this film would inspire. If you are a regular McDonalds' customer, you should watch it. Otherwise, just to learn the truth, it is worth a watch.\r\n\r\n_7/10_", "created_at": "2017-10-09T21:31:20.510Z"}, {"movie_id": 310307, "review_id": "62fbf83e94d8a8008232208d", "rating": 3.0, "review_text": "**A decent film, although the story told is substantially stilted and made more tense than it actually was.**\r\n\r\nWe all know that the business world is not for boy scouts. As the film's protagonist himself assumes, you have to be prepared for the toughness of competitors and moves that are often disloyal. However, this is precisely why great businessmen are usually people worthy of our disdain: they associate coldness and calculation with intelligence and the cult of the ego, and not infrequently they see other people as numbers or as means of business.\r\n\r\nMcDonald's is undoubtedly a huge, very powerful multinational, and the film reveals how the company was born, at the hands of Ray Kroc, who takes over the company, taking it from the control of the founders – the McDonald Brothers – and transforming it into something that is very different from what they dreamed of, although they were satisfied with the money they received for it afterwards, and that the relations between the three, in real life, were not as tough as the movie makes us think. The screenplay, cleverly written but very bitter and unpleasant, inflated the situation and made it more tense. Like _Social Network_, the film shows us the controversial origins of one of America's most flourishing companies… and makes us dislike whoever built it. And interestingly, contrary to what I initially thought, the McDonald's Corporation seems to have kept a certain distance from this film… why is it?\r\n\r\nMichael Keaton did a very good job with the main character and knew how to embody the controversial figure of Kroc well, both in voice and in ideas and mannerisms. The actor deserves, in fact, a praise for the way he gave himself to the work. Also, John Lynch and Nick Offerman are in excellent shape and give us very convincing performances, turning the two founding brothers of the company into a harmonious duo in which one thinks and plans, and the other carries out and executes everything on the ground. Unfortunately, the rest of the cast just doesn't do anything of value and sticks to the most basic.\r\n\r\nTechnically, the film is very low-key, although I have to commend the effort made to recreate and bring back to life some of the company's early restaurants, most notably the one in San Bernardino. The effort to be faithful to the original design was very pleasant, as was the use of very appropriate sets, cars, filming locations and costumes, which take us back to the 50s. The cinematography does a discreet but effective job, and the editing is good, not allowing the film to waste time on unnecessary things or lose its rhythm.", "created_at": "2022-08-16T20:04:14.548Z"}, {"movie_id": 310307, "review_id": "630018305ab81a007d230738", "rating": 7.0, "review_text": "**Overall : A brilliant telling of a bleak story that left a disappointing flavor in my soul.**\r\n\r\nI remember the plaque in our McDonalds growing up about its founder, Ray Kroc, but this movie tells a much different story. Suddenly, I am questioning whether or not I should let my two-year-old eat McDonald's anymore! Michael Keaton's relentless portrayal of the opportunistic and duplicitous Ray Kroc is so spectacular that I questioned whether I even liked Keaton. Yet, he is one of my favorite actors! That is just how disheartening the true story of McDonald's' meteoric expansion is. The Founder does an excellent job telling a dispiriting story and does such a thorough job that it leaves a bad taste in your mouth at the end (pun intended 😉).", "created_at": "2022-08-19T23:09:36.119Z"}]