[{"movie_id": 9533, "review_id": "5ea1704f0b5fd60024816af7", "rating": 7.0, "review_text": "I am not a man. I began as one, but now I am becoming more than a man, as you will witness. \r\n\r\nRed Dragon is based on the novel of the same name written by Thomas Harris and is directed by Brett Ratner and written by Ted Tally. It stars Edward Norton, Anthony Hopkins, Ralph Fiennes, Emily Watson, Harvey Keitel, Mary-Louise Parker & Phillip Seymour Hoffman. Dante Spinotti is on cinematography and Danny Elfman scores the music.\r\n\r\nRed Dragon is a prequel to the hugely successful Silence of the Lambs. The story had already been filmed as Manhunter in 1986 directed by Michael Mann. The signs weren't particularly good for Red Dragon. The previous year had seen Ridley Scott tackle Silence Of The Lambs follow up, Hannibal, with tepid results. While at the helm here was the director of such fodder as Rush Hour 1&2, and of course Mann's take on the story is viewed as a grainy and skin itching cult classic. Nice to report then that even tho it's hardly in the same class as \"Lambs,\" it's a willing entertainer that genuinely manages to unease.\r\n\r\nFirstly one has to get past the Hannibal Lecter factor to fully enjoy (and dampen expectations) the movie on its own terms. Lecter (Hopkins enjoying himself but going through the motions) is a secondary character. Important? Yes! But still secondary to Norton's troubled but gifted FBI agent Will Graham and Fiennes bonkers serial killer Francis Dolarhyde (AKA:The Tooth Fairy). Red Dragon is first and foremost a ripping good old detective story, with Ratner and Tally wisely using the bits that made Harris' novel such a page turning success. They have added their own bits of course {the pre-credit sequence involving Lecter & Graham sets things up perfectly}, but ultimately it's a loyal enough telling of a gripping and goose flesh inducing story.\r\n\r\nThe makers have wisely filled the film out with quality performers. Norton underplays Graham nicely, a character unable to stay away from the job that threatens his family, he becomes an easy guy to root for as things start to get troubling. Fiennes too doesn't go over the top, in great physical shape and with piercing blue eyes, he exudes menace without resorting to being a cackling caricature. Hoffman was a shoe in for a weasel reporter since he does it so well, while Keitel, tho not having to stretch himself, offers up a stoic turn as Jack Crawford. But the main performance, and sadly unheralded, comes from Emily Watson as the blind Reba. With Reba acting as both a romantic and redemptive foil to Dolarhyde's split-personality, Watson gets the tough gig, and comes up trumps with an affecting turn featuring the right amounts of spunk, sadness and needy tenderness.\r\n\r\nIt's a bit too polished to be a nerve shredder, with Ratner unable to give the film an atmospheric feel befitting the darkness at its core. But it does deliver on the promise of not only that opening segment, but also on Harris' fine procedural narrative. 7/10", "created_at": "2020-04-23T10:39:11.872Z"}, {"movie_id": 9533, "review_id": "5eeb413fdd926a0034a2b0d2", "rating": 7.0, "review_text": "This might seriously be the only good thing Brett Ratner has ever done. I don't even mean movies he's made, just like, thing he's done. Ever. In his life. Doesn't live up to the book, or to _Silence of the Lambs_ (though that second part took me a while to figure out), but I watch this thing semi-regularly and I haven't gotten sick of it yet. \r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2020-06-18T10:26:07.483Z"}, {"movie_id": 9533, "review_id": "64f429987d41aa011b88e5b7", "rating": 7.0, "review_text": "Retired FBI man \"Will Graham\" (Ed Norton) finds himself back working with \"Hannibal Lecter\" (Sir Anthony Hopkins) at whose hands, years earlier, he only narrowly escaped death - this time on the hunt for the elusive \"Tooth Fairy\" (Ralph Fiennes) who is running amok in downtown Baltimore using each full moon as an excuse to slaughter two - seemingly unconnected - families. Norton is great in the role; he treads the line between emotionally embattled agent and dedicated, almost obsessed, detective with considerable skill. Hopkins features less frequently, but still exudes menace as only he can and Fiennes, too, has a look of madness and evil about him that, alongside Ted Tally's adept adaptation of Robert Harris' novel, creates a wonderfully tense, suspenseful couple of hours of drama. It hasn't the style, or pace of it's 1991 sequel - but perhaps that's because we have had ten years to absorb just how potent these original characterisations actually were; but this is still is good watch combining horror and wickedness in an, at times, edge of the seat story.", "created_at": "2023-09-03T06:37:12.472Z"}]