[{"movie_id": 600354, "review_id": "60367255d132d60040a2e28a", "rating": 10.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nI've watched some incredible films during my life. Some offered me a blast of pure entertainment, others left me crying like a baby, and dozens made me laugh uncontrollably. Nevertheless, the most memorable movies are the ones that profoundly impact me emotionally either by remembering me of a past phase of my life or by possessing main characters who I can strongly relate to. What might be \"just another film\" for most viewers can ultimately become a personal journey for other people in the audience, which is how I partially experienced The Father. I didn't have massive expectations for the movie itself, but I was curious to know how great Anthony Hopkins would be.\r\n\r\nWhile the legendary actor is undoubtedly a notable standout, Florian Zeller's creative, unconventional storytelling left me completely floored. By the end of the film, I felt emotionally drained of all my feelings and thoughts due to the increasingly heavier, devastating narrative co-written by Zeller and Christopher Hampton, adapted from the former's award-winning play, Le Père. This could have been yet another generic story about dementia, but Zeller's brilliant storytelling places the viewer in the protagonist's skin, offering a terrifying viewpoint of the disease. From the very first minute until the end, the spectators accompany Anthony, an old man starting to lose track of reality, through his own perspective.\r\n\r\nI genuinely don't know if this sort of point of view has been depicted before, particularly in the case of dementia, but either way, it's a harrowing experience that will surely leave a vast majority of its viewers extremely captivated throughout the entire runtime. Watching Anthony go through scenes that he wholly believes are indeed happening as he sees them is as attention-grabbing as it is frustrating and sad once the audience gets to see how the same scenes really played out. In fact, if one starts watching the movie without even knowing the synopsis, the first act will almost seem like a mystery-thriller due to so many twists and turns regarding previous conversations that Anthony and the viewers believe are 100% real.\r\n\r\nZeller and Hampton's script doesn't only approach Anthony's feelings but also the loved ones surrounding him, which I firmly believe was both necessary and honest. The Father doesn't shy away from showing the boiled-up frustration and even desperation that the family usually goes through when dealing with someone with this terrible health condition. I have no words to describe how thoughtful and impactful Zeller's storytelling method ends up being. I found myself remarkably surprised once I realized the film had reached the one-hour mark. The control of the movie's pacing and tone is absolutely seamless. Technically, Yorgos Lamprinos' editing work is as impeccable as Ben Smithard's lingering cinematography.\r\n\r\nHowever, it's Ludovico Einaudi's outstanding score that steals the spotlight in the technical realm. From the atmospheric, grand opera music to the more subtle tracks, Einaudi makes sure to elevate the critical moments with a noticeable sound that helps the viewer understand the progressive shift in Anthony's perception of reality. Zeller demonstrates immense talent in his feature film directorial debut. Being an adaptation from his own play certainly aids him in bringing the story from stage-to-screen, but his filmmaking choices are worthy of recognition, such as the extensive use of long takes to let the actors shine in their layered roles. And since I mentioned the cast...\r\n\r\nAnthony Hopkins delivers an award-worthy performance that only finds in Chadwick Boseman (Ma Rainey's Black Bottom) a serious rival for this year's awards season. Hopkins holds countless astonishing displays throughout his career, but this one is definitely one of my favorites. I never anticipated I'd shed so many tears by watching an old man cry or getting slapped in the face, though it's not even due to the acts themselves but to everything that builds up those moments. During most of the runtime, I don't really feel sadness or anger. Instead, I feel every character's pain because it's incredibly hard to watch how everyone deals with the situation. Hopkins and Olivia Colman are undoubtedly the most impactful, but Olivia Williams and Imogen Poots also add a lot to the sentimental component.\r\n\r\nI insinuate above that The Father impacted me at a personal level. A little bit about my life: my grandfather didn't have dementia, but his mind slowly deteriorated until it reached a point where he had to spend his last few months on this planet stuck in a bed without really talking or moving. Still to this day, part of me regrets not spending that much time with him near the end, while the other part feels a bit relieved that my memory of him in his \"normal\" state remains intact. I always feared that if I visited him often in his last days of living, I'd only remember his time at the nursing home instead of the years packed with tremendously essential lessons he taught me. This movie left me sleepless, spending the night thinking about that time of my life...\r\n\r\nThe Father is an overwhelmingly devastating depiction of the painfully progressive disease that is dementia. Florian Zeller's extremely captivating storytelling places the viewers inside the protagonist's mind, making the audience witness and feel everything through his unclear perspective. Zeller and Christopher Hampton deliver a brilliantly unique screenplay packed with emotional punches that will leave no one indifferent. From the perfect editing to the persistent camera work, it's Ludovico Einaudi's gorgeous, impactful score that elevates the big moments. Zeller's use of long takes feels both necessary and important to attach the viewers' attention to Anthony Hopkins, who delivers an award-worthy, powerfully compelling performance. One of my favorites of his entire career. Hopefully, this will be the closest I'll ever be to experience this mental condition. My personal connection to this film justifies why I'll offer it my highest rating since November 2019 (Ford v Ferrari). One of the best movies I've seen in the last couple of years. Do not miss it!\r\n\r\nRating: A+", "created_at": "2021-02-24T15:35:49.471Z"}, {"movie_id": 600354, "review_id": "6047955fea37e0005a3d1b1a", "rating": 6.0, "review_text": "“The Father” gives its audience a fully immersive experience with the frustrations of dementia in this stage-to-screen adaptation of Florian Zeller‘s 2012 play. Making his feature film directorial debut, Zeller gives the project a personal touch with much emotional gravity, as he’s so intimate with the source material. The film has the look and feel of a stage play, but it thrusts audiences into the main character’s head in a way that only the medium can achieve.\r\n\r\nAnthony (Anthony Hopkins) is growing increasingly confused in his day-to-day activities. At first he can’t remember where he left his watch, but later he doesn’t know if it’s morning or night. The man sometimes doesn’t recognize his daughter Anne (Olivia Colman), and he confuses his caregiver Laura (Imogen Poots) with others in his life with increasing frequency. As Anthony’s mind continues to decline at an alarming rate, he starts to have severe mood swings that are brought on from the frustration of his lifetime of memories slipping away. He refuses assistance from Anne, who is trying her best to help him cope. Change is never easy, but Anthony’s paranoia grows as the fabric of his reality unravels.\r\n\r\nThe film features excellent turns from Hopkins and Coleman, two seasoned actors who carry the dialogue-heavy film. It’s fantastic work from both of them. Zeller puts viewers into Anthony’s shoes, adopting the old man’s mental state as he questions what’s real and what’s imagined. You’ll begin to wonder if his daughter and nurse are playing cruel games on him, with a sense of doubt that’s contagious. Something isn’t quite right, and the conflicting distractions offer a puzzle with no easy solution.\r\n\r\nThe intentional misdirection is a bit gimmicky and the pacing slow, but “The Father” paints a poignant and effective (if depressing) picture from the point of view of a person struggling with dementia.", "created_at": "2021-03-09T15:33:51.917Z"}, {"movie_id": 600354, "review_id": "605303a4a2d2e900282044f0", "rating": 8.0, "review_text": "'The Father' is a standout during this very bland awards season, but just because it's both a critical darling and awards frontrunner doesn't take away from the emotional power and stellar performances for Colman and Hopkins.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-father-a-deeply-moving-look-at-mental-illness", "created_at": "2021-03-18T07:39:16.797Z"}, {"movie_id": 600354, "review_id": "62184b78a6d931001b593977", "rating": 9.0, "review_text": "Incredible performances from Anthony Hopkins and Olivia Colman!\r\n\r\n<em>'The Father'</em> makes for a rather heart-breaking watch, it's very clear from the get-go where the film is heading but that doesn't stop it hitting directly in the feels. I've fortunately never been around someone with what this film depicts, yet it still came across as very realistic - based on what I have heard about the condition.\r\n\r\nHopkins is utterly superb in the lead role, which is what I expected given I had heard about this 2020 flick back when it won the big gongs. Something I hadn't heard about, though, was Colman's performance - which is absolutely fantastic, particularly in one emotional scene alongside Hopkins and Imogen Poots.\r\n\r\nA very saddening but brilliant film, cleverly portrayed too.", "created_at": "2022-02-25T03:22:32.006Z"}, {"movie_id": 600354, "review_id": "621a874389d97f001bb4322d", "rating": 9.0, "review_text": "‘The Father’ is an incredibly moving film that leaves you as confused in time and place as the main character (an incredible Hopkins), allowing the audience to experience - if only a little - what it must feel like to have dementia.\r\n\r\n9/10", "created_at": "2022-02-26T20:02:11.616Z"}, {"movie_id": 600354, "review_id": "631bfea60d2f53007f5cb2df", "rating": 6.0, "review_text": "Anthony Hopkins's performance in The Father is bulletproof. This is fortunate, because he encounters what the military calls 'friendly fire' resulting from a baffling decision by co-writer/director Florian Zeller, who has a couple of characters played each by two different sets of actors.\r\n\r\nThus Anne, Hopkins’s character’s (also named Anthony) daughter is played by Olivia Williams and Olivia Colman (who at least share some physical resemblance), while Anne's (ex)husband Paul is played by Rufus Sewell and Mark Gattis (who are like day and night). No wonder Anthony is so confused – as are we.\r\n\r\nThere are certainly precedents for this type of casting, the most famous of which is That Obscure Object of Desire, in which Luis Buñuel alternates the role of Conchita between Carole Bouquet and Ángela Molina – but then Buñuel was a prankster, whereas The Father's theme of senile dementia is very serious and deserves to be treated accordingly.\r\n\r\nNow, I’m aware that it’s only natural for Anthony to think that his nurse is also his daughter, but the source of his confusion should be that the person he believes to be his daughter behaves like a nurse, and not the other way around. It would make more sense, comparatively, for Colman to play Anne and the nurse, and for Williams to only play the nurse, but not Anne.\r\n\r\nOn the other hand, it doesn't make sense that the first time Anthony fails to recognize Anne we can't recognize her either, because then we think there’s something fishy going on. It would be far more dramatically effective if the actress Anthony doesn't recognize as his daughter is the one and only whom we identify as Anne. The protagonists turmoil is internal, and it’s Hopkins's duty to externalize it – of which the actor does a flawless job.\r\n\r\nThe film's mise-en-scène works better to convey Anthony's cognitive impairment but, again, it is the character's mental feng shui, or lack thereof, that interests us, and which Hopkins expresses unequivocally through a masterful combination of oral and body language. It’s not that he's the best part of the movie; he is the movie.\r\n\r\nHopkins puts on the proverbial clinic; his is a heartbreakingly beautiful performance, a veritable emotional roller coaster with sudden highs and unexpected lows. The Briton’s acting is all the more impressive because he makes it look easy – I mean, like Brando easy.\r\n\r\nAnd yet, it's as if Zeller doesn't quite trust Hopkins to make his vision a reality, hence all the visual gimmickry that hurts more than it helps (to paraphrase Jorge Luis Borges, saying something too much is as bad as not saying it). This is most unfortunate because Hopkins's talent for storytelling remains as powerful as ever – perhaps even more so.", "created_at": "2022-09-10T03:04:06.046Z"}, {"movie_id": 600354, "review_id": "635fd55241eee1007dd1297f", "rating": 9.0, "review_text": "We, as \"normal\" people, cannot imagine what really goes on inside the head of those suffering from more advanced dementia. We only know for sure what is reflected by caretakers and psychiatrists. Yet, Florian Zeller has done a tremendous job of immersing us in what may be the experience of one suffering individual. As a caretaker of two parents who both went this way, it is about as accurate an experience as we will ever come to understand. This is a powerful drama, made real by an absolutely amazing acting by Anthony Hopkins.", "created_at": "2022-10-31T14:01:54.475Z"}, {"movie_id": 600354, "review_id": "63ef8985ea84c70084b6d9b9", "rating": 9.0, "review_text": "The Father is a brilliant film. Fantastic performances all around, amazing editing, and cinematography that creates confusion for not only the audience but our main character. This story is so touching and incredibly tragic, it had me tearing up at multiple points. Not only do the emotional points work, but this film also creates an almost horror aspect of Alzheimer's that is quite frightening. It really made me sympathize for those with this disease and fear for the potential future of myself losing my memory.\r\n\r\nScore: 92% | \r\nVerdict: Excellent", "created_at": "2023-02-17T14:04:53.629Z"}]