[{"movie_id": 338970, "review_id": "5ab10e6dc3a36861ac00bee3", "rating": 8.0, "review_text": "ok walking into this movie i knew it was going to be fun not sure how much fun but fun however hen i sat down i got a treat there was a ton of action it was a really good movie too it had lots of adventure too and a good plot i really enjoyed it my only gripe is the begining is very slow but besudes that i say go see this movie", "created_at": "2018-03-20T13:36:45.050Z"}, {"movie_id": 338970, "review_id": "5ab53f48925141484a000025", "rating": 6.0, "review_text": "Your typical adventure film. Neither Vikander nor Goggins stand out. Though there was the screen debut of Daniel Wu as Lu Phen. \r\n\r\nWow!", "created_at": "2018-03-23T17:54:16.875Z"}, {"movie_id": 338970, "review_id": "5b0e747692514153b7003e12", "rating": 10.0, "review_text": "As a video game to movie adaptation Tomb Raider works on nearly every level, the only flaw being that there's so much of Tomb Raider to pack into two hours.\r\nI had great expectations for this film and wasn't disappointed in the least. On the contrary, it was a blast from beginning to end with Alicia Vikander lending a nice touch of innocence to Lara, which is a clear nod to the 2013 game reboot which is what the film is based on.\r\nHer tortuous relationship with her dad was predictable, but it wasn't overdone and it's a key element in the Lara story. On the other hand, we're plunged into the action right away and in that respect I was more than happy as the scenes were both exciting and typically Lara Croft. She uses keys, there are puzzles, traps,maps, evil foes and magnificent set pieces that, if you've ever played the games, will be instantly recognisable as Tomb Raider.\r\nMuch as has been said about the last two games perhaps giving a conflicted projection of Lara Croft - on the one hand a tormented soul and on the other, a ruthless killing machine. In all the games, she always killed the foes just to survive and the balance was just right here, with Alicia Vikander lending just the right amount of steely determination to the role.\r\nMore importantly, I could relate to the film having played all the games - the plane on top of the waterfall, the rolling spikes and the collapsing floor later on - all drew me in wonderfully.\r\nI'll take two please, or preferably three!", "created_at": "2018-05-30T09:52:54.012Z"}, {"movie_id": 338970, "review_id": "5b9334da0e0a26197b000816", "rating": 4.0, "review_text": "Some of the most generic shit ever put to screen. Don't get how this was supposed to please anybody, Tomb Raider fan or otherwise.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2018-09-08T02:32:58.030Z"}, {"movie_id": 338970, "review_id": "5bf85ff6c3a3686375097666", "rating": 7.0, "review_text": "\"Not dead yet, no sh*t!\"\r\n\r\nWanted to see this because I'm a long time fanboy of the game series. Liked the old movies with Angelina Jolie, perfect for a teenage boy with the humor; action and a beautiful lead actress.\r\n\r\nAlicia Vikander delivers a solid performance combined with a more realistic plot. Great action sequences with a nice cliffhanger for a sequel.\r\n\r\nOnly downside would be the role of Daniel Wu as there was no need for a sidekick who isn't really included in the storyline.\r\n\r\nYour regular action-adventure that gets lifted above the rest because of the solid and stunning lead actress.", "created_at": "2018-11-23T20:15:50.958Z"}, {"movie_id": 338970, "review_id": "63261cb7fd4a96007a293de8", "rating": 5.0, "review_text": "Alicia Wikander picks up where Angelina Jolie left off and after about fifteen minutes, I am fairly certain that she would have wished she had left well alone completely. I certainly wished she had. She is \"Lara Croft\", left a fortune after her industrialist/explorer father mysteriously disappears. Seven years on, decisions have to be made and she finds herself stumbling over clues that might lead to answers about where pop (Dominic West) disappeared to. That takes her on a series of sterile, well-choreographed, escapades with loads of \"Indiana Jones\" style adventures, stunts, fight scenes and shoot outs with bows and arrows and guns alike. Fortunately, her newfound foes couldn't hit a cow on the tit with a tin cup most of the time. Except, maybe the mean and moody \"Vogel\" (Walton Goggins) who at least looks like he is enjoying himself a bit throughout this otherwise unimaginative reimagining. Dame Kristin Scott Thomas and Sir Derek Jacobi must have had tax bills to pay as they show up for a few scenes at the beginning and a few more near the end as the dastardly ploy thickens, but the rest of this - at almost two hours - is really pretty procedural and disappointing. The production looks fine, but somehow the whole thing just never quite gets out of second gear.", "created_at": "2022-09-17T19:15:03.236Z"}]