[{"movie_id": 335984, "review_id": "59d5c60bc3a36832590089db", "rating": null, "review_text": "\"Blade Runner 2049 embraces the enormous shadow cast by Blade Runner 1982 by crafting a vast immersion in scale and vision...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2017/10/5/blade-runner-2049.html", "created_at": "2017-10-05T05:41:31.456Z"}, {"movie_id": 335984, "review_id": "59df3ea6c3a3686227098acb", "rating": 8.0, "review_text": "In a wonderfully woeful world, a detective makes a sad attempt at a relationship, has the most inventive sex scene ever committed to screen, and grapples with an existential crisis as he does his work. This stuff, which could work as a standalone story, is so strong that this movie must be seen.\r\n\r\nUnfortunately, the movie doesn't realise that the protagonist's everyday life is the best part, and instead focuses on a larger-than-life, goofy premise meant to tie 2049 to the original and set up another sequel, thus undermining what would otherwise be a gripping, intimate story.", "created_at": "2017-10-12T10:06:30.808Z"}, {"movie_id": 335984, "review_id": "59e6d0c1c3a368133e00668c", "rating": null, "review_text": "Hail to the Science Fiction gods as they came to their senses and granted upon the eagerly movie-going masses the long-awaited arrival of a stunning and opulent _Blade Runner_ sequel. Perhaps we should praise the understated genius and visionary mastermind Ridley Scott for his 1982 directorial accomplishment in serving up what appeared to be an underappreciated and overlooked SF thriller in its heyday over three decades ago only for it to emerge now as one of the greatest Science Fiction futuristic capers worthy of its cult classic following?\r\n\r\nMaybe the long overdue kudos are reserved for the diehard nostalgic _Blade Runner_ bunch whose committed and fanatical fandom was the key catalyst for this undeniably brilliant, brainy, dazzling and polished presentation to resurface and give new vitalizing breath and striking energy to the Science Fiction genre in conception? Could it be possible that Hollywood simply saw opportunistic and healthy box office receipts to restart another pop cultural juggernaut from yesteryear’s cinematic scene?\r\n\r\nIs there a returning Harrison Ford fixation/fetish blossoming courtesy of his past blockbuster film resume that boasts the obvious inclusion of prominent SF/adventure fantasy biggies such as both the _Star Wars_ phenomenon and the _Indiana Jones_ installments with _Blade Runner_ now taking up the matinee mantle?\r\n\r\nRegardless of the film-making forces at hand or the key reasoning for this 164 minute visually arresting odyssey updated and packaged for bombastic _Blade Runner_ enthusiasts and dedicated SF connoisseurs the proof is in the proverbial pudding as **Blade Runner 2049** has made its auspicious presence known and succeeds thrillingly as an indelible wonderment in imagination, intrigue and intelligence.\r\n\r\nBreathtakingly rich and vibrant in its overlong execution, **Blade Runner 2049** is a lustrous escapist epic that resonates with snappy pop, thought-provoking tendencies and atmospheric grittiness that soundly resonates. And yes…the participation of the aforementioned and omnipresent Ford reprising his role from 35 years ago is indeed the appealing and motivating factor to re-enter the anxiety-driven world of intrusive replicants,  societal annihilation and the guessing game of humanity infiltration.\r\n\r\nIt seems that the intense workmanlike charm and structured suspense in the rebooted **Blade Runner 2049** has not missed a single beat as it colorfully brings its brand of contemplative tension and underlying humorous texture to this sumptuous spectacle. Importantly, the film’s philosophical edginess and saturated cynicism stays true to Scott’s unflinching vision of introspection about the valued properties of life and who are the chief architects of such a unique gift of existence. Consequently, speechless Science Fiction audiences once again are transfixed by the mesmerizing yet old adage about the rivaling ‘have’s and ‘have nots’ especially so vital in the gloomy squalor and doomsday darkness that Scott created so fervently in his vintage edition that set the stage for renegade blade runners in a power struggle with defiant, roguish replicants disastrously flirting with the sacred boundaries of humankind.\r\n\r\nFilmmaker Denis Villeneuve (‘Arrival’, ‘Sicario’, ‘Prisoners’) has stepped into some pretty mighty cinematic shoes in dusting of the mothballs of _Blade Runner’s_ haunting and hedonistic past in an accomplished effort to bring forth a percolating potboiler of a challenging and imaginative hue to its succulent successor in 2049 with surging, exquisite aplomb. Screenwriters Michael Green (‘Alien: Covenant’, ‘Logan’) and Hampton Fancher (‘Blade Runner’, ‘The Minus Man’) manage to brilliantly convey the dystopian disillusionment as the caustic yet compelling commentary concerning the decline of humanity and how it is feverishly on the brink of non-existence. The fuzzy lines are crossed for the calculating chaos and corruptible wheels that are turning so aimlessly and shockingly. The sins of sinners, good, bad or indifferent, gloriously are stemmed in moodiness and mystery. Additionally, notably iconic cinematographer Roger Deakins (‘Fargo’) cultivates a dank, hazy-coated landscape where shadowy imagery compliments the dour suspicions of determined man versus durable machine co-existing in a hostile futuristic fantasy world of techno-dismal dimensions. Also, kudos are reserved for Hans Zimmer and Benjamin Wallfisch for their soaring, energetic score that undercuts the tension and turmoil.\r\n\r\nIn a nutshell, Ryan Goslin (Oscar-nominated for 2016’s ‘La La Land’) is a young blade runner known as ‘K’ whose mission is to track down veteran Rick Deckard (the returning Harrison Ford…also a former Oscar nominee) in the aftermath of a major uncovered secretive revelation that requires the missing senior badge-flashing blade runner’s undivided attention. The problem remains, however, is that Deckard has been out of circulation for three decades and so the search is on for K to hunt down the long-absent Deckard.\r\n\r\nIndeed, Officer K’s critical and contemplative police work is, to mildly put it, seek out the about-to-expire, unpredictable and resistant replicants and eradicate them when necessary. The replicants, mechanical menaces with artificial intelligence that are living among the humans incognito, are the main focus of the LAPD and K enthusiastically is immersed in the manhunt for the hidden techno-tyrants with militant mindsets that could strike at any moment among the walking flesh. K strives to put them out of their mechanical misery as his sworn duty to serve and protect but he is handcuffed (no pun intended) by the political politeness and procedural proprieties as pushed by his boss Lt. Joshi (Robin Wright). Basically, K is under surveillance based on his fragile mental state and Joshi is the one to contain this gritty-minded cop’s wandering psyche.\r\n\r\nThankfully, there is undeniable texture and intensity that fortifies **Blade Runner 2049** due to the layered and complex story that effectively taps into the robust realm of man’s possible mercy call at the dominant feet of advanced and sophisticated technology. This observational sentiment certainly rings true in contemporary times as selective human beings feel lost, intimidated, overwhelmed and need to surrender to the mounting shifty pressures of an exposed society seemingly ruled by sinning opportunists on both sides of the shady aisle, mechanisms rendered equally with blood and bolts.\r\n\r\nRefreshingly, **Blade Runner 2049** is devoutly cerebral in passion and old school perception. Oddly, Villeneuve’s mixture of science fictional roots and thought-provoking dramatic art house probing works while adding a realistic and somber milieu of existential foreshadowing. Gosling is gloriously geared as the hound dog-faced law enforcer too close for comfort on the fringe of film noir-style burnout as he gets embroiled deep into an abyss of head-scratching discoveries. Ford does not miss a single beat as the gravel-faced, handsome-aged Deckard saddled in adventurous mode despite the matured years since his early 80s heyday in the mundane, ground-breaking _Blade Runner_ blueprint from yesterday. Oscar winner Jared Leto (‘Dallas Buyers Club’) joyously lets it all hang out as the wickedly off-kilter character Niander Wallace. The feminine inclusion of Wright’s top policing babysitter Joshi and Ana de Armas as K’s love interest, Joi, are welcomed personalities. Ex-wrestler/actor Dave Bautista (hot off the ‘Guardians Of The Galaxy’ film series) is a larger-than-life specimen as always in proven popcorn blockbusters.\r\n\r\nConvincingly well-structured, profound, purposeful and without a prosaic bone in its bountiful body **Blade Runner 2049** is stunningly sumptuous Science Fiction theater for the thinking man and for the progressive machinery master-blasters as well.\r\n\r\n**Blade Runner 2049** (2017)\r\n\r\nWarner Bros. Pictures\r\n\r\n2 hrs. 44 mins.\r\n\r\nStarring: Ryan Gosling, Harrison Ford, Robin Wright, Jared Leto, Ana de Armas, Sylvia Hoeks, Mackenzie Davis, Lennie James, Dave Bautista and Carla Juri\r\n\r\nDirected by: Denis Villeneuve\r\n\r\nWritten by: Michael Green and Hampton Fancher\r\n\r\nMPAA Rating: R\r\n\r\nGenre: Science Fiction/Action & Adventure/Fantasy/Drama\r\n\r\nCritic’s Rating: ***1/2 stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** (2017", "created_at": "2017-10-18T03:55:45.725Z"}, {"movie_id": 335984, "review_id": "59e8ac0ac3a36827f401269f", "rating": 4.0, "review_text": "The film was actually rather disappointing. As a film it was OK, but as a sequel to Blade Runner, it was terrible. There were some nice in-jokes and references, but overall low-brow junk masquerading as high-brow gold (it was directed by Villeneuve, so I really shouldn't have expected better, the only thing he's good at is making stupid people think they are clever). Everything seemed forced and unnatural. The plot was trite and cliched, and everything was very predictable. Totally a wasted opportunity ;^<", "created_at": "2017-10-19T13:43:38.573Z"}, {"movie_id": 335984, "review_id": "59f292c492514122f8002e32", "rating": 8.0, "review_text": "Strikes a true balance between new and old. Denis Villeneuve has a perfect filmmaking record in my mind, and _Blade Runner 2049_ continues that trend with aplomb.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2017-10-27T01:58:28.298Z"}, {"movie_id": 335984, "review_id": "5a8d7bdc9251412a4500a36d", "rating": 6.0, "review_text": "As a movie this is a very good movie. The scenery, the acting, the colors etc. are of a very high technical standard. To me personally however, this movie is much too dark and depressing for my taste.\n\nI cannot say that I am surprised that the movie is dark. The first movie was a rather dark one after all and this one is a truly post-apocalyptic one. I quite liked the first movie despite its dark setting though. However this one takes the darkness and melancholy to an entirely new level.\n\nAs I said before, technically the movie is great. The scenery is stunning whether it is a dirty little hut out in the badlands or the equally dirty vast cityscapes. The scenes of the abandoned city where Decker is (re)introduced is sad but beautiful.\n\nThe acting is more or less great from all the main characters and the special effects are very well done and just right to fit with the rest of the movie.\n\nUnfortunately I cannot bring myself to give it more than 3 out of 5 stars. It has nothing to do with the quality of the film but a lot to do with my personal taste which of course is reflected in my ratings.", "created_at": "2018-02-21T14:02:04.153Z"}, {"movie_id": 335984, "review_id": "5d63da037f6c8d03acedc04b", "rating": 4.0, "review_text": "I don't understand what people like in this movie. It has some good things, but nothing much to deserve such big rating. Soundtracks & atmosphere are really good & it's well shot, however story is confusing & everything is all over the place. I still didn't understand what was the whole story of movie and it is extremely slow & prolonged. Very small amount of talking & a lot observing moments. Every minor action is prolonged. Like you see man laying in the snow for a few minutes & etc... I didn't like the movie & it took more than 2:30 hours of torture and boredom...", "created_at": "2019-08-26T13:09:23.606Z"}, {"movie_id": 335984, "review_id": "6146b31f55c9260067f54942", "rating": 3.0, "review_text": "The only thing _great_ about Blade Runner 2049 is the cinematography and the Atari sign, but it was just trying to copy Blade Runner instead of a new story. Outside of that it's dog dung. The music is a poor knock off Vangelis score. The story is basically fan-service and pandering by the studio with the tons of plot holes. It includes of biblical references, and aspects from the books _Fahrenheit 451_ by Ray Bradbury, that also takes place in 2049, mixed with _1984_ by George Orwell to try to come off as intellectual, but utterly fails and is poorly done. It practically ignored _Do Androids Dream of Electric Sheep_ by Phillip K. Dick. The original Blade Runner film did too, but at least that film was interesting. This film doesn't introduce anything new or anything that could be considered an original idea. The editing is awful. Dragging out scenes for no reason other than an attempt to appear \"intelligent and serious\" or to try to mimic 'Blade Runner' doesn't work since there's no reason for it story wise. It's kind of like a Zack Snyder movie, in that regards. The acting is subpar and wooden. Harrison Ford was phoning it in. It's a shallow film that misses the point. Here's a neat idea, why not try to actually adapt _Do Androids Dream of Electric Sheep_ into a film.\r\n\r\nI don't understand why people think this shallow movie is an intellectual and intelligent movie.", "created_at": "2021-09-19T03:48:47.705Z"}, {"movie_id": 335984, "review_id": "6300147a2faf4d007a9857cd", "rating": 7.0, "review_text": "**Overall : One of the most visually spectacular, stunning, and beautiful films I have ever seen!**\r\n\r\nNow I need to be honest; I am a simple man, and the complexities of the philosophical questions presented by the Blade Runner movies are lost on me. What makes someone truly human or real is a profound question with which an escapist like myself doesn't want to grapple. But with all that being said, Blade Runner 2049 is a masterpiece regardless of your movie taste. The beauty of the bright neon colors splashing across the cold, dismal, muted city of Los Angeles in 2049 is breathtaking. Every scene and moment is a visual feast filled with practical effects despite being a sci-fi film with flying cars and futuristic technology. While parts of the story and action were a little slow, Blade Runner 2049 captivates and intrigues from start to finish.", "created_at": "2022-08-19T22:53:46.114Z"}, {"movie_id": 335984, "review_id": "63149f6a9408ec007bed0a61", "rating": 7.0, "review_text": "Ryan Gosling is great in this update of the Ridley Scott story from 1982. He is \"K\" - working for the new but still all-powerful \"Tyrell Corporation\" tasked with eliminating the last of the \"Nexus\" generation of replicants. It's on one such mission that he, quite literally, unearths a terrible secret that could spell doom for the already crippled society of mankind. \"K\" sets out to gather as much information as he can to prevent this collapse, and gradually comes to realise that the answer might lie with the long disappeared \"Deckard\" (Harrison Ford); his water ego from times gone by. Thing is, though, as his search nears it's conclusion, will he be permitted to discover and act upon the truth? This enhances and augments the original, rather than try to replace it. The story is well held together by a Gosling who makes his presence felt, but who allows the story to develop using imagery and a sparing dialogue. Robin Wright is maybe not the best as his boss \"Joshi\" but it does feature one of the better efforts from Ana de Armas (\"Joi\") as we head towards a denouement that really does look at life as we know it! The photography is dark and gritty, there is a distinct and effective sense of the claustrophobic and the score from Hans Zimmer is one of his best - it really does assist in focussing the attention on the detail of this cleverly constructed and compelling adventure with a conscience. Big screen if you can - the lighting and effects are better appreciated that way.", "created_at": "2022-09-04T12:51:54.555Z"}, {"movie_id": 335984, "review_id": "6319f968880c92007aed0e3d", "rating": 7.0, "review_text": "Visually stunning. That's it. It felt cold as the acting of the main character. Also it made so many assumptions on the original movie that it felt banal. Such a shame, because the concept behind could have been good, but the delivery is just not there, I'm afraid.", "created_at": "2022-09-08T14:17:12.768Z"}, {"movie_id": 335984, "review_id": "63c20b5b23be4600817cd667", "rating": 1.0, "review_text": "Did it really need a sequel?\r\n\r\nIt was beautiful. I mean, it looked beautiful...even if there was one part that made me motion sick, but even that part was beautiful. And that, I think, was really more of a lighting thing than a set design thing or a special effects thing.\r\n\r\nHonestly, you remember the lighting in this. You remember it the way people remember the lighting in an Edward Hopper painting.\r\n\r\nBut did it need a sequel?\r\n\r\nThe acting was great, it really was.\r\n\r\nThere was honestly no real flaw as to how the movie looked, how it was directed, or how it was acted. It was pleasing...\r\n\r\n...but it was also kind of empty. So, did it need a sequel? Questions were answered, but those questions were best left as questions weren't they? The little mysteries that fueled debate that made the first film so...talked about, even if it was initially hated.\r\n\r\nWhy did those questions need to be answered? They were better left as little mysteries to ponder.\r\n\r\nAnd the result is the empty feeling you get when a really fun problem is finally solved. There is that A-HA moment of adulation...and than that little depression when you realize the mystery is finally over and you can move on.\r\n\r\nFrom now on the questions will be officially answered and as it doesn't hurt this movie, it doesn't take away from the film as a singular entity, it kind of kills the first film.\r\n\r\nNow we know it all and because of that, the first Blade Runner will never have the same feeling when you watch it.", "created_at": "2023-01-14T01:54:35.353Z"}]