[{"movie_id": 440, "review_id": "53837834c3a36805a800895c", "rating": 0.5, "review_text": "Remember when chest busters were scary? \r\n\r\nThis stinks, it really does, and this coming from a man who owns and loves many a cheese filled B/Z movie. Although I would in no way say that AVP: Alien vs. Predator (2004) was a good movie, I have a tiny soft spot and found it watchable at least, this hack job makes that film seem like the pinnacle of creature feature nirvana. \r\n\r\nA Predator ship encounters problems on board by way of a newly born predator/alien hybrid, it crash lands on Earth (America) and thus Requiem is born as face huggers go crazy, aliens run amok, predator fights back, and the cast of genre stereotypes kill or be killed, the end! All the makers have done here (apart from attempting to kill off the franchise it seems) is splice together various staples from the other films in the series. Be it the settings or confrontations, they have just upped the blood quota, the film has no substance what so ever. Characters so dense and unlikeable you root for the monsters by way of having no choice, dumb teens in angst, Rambo mom, ex-convict trying to do good, you name it and chances are you have seen it in other rubbish murder death kill movies. \r\n\r\nThere is gore galore which I'm sure will appease the easily pleased, and in one particularly monstrous scene involving a pregnant woman, a sequence for the squeamish to chat on the playground about come Monday morning. But you honestly would be better off watching some cheap no budget slasher film from the 70s, because unlike the money backed hack directors here, they had an excuse back then. Drek 1/10", "created_at": "2014-05-26T17:21:56.686Z"}, {"movie_id": 440, "review_id": "5aaf6b2d0e0a267827035d99", "rating": 3.0, "review_text": "Out of all the _Alien_ and _Predator_ franchise, a series stretching out for nearly 40 years, a cultural phenomenon that has wormed its way into all manner of media, and has produced no less than eleven official movie entries, _Aliens vs Predator: Requiem_ is the worst. It's so blatantly obviously the worst that I don't think any _Alien_ or _Predator_ or even _Alien vs Predator_ movie that we ever see from now until the end of time will ever unseat it as the worst.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2018-03-19T07:47:57.767Z"}, {"movie_id": 440, "review_id": "625e70731f98d10aa4b41d71", "rating": 4.0, "review_text": "So if you recall the last scene from the first AVP film (2004) you will know that the \"Predator\" ship is carrying an unwelcome passenger. Well, it manages to run rampage forcing the ship to crash-land in Colorado. A nicely wooded area where the two races can pick up their unfettered hostility with enthusiasm. An added bonus for our hungry visitors is a local community of humans ripe for the eating. Maybe 90% of this is either filmed in the dark, or in dark and dingy interiors and that does nothing for the menace of the film, nor does it make it enjoyable to watch. The human actors are pretty mediocre delivering a dialogue that was clearly of little importance when it came to the commissioning of this completely unnecessary and unrewarding sequel; indeed I found myself very much in the corner of whatsoever wanted to make a feast of these rather uninspiring, hormonal, teenagers who are delivering a pizza one minute, then wielding a pump-action shotgun whilst driving a tank the next. Sci-fi is, of course, meant to be far-fetched, but this is just a beastie too far and the ending just ridiculous (if, mercifully, quite, quite final!). This gift stopped giving long ago, let's hope we can recall the glories of Arnie and Sigourney and let this nonsense just RIP.", "created_at": "2022-04-19T08:18:59.796Z"}]