[{"movie_id": 439079, "review_id": "5b98b7ef0e0a263db5006afb", "rating": 4.0, "review_text": "Appallingly cliched. Slow and boring. Not even the Conjuring hype could save this film. It moves forward at a painful pace, brings nothing new to the table, and is not even scary.", "created_at": "2018-09-12T06:53:35.436Z"}, {"movie_id": 439079, "review_id": "5b9b19530e0a2628dc00bca3", "rating": 8.0, "review_text": "Overall I liked The Nun it was a spooky fun movie with some pretty good shots and scenes (lighting, camera angles, and such). The transitions from one scene to another was a bit off and the story overall had a more fantasy tone over the more grounded and realistic tone The Conjuring and Annabelle movies had. Much of the story felt like it was just forced to setup a shot or scene which does hurt it. It isn't a perfect movie but I'd watch it again. It is like Indiana Jones meets Silent Hill. None of the character actors felt out of place or superficial either, I really appreciate that. Everyone felt believable and natural to their roles and environment, not forced.", "created_at": "2018-09-14T02:13:39.111Z"}, {"movie_id": 439079, "review_id": "5bdcd3f20e0a26058d000145", "rating": 6.0, "review_text": "Horror is baaaaack! \r\nAnd with a vengeance.\r\n\r\nThe Nun is not for people that don’t like horror movies or burnt out on them. Don't expect character development either. Don't expect to be shock like you were when you watched The Exorcist. I’ve read several critic reviews were they just don’t get it. They use words to describe it like “using every trick in the horror trope” or “predictable”, “throwing the kitchen sink at”, or “not enough character development”. Well forget what you heard because there is more bite to this movie than you’d expect. \r\n\r\nOkay, so we begin with a spooky opening sequence where two nuns are fighting to save humanity from a malevolent presence that is about to enter our world. One is dragged into a room and the other commits suicide by hanging. Suicide is a sin, right? Makes you wonder what type of evil is powerful enough to destroy Catholic nuns?\r\n\r\nBeing the beginning of The Conjuring movie universe, this story begins like this, Father Burke (Demién Bichir) is summoned by the Vatican to investigate the suicide of a nun at The Abbey, a castle located somewhere in Romania. Apparently Father Burke has a trauma and a shameful past after having failed to save a teen from an exorcism he performed. Makes you wonder why The Vatican would send a priest like Father Burke on such a dangerous mission. The Vatican doesn’t send Father Burke alone on this task though. They assign Sister Irene (Taissa Farmiga), who hasn’t yet taken her vows. A nun that hasn't taken her vows yet, and not your typical nun either. She's contrary to the average nun. She seems so innocent.\r\n\r\nFather Burke and Sister Irene are taken to The Abbey by a local delivery man, Frechie (Jonas Bloquet). (You may remember Frenchie as the first exorcism performed by The Warrens from the original The Conjuring. Lorraine Warren has the painting of The Nun at their home and references it in the film.) Sister Irene was chosen to go on this assignment because she experiences visions, these visions provide the information needed to uncover what actually occurred at The Abbey.\r\n\r\nThe Abbey has been the site of a malevolent force locked away for centuries. The Church took over The Abbey and placed a congregation of nuns to pray 12 hours a day to keep the evil force in control. However, after WW2 bombing weaken the structure of The Abbey, the evil locked inside of it found another way to escape, and using the guise of a nun, slowly grows in strength causing terror on those around it. \r\n\r\nYes, The Nun is a supernatural survival horror installment of The Conjuring universe. You don’t have to be a die hard fan of the horror genre in order to be scared. Yes, there is a lot of the same tropes from the most popular supernatural horror movies and that is because this is how demonic infestation happens. \r\nDirector Corin Hardy and screenplay writer Gary Dauberman do wonderfully.\r\n\r\nWhat this film gives us is tricky camera and visual effects that showcase how the demon works. We find out that the demon’s name is Valak–an ancient demon from Hell that was summoned by the count performed sacrificial rituals. \r\nIf you are expecting character development then you’re not going to find it here. This story doesn’t need a lot of characters at all. You don’t need a lot of information about these characters because Valak is the only character this story is about.. One minute he’s behind the character’s back, the next his shadow appears on the wall, he reanimates dead corpses and even manifesting animals and the usual superhuman strength as well as taking on human form. He ghosts the characters as well. It’s always interesting to see how the director and screenwriter pull off these visual effects. \r\n\r\nFather Burke character plays like a detective searching the castle for any information he can use to exorcise the demonic spirit from the world while Sister Irene uses her visions to lead her to the truth about what occurred at The Abbey as well as discover anything that she can use to send the evil spirit back to Hell. If you like Ash from the Evil Dead horror series, then you’ll like Frenchie because he is the outsider in all of this providing necessary dark humor. Frenchie isn’t afraid to use a shotgun to blow off the heads of a couple of deadites disguised as nuns.\r\n\r\nWhat also makes this film enjoyable to watch with a group, is the pacing. There are enough slow moments for you to make jokes about the characters or the visual bombarding your senses.\r\n\r\nI give this film an enthusiastic 7/10 for its creepy mood and intense disturbing images. And those squeamish people, no worries. There isn't a lot of gore. \r\n\r\nDefinitely a great popcorn horror flick to watch in the dark with your friends. Definitely worth the movie ticket. You won't be disappointed as long as you keep what I've said in this review in mind.\r\nIf I were to rate its place among the other films in The Conjuring universe, I would rate as follows\r\n\r\n1) The Conjuring\r\n2) The Conjuring 2\r\n3) The Nun\r\n\r\n* 4) Annabelle Creation", "created_at": "2018-11-02T22:47:14.442Z"}, {"movie_id": 439079, "review_id": "5d63daf57f6c8d1394ec3b97", "rating": 4.0, "review_text": "I wanted to like this movie because it's connected to Conjuring movies, but it was awful, even from the start it was obvious.\r\n\r\nIt was a dull, boring movie with cheap jump scares. The only reason I'm giving it 4 and not 3, because it was shot nicely and acting wasn't that bad.", "created_at": "2019-08-26T13:13:25.154Z"}, {"movie_id": 439079, "review_id": "5d9b5c5d1d01910020b7129c", "rating": 6.0, "review_text": "The Nunjuring!\r\n\r\nWhen a young nun at a cloistered abbey in Romania takes her own life, a priest with a haunted past and a novitiate on the threshold of her final vows are sent by the Vatican to investigate...\r\n\r\nSo here we have the latest spin-off from the one time high quality \"Conjuring\" franchise. Sticking strictly to a formula that will either infuriate or satiate horror genre fans, \"The Nun\" delivers enough creepy boo-jump tropes to keep it above average. There's plenty of roaming about dark corridors and churchyards, with lanterns our only prominent saviours from the terrors of the dark. If, and it's a big if, you don't mind that Corin Hardy's film isn't trying to raise the bar for horror, and is in fact staying safe, then there's a decent enough good time to be had here. If you be one of those who constantly moans about bringing nothing new to the table, don't bother with this one, in fact, think of something new to bring to the table yourselves then... \r\n\r\nThe set-pieces hold up well enough (buried alive shiver shiver), the atmospheric dread only occasionally punctured by Abel Korzeniowski's bombastic score. The story is interesting enough, such as why the entity is bringing terror to the abbey, what is the link to the \"Warren\" family, and the backstory axis for Father Burke (Demián Bichir) brings another demonic layer to the plotting. While talking about \"bringing something new to the table\", for the first time in this series we actually get a bit of humour, mostly from Jonas Bloquet's likable Frenchie character. Taissa Farmiga holds the lead well, where she has a very appealing visual reaction style that will serve her well if she stays in genre mode. While Maxime Alexandre's cinematography (low lights and fogs) is a big improvement from \"Annabelle: Creation\" and is tonally compliant.\r\n\r\nThis formula has been done much better previously, such as Hammer's take on \"The Woman In Black\", but even then they were going on about new stuff being brought to the table etc etc etc. It is what it is, a boo-jump haunted house (buildings) picture that is there for those who like such things, who buy into it on that level. Is this a great film? Absolutely not, but it works on its intended terms and any expectation of a new branch of horror is going to have you crying over spilt blood. 6/10", "created_at": "2019-10-07T15:40:13.179Z"}, {"movie_id": 439079, "review_id": "5f3384d8ef8b32003713f40d", "rating": 4.0, "review_text": "Not the literal **worst** entry in the series (that laurel still rests firmly upon the crown of _Annabelle_) and there was a couple of cool design moments, like creepy hands busting out of statues, even the acting is of acceptable level. But that's about everything positive I can say for _The Nun_, 'cause this is pretty dang bad. \r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2020-08-12T05:57:44.754Z"}, {"movie_id": 439079, "review_id": "63bf7dcddf857c008926cec4", "rating": 1.0, "review_text": "It looks like they attempted to make an inoffensive horror movie...not really in the PC sense of the word, but in the \"we are going to do just enough to get an 'R' rating in an otherwise PG movie\" sense of the word.\r\n\r\nIt's not really frightening. It's not really scary, it's not really gory, and the nun herself is not really ominous.\r\n\r\nIt just sort of is.\r\n\r\nAnd, really, it could be a lot better.", "created_at": "2023-01-12T03:26:05.786Z"}]