[{"movie_id": 383785, "review_id": "5935cd68925141052d002fcd", "rating": 2.0, "review_text": "**When two different ancient arts meet.**\r\n\r\nThis is not some film. The project was decided when two leaders of the respective nation met a couple of years ago. More like it is China's move to mend the relationship with India. So except Indian cast participation and a few Indian locations, this is completely 'made in China' and for the Chinese market. Like always any Chinese product, this is not a quality product. Just an another 'The Myth' from the same director.\r\n\r\nTeam up between India and China is a rare thing in filmdom, so I was curious about that. It should have been a star studded cast, but from the Chinese side, it does, not on the Indian side. The worst screenplay award goes for Mr. Tong. Literally, it is a retelling story of those great treasure hunt adventure films we had seen so far in our life. Even Jackie Chan could not save it. His presence failed to do the usual magic. Like his signature, action-comedy, nothing new to appreciate either his part or the film.\r\n\r\nThe story follows the famous Chinese archaeologist Jack, who teams up with his Indian counterpart for a new quest. Equipped with the modern technological tools, the crew heads for a frozen lake in the Himalayas. It's the first and an important clue for the rest of the treasure hunt. But it was interrupted by a group of armed men and soon the tale flies to Dubai, followed by Western India, where it comes to end with lots of action and adventures.\r\n\r\n> ❝'Vastu Shastra', the oldest book ever written about architectural design.❞\r\n\r\nThe opening scene sets in some thousand years ago. The graphics were very poor in that part. Even computer games have much better CGI work. So I lost the interest in the film within the first sixty seconds. The stunt choreography was unbelievably terrible. I mean too much unrealistic, I felt it like I was watching some kind of commercial Tollywood/Rajamouli film. Surely this film was not made under the art and the film-making value. It seems nobody was interested to participate or make a quality film. They made it to just to keep the promise made by the politicians, so it was wrapped up awfully.\r\n\r\nI thought it was a bad combination of words for a title. Kung fu and Yoga. Like the polar opposite, two different philosophies. One is violence and the other one is peace and healthy. Though not bad how those two were utilised to tell the tale. This is a watchable film, but no good at all. Might be the worst Jackie Chan film I've ever seen. Promoting the unrealistic road projects in the film was a bad idea, and enough reason to flop in India.\r\n\r\nThere are many good actresses in India, but they have picked Disha Patani. She's a real beauty, but the performance was worse than the film's graphics. I could not stand for her dialogue deliverance. She just read them rather than expressing naturally as any actors do in the world. The end was really disappointing. An easy compromise. It's good for the real life, but not good for an entertainment film. Those who are seeking treasure hunt film, just stay away from it. Because it looks more like a parody than a distinct one. Overall the film was overwhelmed by lots bad parts. So easily a skippable film of the year, which has a big name in it.\r\n\r\n_02/10_", "created_at": "2017-06-05T21:30:16.108Z"}]