[{"movie_id": 343668, "review_id": "5a460f6e9251411fab0931c0", "rating": 5.0, "review_text": "This _Kingsman_ sequel might not be an outright terrible movie, but it is a **massive** disappointment. Virtually every enjoyable aspect of the first movie has been either turned down to and unsatisfyingly low level, or blasted way the fuck up into the realm of off-putting nonsense. _The Golden Circle_ somehow manages to both underserve all of its elements, while still feeling far too long. A couple of good fights, nice suits and maybe a single laugh can be found throughout the movie, but it does not do the original one iota of justice.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2017-12-29T09:48:30.521Z"}, {"movie_id": 343668, "review_id": "5a8c61b79251410ac408fac7", "rating": 9.0, "review_text": "This is indeed a silly, even childish at time, movie but to me it was also a really really fun movie to watch.\n\nThe movie starts by the Kingsman organisation getting screwed over royally by the psychopathic Poppy Adams which forces what remains of the organisation, all two people, to work with their counterpart in the United States. Just as the Kingsmen are parodies on the stiff upper lip British gentleman the Statesmen are parodies of the southern US gentleman (if you can actually call them that) only even more so. Maybe it is my European heritage but I personally feel the Kingsmen are fairly cool where the drawling Statesmen are more on the silly side.\n\nOnce again Eggsy is the main character although I have to say that I personally like Harry, the original Galahad, much more. He has much more charisma, elegans and smarts. Since he is portrayed on the movie posters I guess it is not much of a spoiler when I say that, to my delight, the rumors of his death were greatly exaggerated. Unfortunately Eggsy is sometimes quite cool and plays his British gentleman role quite well and sometimes he is just dumb as a doornail.\n\nPoppy Adams is okay but she is bordering on the ludicrous too much for my taste. The we have a certain English artist, a Sir no less. I do not know how much they had to pay to get him to take part in this movie but I am fairly sure I would consider it too much. He was just silly as far as I am concerned.\n\nThe movie is of course loaded with gadgets, most of them of the variety that makes noises of varying levels of loudness usually resulting in one or more bad guys biting the dust. It is almost gadget overload but I really liked. Sometimes this amount of totally unbelievable gadgets is dragging down the movie more than anything but in this one it was mostly a success. To me Harry and the gadgetry is what makes this movie.\n\nGiven that I am originally from Sweden I have mixed feelings about Eggsy’s girlfriend and the Swedish royalties. I guess those parts were okay but I could have been without them as well. At least I feel that however wrote the scene with the “royal” dinner could have read up on Swedish etiquette. Knocking on a glass with your spoon, knife or fork means you are about to give a speech, NOT that you want the plates to be changed. A professional servant, and the Swedish royalty DO have professional servants, do not need to be told when to change plates.\n\nThe actual story is, well it is original at least but I would not rate it any higher than okay. It served as a vehicle for stringing together all the stunts and jokes so it served its purpose. The worst part of the story was that I was actually finding myself agreeing with the president. This might perhaps shock some people but I am sorry, if you are dumb enough to ingest that crap, which is also highly illegal, then I have no sympathy for you.\n\nIf you get upset about stupid plot details and plot holes then be prepared to be upset. There are plenty of them in this movie. To me it did not matter too much since this is not really a thriller or drama. It is a spy parody / comedy. Having said that it did piss me off a bit that this advanced organisation did not have brains enough to deal with the piece of equipment left in the London cab at the beginning of the movie. I mean, it was just soo obvious what would happen.\n\nAnyway, on the whole this movie was great fun to watch. I hope we get another sequel. Perhaps one with a Japanese version of the Kingsmen? There ought to be plenty of cultural stereotypes to play on there.", "created_at": "2018-02-20T17:58:15.555Z"}]