[{"movie_id": 82505, "review_id": "53b00bbd0e0a265975006267", "rating": 5.0, "review_text": "Lawrence of Suburbia.\r\n\r\nA little better than its garbage reputation, as evidence by the support it got at the box office from its target audience, Mark Tonderai’s horror/thriller is safe genre film making. There’s no intelligence in the screenplay, no copious amounts of blood letting, the characters do dumb things and in truth it unfolds as a standard girl in peril movie. These things are what have led to it being savaged by critics, but backed by a trio of strong performances from Jennifer Lawrence, Elisabeth Shue and Max Thieriot, boosted by a genuine narrative surprise and the fact that Tonderai is able to do the peril motifs with suspenseful impact, ensures House at the End of the Street is at least a decent enough time waster. 5/10", "created_at": "2014-06-29T12:51:09.975Z"}, {"movie_id": 82505, "review_id": "5f4947377739410034e9d025", "rating": 7.0, "review_text": "_**Does a killer prowl the neighborhood or is it just local lore?**_\r\n\r\nA mother and daughter (Elisabeth Shue & Jennifer Lawrence) move into a Pennsylvania suburb where a nearby abode was the scene of a double murder four years earlier, committed by a deranged girl named Carrie-Anne. She was thought to have drowned, but her body was never found and local legend suggests that she prowls the eerie woods. Meanwhile her brooding brother (Max Thieriot) lives on the property and is maltreated by some of the residents. Gil Bellows plays an officer that befriends the mother and is sympathetic toward the despondent young man.   \r\n\r\n“House at the End of the Street” (2012) is a coming-of-age drama mixed with mystery and horror of the slasher variety, but more realistic than a guy in a mask lurking around with a machete. It borrows story elements from “Psycho” (1960) and “Sleepaway Camp” (1983), but has the polished modern tone of flicks like “Solstice” (2008), “The Last House on the Left” (2009) and “My Soul to Take” (2010). It’s not great like “Psycho” or the remake of “Last House,” but it’s at least on par with “Solstice” and superior to “Sleepaway Camp” and “My Soul to Take.”   \r\n\r\nJennifer looks great in her prime while Thieriot’s character makes for a sympathetic study. The lush Eastern locations are sumptuous and the relatively believable story holds your interest while offering some unexpected revelations. The feminine cast also includes Allie MacDonald, Eva Link and Jordan Hayes.\r\n\r\nThe film runs 1 hour, 41 minutes, and was shot in Metcalfe & Carp, Ontario, both outside of Ottawa.\r\n\r\nGRADE: B", "created_at": "2020-08-28T18:04:39.193Z"}]