[{"movie_id": 680813, "review_id": "6046fc6270b444005a2c311c", "rating": 7.0, "review_text": "Everybody has a story that deserves to be told, and an Afghan refugee’s personal narrative of oppression and the pursuit of a better life is portrayed in “Flee.” Director Jonas Poher Rasmussen animates a discussion between himself and his anonymous friend “Amin,” a man that has had one hell of an existence. Amin recounts his dramatic story through his own words, beginning when he was a young boy in Afghanistan in the 1980s to his incredible journey that made him the man he is today.\r\n\r\nThe hand-drawn animation is a poetic way to not only tell the man’s story, but to protect his identity. Amin’s life, of which most of it has been spent on the run, is recounted in a series of unbelievable events that are traumatic, heartbreaking, and inspiring. That all of these things happened to one man and he’s still standing is a testament to a human’s will to survive, and I hoped he would eventually get his happy ending (you’ll have to watch the film to see if that happens).\r\n\r\nRasmussen has an empathy towards his subject that’s crucial to making this thoughtful documentary work. Amin feels comfortable opening up to him, and reliving so many painful memories about the horrors he and his family experienced during his lifetime gives the film a very somber tone. From his parents resorting to human trafficking so their kids could have the opportunity to get an education to the sadness of leaving his homeland for Russia during a time of unrest in Kabul, this refugee story spans more than a decade and examines the long-term psychological effects of a lifetime spent running away from oppression and towards freedom.\r\n\r\n“Flee” is a personal history brought to life, and Amin eventually reveals a secret that he’s never told another soul. It’s a cathartic exercise of a man confronting his painful past so he can move ahead to a brighter future, and his quest to find a place he can finally call home.", "created_at": "2021-03-09T04:41:06.639Z"}, {"movie_id": 680813, "review_id": "62e9a0fde61e6d0062f1ef23", "rating": 10.0, "review_text": "I loved **EVERYTHING** about this film. Jonas Rasmussen apparently is best friends with Amin, who just happens to be a Afghani who had to escape during Afghanistan's civil war because his father was one of the \"_desaparecidos_\" (to borrow the Chilean term of those silently murdered during Pinochet's rule).\r\n\r\nSounds ordinary? But oh no it isn't.\r\n\r\nNow in his mid-30s, living in Denmark, gay, and having a boyfriend who wants to get married, Amin realizes that to have any quality of life, he must confront his past, and the horrible secret he's kept for most of his life. This film is the result.\r\n\r\nAs if that weren't different enough, Rasmussen animates most of the film in order to protect the actors from the Taliban. Why? Because this is a documentary and a true story.", "created_at": "2022-08-02T22:11:09.390Z"}]