[{"movie_id": 373569, "review_id": "59805be1925141495f00db41", "rating": 2.0, "review_text": "Short version, don't watch unless you really want to punish yourself.\r\n\r\nThis is one of the most boring and predictable movies I have seen in a long time.\r\n\r\nIn addition to the extremely unfunny jokes, the whole movie plot is lacking. There is NO point in the movie where you tell yourself \"Ok, now it makes sense!\". \r\n\r\nThe movie tries to exploit 1) the need that movies have to have women heros and 2) family problems and family bounds, but they fail at both.\r\n\r\nLet there be    \r\n<==========    Spoilers   ==========>   \r\n\r\n\r\n> The whole movie is about a mother and a daughter that go to Ecuador to have fun. They get captured by a very powerful underground lord to be sold. They, together, bring down this person and his organisation and do what  the whole US and Mexican police force have not been able to do.   \r\n> Oh and the girl is really irresponsible and the mother is really uptight which by the end of the movie becomes the exact opposite.", "created_at": "2017-08-01T10:45:53.550Z"}, {"movie_id": 373569, "review_id": "59fe20e292514147330241f6", "rating": 6.0, "review_text": "**When the paradise turned into a hell!**\r\n\r\nPeople have reason to dislike it, but I'm not on the same page. Of course it was not the best kidnap-adventure I've ever seen. But I enjoyed watching it. Because I felt it was being truthful. I mean Amy Schumer neither a beauty queen nor a sexy devil. Her role was much better than the last time I saw her in a romance-comedy. Except the familiar storyline, this film had a better narration with honest dialogues. So don't criticise me for saying what I felt about her.\r\n\r\nAnother South American based clichéd theme. A woman goes on vacation with her mother after breaking up with her boyfriend. Soon the paradise becomes a 'behind the enemy line' hell. When there's no one is coming to their rescue, the surviving and fight back begins. In an unfamiliar territory, how they plan for their escape and other adventures follows till the last sequence of the film.\r\n\r\nBoth, Amy Schumer and Goldie Hawn was good. It was a perfect casting, because the chemistry was good. The pace of the narration was the advantage. A decent direction from the filmmaker of some of the finest comedy films. Surely there's nothing wrong to watch it at once. An average film, or maybe slightly above that. But there's nothing laudable. If you are looking for logicless time pass film, it will do just fine.\r\n\r\n_6/10_", "created_at": "2017-11-04T20:19:46.220Z"}]