[{"movie_id": 419704, "review_id": "5d7f61efc54304001096a5ef", "rating": 8.0, "review_text": "‘Ad Astra’ is about as art house as Hollywood cinema gets; disguising a metaphysical drama as an action-packed sci-fi adventure is a clever move for James Gray. While not perfect, it’s consistently entertaining whilst offering an introspective investigation on how parents influence their children. While a journey to the outer realms of our solar system, ‘Ad Astra’ is also an exploration of the human heart.\r\n- Charlie David Page\r\n\r\nRead Charlie's full article...\r\nhttps://www.maketheswitch.com.au/article/review-ad-astra-a-luscious-and-meticulous-space-drama", "created_at": "2019-09-16T10:20:31.384Z"}, {"movie_id": 419704, "review_id": "5d8382069e458602269604e4", "rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nI love sci-fi space movies, especially when these depict the cosmos in such a visually stunning manner as Ad Astra does. It’s one of those films where the visuals elevate whatever narrative is being told. If you don’t get goosebumps or get excited with the opening sequence of this movie, then it might not be the film you’re looking for. From the quiet but powerful sound design to the impressive cinematography, James Gray delivers a visually captivating story with an outstanding protagonist. Brad Pitt is definitely getting tons of nominations this awards season (let’s not forget his amazing role in Once Upon a Time in Hollywood).\r\n\r\nHis subtle yet incredibly emotional performance shows an astonishing range. He carries the whole screenplay in his shoulders, and I don’t mind that at all. There’s a lot of narration, and here’s where I transition to the most divisive aspect of the movie: it’s a slow-burn. Now, there’s no problem with a film being deliberately slow. In fact, some of my favorite movies of all-time aren’t fast-paced. They cherish their story and make the audience feel interested in what they’re experiencing. Ad Astra isn’t an action flick or a comedy, it’s a character-driven drama, so most of the runtime is devoted to developing Roy.\r\n\r\nThat said, don’t go in with expectations of feeling entertained all the time. Some moments aren’t supposed to excite you or leave you jaw-dropped. Some sequences are just meant to make you feel immersed by the environment, be lost in space (IMAX is the mandatory way of watching this feature). Don’t expect the film to make an 80-day trip to some planet end in two cuts and 20 seconds. Gray purposefully establishes a slow pace. Obviously, general audiences don’t usually enjoy this type of flicks, but if you’re able to manage your expectations realistically, you’re one step closer to not feel bored throughout the runtime.\r\n\r\nThe first act is the one that captures everyone’s attention. It doesn’t waste time on Earth, it goes through what’s happening pretty quickly, and it possesses 90% of the heavy action (including one of the best opening sequences of the year). Sound has a significant impact on how Gray films his sequences, and it’s unbelievable how well-shot the chasing scenes on the Moon are. Scientifically speaking, this is no Interstellar where you simply have to accept some mind-blowing yet unjustified stuff. Ad Astra doesn’t have a single scene where one might think “this completely takes me out of the movie, I can’t accept that this is possible in some fictional future”. This is a huge compliment to a space film containing several launches, lunar bases, and (very) long space journeys.\r\n\r\nHowever, the remaining two acts focus intensely on Pitt’s character, slowing down the main plot. Like I wrote above, there’s a lot of development through Roy’s thoughts. Extensive narration is almost always an issue, even when the narrator is Brad Pitt. Some monologues do indeed develop the character or explain what he’s feeling, but some tend to fall into the philosophical side that doesn’t always carry a meaningful or interesting message. Using everyday language, sometimes it’s a bit boring… Additionally, the ending might be a letdown for a lot of people. Tommy Lee Jones (H. Clifford McBride) doesn’t have a lot of screentime, and I can’t really delve into details about his storyline, but his character’s relationship with Roy doesn’t exactly serve as a fantastic payoff.\r\n\r\nMax Richter’s score is one of 2019’s best, and I hope it gets recognized by every award show. It definitely helps the experience to be more enthralling. The lack of sound in space is also powerful in its own way. Beautifully-edited, but with a continuously slow pace that doesn’t change from the moment the second act begins. However, the story of Ad Astra is vastly superior to, for example, Gray’s The Lost City of Z, which I genuinely disliked. This space adventure is visually more exciting, its story is more engaging, and its protagonist is more compelling than everything else in Gray’s previous installment. Finally, it’s one of those movies that watching at a film theater (mainly IMAX) or at home, makes a massive difference. You’ll never feel as entertained or captivated at home, so make sure to check this one at the best possible screen near you.\r\n\r\nAll in all, Ad Astra is yet another display case for Brad Pitt’s chances at winning an Oscar. With a subtle yet powerful performance, Pitt carries the whole story to safe harbor with tremendous help from the eyegasmic visuals. Technically, it’s one of 2019’s closest movies to being perfect. Very well-shot, well-edited, with an immersive score, and gorgeous cinematography. However, it’s a slow-burn that doesn’t always work as such. Narration is the go-to method to develop Pitt’s character, and while it works most of the time, it slows down the main plot, becoming a tad boring during a few moments. The ending isn’t the impactful payoff that the film needed, and the incredible supporting cast is under-utilized. In the end, it’s still a great movie and one that should be seen at the biggest and best screen possible, so go see it for yourself!\r\n\r\nRating: B+", "created_at": "2019-09-19T13:26:30.613Z"}, {"movie_id": 419704, "review_id": "5d9e02057f05400037ab4d04", "rating": 7.0, "review_text": "**_Despite some utterly absurd diversions (chase scene! horror scene! shoot-out scene!), this is a quality science-fiction narrative, suggesting the answers we seek in the stars are actually found within_**\r\n\r\n>_macte nova virtute, puer, sic itur ad astra,\r\ndis genite et geniture deos._\r\n\r\n- Publius Vergilius Maro; _Aeneis_ (29-19 BC)\r\n\r\n>_N = R∗ · fp · ne · fl · fi · fc · L_\r\n\r\n>_where:_\r\n\r\n>_N = The number of civilisations in the Milky Way whose electromagnetic emissions are detectable (i.e. which are on our current past light cone)._\r\n\r\n>_R∗ = The average rate of the formation of stars._\r\n\r\n>_fp = The fraction of stars with planetary systems._\r\n\r\n>_ne = The average number of planets, per star with planetary systems, with an environment suitable for life._\r\n\r\n>_fl = The fraction of planets with an environment suitable for life on which life actually appears._\r\n\r\n>_fi = The fraction of planets on which life actually appears on which intelligent life emerges._\r\n\r\n>_fc = The fraction of planets on which intelligent life emerges that develop a technology capable of releasing detectable signs of their existence into space._\r\n\r\n>_L = The length of time such intelligent life release detectable signals into space._\r\n\r\n- The Drake Equation; Frank Drake (1961)\r\n\r\n>In Drake's original hypothesis, the proposed values were:\r\n\r\n>R∗ = 1 yr−1 (1 star formed per year, a very conservative estimate)\r\n\r\n>fp = 0.2 to 0.5 (one fifth to one half of all stars formed will have planetary systems)\r\n\r\n>ne = 1 to 5 (stars with planetary systems will have between 1 and 5 planets with an environment suitable for life)\r\n\r\n>fl = 1 (100% of planets with an environment suitable for life will develop life)\r\n\r\n>fi = 1 (100% of planets which develop life will develop intelligent life)\r\n\r\n>fc = 0.1 to 0.2 (one tenth to one fifth of planets which develop intelligent life will develop life capable of releasing detectable signs of their existence into space)\r\n\r\n>L = 1,000 to 100,000,000 years\r\n\r\n>This gives N as a range between 20 and 50,000,000, although Drake asserted that, given the uncertainties involved, the more likely range was that N ≈ L, hence there are between 1,000 and 100,000,000 intelligent civilisations in the Milky Way with whom communication should be possible.\r\n\r\n>_We're searching for intelligent life-forms that have also evolved conscious self-awareness. We're searching for conscious, intelligent life-forms that have both the available resources and the need to manipulate raw materials into tools. We're searching for intelligent, conscious, tool-making beings that have developed a language we're capable of understanding. We're searching for intelligent conscious, tool-making, communicative beings that live in social groups (so they can reap the benefits of civilization) and that develop the tools of science and mathematics._\r\n\r\n>_We're searching for ourselves..._\r\n\r\n- Stephen Webb; _If the Universe Is Teeming with Aliens … Where Is Everybody?: Fifty Solutions to the Fermi Paradox and the Problem of Extraterrestrial Life_ (2002)\r\n\r\nA short while ago, Pella Kågerman and Hugo Lilja's mesmerising _Aniara_ (2018) pondered the insignificance of mankind when considered against the infinity of space and time. An esoteric science-fiction film in the tradition of Stanley Kubrick's _2001: A Space Odyssey_ (1968) and Andrei Tarkovsky's _Solyaris_ (1972), it attempted, amongst other things, to convey the sense of near-inconceivable vastness that must be attendant to any self-respecting pseudo-realist discussion of the universe, and to convey the psychological ramifications of what it must feel like to be lost in such a vastness. This is the lineage into which _Ad Astra_ wishes to step, but for me, it has more in common with Danny Boyle's excellent _Sunshine_ (2007) and Christoper Nolan's enjoyable but flawed _Interstellar_ (2014); irrespective of its themes and tropes, it remains fundamentally a mainstream Hollywood movie. And whilst such a status can certainly hold advantages for a filmmaker (primarily in terms of budget and casting), so too are there major pitfalls in having to toe the line of commerciality and cater to demands for crowd-pleasing material, demands which often don't jibe with esoteric content. In the case of _Sunshine_, this took the form of a relatively sudden genre shift into horror that Boyle doesn't fully pull off, and in the case of _Interstellar_, it's an unnecessary third-act twist that's (paradoxically) as predictable as it is nonsensical. And so we have _Ad Astra_, where it's in the form of an overly convenient resolution and some of the most ludicrous narrative diversions I've seen since the sojourn to Canto Bight in the Rian Johnson abomination that was _Star Wars: The Last Jedi_ (2017), diversions which seem to belong in a different film entirely, so tonally unrelated are they to the more existential material surrounding them (space pirates! enraged simians! knife-fight/shoot-out!). Which is not to say, for one second, that I disliked the film – I didn't; even if the narrative never manages to get beyond the \"_Heart of Darkness_ in space\" template and the script relies far, far too heavily on a sub-Terrence Malick voiceover. The craft on display is exceptional and the story is thought-provoking and generally entertaining, with a terrific central performance, and some spectacular visuals (especially in the IMAX format). But it all could have been so much better.\r\n\r\nSet at an unspecified point in the near future (an opening legend informs us, rather generically, that it's \"_a time of hope and conflict_\"), space travel has become routine, with the moon not unlike any major city on Earth, although there are territorial disputes and marauding pirates are a constant threat. Mars too has been colonised, although it's not yet open to the public. As the film begins, we meet SpaceCom's Maj. Roy McBride (Brad Pitt), who is working on repairs to the International Space Antenna – a massive communications array that juts miles into the sky from the surface of the Earth. When a huge explosion causes him to fall from the antenna, he remains unnaturally calm as he plummets to Earth, and is able to land relatively unscathed. In a debriefing, he's told the explosion was just one result of a series of energy surges that originated near Neptune and which have left much of Earth and the moon without power. 29 years previously, Roy's father, H. Clifford McBride (Tommy Lee Jones), left Earth as the leader of the Lima Project, a mission aimed at establishing contact with whatever alien civilisations may be elsewhere in the galaxy. Needing to get far enough from the Sun's solar interference to send out adequate communications, the Lima team travelled to the same region near Neptune from which the surges are now emanating. However, 16 years into the mission, all contact was lost. SpaceCom presumed the crew dead, but now they fear that Clifford may be behind the surges, and with an antimatter power core at his disposal, if he has become unhinged, he could create a chain reaction that would eradicate all life in the galaxy (it's best not to dwell too much on the script's fundamental misrepresentation of how matter and antimatter interact). However, all attempts at communication have failed, and so Roy's highly classified mission is simple – travel to a secure long-range communications base on Mars and record a (prewritten) message for Clifford in the hopes he might respond. And, of course, it's no spoiler to say that the mission doesn't exactly go smoothly.\r\n\r\n_Ad Astra_, which is written by James Gray and Ethan Gross, and directed by Gray (_The Yards_; _We Own the Night_; _The Immigrant_; _The Lost City of Z_), wastes no time in tying us rigidly to Roy's perspective; it opens with a POV shot from inside his helmet, and the first words we hear are him speaking in voiceover. This sets up the narrative to come, as Roy remains the sole focaliser throughout – we see and hear what he sees and hears, we know what he knows, we learn things as he learns then, and we never experience anything with which he is not directly involved. Such rigid focalisation can lend itself to some very subtle moments. For example, as Roy thinks back to a time before his marriage broke up, there is a shot of him sitting on a bed in a darkened room. Barely visible behind him, lying down, is his then-wife Eve (a thankless and largely wordless performance by a blink-and-you-miss-her Liv Tyler). As the camera moves in on him, Eve fades out of the image – she disappears without him noticing, which sounds like it should be horribly on the nose, but because it's dark, because she was out of focus to begin with, and because by the time she disappears, Roy has come to occupy almost the entire frame, it makes the moment easy to miss, and rather poignant – he quite literally doesn't notice his wife phasing herself out of his life because of his obsession with his career (his focus on work is something he shares with Percy Fawcett (Charlie Hunnam) in Gray's masterpiece, the criminally overlooked _Lost City of Z_, although to be fair to Fawcett, Roy's single-mindedness at the expense of all else makes Fawcett look like husband-of-the-year material).\r\n\r\nThe fact that the film is set amongst the stars, but remains always tied to Roy's perception allows Gray to fashion a narrative that's both massive in scope yet emotionally intimate (in this sense, he one-ups Kubrick, whose _2001_ has all the grandeur and awe imaginable but is relatively detached from and uninterested in its characters' psychologies). Gray is aided immensely in this by cinematographer Hoyte van Hoytema (_The Fighter_; _Her_; _Interstellar_; _Dunkirk_), arguably the finest currently active DoP not named Emmanuel Lubezki. Shot on 35mm film, van Hoytema's gorgeous photography effortlessly captures the overwhelming scale of the milieu, but also frequently shoots Pitt in tight close-ups that afford the actor little room to hide his emotions (which become more and more externalised as the film progresses).\r\n\r\nSpeaking of emotions, depending on your perspective, Pitt's portrayal of Roy is either one of the film's most laudable aspects or one of its most alienating. Initially played as emotionally closed off, if not necessarily shut down (he tells us in VO, \"_I've been trained to compartmentalise my emotions_\"), he's depicted as cold and distant. This stoicism, however, slowly starts to erode as his mission begins to go wrong, although there are a few early hints that all is not well - his fixation on the breakup of his marriage, for example, or his observation of the crew of the _Cepheus_ (which takes him from the moon to Mars), \"_they seem at ease with themselves. What must that be like?_\". His emotional state becomes more and more tempestuous as we move closer to the finale, until, rather suddenly (and rather unrealistically), he manages to steady himself in time for the _dénouement_. Pitt's performance is such that one viewer might praise it for shunning emotional grandstanding even as another might criticise it as too taciturn. Personally, I'm very much in the former camp; I think it's a terrifically modulated and minimalist performance in which Pitt uses the lack of outward emotion to inform the character's emotional beats. For example, Roy doesn't have a huge amount of dialogue (aside from that accursed VO) and for long stretches, he doesn't even have anyone to act against, so Pitt has to rely to a large extent on subtlety and nuanced gesture to convey emotion, which he does exceptionally well. Having said that, however, I can certainly understand why some might find the performance too cold – Roy is definitely not your typical Hollywood protagonist, and the problem is that if you're not impressed by Pitt, I'd imagine it must be very difficult to get into the film at all as he's in literally every scene.\r\n\r\nThematically, on the most basic of levels, _Ad Astra_ is the story of two men obsessed with their profession to the detriment of all else - a theme brought to perfection in the work of Michael Mann. Such a theme is not unusual in Gray's films, receiving its most thorough exploration in Percy Fawcett and Henry Costin (Robert Pattinson) in _The Lost City of Z_. Additionally, like most of Gray's films, _Ad Astra_ is heavily androcentric, with neither Liv Tyler nor Ruth Negga (as the administer of the SpaceCom base on Mars) given much to do. In this sense, it's a study of masculinity, much as were its most obvious narrative influences – Joseph Conrad's _Heart of Darkness_ (1899) and Francis Ford Coppola's Conrad-adaptation, _Apocalypse Now_ (1979). In the reformulation of the narrative template, Roy is Charles Marlow (Cpt. Benjamin L. Willard in the film), whilst Clifford is Kurtz. In the original, Marlow, a merchant seaman, must locate revered ivory trader Kurtz, who has established himself as a demigod at a trading post on the Congo River. In the film, set at the tail-end of the Vietnam War, US Army captain Willard (Martin Sheen) must travel from South Vietnam into Cambodia to track down Col. Walter E. Kurtz (Marlon Brando), a once-legendary but now renegade Army Special Forces officer who, in all probability, has gone insane. The narrative parallels are obvious enough – a conflicted man sent to find a brilliant and pioneering man who has gone off-grid and who must be stopped, with the journey proving to be as much about travelling into the self as reaching a specific geographical destination. All three narratives also feature a roughly similar relationship between the two characters whereby the man searching deeply admires the man for whom he is searching.\r\n\r\nOf course, _Ad Astra_ is also an esoteric science fiction film that looks at issues such as humanity's place in the galaxy and the search for intelligent life. An especially interesting theme that comes up when Roy is on the moon is commercialism and humanity's tendency to taint anything we touch. The commercialism of space travel is introduced when Roy takes a Virgin America shuttle to the moon, whilst an exterior wide shot of a lunar tourist base shows signs for, amongst others, Applebee's, DHL, and Subway. And since the moon is now so like Earth, thus it has become blighted by many of the same issues as Earth; crime, political division, materialism - the grandeur of space travel infected with the mundanities of Earth. This point is driven home by the references to territorial disputes and the problem of marauders, which is significant enough for Roy to need a military escort from the base to the _Cepheus_. And if all this wasn't enough to get the point across, in VO, we hear Roy lament how sickened Clifford would be with what the moon has become, pointing out it's now simply a \"_re-creation of what we're running from on Earth. We're world eaters_\". All of which helps create the impression of a future that's reasonably familiar and relatively plausible, given current technologies. Indeed, the lived-in nature of the film's environment is superbly realised by production designer Kevin Thompson (_Birth_; _The Adjustment Bureau_; _Okja_), whose discoloured sets and gritty textures are as far from the more glossy end of science fiction as you could imagine.\r\n\r\nHowever, for all these positives, some significant problems detract from the whole. For me, there were three main flaws; 1) a poorly written and hugely distracting voiceover upon which Gray relies far too heavily, 2) three ludicrous action scenes that accomplish nothing and which feel like they're from another movie entirely, and 3) an anti-climactic and overly neat dénouement.\r\n\r\nTo look first at those three scenes, although they all occur in the first half of the film (with two in the first act), to describe them in any detail would constitute a spoiler, so I'll just give a very basic overview – the first is a chase scene involving moon buggies, the second is something more suited to Paul W.S. Anderson's hugely underrated _Event Horizon_ (1997), and the third is a shoot-out/knife fight, which is the most narratively justified of the three, but still a ridiculously over-the-top scene for a film of this nature. Imagine if in _2001_, instead of attempting to outwit HAL 9000, Dave Bowman (Keir Dullea) had pulled out a shotgun and engaged in a running battle with androids controlled by the AI. Ridiculous? Of course. The three scenes in _Ad Astra_ are only slightly less so. The third at least does have a narrative point insofar as it serves as the springboard for the entire second half of the movie, but it's still a monumentally silly way for Gray and Gross to advance the plot when there were far more organic ways to do so. The first two scenes, however, serve no such purpose – remove them from the film, and you'd have to change virtually nothing in the surrounding material - they're that disconnected and irrelevant, right out of the Rian Johnson school of narrative construction. They lead nowhere, reveal nothing about the character or his psychology, and have no connection to the esoteric themes found elsewhere. You know the French plantation scene in _Apocalypse Now Redux_? They make that scene look pivotal. I really can't over-emphasise how much they pulled me out of the film and detracted from the excellent work elsewhere.\r\n\r\nAs for the other two issues (the VO and the ending), obviously, I can't say much of anything about the finale without spoilers, so all I'll say is that I'm led to believe the ending as it exists now was a reshoot after test audiences responded poorly to the original (and far superior) ending – look it up online; the originally scripted ending made a lot more sense and was as thematically fascinating as it was existentially audacious (sheesh, test audiences, am I right?). \r\n\r\nIn terms of the VO, good lord, it's bad. I can count on one hand the number of times VO has been done well in film – there's the hard-boiled noir films of the 40s and 50s, the Michael Herr-written narration of _Apocalypse Now_, the work of Terrence Malick, Andrew Dominick's _The Assassination of Jesse James by the Coward Robert Ford_ (2007), and...well, that's about it really. The VO is obviously intended to function in much the same way as Willard's in _Apocalypse Now_, providing some factual info, but also probing the soul of the character. However, the problem is that most of the time, the voice is describing something we can see plain as day on the screen. Pitt's performance is strong enough that the VO is unnecessary. You know the way the best films show rather than tell and the worst tell rather than show? _Ad Astra_ does both, and it's hugely distracting – you think \"_I don't know why he saved my life_\" ruins the end of the original version of Ridley Scott's _Blade Runner_ (1982)? I lost count of the number of times Roy's derivative interior monologue undermined the power of the moment. By the half-way stage of the film, I was sick of his cod-philosophical ramblings that aspire to portentousness, but end up coming across as someone trying and failing to imitate Malick.\r\n\r\nWith all that said, however, it's a testament to the story the film tells that despite these significant hurdles, I still enjoyed it. Pitt's performance is excellent, and Gray, who has yet to make a bad film, is his accomplished self. The storyline is interesting, and what it says about man's place in the universe, particularly whether or not we're alone, is unexpected and fascinating. The original ending was infinitely superior, the VO is a huge misstep, and the action detours are ludicrous, but this is still an entertaining movie. It's not a patch on _Lost City of Z_, but the manner in which Gray juxtaposes an intimate tone with such massive themes is really impressive. In essence, _Ad Astra_ is a fable about the importance of transient human connection, played out against the backdrop of the infinite, and despite some not insignificant problems, it's well worth checking out.", "created_at": "2019-10-09T15:51:33.108Z"}, {"movie_id": 419704, "review_id": "5e083f7aeda4b700142e147f", "rating": 5.0, "review_text": "I like quiet moments in big action/sci-fi type movies. The family sitdown at Avengers Tower in _Age of Ultron_ is probably the best part of that movie. The contemplative moments of John Wick are what make that character who he is. What is a little more odd, however, is when a quiet, reflective drama, is broken up by moments of big action/sci-fi type sequences. _Ad Astra_ is certainly the latter. The majority of _Ad Astra's_ runtime is taken up by Brad Pitt narrating environmental cosmic shots, or having quiet conversations about his father, or his mood. Then suddenly! Space pirates! It's unusual, and I don't know that it really works. _Ad Astra_ is something different, and if that's all you're looking for, by all means, give it a chance, but I don't know if I'd personally call it very good. \r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-12-29T05:54:02.278Z"}, {"movie_id": 419704, "review_id": "5e206465b3316b0013032124", "rating": 8.0, "review_text": "Ad Astra galactically depicts sorrow, proving that no one can hear you cry in space. For the past few years, dramas set in the expansive dangers of space have been my bread and butter. Devouring them during my annual breakfast as I purposefully starve myself for the taste of space traversal. Every year, the likes 'Arrival', 'Blade Runner 2049', 'First Man', 'Interstellar' and my all-time favourite film 'Gravity', have secured scores ranging from outstanding to perfect. Whilst Ad Astra may be tilting towards the former adjective, it's still irrefutably one of the best films of the year thanks to Gray's understanding, yet again, of what makes a character study captivating. After unearthing the possibility that his missing father may still be alive, his astronaut son travels across the Solar System in search for him and to unravel a mysterious power surge phenomenon that threatens humanity's survival.\r\n\r\nImmediately, one thing I need to brush off my chest is the horrendous marketing. This is not a sci-fi blockbuster. There is limited \"action\". And if you're wanting the next 'Star Wars' or 'Avatar', then remove yourself from the cinema and watch mind-numbing nonsense like 'Angel Has Fallen' instead. This is a James Gray extravaganza. A meticulously woven character study, harnessing melancholia to challenge an existential crisis. Thematically, Ad Astra's premise bolsters a plethora of metaphorical imagery that divulges into the empirical purpose of humanity. Majestic planets emitting every prismatic shade available, yet emanating no emotional connectivity. The vacuous expansivity of space, marking humanity's reflection on life as a mere speck of stardust. Worldly hostility reaching the depths of our galaxy, hyperbolising the \"world-eating\" philosophy of our own self-destruction as a species. The obsession to venture forth. Departing love, hate and grief. Welcoming nothingness.\r\n\r\nGray's space-opera is a sorrowful tale, intently focusing on the pressures of a son following in the footsteps of his acclaimed father. A patriarch of inspiration to many. Allowing a tangible tense bond to illuminate the stars with despair and anguish. Pitt's universally nuanced performance brings forward stoic mannerisms that allow McBride to feel these emotions. Minor glitches that break character, such as slamming the wall in frustration, showcase the purity of humanity within him.\r\n\r\nGray encompasses the plot around McBride. The lunar pirate raid, mayday rescue and crew brawl scenes, whilst inserting mainstream tendencies into a contemporary drama, were emblems of McBride's emotions. Fear, rage and desperation respectively. A series of gestures that, again, hark back to humanity's endurance. The mildly engaging supporting cast, ranging from Jones, Sutherland and Negga, acting as stability for McBride. Stepping stones allowing him to find his father, as if fate was dictating his alignment. Narration, shifting between inner thoughts to exposition, was overused and irked me with its basic functionality. Hoytema's cinematography could've elicited these unnecessary lines of dialogue from his beautiful imagery. And beautiful just doesn't do it justice.\r\n\r\nImmediately, from the iridescent opening shot, Hoytema takes hold. Utilising colours and shadows to produce the incarnation of life, what it means to see. The blue of Neptune, the red of Mars. Clashing tonalities resembling McBride's emotions. Accompanied by Richter's euphoric score and the almost '2001' production design, and Ad Astra is technically a masterful piece of art. Gray's conclusion is teetering on the edge of underwhelming, for me atleast, with its rushed journey home that dissipated the simmering sorrow built exquisitely beforehand. The ending I personally would've desired, would be the ending no one wanted (but that's life I guess...).\r\n\r\nRegardless, the small criticisms here and there are subject to change upon an inevitable rewatch. Gray is fast becoming one of my favourite directors. He is a man who understands character. He acknowledges the obsession of man. Amalgamating life's wondrously challenging hurdles into singular expressive characters. Ad Astra's meditative and resonant pacing, whilst is sure to put many viewers off, ensures that loss and grief are captured wherever a soul may be. At home or in deep space. It never vanishes.", "created_at": "2020-01-16T13:25:57.512Z"}, {"movie_id": 419704, "review_id": "5e2371a0cf4b8b0014f44796", "rating": null, "review_text": "* Meh.", "created_at": "2020-01-18T20:59:12.276Z"}, {"movie_id": 419704, "review_id": "5e2f26a0fd140b00196bf3b0", "rating": 8.0, "review_text": "“Work hard, play later.”\r\n\r\nOnce a year ever since ‘Gravity’ was released, we seem to get new stories about the voyage of space where certain characters “do not go gentle into that good night.”\r\n\r\nI wasn’t wowed over the trailers for Ad Astra, because when you work at a cinema and spent most of your day watching trailers, well trust me when I say this didn’t stand out from the rest. I originally thought it was about saving the world or something like that. For what it didn’t advertise was a slow burn sci-fi movie that’s on the same level as ‘Blade Runner 2049’ and the emotional side as ‘First Man’. A personal story told through a first person narrative about unresolved issues from past relationship.\r\n\r\nBasically an art house movie with a huge budget.\r\n\r\n‘Ad Astra’ was pretty good. After only seeing it once, I feel that this will grow on me overtime and so far it has. A mixture of both ‘2001: A Space Odyssey’ and Terrence Malick movies. While not as great as those two comparisons, but while watching I couldn’t help to be reminded of those two.\r\n\r\nThere's some beautiful and impressive shots through out the movie, especially when the movie constantly shows you the entire scale of space and planets through the characters journey. The colors adds to environment that oozes with style and has a tranquil feel to it. I think that’s where the Blade Runner vibes really come in. Brilliant cinematography by Hoyte Van Hoytema.\r\n\r\nBrad Pitt was terrific as the silent astronaut with tangled mood swings. It’s not an explosive performance, just simple enough for it to be effective. Any other actor would’ve gone big for no other reasons than being overly dramatic and it makes sense for his character to be closed off; similar to Ryan Gosling in ‘First Man’, where his emotional health comes last. You learn very little about his character, as most of his backstory is only in the background for you to piece together the puzzle.\r\n\r\nThe score was mystical and often eerie at times which helped ties in with the unknown aspects of space. The visual effects are excellent and nearly photo realistic at times - something you come to expect by now with space movies.\r\n\r\nI wasn’t too sure about the narration at first, because it was very off putting and a cheap way for the character to express himself. However it sorta grew on me after awhile and some of it was almost rambling with Roy questioning every decision he made.\r\n\r\nNow for the issues:\r\n\r\nI have no idea why Liv Tyler was in this movie, because she literally does nothing and could have easily been cut out. It felt like a re shoot for some reason.\r\n\r\nRemember when I said the visual effects are photo realistic ‘at times’, but that isn’t always the case with certain scenes. There’s a deranged chimpanzee that pops up and it looks really phoney. I think that entire scene could been cut out. I’ve brought up twice about cutting scenes, because I believe if this movie went back to the editing room one more time, then my score would be a lot higher.\r\n\r\nThere’s a ridiculously and almost laughable scene where Roy (Brad Pitt) steaks into a spaceship that he’s not suppose to be on, and all the astronauts on board go into a frenzy and accidentally start kill themselves while trying to cease Roy. No joke. Roy doesn't even do anything as he never intended to hurt them. It was cheap way of making Roy isolated for the rest of the movie. A few years ago I remember reading a horrifying incident that happened to astronaut Luca Parmitano where he reported water inside of his space suit helmet, and nearly become the first astronaut to drown in space. However, Luca remained calm throughout the whole incident despite the odds of him dying being high, but in the end he survived. So it’s really strange seeing these trained astronauts freaking out because came on board.\r\n\r\nOverall rating: Out of the whole spectacle, I find the meaning of the movie the most striking. The themes of family, love and abandonment plays a major role in the story. The whole idea of “working hard and playing later” comes with a cost, which is the less time we spend with our loved ones and abandoning everything to pursuit something better out there when in reality the best things in life are right here. When you discover nothing there’s no turning back and no finding your way back. I’ve been thinking about it for awhile now after seeing the movie.\r\n\r\nNever underestimate James Gray as a storyteller.", "created_at": "2020-01-27T18:06:24.552Z"}, {"movie_id": 419704, "review_id": "5e6530ec55c92600155f6219", "rating": 5.0, "review_text": "I really did like some moments in this movie. Some of the action was intense. The pacing went from quiet movements focusing on the protagonist internal struggle to intense chaotic external action. This repeated several times throughout the movie. These undulating beats made the movie predictable and unsurprising. \r\n\r\nWhile visually stunning this movie left me feeling disapointed.", "created_at": "2020-03-08T17:52:44.990Z"}, {"movie_id": 419704, "review_id": "5e7d5a796c74b95757cb41fa", "rating": 8.0, "review_text": "“Ad Astra” is one of the most cerebral sci-fi films I’ve ever seen. The original story from writer / director James Gray gives an intimate look at the emotional toll that comes from being just one man lost among the stars in the vastness of space. It’s like a more existential version of Terrence Malik’s “Tree of Life,” but set in the outer reaches of our galaxy.\r\n\r\nRoy McBride (Brad Pitt), an astronaut with nerves of steel, travels to Neptune to find his missing hero astronaut father (Tommy Lee Jones). As part of a top secret mission, Roy begins to unravel a mystery and uncover truths that may threaten the survival of Earth. This may sound like a blockbuster action thriller, but it’s not. Instead, the film is an emotionally complex introspective about a man burdened with the sins of his father.\r\n\r\nPitt gives a stunning, understated performance as a man struggling with the psychological toll of isolation and regret. It’s one of his best to date, and it’s nearly impossible not to have a deep emotional connection as you share his character’s established sadness. The father and son dynamic shapes Roy’s life, and he’s never quite gotten over the abandonment issues he’s felt since he was a child. The scenes where Roy and Cliff finally reunite are brief but come from a heartfelt place of forgiveness that grows with the passage of time. It’s the perfect analysis of our own humanity, as we all continue searching with a blind hope to find our footing in the cosmos.\r\n\r\nThe film relies heavily on voiceover narration from Roy, something I normally hate because it feels like lazy storytelling. That isn’t the case here. It works well and is a very effective method that complements the director’s vision. In fact, everything about this film is a success, from Max Richter‘s haunting original score to the special effects and striking cinematography (by Hoyte Van Hoytema), tight direction, and detailed sound design. Gray achieves what he’s going for when every element of the film works together as a whole, and it all is executed in a stunning fashion.\r\n\r\n“Ad Astra” is highly intelligent and melancholy science fiction that will leave a lasting impression on those who can appreciate its sadness and beauty.", "created_at": "2020-03-27T01:44:25.726Z"}, {"movie_id": 419704, "review_id": "5e8a49aa17792c001371640f", "rating": 5.0, "review_text": "This movie had some decent actors, sadly the story was disappointing and quite slow. This would be a good option for those nights when you just can't fall asleep.", "created_at": "2020-04-05T21:12:10.568Z"}, {"movie_id": 419704, "review_id": "5f3ff7be6a34480036aed974", "rating": 10.0, "review_text": "One of the most emotionally impacting films I've ever seen. With its amazing cinematography and great performances it won me over.", "created_at": "2020-08-21T16:35:10.427Z"}, {"movie_id": 419704, "review_id": "62421b959ba86a0047b16774", "rating": 5.0, "review_text": "It is hard to write anything positive about Ad Astra but I shall try.: it does look great; the visual effects are unique in their brilliance and application, except, perhaps, for Star Trek, Star Wars, Mars, Starship Troopers, Battlestar Gallactica (you name it! ). The film moves along with the pace of a an elephant trudging through fudge (or something of a similar colour) and by about half an hour in, I found myself considering the cardinal sin of the cinema - looking at my phone for messages I knew I hadn't received since sitting down. As ever with these kind of films, I am grateful that their box office viability helps cinemas to stay afloat in times when many prefer to watch on their televisions at home; but aside from this tangential benefit, this has precious little else to offer. I expect Brad Pitt may skirt over this film in his career retrospective autobiography one day... Drivel!", "created_at": "2022-03-28T20:33:25.675Z"}, {"movie_id": 419704, "review_id": "63bf6d7de16e5a00d4029de2", "rating": 1.0, "review_text": "I should have stayed away when I heard some of the interviews about it... but I didn't.\r\n\r\nIf they had dropped the budget and not taken it so seriously, it actually would have been a fun albeit ridiculous space adventure. It really had all the makings for campy Science Fiction fun. The potential was there.\r\n\r\nBut, instead, the film took itself too seriously... so seriously that kind of lost the fun element behind it. And it took itself seriously because of the political message attached to it, and unfortunately it's kind of directed towards the \"everything has to be political all the time\" crowd and they take everything so seriously that nothing can be fun.\r\n\r\nBut the potential was there. It wasn't dark enough to be Sci-Fi Horror ala Alien... and the plot lends itself to campy Sci-Fi adventure, or at least a Sci-Fi adventure... and even there politics are integral to the plot. Science Fiction is a satire of some element of culture, but it's done in a way that is entertaining.\r\n\r\nHad they toned it down a bit, had they not thought they were making Chinatown, it would have been much better.\r\n\r\nInstead what you have is pretentious, heavy handed, and boring.", "created_at": "2023-01-12T02:16:29.850Z"}]