[{"movie_id": 62213, "review_id": "4fb026f6760ee33b55006268", "rating": 8.5, "review_text": "Let's leave it all at the door here. I loved Beetlejuice, Edward Scissorhands, and Batman. Hated Batman Returns, Alice in Wonderland, and Willy Wonka. Could care less about Nightmare before Christmas and Sweeney Todd. Okay, so I'm not a Tim Burton hater. I'm not a huge Tim Burton fan. I think in this situation, I'm as close as you get to the average movie goer. No agenda, no attachments. That being said, this film is terrible. Burton spent so much effort and time worrying about making this film Gothic and off pace, stuffing his favorite actors into the film even though half of their parts were pointless, he forgot he was making a film. It's a simple and fun idea but it feels like ego and \"showiness\" kept them from making the plot even make sense. We get it Tim! You are weird! Don't ruin a good performance by Depp and a fun idea for a film because you have to live up to your own Gothic standards. Grow up. So much talent is wasted on these films having the same look, cast, and feel to them. Take that talent and make something fresh! Stretch yourself just a tad out of that Hot Topic comfort zone will ya? This movie was long, boring, and ruined. All of the funny scenes were in the trailer. By the way.... wasn't this supposed to be the 70's? Other than a shot or two of trees and a hippie van it was just like the set of Sweeney Todd. The whole film felt like London in the 40's. That's bad film making whether your name is Tim Burton or not.", "created_at": "2012-05-13T21:26:14.000Z"}, {"movie_id": 62213, "review_id": "5a92f36fc3a36824fd0238c6", "rating": 7.0, "review_text": "I generally like Tim Burton as well as  Johnny Depp. This movie was no exception. It is a dark (of course with Tim Burton) comedy with some hint of action/thriller in it. I would not really characterize it as a horror movie even though there are a vampire as well as a witch and a werewolf in it. Of course there is the romance stuff but I personally feel that is really more of a background or justification to the plot than anything else.\n\nThis is not a magnificent movie but it’s a good movie. I have never seen the original series so I am not biased by that. It seems that many people that considers this to be a bad movie refers to the original show. I have read several of the critical reviews and I do not agree with most of them.\n\nI found this movie to be a nice, moderately paced, comedy in a vampire/gothic setting. The mood and the wackiness were fairly typical for a Tim Burton production. Johnny Depp was pretty much as can be expected which is a good thing if you like Johnny Depp. \nThe return of Barnabas to his, now rather dysfunctional, family is rather funny. The ease with how Barnabas was duped and trapped again in the second half of the film was a bit annoying but then, he had been asleep for a few centuries.\n\nThe entire family quite enjoyed this movie.", "created_at": "2018-02-25T17:33:35.299Z"}, {"movie_id": 62213, "review_id": "5bde4751c3a3682b2f01a785", "rating": 7.0, "review_text": "***I don’t get all the hate***\r\n\r\nOn coastal Maine, a Vampire named Barnabas Collins (Johnny Depp) is released in 1972 after almost 200 years in captivity and reacquaints himself with his family’s chateau & the nearby fishing village. Michelle Pfeiffer plays the Collins matriarch, Helena Bonham Carter the in-house shrink, Eva Green a conniving witch, Bella Heathcote the reincarnation of Barnabas’ long-lost love and Chloë Grace Moretz a 15 year-old punk.\r\n\r\nDirected by Tim Burton, “Dark Shadows” (2012) isn’t far removed in tone from his “Sleepy Hollow” (1999), which also featured Depp as the protagonist, although I suppose “Shadows” throws in a little more humor. I’ve never seen the TV soap opera Dark Shadows or the subsequent two movies, so I can’t compare this movie to them. All I know is that I liked this rendition quite a bit, just as I liked the inexplicably reviled “The Lone Ranger” (2013).\r\n\r\nThe October/November ambiance (i.e. Halloween-season) is to die for and Depp as Barnabas Collins maintains your interest throughout. He’s obviously a fish-out-of-water in 1972, but acclimates pretty quickly. Eva Green is perfect as the ee-vil witch and Carter is enjoyable as usual. I don’t get the hubbub over Moretz, but she’s a’right (and holds a surprise for the last act). Alice Cooper is featured in a glorified cameo. I should add that the opening credits sequence with “Nights in White Satin” is cinema at its finest.\r\n\r\nThe movie runs 1 hour, 53 minutes and was shot in England (Devon, Buckinghamshire, Kent, Cornwall &  Farnham) and Scotland (Mull, Argyll and Bute) with exteriors of the chateau shot at Trafalgar Castle School, Whitby, Ontario, Canada.\r\n\r\nGRADE: B", "created_at": "2018-11-04T01:11:45.379Z"}, {"movie_id": 62213, "review_id": "5ec3a16c6dea3a001cf8f62e", "rating": 4.0, "review_text": "I'm sorry but I am incapable of buying 50-year-old Johnny Depp as the immortal, youthful, irresistible heir to his father's New World empire. Maybe in a better movie, I would have been too distracted to be bothered by it, but this is Tim Burton's 2012 reboot of _Dark Shadows_, so that was not the case. \r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2020-05-19T09:05:48.119Z"}, {"movie_id": 62213, "review_id": "5fb05747498ef9004081ada9", "rating": 7.0, "review_text": "Really good watch, would watch again, and can recommend.\r\n\r\nDon't get me wrong, this is probably a stranger than good watch, but from concept to story to characters, it has a lot of good to it.  Some of the choices are a bit odd, but they do create their own problem-solution story arcs that make it feel like this was a comic book that was consolidated into a movie.\r\n\r\nWhile Depp's typical weirdness is abundant, each character has their own weirdness about them, and the otherworldly atmosphere of the movie is what makes it.\r\n\r\nEva Green does steals the show whenever she makes an appearance, and her character is a force of power, and it shows.\r\n\r\nThere is something very intriguing about immortal characters locked in battle, and that's what really draws me back to this movie.", "created_at": "2020-11-14T22:16:39.715Z"}]