[{"movie_id": 899112, "review_id": "638704a92e0697023d292c10", "rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/violent-night-spoiler-free-review\r\n\r\n\"Violent Night is one of the biggest surprises of the year, instantly becoming a contemporary Christmas classic! David Harbour expertly embodies a shockingly brutal, savage version of Santa Claus that somehow still delivers lovely messages.\r\n\r\nFighting sequences feature truly violent practical stunts, taking advantage of the R rating to provide unmeasurable amounts of gore. Creative use of Christmas songs will leave audiences crying with laughter.\r\n\r\nA brilliant homage to the seasonal genre classics that should be seen in a packed theater!\"\r\n\r\nRating: A-", "created_at": "2022-11-30T07:22:17.986Z"}, {"movie_id": 899112, "review_id": "638b2ba97d5db50fc7f6992c", "rating": 7.0, "review_text": "\"Santa\" (David Harbour) is getting a bit disillusioned with the whole Christmas thing. He is tired of delivering gifts to modern day children who live in an unappreciative, throw-away, culture and so has taken to the bottle rather. Leaving Bristol one night, he rather drunkenly crash-lands thousands of miles away at the compound of the wealthy and therefore entirely dysfunctional \"LIghtstone\" family. Now here we have group of people ruled over by matriarch \"Gertrude\" (Beverly D'Angelo - who just reminded me of Goldie Hawn) who are dealing with their own issues of separation, avarice, precociousness and, yes, I too was already thinking - same old, same old... Wait, though, it seems that this family are the target of some seriously nasty robbers who are after the $300 million hidden in an impenetrable vault in the cellar. \"Santa\", unwittingly, becomes embroiled in these shenanigans and after being initially desperate to get out of the place, he spots the terrified young \"Trudy\" (Leah Brady) and, well, someone's goose is about to be cooked! It can't resists wallowing a bit in sentiment at times, and the familial discord stuff is all very old hat, but when the action scenes kick in we are offered a sort of \"Home Alone\" (1990) meets \"Thor\" (2011) experience peppered with some genuinely laugh-out-loud moments as, of course, the plot follows it's own, very obvious course. It's violent and gory, but the fact that much of that emanates from this epitome of kindness and avuncularity makes this just a bit different - and quite entertaining - with Harbour carrying it off quite engagingly. It is a bit long, and there are times when you want it to pedal faster, but it's a fun watch that is certainly not for the youngsters!", "created_at": "2022-12-03T10:57:45.312Z"}, {"movie_id": 899112, "review_id": "6393c98ba0f1a2007b37a379", "rating": 7.0, "review_text": "**Violent Night is a savage Christmas action flick with Die Hard vibes and an awesome hardcore Santa hero!**\r\n\r\nViolent Night was precisely what I expected and everything I hoped for - ridiculously delightful dumb fun filled with brutal action and violence! A new Christmas classic! This is a movie best seen with friends that can laugh and recoil at the gruesome kills and outrageous dialogue. Violent Night knows exactly how cheesy it is and embraces all the tropes in a way that is fun and entertaining without being cliche. It adds new twists to classic Santa lore and leaves me wanting to know more with hopes for a prequel! As with any 87North film, the fight sequences are top-notch. This movie isn’t for everyone, but fans of Bullet Train or Nobody will add Violent Night to their yearly holiday film watchlist.", "created_at": "2022-12-09T23:49:31.998Z"}, {"movie_id": 899112, "review_id": "6395cb652cefc2008ca70416", "rating": 7.0, "review_text": "_Violent Night_ overcomes its weak script and familiar concept with enough ooey gooey squelchy violence to appease bloodthirsty horror fans and action junkies alike. It still manages to be a bloody festive blast filled with head squashing Christmas carnage.\r\n\r\n**Full review:** https://boundingintocomics.com/2022/12/09/violent-night-review-santa-delivers-an-ooey-gooey-squelchy-head-squashing/", "created_at": "2022-12-11T12:21:57.493Z"}, {"movie_id": 899112, "review_id": "63a927ffa6a4c100a7ae81ae", "rating": 6.0, "review_text": "It would seem psychotic Santa is coming to town this Xmas. \r\n\r\nPutting aside the woke nonsense and shallow script, Violent Night is a moderately watchable, darkly comedic action flick, that draws inspiration from 80's style  franchise's such as Die Hard and Lethal Weapon. \r\n\r\nIts well paced, predictably violent but lacks a lot of the well crafted personality and charm, of its predecessors. \r\n\r\nIn short, an easy viewing action flick, offering a festive dose of mindless violence, wrapped up in Xmas tinsel.", "created_at": "2022-12-26T04:50:07.734Z"}, {"movie_id": 899112, "review_id": "63b88fc4028f1400a2ea491c", "rating": 7.0, "review_text": "Violent Night was exactly what I was looking for heading into this movie. It is laugh-out-loud funny with spectacular action and brutal gory kills, a perfect blend for a Christmas film!\r\n\r\nWhen David Harbor is on screen this movie works wonderfully. I never knew I needed a David Harbor Santa Claus, but now that we got it, I want to see more. He portrays a charming grumpy Santa wonderfully. His lack of care and worldview had me laughing in so many instances. This performance carried the film and was the only reason I was there.\r\n\r\nUnfortunately, the writers tried to do a little too much with all the secondary characters. There are subplots sprinkled throughout that take away from the action adding unnecessary minutes to this film. This creates an unbalanced pace that jumps from interesting action to boring side character development, really messing with the flow. This film is nearly 2 hours long, and that length is felt at times. If these side plots were to be eliminated and we streamlined the action the film would have been all the better for it.\r\n\r\nAll in all, Violent Night effectively achieves its main goal and provides a brutal Christmas movie that I will be revisiting every season.\r\n\r\nScore: 68% | \r\nVerdict: Good | \r\nTheater Verdict: See It", "created_at": "2023-01-06T21:16:52.869Z"}, {"movie_id": 899112, "review_id": "63bcc59cae6f093cb9df2a99", "rating": 10.0, "review_text": "Yeah I'm going to give this top marks, not because it is really that good, but because it came out in 2022 and was probably the best thing in the theater at the time (which was probably why the other Movie Data Base started deleting positive reviews of it).  \r\n\r\nBut a lot of it is done right, it features an interracial family but doesn't make the race a key part of the story.  In fact, it doesn't even mention it at all.  Instead it follows the story of a little girl and Santa. \r\n\r\nAnd the Santa is a bit weird, there is a lot of things that just don't fit with his character, but that doesn't matter because the story is just so fun that you willingly suspend most of your disbelief.\r\n\r\nIt is violent and does a great job of making the violence both exciting and at times comical.  It drops Easter eggs in some of the best possible ways.  Not all the men are evil and idiotic and not all the women are practically perfect in every way.  They are just written as, well, as unique characters.\r\n\r\nAnd you really have to appreciate it in 2022 when most movies drop characters for checked boxes.  \r\n\r\nIt was probably the only movie that you could go into in 2022 and just be entertained by.  That was the clear intent in making this and that was the end result.\r\n\r\nTwenty years ago it would have been \"Meh\" but in 2022 it is the best thing in theaters.", "created_at": "2023-01-10T01:55:40.918Z"}]