[{"movie_id": 7797, "review_id": "5b2fc9599251416e58005a11", "rating": 6.0, "review_text": "Equal parts fascinating, entertaining, beautiful, inscrutable, contrived and tedious\r\n\r\nRELEASED IN 2007, \"Youth Without Youth\" was Francis Ford Coppola's return to filmmaking after a ten-year absence. The story revolves around a 70 year-old man (Tim Roth) in Romania at the outset of WWII who is struck by lightning and miraculously regains his youth, looking like a 40 year-old man. He acquires amazing powers as well, like psycho-kinesis and the ability to \"read\" a book by \"scanning\" it with his mind. The Nazi's catch wind of his amazing evolution and want to study him to contribute to the “master race” (or whatever). The second half of the film takes place after the war years when the man finds a woman who looks like a young version of his deceased love (Alexandra Maria Lara). Incredibly, she too is struck by lightning with differing results and it aids in his research on the origins of languages.\r\n\r\nThe plot brings to mind two films from the mid-90s that also address people with fascinating powers: \"Powder\" and \"Phenomenon.\" The latter was decent whereas the former shot for greatness and in some ways attained it. \"Youth Without Youth\" is completely different in tone, mostly due to the WWII time-frame, but also because it's less of a wannabe blockbuster and more artsy and nigh unfathomable.\r\n\r\nIt has been said that \"Youth Without Youth\" was an intensely personal project for Coppola. The topic, based on the novel by Mircea Eliade, resonated with him and he was driven to convey it on film. You get the impression that Coppola had discovered the answer to the mysteries of life and wanted to share it with the world.\r\n\r\nThink about it: Coppola is one of the greatest filmmakers of all time and he had a full decade to conceive, prepare, make and release a film. He could've churned out blockbuster drivel like the \"Transformers\" movies (not that there's anything wrong with that, lol), but as a true artist he's beyond caring about creating popular popcorn fare and the \"success\" thereof. It brings to mind Willard's observations about Col. Kurtz (Brando) in Coppola's renowned \"Apocalypse Now\" (1979): \"He could've gone for general, but he went for himself instead.\" Francis could've gone for mindless and lucrative entertainment, but he had something more important in mind.\r\n\r\nSo \"Youth Without Youth\" is a work of art, and certainly interesting and entertaining in some ways, but it requires willingness and effort to handle the 124 minutes runtime. It is a dense film, loaded with depth; it may even hold the secrets to life itself! Beyond that, it features some beautiful cinematography, music and women.\r\n\r\nSpeaking of the women, I found it curious that women are shown to be universally attracted to Dominic, the main character played by Roth. After all, Roth is short and hardly a George Clooney. But then I reflected on it and accepted it. Why? Because women have a sort of sixth sense, typically called \"women's intuition,” where they see or sense things beyond the physical. In other words, Dominic had highly evolved and was, in essence, a superior human being. He may not have been an Adonis, but women instinctively picked up on his evolutionary superiority and drew to him like a magnet.\r\n\r\nAnother plus are the locations, shot in Romania and Bulgaria with establishing shots of the Himalayas and India.\r\n\r\nNeedless to say, this is a difficult film to rate. If you're in the mood for conventional cinematic entertainment \"Youth Without Youth\" won't fill the bill even though there are several entertaining elements (the aforementioned cinematography, music, women and locations); but if you're looking for cinematic art and weighty mind food it's an \"A.\" As such, my balanced rating is...\r\n\r\nGRADE: B-", "created_at": "2018-06-24T16:39:53.445Z"}]