[{"movie_id": 768, "review_id": "543d28d7c3a36815f60019ad", "rating": 7.0, "review_text": "I cannot say that I am an outright fan of old era British crime stories but I do fancy them now and then. This one is a rather dark, grim and gloomy story perfectly suitable as a evening movie at this time of the year when darkness already starts to come quickly and matches the candlelight mood of Victorian London.\r\n\r\nI found this a quite nice movie. Well up to its very end which I have to admit is way too tragic for my taste. The voyage to the end was well worth watching though. The dark scenery is very well done. Beautiful and depressing at the same time. It is yet another Jack the Ripper based story and it is pretty much pure fiction loosely based on the character of Jack the Ripper. It is a good and well implemented story though and it was enjoyable to follow Inspector Abelard unravel to true reason behind the murders.\r\n\r\nAs far as I am concerned the acting was without any major faults and generally of high standard although it is perhaps a bit sad that Johnny Depp again proves that he plays best in roles that portrays a more or less crazy, even insane, character.\r\n\r\nThe movie is not as gory as one perhaps and it certainly would not classify as a horror movie. Most of the violence is hidden from the viewer although there are a couple of scenes which are a wee bit “splattery” but only if you really have a weak stomach for these things and if you do perhaps you should not watch serial killer movies in the first place.\r\n\r\nThe ending took a star or two off this movies rating but otherwise it was surprisingly enjoyable.", "created_at": "2014-10-14T13:44:55.503Z"}, {"movie_id": 768, "review_id": "57b3795cc3a36875d5000d71", "rating": 8.0, "review_text": "I went into this having only seen 'The Book of Eli' by these directors, The Hughes Brothers. I quite liked that film, although I did feel their vivacious stylizations interfered with the telling of the story. Seeing this earlier film of theirs confirmed that suspicion, though it's still a fine film. Though Johnny Depp (the brothers' 5th choice for the lead) does a fine job as the film's protagonist (I haven't read Alan Moore's graphic novel yet, so I can't say how this filmic adaptation compares), it certainly would have been interesting to see how any of their previous choices would have done (in order of their preference): Daniel Day-Lewis, Sean Connery, Jude Law and Brad Pitt (but especially either of the first two). It has a fine supporting cast, is beautiful to look at and is consistently intriguing. I especially liked Heather Graham (I think this is solidly amongst her best work), Ian Holm, Robbie Coltrane and, most significantly, Katlin Cartlidge. Boy, do I ever miss her in films made ever since.", "created_at": "2016-08-16T20:36:44.140Z"}, {"movie_id": 768, "review_id": "5afb314e0e0a263b9300e603", "rating": 7.0, "review_text": "From Alan Moore, the Hughes brothers and Johnny Depp\r\n\r\nRELEASED IN 2001 and directed by the Hughes brothers, \"From Hell\" details the Jack the Ripper slayings in the slummy Whitechapel district of London in autumn, 1888. Johnny Depp plays an opium-addicted detective while Robbie Coltrane appears as his colleague. Heather Graham is on hand as a prostitute that captures the Detective’s interest.\r\n\r\nThe film was based on Alan Moore’s graphic novel of the same name. Moore condemned the change of his \"gruff\" version of Frederick Abberline with an \"absinthe-swilling dandy,” referring to the protagonist played by Depp. In real life, there’s no evidence that Abberline “chased the dragon” or that he had “psychic visions.” Speaking of real life, Moore’s graphic novel was based in large part on the royal conspiracy theory popularized in Stephen Knight's 1976 book “Jack the Ripper: The Final Solution.” This is one of several theories on the identity of the slayer. True or (probably) not, it makes for a good story.\r\n\r\n“From Hell” plays like a Hammer film, but with a blockbuster budget in the modern era. A couple of comparable Hammer flicks are “Frankenstein Must Be Destroyed” (1969) and “Taste the Blood of Dracula” (1970). “From Hell” even shares a minor subplot with the latter (high society ‘gentlemen’ in the Victorian era secretly partaking of taboo hedonistic pleasures). Like Hammer’s Gothic horror catalog, you can expect top hats & black coats, cobblestone streets, alluring women, a ghastly killer (or monster) and lush colors.\r\n\r\nTHE MOVIE RUNS 2 hours, 2 minutes and was shot in Prague, Czech Republic, and England (Boscastle & Goldings).\r\n\r\nGRADE: B", "created_at": "2018-05-15T19:13:18.090Z"}, {"movie_id": 768, "review_id": "6022d4499979d2003de3faa4", "rating": 8.0, "review_text": "Great watch, would watch again, and can recommend.\r\n\r\nIf you're accepting or even intrigued by the case of Jack the Ripper, then this should be a great murder mystery for you.\r\n\r\nJohnny Depp, opinions aside, does confused, drug-addicted, and detective all well.  Heather Graham is able to emote and elevate her role wonderfully, despite it basically being a damsel role.\r\n\r\nAlmost everyone else is old British guy, and it really feels like the complex mystery and drip-fed information investigation is really what makes the movie stand out.\r\n\r\nFortunately, despite the movie still being somewhat gruesome, it's not a complete gore-fest, so there is very little to distract from the investigation aspect of the movie except for a ill-found romantic entanglement.", "created_at": "2021-02-09T18:28:25.478Z"}]