[{"movie_id": 272693, "review_id": "55b13438c3a368300200e7ad", "rating": 7.0, "review_text": "> It's not about a GEEK, but somebody's DUFF.\r\n\r\nYet, another movie about an intelligent high school teen girl who socially unfit among others. After realising her issue, she fights back to regain what she was missing. This type of concept is extremely common, but initiating a fresh idea on where the narration can develop the plots and finishes off high note is the vital for a movie's success. This film had one of that and that is called the DUFF. You can find out what that stands for in its official posters.\r\n\r\nThe movie was above the average. The characters were great, but not the unique ones. Everything was enjoyable, I mean it was not a usual annoying teen movie. Well directed because he got a good screenplay that extracted from the book of the same name. The cast was good, nice performances and so it is official that Bella Thorne classified for those mean girl roles.\r\n\r\nAnyway the main character Bianca was so good. Whitman was too old for the role, but outclassed it. Carefully handled to get under the PG13, and it succeeds. So kids with the matured minds are pretty much allowed to watch it and I don't see any serious offensive to keep them away other than facts the film talks about. Overall a nice watch for sure.\r\n\r\n6.5/10", "created_at": "2015-07-23T18:36:40.483Z"}, {"movie_id": 272693, "review_id": "5ffceb9bc8a5ac003eb1bea5", "rating": 6.0, "review_text": "Good watch, could watch again, and can recommend.\r\n\r\nBeing that Dr. Jeong is the reason I finally watched this, I feel he was under utilized, but I was surprised to see Taylor Lautner and Bella Thorne delightfully playing jerks.\r\n\r\nMae Whitman is an excellent actor and not necessarily known for being a \"looker\", but I never would have thought of her as a DUFF either, but I guess the concept is all relative.  The movie does spend a lot of time making fun of her for being \"unattractive\" though.\r\n\r\nTo be fair, there is a LOT of fun with her being awkward, which isn't the same thing as unattractive.\r\n\r\nThis movie has the same sort of feel to it that \"Juno\", \"Superbad\", and \"Easy A\" have to them, all good high school social dramedies.\r\n\r\nWhile some of the movie feels like sketch writing for \"how to lie your way to victory\", it doesn't disappoint.", "created_at": "2021-01-12T00:21:47.118Z"}]