[{"movie_id": 13053, "review_id": "5f2d75b746e75f0039097cac", "rating": 8.0, "review_text": "Excellent.\r\n\r\n<em>'Bolt'</em> is all a joy to watch. On paper, the premise can look a bit ridiculous, don't get me wrong it is, but the film manages to not only make it entertaining but to also make it both amusing and heartwarming.\r\n\r\nThe opening scenes are superbly done, when the cat (dog?) gets let out the bag, so to speak, it does take a few moments to regain its footing but quickly turns into a lot of fun. It's got a pleasing adventure, heartfelt feelings and comedy to keep it fresh.\r\n\r\nThe cast are very good, too. John Travolta (Bolt) and Miley Cyrus (Penny) do very fine jobs in their respective roles, but it's actually Susie Essman who stands out most to me - she gives a super performance as Mittens. A few of the other voices do solid stuff, also.\r\n\r\nThoroughly enjoyed this.", "created_at": "2020-08-07T15:39:35.460Z"}, {"movie_id": 13053, "review_id": "644fdd49bdd5681be6cbdbab", "rating": 6.0, "review_text": "My daughter wanted this movie. I had it for years before I ever watched it. It was actually a decent movie. I was surprised.", "created_at": "2023-05-01T15:39:53.718Z"}, {"movie_id": 13053, "review_id": "65720d8790fca3014e71e454", "rating": 6.0, "review_text": "This starts off quite entertainingly with \"Penny\" and her super-hero dog \"Bolt\" having to thwart the evil plans of the dastardly \"Dr. Calico\". She's on her glorified scooter and he just on his four paws - but they are not daunted by the overwhelming forces arrayed against them as they try to get to the airport. Well, that's when we realise that this is a television show and there'll be another edition tomorrow. Or will there? \"Mindy\" from the network comes to tell the rather fastidious director that the demographic is a bit bored with formulaic television and so he's going to have to introduce some jeopardy or it's the can for all of them! The subsequent attempt to revamp the brand results in \"Bolt\" thinking his pal really has been kidnapped and ending up in a box full of polystyrene packing many, many miles away in NYC. Can he get back in time to save her from their evil nemesis? Well, en route he meets the street-smart \"Mittens\" and they have quite few adventures as he tries to get home. It's a perfectly watchable family adventure film, but like the television show it's based around, it's entirely derivative and formulaic. Plenty of set-piece action scenes before a conclusion that rather reinforces the unoriginality of it all. It's busy, colourful and the younger amongst us will probably quite enjoy it, but I reckon unless you're a grown up pet lover (dogs especially) you might struggle to remember this.", "created_at": "2023-12-07T18:23:03.419Z"}]