[{"movie_id": 502356, "review_id": "642f2de32588230098248468", "rating": 5.0, "review_text": "_The Super Mario Bros. Movie_ is like Fruit Stripe Gum. It’s super colorful and eyecatching, but it seems to instantly lose its flavor and charm. The film is visually stunning and Jack Black is outstanding as Bowser. The big action sequences are like big budget versions of the Mario video games playthroughs with little welcome surprises thrown in.\r\n\r\nBut the film is massively unfunny, the characters are extremely flat, and the flimsy writing is about as complex as an unkempt mustache.\r\n\r\n**Full review:** https://boundingintocomics.com/2023/04/06/the-super-mario-bros-movie-review-plunging-rainbow-colored-nostalgia-to-death/", "created_at": "2023-04-06T20:38:59.988Z"}, {"movie_id": 502356, "review_id": "6438014c1d538600f40f4d4e", "rating": 6.0, "review_text": "I am not the demographic and to be honest this isn't really a film that I was ever going to like either. The story is beyond simple and the game-based animation - though expertly crafted - did absolutely nothing for me as ninety minutes rolled along devoid of characterisations, thrill or much sense of adventure. I got the feeling this was really an outing for \"Mario\", \"Luigi\" and \"Peach\" designed to satisfy the die-hard fans, or the children - or both, but if you were not in on the game from the start then you are unlikely to have become any more engaged by the end of this fungi-fest. It wouldn't be fair to say this is bland - it's not designed to challenge or take risks: it's fun for those who grew up with \"Mario\" et al in their lives and I'm not going to decry that. It's colourful, pacy, and at times quite well written but perhaps it ought to have a rating that says if you are over 12 then you should be advised against it?", "created_at": "2023-04-13T13:19:08.627Z"}, {"movie_id": 502356, "review_id": "64399d2a7ef3810522626d9c", "rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.firstshowing.net/2023/review-illuminations-super-mario-bros-movie-left-a-me-so-happy/\r\n\r\n\"The Super Mario Bros. Movie delivers everything I wanted. Packed with fantastic references that will warm the hearts of those who lived and still live with Nintendo and Mario up close. Along with energetic action, dazzling animation and world-building, and iconic music – Brian Tyler's score goes straight into my Spotify playlist. Mario and Co. marked my childhood, and, still today, continue to offer me wonderful memories for life. As a viewer clearly belonging to the target audience, I couldn't have left the cinema more joyful. Ya-hoo!\"\r\n\r\nRating: A-", "created_at": "2023-04-14T18:36:26.281Z"}, {"movie_id": 502356, "review_id": "643d9df0773941051bf22997", "rating": 9.0, "review_text": "This and Last of Us are two recent movies-from-games that have really impressed me. Saw this in a theatre in Brooklyn, really couldn't ask for a better place to do so.", "created_at": "2023-04-17T19:28:48.334Z"}, {"movie_id": 502356, "review_id": "6463a5e8e3fa2f0103a28207", "rating": 7.0, "review_text": "The Super Mario Bros. Movie is a fun ride through the iconic world of Mario. The screenplay is admittedly very bare bones, and the characters lack depth, but the film still manages to capture the essence of the beloved video game franchise. The writers do not attempt to do anything beyond create a narrative that intentionally puts our characters in worlds and areas that are instantly recognizable to the audience. This makes the film feel like a Mario game come to life so that audiences can say “that is like Mario Kart or Super Smash Bros.” The movie pacing flies at a breakneck speed, and I felt that this movie could have benefited from a slightly longer runtime to flesh out the story and characters a bit more.\r\n\r\nI was initially nervous about how the voice acting would hold up, but I was pleasantly surprised. Chris Pratt's voice as Mario is not over the top, which works well. It would have been extremely annoying to hear the super Italian Mario accent for a full hour and thirty minutes. Jack Black's portrayal of Bowser steals the show and was the best of the film. Anna Taylor Joy and Seth Rogan were good as Princess Peach and Donkey Kong, although I think Rogan may have injected a bit too much of himself in the character.\r\n\r\nThe direction of the film is solid, with great action set pieces and creative camera angles that make the action feel exciting and dynamic. The animation is stunning, with the characters and world directly designed off the games, but with more polish and details than ever before. The lighting is beautiful, with the bright lights of Rainbow Road and the dark, fiery flames of Bowser standing out as highlights.\r\n\r\nOverall, The Super Mario Bros. Movie may not be the deepest or most complex film, but it is a good time for fans of the Mario franchise. The movie captures the fun and whimsy tone of the games and brings it to life on the big screen. While the comedy may not hit every mark, the voice acting, and direction make up for it. I am excited to see where this film series goes next.\r\n\r\nScore: 72%\r\nVerdict: Good", "created_at": "2023-05-16T15:48:56.525Z"}, {"movie_id": 502356, "review_id": "646bbf8ed1857201802df9c0", "rating": 10.0, "review_text": "SOOOOO FIRE I LOVEEEE MARIO PLEEASE MAKE ANOTHER I LOVE YOU MARIO <3", "created_at": "2023-05-22T19:16:30.951Z"}, {"movie_id": 502356, "review_id": "65196587c50ad200eabe8023", "rating": 6.0, "review_text": "All my three kids used to play Super Mario Bros games and two of them played them a lot when they were younger so this movie was kind of a must-see movie for us.\r\n\r\nFor myself , this felt very much like a movie made for Super Mario Bros fans and less for the general audience.\r\n\r\nThe characters, the completely illogical platform jumping everywhere and the rather childish story are certain to appeal to younger people still playing the game or those that grew up with the Mario Bros games.\r\n\r\nFor me though the movie was ranging from okayish to, sometimes, cringe worthy. Especially the scenes with Bowser starting to sing. Ouch, my ears are still hurting.\r\n\r\nThe best parts of the movie was when they entered the ape kingdom. That was quite fun and so was the car chase on the rainbow road.\r\n\r\nThe rest of the movie was, for me personally, rather forgettable. Not bad just not that good. That said, it is not really a bad movie either. The rotten rating on Woke Tomatoes is entirely undeserved.", "created_at": "2023-10-01T12:26:47.533Z"}, {"movie_id": 502356, "review_id": "65623496a6c10400c409de3e", "rating": 7.0, "review_text": "Probably the best thing about the movie is that it doesn't take itself seriously. There's no attempt to make this an epic movie. It just brings the game's characters to life.\r\nThey do so while keeping the art style in line with what you see in the game. The story of the very simple game is expanded without adding too much like how everything works. The game's story is simple and this one is too. Fear not, there's a lot of room for sequels.\r\n\r\nGo in expecting nothing, otherwise you'll be disappointed. It's a good film to turn off your brain to and just let the light drizzle onto your eyeballs.", "created_at": "2023-11-25T17:53:26.950Z"}, {"movie_id": 502356, "review_id": "6592110d1dcb776b81457166", "rating": 5.0, "review_text": "About as good as a Mario movie can be I suppose. It hits all of the reference points from the game, then shoe horns in some toxic bro dude politics. Overall just found it exhausting after a while. There is this new mode of pleased with itself mentality that so many of these types of movies hit. Its the corporate product as film in particular. They merged the marvel movie franchising with their endless line of whats for sale. Not really sure what the mechanism is yet, but Mario the movie shows off how this well oiled machine is cranking out this mid level trash en mass.", "created_at": "2024-01-01T01:10:37.599Z"}, {"movie_id": 502356, "review_id": "65a33d767d5f4b00ceb7bd36", "rating": 7.0, "review_text": "It's a good!\r\n\r\nMy experience of <em>'Mario'</em> starts and ends with <em>'Mario Kart'</em>, which I haven't actually played since back in the day on my Nintendo DS and even then I had no understanding of the franchise itself; just treated it as a normal racing game. I was an Xbox kid growing up (thanks, ma!), so that be the reason. Anyway, that's a long way of saying I'm no Mario know-it-all.\r\n\r\nDespite all that, I do remember most of the characters from the aforementioned video game and it was cool seeing them come to life in 'The Super Mario Bros. Movie'. Chris Pratt feels an odd cast for Mario but does do a solid job in fairness to him. Jack Black and Charlie Day are very good in their roles as Bowser and Luigi. Keegan-Michael Key, Seth Rogen and Anya Taylor-Joy are also positives as Toad, Donkey King and Princess Peach.\r\n\r\nNo doubt whatsoever that this will be the first film of a crap tonne from this franchise. Still, if they do as well as they did here then they'll be successful, I'm sure. I'd be up for exploring the world via film, tbf.", "created_at": "2024-01-14T01:48:38.720Z"}]