[{"movie_id": 8909, "review_id": "58ac55fec3a36849cc013974", "rating": 8.0, "review_text": "I typically never write a review on a film that I've already seen more than once, because I insist on the review reflecting my first (and strongest) impression of the film. But after watching Wanted for what must be the 5th or 6th time now, I suddenly felt like writing something anyway, so here I go.\r\n\r\nLet me begin by saying, this is one strange film. Strange in the sense that it's literally like a train wreck that you can't keep your eyes off because it's so fascinating to watch. And you almost feel sick with guilt and exhilaration because you're enjoying it so much. Violence never looked so gorgeous before... \r\n\r\nWanted is about a guy named Wesley Gibson, who is such a hopeless, pathetic dweeb that even Google won't return any results when he types in his own name. He is \"rescued\" from his pitiful cubicle existence by a gorgeous woman named Fox, who recruits him into an organisation of assassins known as The Fraternity, supposedly because they believe he is the only person who can kill the man who killed his father. Little does he know just how drastically his life will actually change once he agrees to join them.\r\n\r\nThe casting of the film is spot-on. James McAvoy has already proved himself to be a versatile actor and he is very believable as a weak push-over, who finds confidence in the fact that group of trained assassins apparently believe in his abilities. He also makes his character likable and fun to watch, because he delivers it with a sense of humour and you can actually relate to him because his situation is so understandable. Basically, he's just another slave to the wage, looking for a way to break free. This way is initially offered to him by Angelina Jolie, and who could say no to a woman like that... Ms Jolie plays a role that seems like it could only have been written specifically for her. Who else could play a beautiful and deadly assassin who's charismatic and covered in tattoos? She could and would kill you in a heartbeat, and yet you just want to be near her. Morgan Freeman plays Sloan, the leader of the Fraternity, and, well... I hardly need to elaborate on this one, do I? He makes pretty much every film he's in worth watching, and that's all I need to say.\r\n\r\nNow, I titled this review 'beautiful garbage'. That's not so much because the film itself is garbage, because it's not, but rather because the events portrayed in this film are so brutal and merciless that they could only come from a very dark and rotten place. The 'beautiful' is directed at the visual effects, because everything ranging from camera techniques to production design to action choreography is so beautifully done, so thrillingly eye-popping that it would almost make you forget that you're watching people get slaughtered, beat up and maimed. Tons of blood flow, brains are splattered against the wall and yet you can't take your eyes off that beautifully designed bullet. That awesome tattoo on Angelina Jolie's hand interlacing with the engravings on her gun. Those mind-blowing car chase scenes. That guy jumping through the glass out of a skyscraper just to finish his \"job\"... This film is visual effects executed to perfection, elevating said perfection to a whole new level. \r\n\r\nIt's all so pretty to watch that it would almost make you able to forgive the writers the overpowering lack of realism. Almost. \r\n\r\nThe staggering amount of ideas and actions that are 98% of the time either inconsistent, improbable or flat-out impossible would in any other case surely put any screenwriter out of work. With a film like this, it's literally only the wrapper that makes the candy sweet. It just goes to show that sometimes, making something really, really pretty can make it worth watching, just so long as you're willing to suspend every inch of disbelief for the sake of watching pretty pictures. Nature, science, biology and every other form of technical factuality is being put to the test here, which is not to say it's basically just being thrown out the window... But hey, I can promise you you're going to get to see a guy get in a car the way you've never seen before. And a girl get in a train in a fashion that defies every rule of physics... It's all worth it for a totally cool, put-your-brain-in-stand-by-mode kind of action flick. \r\n\r\nDirector Timur Bekmambetov has obviously tried his darnedest to make his mark in Hollywood with his first English spoken, big-budget effort, and may I say, he could've done a lot worse. Not to mention the fact that he has managed to recruit a few very big names to top the bill, this is definitely a Hollywood debut to be proud of. I can only hope he will continue to work with the same excellent crew in the future, because although only the sound department was nominated for an Oscar, camera and visual effects would have definitely deserved a nod from the Academy too.\r\n\r\nIn a nutshell, Wanted is an 110 minutes of gorgeous, eye-pleasing nonsense with great action and one very beautiful lady... I for one can't wait for the sequel.\r\n_(July 2012)_", "created_at": "2017-02-21T15:00:14.124Z"}, {"movie_id": 8909, "review_id": "5f0c9764eec5b50036d37257", "rating": 9.0, "review_text": "He's the man alright.\r\n\r\nWanted is loosely based on the comic book miniseries of the same name by Mark Millar. It's directed by Timur Bekmambetov and stars James McAvoy, Angelina Jolie, Morgan Freeman, Thomas Kretschmann, Common, Terence Stamp and Konstantin Khabensky. The storyline follows Wesley Gibson (McAvoy), a frustrated and downtrodden office worker who discovers that he is the son of a professional assassin when he is saved by Fox (Jolie) from being assassinated himself in a supermarket. Initially he is baffled and out of his depth, but upon meeting the secret \"Fraternity\" headed by Sloan (Freeman), Gibson starts to undergo training to fulfil his destiny as a \"Fraternity\" hit-man.\r\n\r\nOne of the better things about popcorn action movies is when there is a geek coming good and kicking ass. Be it super-heroes or average Joe's finding something extra, having the rise of the meek get tough at its core is normally a winner. So it is with Wanted, the US directorial debut of Night/Day Watch helmer, Timur Bekmambetov. It's not so much that McAvoy's anxiety riddled office worker gets to play guns, sports cars and hang with a lithe Angelina Jolie - it's that he, courtesy of a good source, gets to not care about the killing. The film may not be as dark as the source material, but the essence of it is there with corruption and violence at the core. The story, as bonkers as it is, is simplified into one that features ancient weavers receiving messages depicting targets to be wiped from the planet for the greater good of humanity. Enter the \"Fraternity\" in modern times, which in the name of good, goes out slotting said targets. Oh but it's not just a case of line someone up in a telescope and pull the trigger, this is more fun than that.\r\n\r\nFor action movies in this decade, Wanted has few peers. From the intense and brutal training regime that Gibson undertakes, to the number of explosive and inventive sequences that flit in and out of the piece, it delivers pulse raising cinema. There's outrageous car pursuits, car jumps with whirls and crash bangs, speeding trains resplendent with stunts, a train crash sequence that's as good as anything in popcorn world, and then there's the bullets. Curving bullets that either smack into each other or do untold damage to the forehead of some unknowing target. That the makers are not aiming for the PG-13 market is an obvious bonus, for it allows them to fully payoff on the fights and blood letting. Even those that come with funny and inventive gimmicks. Bekmambetov is having fun, the nature of the beast is a haven for his fast-cutting and slow-mo dalliances, while the noise that thunders out of the speakers pulls one further into the action.\r\n\r\nMcAvoy steps up to the action plate with great success, at times charming yet pathetic, at others totally scary, he revels in the chance to carry a movie of such adrenalin fuelled excess. Jolie too comes out with much credit, the role of Fox giving her the chance to shine, unlike Lara Croft, as a charismatic action girl. While Freeman does what Freeman does well, be straight and oddly classy. Not since John Woo's action berserker Face-Off 11 years previously has the action genre been this much fun and exciting. The pace may not be perfect, and some scenes will be just too ridiculous for some demanding critics (they of course realise the tongue in cheek/nudge in the ribs that's going on?), but regardless, Wanted has taken the action genre to another level. Lets hope it's not 11 years till we have to wait for the next bar raiser. 9/10", "created_at": "2020-07-13T17:18:28.105Z"}]