[{"movie_id": 273248, "review_id": "568847f09251414ecb015a7e", "rating": 8.0, "review_text": "The Hateful Eight is an epic film. Epic the way Ben-Hur was epic. It’s filmed on rare Ultra Panavision 70. The film crew altered Modern cameras to work with UP70. Quentin Tarantino knew there were two types of film viewers. Those who would see his film as he intended and those who would not. Tarantino isn’t an idiot and knows people will pirate his and watch it on devices he can’t control [Note 1]. To combat this Tarantino made a version of the film which requires viewing in a theatre. He did this with the 70mm roadshow production of The Hateful Eight.\r\n\r\nThe roadshow production of The Hateful Eight is a great experience. I was born in 1981, after roadshow theatrical releases fell out of popularity so I’ve never experience a roadshow theatrical release. Roadshow theatrical releases were (or are) a limited engagement showing of a movie before general release. The Hateful Eight’s roadshow includes a beautifully produced souvenir program — already available on Ebay. The lights go out fifteen minutes prior to the film starting and no previews are shown. Roadshows aren’t their to advertise. Their purpose is to wow you with The Hateful Eight in 70mm.\r\n\r\nI was only eleven when Reservoir Dogs was released and thirteen when Pulp Fiction was released. Arguably, a little too young to watch these films. Although I knew what sex was and how it worked, My young mind didn’t know about paraphilia or unusual sexual interests. I don’t think I even had a working idea of how homosexual sex worked. This would have made watching scenes from Pulp Fiction rather difficult for me at that age. [Note 2]\r\nUnlike many, I saw Reservoir Dogs before Pulp Fiction. Although I like the editing style of Pulp Fiction, I think Reservoir Dogs is a better film. What makes Reservoir Dogs great is the lack of financing. Financial constraints didn’t limit Tarantino and Reservoir Dogs is dialogue heavy with very impactful scenes revolving around a single location: The Warehouse.\r\n\r\nThe high-level idea of The Hateful Eight, Quentin Tarantino’s Eighth film, which implies the title is deliberate, is about a bounty hunter escorting a prisoner (the only female in the film) to “hang by the neck until they are dead” in Red Rock. However, a blizzard prevents the prisoner from reaching the final location and the prisoner along with eight others are stuck in a single room: Minnie’s Haberdashery.\r\n\r\nThe Hateful Eight is filmmaking at it’s finest. Like Reservoir Dogs it could have been a theatrical production. It didn’t have to be a movie. If there are special effects they aren’t noticeable. There is violence and blood, which you expect, but comparing to other Quentin Tarantino’s films it’s tame. There is no dancing to a radio tune while Michael Madsen conducts a horrific act. But, the strongest story-telling scene will stick with you. A flashback overlaid with a monologue performed by Samuel L. Jackson that demonstrates the artistic ability of Tarantino. The editing between Major Warren’s narrative and what General Smithers envisions can only be told with film. The scene contrasts the alluring story with the distasteful act. A compliment to the editor who doesn’t pull you out of the monologue, but enhances it.\r\nI’ve only seen, read, or heard a few interviews with Tarantino, but I don’t get the impression he does anything on accident. Tarantino puts too much thought into his ideas and works. When Bret Easton Ellis interviewed Tarantino he stated:\r\n\r\n> My scripts are meant to be read.\r\n> [The Bride] has stashed all this shit in the ground. So, she is going to dig a hole and pull up a footlocker and it will have passports, money, and weapons. All the things she will need for her revenge. But, the way I have it written in the script is she needs to find a rock and turn it over to find an ‘X’ on the rock. She turns over the rock and finds the ‘X’.\r\n> \r\n> If the ‘X’ hadn’t have been there or if she couldn’t have found rock, she would have taken it as a sign that her revenge never should happen and she would have dropped the whole idea.\r\n\r\nThese are things you can’t show on film.\r\n\r\nYou get this same type of feeling when watching The Hateful Eight. It is hard to imagine that Tarantino didn’t have a few one-on-one days with each actor explaining to their character’s fully-developed backstory which isn’t depicted in the film. Only additional viewings will explain each characters motives.\r\n\r\nMany of my college friends who enjoyed Kill Bill Volume One didn’t like Kill Bill Volume Two even though Kill Bill Volume Two is the stronger of the two films. The reason? The dialogue. The dialogue is the best part of The Hateful Eight. Although The Hateful Eight is three hours long you don’t feel it. The film engrosses you with the characters, their conversations, and the conflict between them. The acting is superb.\r\n\r\nMy wife said that this is her favorite Quentin Tarantino film. I don’t know if I disagree and although Reservoir Dogs holds a special place with me, The Hateful Eight is a much more mature film. Tarantino has had 23 years to perfect his craft and it shows. Although I liked Django Unchained, it isn’t as good as The Hateful Eight.\r\n\r\nThe Hateful Eight may be one of the better films I’ve seen in the past few years.\r\n\r\n_Note 1: Mark Z. Danielewski’s House of Leaves is a piece of art as much as a novel. But, there isn’t a digital version. This is deliberate. Danielewski can’t determine a way for readers to digitally consume the book. Contrary to what you expect, this control is more easily achieved with print than film._\r\n\r\n_Note 2: Like all Quentin Tarantino’s movies, The Hateful Eight isn’t for children. Quentin Tarantino is great because of his dedication to his art. Tarantino made a purposeful choice to not have a relationship or children because it would affect his art. I wonder if his decision is partially due to discussions around the dinner table about what Daddy does without showing them. I don’t know if Tarantino has actually thought about the ramifications of raising a child in the dark to his art until a certain age. Maybe he hasn’t. But, If I was in his shoes, I would have internal conflict about not wanting to twist my kid’s minds until they were of age to deal with my creations. But, I am probably projecting._", "created_at": "2016-01-02T21:58:08.485Z"}, {"movie_id": 273248, "review_id": "5699bbd19251412b05000174", "rating": 6.0, "review_text": "The hateful eight is well directed, good photography and has a great OST, with a good melody from Ennio Morricone (although it is just that, not much more) and, as usual, well selected songs by Tarantino.\r\n\r\nThe best of the movie is its cast, with the exception of Michael Madsen which I think is terrible but Tarantino seems to love. As usual, good performance by Samuel L. Jackson and superb ones by Kurt Russel and Jennifer Jason Leigh. Tim Roth makes a great role in a character that seems as if it was made for Chistoph Waltz, though. IMHO, the best performance is from Walton Goggins, though. A usual secondary which has the chance in this movie to be more than just that.\r\n\r\nAll in all, a Tarantino movie with what you would expect from one of his movies.\r\n\r\nBut ... the problem is precisely that there is everything to be expected, but nothing else. The typical long and witty dialogues. The typical stories and anecdotes distracting the viewer attention from the important happenings ongoing, but just that. Hence, this movie stays half way to be a really good movie and it remains just a enjoyable movie, without much more expectations.", "created_at": "2016-01-16T03:41:05.588Z"}, {"movie_id": 273248, "review_id": "56f3ee2dc3a3682fdb00289c", "rating": 8.0, "review_text": "> ...And then there were none.\r\n\r\nI'm neither Tarantino nor Nolan's fan, but love watching their movies. As usual these director's films are highly expected by all, that's including me. This one started off quite like a normal western, so I thought it wouldn't be like the director's previous film 'Django Unchained'. In fact, it was considered for a sequel to that, but the director felt this story and the previous character Django failed to blend, hence 'The Hateful Eight' was born with Samuel L. Jackson playing an important role.\r\n\r\nSolid eight from me for this QT's eighth film. But I felt the movie was kind of inspired by 'And Then There Were None'. It was not about to find who's the killer or next to be killed. The character introductions were at its best and an excellent twist in the middle. This sets in a cabin with eight strangers struck there after the snowstorm. But after an unexpected event the suspicious started to mount and brings chaos. Then takes us to the flashback to reveal something the story that did not mention in the earlier part which's very essential for coming back to the finale.\r\n\r\nThe 80% of the movie was just talking, but the remaining stunt sequences were so powerful. All the eight, plus, supporting character were exceptional, but the director's favourite Samuel L. Jackson nailed it as his character is a bit above from the rest. The entire film was shot is a couple of locations, but the major portion takes place in a cabin and it was a limited cast movie. These days, western movies are shrinking, only a very-very few good movies are made every year. In the time of superheroes, a movie like this is really very precious, so definitely recommend it.\r\n\r\n8/10", "created_at": "2016-03-24T13:39:57.313Z"}, {"movie_id": 273248, "review_id": "5738fcc6c3a3686e21000538", "rating": 9.0, "review_text": "Marmite at Minnie's Haberdashery. \r\n\r\nQuentin Tarantino writes and directs and it stars Samuel L. Jackson, Kurt Russell, Jennifer Jason Lee, Walton Goggins, Tim Roth, Micahel Madsen, Demian Bichir and Bruce Dern. Music is scored by Ennio Morricone and cinematography by Robert Richardson. \r\n\r\nWyoming, wintertime, and an assortment of suspect characters are holed up at Minnie's Haberdashery while a blizzard rages outside. Soon enough suspicions and ugly human traits come to the fore... \r\n\r\nTarrantino is on a Western/Southern/Oater/Civil War kick these days, here following on from Django Unchained, this is set just post the Civil War. Proudly homaging genres he loves, he throws all his trademarks at The Hateful Eight for glorious results - that is on proviso you happen to be a fan of his in the first place. \r\n\r\nPicture is split into two halves. First half sets up the characters who come to be at Minnie's, the conversations are pungent with Tarrantino's caustic and comedic writing, the characterisations equally so, whilst we have been treated to some absolutely gorgeous Colorado vistas. There's a constant sense of mistrust in the air, while racism, misogyny and political fall outs pulse away in set up scenarios. \r\n\r\nThen it's the second half, where after a wee bit of narration that had me thinking my Blu-ray player had somehow started playing The Assassination of Jesse James by the Coward Robert Ford, hell then comes to Minnie's! It quickly becomes evident we have been part of a Tarrantino parlour game, a game of Clue - cum - Ten Little Indians, only in a Wild West setting, and with blood, bones and bile in full effect. \r\n\r\nThe whole thing is wonderfully stylish in the way that Tarrantino is known for. The cartoonish horror mingles with more biting observations on humanity, the violence shocks to get a reaction from the viewer, for better or worse, and always there is humour, where Hateful Eight proves itself to be one damn funny film. \r\n\r\nMorricone scores it as cartoon horror with Western strains, and it's magnificent, it sounds like the evil twin to his score for The Untouchables. The cast are super (though a couple of them are not given much to do), with Leigh standing out, and Messrs Jackson and Russell hold glorious excessive court. Costuming is most appealing, as is the set-design for Minnie's. And director QT? Well he does his thing, chapters and verse and playful filmic cunning. 9/10", "created_at": "2016-05-15T22:48:38.895Z"}, {"movie_id": 273248, "review_id": "58b4c7fec3a3685ef7002ab2", "rating": 7.0, "review_text": "The Hateful Eight is Quentin Tarantino's eight film. Inspired by John Carpenter's movie, The Thing. We even have Kurt Russell mentioning going without sleep. However despite all the talking and there is a lot of chatter between some hateful people, it is an Agatha Christie style thriller.\r\n\r\nIn a snowbound post civil war wild west, Kurt Russell is bounty hunter John Ruth better known as the Hangman. He brings his bounty back alive so they can hang.\r\n\r\nRuth is taking back Daisy Domergue (Jennifer Jason Leigh) a female captive with a big reward on her. He meets Major Warren (Samuel L Jackson) another bounty hunter and they decide to ride together to town and meet the new Sheriff who is due to show up.\r\n\r\nA blizzard means they have to stop at an inn. Holed up in the inn is Bruce Dern's confederate General Smithers, a bitter racist trying to find out the fate of his son.\r\n\r\nAlso there is Tim Roth's Mobray on his way to the same town as the Sheriff to be their new hangman. There are several other people hanging around the inn. Ruth is convinced that someone is not what he claims to be and is nervous.\r\n\r\nThe film has a lot of talk with suspicious, shifty people rubbing everyone up the wrong way. Tarantino wants the viewer to get complacent and then suddenly bang! He then shows you his hand.\r\n\r\nThe Hateful Eight is a twisted film with Tarantino's dark humour, mean characters and violence. However it is overlong and a mystery that might be too slow before it gets going.", "created_at": "2017-02-28T00:44:46.769Z"}, {"movie_id": 273248, "review_id": "5b4e390bc3a36823de06552f", "rating": 7.0, "review_text": "***Creative Western whodunit is an amusing black comedy, but also profane and repugnant***\r\n\r\nRELEASED IN 2015 and directed by Quentin Tarantino, \"The Hateful Eight\" is a Western about a cruel bounty hunter (Kurt Russell) taking an outlaw woman (Jennifer Jason Leigh) in to Red Rock, Wyoming, to hang. Along with a black bounty hunter (Samuel L. Jackson) and the new Sheriff of Red Rock (Walton Goggins), they hold up at a rural haberdashery during a blizzard with several dubious characters (Tim Roth, Demián Bichir, Michael Madsen, Bruce Dern and Channing Tatum). Dana Gourrier and Zoe Bell appear in small roles.\r\n\r\nThis was Tarantino’s second Western in a row after 2012’s “Django Unchained,” which ranks with the best Westerns of all time. This one’s not as good, but it certainly has its points of interest, like the great wintery wilderness atmosphere, which is to die for. Moreover, the plot is intriguing. It's basically an Agatha Christie whodunit a la Murder on the Orient Express transferred to the Old West. Roughly 90% of the film takes place in the haberdashery and, less so, a stagecoach. It's basically a theater play masquerading as a movie and I found it a unique setting for a Western.\r\n\r\nThe movie starts out with spectacular Colorado winter cinematography highlighted by an excellent Ennio Morricone score, his first full-length score in over three decades (!). Compelling extended dialogues have always been Tarantino’s strong suit; and so it is here. The amusing melodramatics are entertaining and the story keeps your interest despite the one-dimensional setting. Everything’s SO exaggerated that you can’t take it seriously. The movie’s intentionally offensive and you have to roll WITH the excesses to be entertained; otherwise you’ll hate it.\r\n\r\nOn at least one occasion the overindulgences don’t work, like the disgusting fellatio sequence. I get that Marquis (Jackson) was lying to the other guy to compel him to draw, but we didn't need a visual on his fabricated story. It's sordid excess that has no place in a Western or any other movie, except gay porn, but Tarantino obviously included it in order to be \"edgy\" or whatever.\r\n\r\nThe excellent opening with the figure of Christ dying for our sins keys off the theme, which is humanity’s fallen condition and dire need of redemption. The title, “The Hateful Eight,” is a perversion of “The Magnificent Seven.” The latter celebrates the noble and heroic whereas this movie parodies the base and odious. Tarantino is poking fun at our petty hostilities that separate us based on race, gender, sectionalism, faction-ism, envy and rivalry. Furthermore, men divided by hatred of culture and race can unite in hatred of something else, in this case misogyny.\r\n\r\nTHE FILM RUNS 2 hours, 47 minutes.\r\n\r\nGRADE: B", "created_at": "2018-07-17T18:44:27.366Z"}, {"movie_id": 273248, "review_id": "5d45b02d0f2fbd7864ed6f60", "rating": 6.0, "review_text": "Quentin T is on a downward spiral for sure. The film has it's moments but the endless profanity added to the fact there are no sympathetic characters make this a letdown. Too much gore and excessive violence near the end as well.", "created_at": "2019-08-03T16:02:53.946Z"}, {"movie_id": 273248, "review_id": "6388fa5c1b157d008246f8fd", "rating": 9.0, "review_text": "_The Hateful Eight_ is a fantastic western tale of deception that I loved. Only Quentin Tarantino can fill almost an entire movie with just dialogue while still being captivating and engaging.\r\n\r\nFrom start to finish, this film is filled with witty dialogue and dry humor that had me genuinely cracking up. The characters are all stereotypes on a comedic level, but when the writing is this good, they become much more than that. Each character had some level of depth and uniqueness that gave this somewhat dry and slow plot a spark that continually kept the flame of the story burning.\r\n\r\nSamuel L. Jackson is brilliant, this movie was directly written for him, and he makes use of every second of screen time he is given. His comedic delivery is excellent and towards the end of the movie his slyness and witty detective work are mesmerizing. Kurt Russell is hilariously stupid and his relationship with his captee (Jennifer Jason Leigh) is hilarious, sweet, and sometimes demented. Walton Goggins was so damn funny here; this is my favorite performance by him. He makes this movie, and the ending resolution would not be the same without him. Tim Roth was awesome, and all the other gang members were great too. The only one that kind of stuck out was Channing Tatum. I do not know if it was my bias of his based on his previous work, but I did not buy him in this film. Felt really out of place and unnecessarily cast on his name sack alone.\r\n\r\nDespite the slow pace and long runtime, this film is an utter masterpiece that keeps the viewer engaged and constantly curious about what the true motivations are behind each of our eight characters. The chapter-like structure is fantastic and there are some Pulp Fiction elements here in terms of storytelling order which I loved. While this may not be Tarantino's best film, it is still an incredible product and another classic added to his filmography.\r\n\r\n**Score:** _90%_ |\r\n**Verdict:** _Excellent_", "created_at": "2022-12-01T19:02:52.871Z"}]