[{"movie_id": 465914, "review_id": "5d3389166a300b1834ac8552", "rating": 6.0, "review_text": "**_Beautifully shot, but emotionally languid_**\r\n\r\n> **Studs Terkel**: _Did you feel a sense of shame about a heritage that is really so_ rich_, when you accepted the white man's stereotype of yourself?_\r\n> \r\n>**James Baldwin**: _I'm afraid that is one of the great dilemmas, one of the_ great _psychological hazards, of being an American Negro. In fact, much more than that. I've seen a great many people go under because of this dilemma. Every Negro in America is in one way or another menaced by it. One is born in a white country, a white Protestant Puritan country, where one was once a slave, w__here all standards and all the images, when you open your eyes on the world, everything you see, none of it applies to you. You go to white movies and, like everybody else, you fall in love with Joan Crawford, and you root for the good guys who are killing off the Indians. It comes as a great psychological collision when you realise all of these things are really metaphors for your oppression, and will lead into a kind of psychological warfare in which you may perish._\r\n>\r\n>[…]\r\n>\r\n>_All you are ever told in this country about being black is that it is a terrible, terrible thing to be. Now, in order to survive this, you have to really dig down into yourself and re-create yourself, really, according to no image which yet exists in America. You have to impose, in fact - this may sound very strange - you have to_ decide _who you are, and force the world to deal with you, not with its_ idea _of you._\r\n>\r\n>[…]\r\n>\r\n>**Terkel**: Nobody Knows My Name. _Why did you choose that title?_\r\n>\r\n>**Baldwin**: _Well, at the risk of sounding pontifical, I suppose it is a fairly bitter title, it is meant as a kind of warning to my country. In the days when people called me \"Boy\", those days haven't passed except that I didn't answer then and I don't answer now. To be a Negro in this country is really - Ralph Ellison has said it very well - never to be_ looked at_. What white people see when they look at you is not visible. What they_ do see_, when they_ do _look at you is what they have invested you with. What they have invested you with is all the agony, and pain, and the danger, and the passion, and the torment - you know, sin, death, and hell - of which everyone in this country is terrified. As a Negro, you represent a level of experience which Americans deny. This may sound mystical, but I think it is proven in great relief in the South. Consider the extraordinary price, the absolutely prohibitive price, the South has paid to keep the Negro in his place; and it has not succeeded in doing that, but has succeeded in having what is almost certainly the most bewildered, demoralised white population in the Western world. On another level, you can see in the life of the country, not only in the South, what a terrible price the country has paid for this effort to keep a distance between themselves and black people. In the same way, for example, it is very difficult - it is hazardous, psychologically, personally hazardous - for a Negro in the country really to hate white people. He is too involved with them, not only socially but historically. No matter who says what, in fact, Negroes and whites in this country are related to each other. Half of the black families in the South are related, you know, to the judges and the lawyers and the white families of the South. They are cousins, and kissing cousins at that. Now, this is a terrible depth of involvement. It is easy for an African to hate the invader and drive him out of Africa, but it is very difficult for an American Negro to do this. He obviously can't do this to white people; there's no place to drive them. This is a country that belongs equally to us both. One has got to live together here or else there won't be any country._\r\n\r\n- James Baldwin speaking with Studs Terkel; _The Studs Terkel Program_, 98.7 WFMT Chicago (July 15, 1961)\r\n\r\nBased on James Baldwin's 1974 novel of the same name, _If Beale Street Could Talk_ is really two stories in one; there's the love story at the narrative's core, giving the film much of its tonal qualities, and on the surface, there's the socio-political protest about racial injustice and inequality, which provides most of the main plot points. At a quick glance, this should be a masterpiece - there's the foundation of James Baldwin, arguably the most significant African-American author of all time, and this is the first English-language adaptation of one of his novels; there's writer/director Barry Jenkins, fresh off _Moonlight_ winning the 2017 Academy Awards for Best Picture and Best Adapted Screenplay; there's a theme that is (sadly) almost as pertinent now as it was in 1974; there's the vibrant cinematography by James Laxton (_Tusk_), with its lush colours and lyrical compositions; there's a bevvy of hugely talented actors; there's the absorbing and melancholy score by Nicholas Britell (_The Big Short_). This should have been a home run. However, although I found it aesthetically faultless, much like _Moonlight_, I felt the totality was considerably less than the sum of its exceptional parts. Jenkins fails to do justice to either of the narratives running concurrently through the film, with both feeling incomplete, like a pencil-sketch rather than a painting. The biggest problem, however, is the somnolent love story. Employing a Terrence Malick-esque esoteric voiceover, Jenkins lifts entire passages directly from Baldwin. However, what reads beautifully in the novel is badly out of place in the film, even in voiceover, and has the effect of rendering the two central characters completely unrealistic, with their love for one another idealised to such an extent as to become ridiculous. And much like Paweł Pawlikowski's _Zimna Wojna_ (2018), I found _If Beale Street Could Talk_ as formally beautiful as it is emotionally unengaging.\r\n\r\nNew York, 1974; 19-year old Clementine \"Tish\" Rivers (Kiki Layne) and 22-year old Alonzo \"Fonny\" Hunt (Stephan James), who have known one another since they were children, have fallen in love, and are planning to get married and raise a family. Fonny has quit his job working for a furniture manufacturer, hoping instead to make it as a sculptor. However, when he is accused of rape, the victim mistakenly identifies him in a line-up, and he is charged and detained. Awaiting his trial, Tish visits him in jail, telling him she is pregnant. Ecstatic at the news, Fonny says he can't be in prison when the baby is born, and so Tish and her family determine to do anything it takes to get him out as soon as possible.\r\n\r\nWith this as the central framework, the story is told in a non-linear style, jumping back and forth from one time period to another, which has an important thematic effect that I'll discuss below. Although Tish and Fonny are very much the centre of the narrative, we also meet a host of characters on the periphery of their relationship. There's Sharon (an absolutely exceptional Regina King), Tish's gentle mother; Ernestine (Teyonah Parris), Tish's acerbic but loving sister; Joseph (an excellent Colman Domingo), Tish's laidback father; Frank (Michael Beach), Fonny's practical father; Mrs. Hunt (Aunjanue Ellis), Fonny's deeply religious mother, who disapproves of the relationship between Fonny and Tish; Adrienne (Ebony Obsidian) and Sheila (Dominique Thorne), Fonny's sisters, who support their mother in everything; Levy (Dave Franco), a kindly Jewish landlord, who rents Fonny and Tish a space in a warehouse being turned into apartments at a reduced rate, because he enjoys seeing couples in love; Officer Bell (Ed Skrein), a racist cop who falsely says he saw Fonny running from the scene of the rape; Victoria Rogers (a superb (and unrecognisable) Emily Rios), the rape victim, who identifies Fonny in a line-up, with a little prompting from Bell, and then flees to Puerto Rico, delaying the trial; Daniel Carty (a heartbreaking Brian Tyree Henry), an old friend of Fonny's who could provide a solid alibi for the night of the rape, but whose testimony is ignored by the courts because he is an ex-con, having recently been released from a two year bit for stealing a car (which he denies doing, pointing out that he can't drive); Hayward (Finn Whittrock), Fonny's lawyer; Pedrocito (Diego Luna), a friend of Fonny's who works as a waiter at an upscale restaurant; and Pietro Alvarez (the always superb but criminally underused Pedro Pascal), with whom Victoria is staying in Puerto Rico.\r\n\r\nThe title of the novel (and film) is a reference to W.C. Handy's 1917 song, \"Beale Street Blues\", about Beale Avenue in Downtown Memphis (later renamed Beale Street, partially because of the popularity of the song). A mecca of African-American culture, particularly music, in the early 20th century, Beale Street is considered the birth place of Memphis blues, with artists such as Lizzie Douglas (aka Memphis Minnie), Louis Armstrong, McKinley Morganfield (aka Muddy Waters), and B.B. King regularly performing in the many clubs on the street. In 1934, George Washington Lee wrote _Beale Street: Where the Blues Began_, becoming the first African-American writer to be advertised in the Book-of-the-Month Club News. In 1977, Beale Street was officially declared the \"Home of the Blues\" by an act of Congress.\r\n\r\n_If Beale Street Could Talk_ prominently features a voiceover narration spoken by Tish. Mainly in the present tense, the _Erzählzeit_ (time of narrating) is an unspecified point in the future, looking back at the events depicted in the film. A lot of the voiceover is lifted either directly from the novel or is a very close paraphrase. For example, in the novel, Tish states,\r\n\r\n> _Fonny had found something that he could do, that he wanted to do, and this saved him from the death that was waiting to overtake the children of our age. Though the death took many forms, though people died early in many different ways, the death itself was very simple and the cause was simple, too: as simple as a plague._\r\n\r\nIn the film, Tish says,\r\n\r\n> _you see, he had found something that he wanted to do. And this saved him from the death that awaited the children of our age. And though it took many forms, the death itself was very simple. The cause was simple, too._\r\n\r\nUsing a voiceover with such eloquent statements, however, creates a significant problem (more on this in a moment).\r\n\r\nAesthetically, much like _Moonlight_, _If Beale Street Could Talk_ looks amazing. From Laxton's vibrant cinematography to the colour coordinated costume design by Caroline Eselin (_Monster's Ball_; _The Paperboy_) - just look at all the yellow in the opening scene, in both the photography and the wardrobe - everything we see rings true, like a Jack Garofalo photograph come to life. Even more visually lyrical than _Moonlight_, the saturated colour palette of _Beale Street_ recalls Douglas Sirk's Technicolour-soaked melodramas, such as _All That Heaven Allows_ (1955) and _Written in the Wind_ (1956). Jenkins has been very open about his admiration for filmmakers such as Sirk, Claire Denis (_Beau Travail_; _Un beau soleil intérieur_) and Hou Hsiao-hsien (_A Time to Live, a Time to Die_; _A City of Sadness_). However, he is most clearly indebted to Wong Kar-wai (_Days of Being Wild_; _In the Mood for Love_; _2046_); seen in Beale Street's non-linear narrative and relatively slight plot, its poetic tone, the centrality of music, and its tendency to use visuals rather than dialogue to convey thematic points (although Jenkins is nowhere near as formally experimental as Wong).\r\n\r\nAs in both _Medicine for Melancholy_ (2008) and _Moonlight_, Jenkins occasionally has characters speak directly to camera. They're not breaking the fourth wall, however. Such scenes are dialogue scenes, with two characters speaking to one another, so when one speaks directly to camera, it's if the camera is between the two of them. It's a technique that was used most famously (and effectively) in Jonathan Demme's _The Silence of the Lambs_ (1991), where each character looked directly into camera when speaking to Clarisse Starling (Jodie Foster), whereas she always looked just slightly off-camera, setting up a fascinating visual contrast which encourages us to identify with her, as we are presented with her POV, but not that of any of the other characters. _Beale Street_ doesn't do anything as interesting or subtle with the technique, but Jenkins's tendency to use it during moments of heightened emotion does have the effect of suturing the audience into the _milieu_ of the film; we know the characters aren't speaking to us, but it seems like they are.\r\n\r\nAs mentioned above, the use of a non-linear narrative structure has an important thematic effect. We know from the second scene that Fonny is in jail, meaning that as we watch Tish and Fonny planning their future, renting an apartment, having sex for the first time etc, there's a permanent shadow over everything we see; we know that things go wrong, because we know much more than the characters do. For the most part, this contributes to the tone of the film, thus justifying itself. However, Jenkins overuses the technique, jumping back and forth unnecessarily, without adding anything to the story. An editor once told me that the worst thing someone could say to him about his work is, \"I really noticed your editing\". That's because, unless you're talking about a film where the editing itself is literally part of the narrative, such as Oliver Stone's _Natural Born Killers_ (1994) or David Fincher's _Fight Club_ (1999), film editing should be invisible, with the audience never asking questions like, \"_what was the significance of that edit?_\" In _Beale Street_, Joi McMillon and Nat Sanders's editing itself is fine when we're within a scene; it's more the way Jenkins links scenes and chops up the story that draws attention to itself. I understand why the film is told out of sequence, but I don't understand why it's told out of sequence to such an extent. Compare this with Sean Penn's exceptionally underrated _The Pledge_ (2001). For the most part, it's a linear narrative, except that the first scene shows us the protagonist, Jerry Black (Jack Nicholson) as a broken-down alcoholic. The rest of the film takes place prior to this scene, so when we see Nicholson fall in love with Lori (Robin Wright) and spend a blissful Christmas with her and her daughter, we know that something terrible is coming, knowledge that casts a shadow over the entire film. Penn accomplishes this with a single scene, right at the start of the film. _Beale Street_, on the other hand, jumps all over the place, never settling into a standardised rhythm, with the cumulative effect becoming one of distraction rather than immersion.\r\n\r\nWhich brings me to the film's most significant problem - the love story at its centre just didn't work for me. This is partly because of the emotional distance Jenkins maintains, but it's primarily because Fonny and Tish don't seem like real people, not in the way they gaze into one another's eyes as if they are seeing each other for the first time, not in the way they speak to one another as if every syllable is of earth-shattering portentousness; not in the way that everything they say is spoken with a cloying (and ultimately irritating) sanctity. They rarely sound like real people; instead, they adopt the eloquence of James Baldwin. In lifting sections directly from the novel, Jenkins has failed to consider the differing demands of the medium - what works on the page, doesn't necessarily work on the screen, and the reproduction of Baldwin's rich and lugubrious prose is simply unrealistic, with the delivery sounding stilted and awkward, and, most egregiously, far beyond the lexicon of the characters. This is especially apparent in Tish, whose expressive voiceover is far beyond anything we see of her character in the film itself.\r\n\r\nIn this sense, they don't come across as people with their own interiority and psychological verisimilitude, instead functioning as cogs in the machinations of Jenkins's thematic concerns. Tish, in particular, feels like a cypher, because of her dual role as a young girl trying to get her man out of jail, and a sage-like observer of institutionalised racism in the US. Fonny too has an important dual role - that of a young man falsely imprisoned, and that of a tragic figure standing in for the millions of African-Americans unjustly imprisoned throughout history. Jenkins doubles down on this point by intercutting the film with black-and-white photographs of chain-gangs and police brutality; amongst others, we see Henry Smith, Jesse Washington, Will Brown, Emmett Till, and the Freedom Summer Murders. The point is clear; Fonny is a grand representative of the crimes committed against Africa-Americans in the US. However, his character never attains the kind of grandeur such a representative must, by definition, possess.\r\n\r\nThere are also some smaller problems worth noting. For example, in voiceover, Tish says,\r\n\r\n> _New York must be the ugliest and the dirtiest city in the world. If any place is worse, it's got to be so close to hell that you can smell the people frying._\r\n\r\nEvocative words taken directly from the novel, but the New York of the film is anything but ugly; it's picture-postcard perfect, with the streets curiously deserted. Oftentimes Tish's narration simply describes something we can see for ourselves, whereas elsewhere, Jenkins doesn't seem to trust the audience to understand his meaning, so he'll emphasise it to be sure. A good example is Levy, the Jewish landlord. Lest the audience not understand the significance of his Jewishness, there's a shot from beyond with his skullcap prominent in the frame. It's just overkill.\r\n\r\nAnother problem concerns the depiction of Bell, the racist cop who frames Fonny. Played as a leering pantomime villain, with bad hair, bad teeth, and bad skin, he's obviously a metaphor for the ugliness of racism, but he's so completely over the top, it rips you right out of the film. He'd be more at home in a video game than a socially conscious exploration of the challenges facing African-Americans in the US. On the other hand, Regina King's portrayal of Sharon is exceptional, and completely worth her Oscar win for Best Supporting Actress. King has been giving superb under-the-radar performances for a while now, particularly on TV, in shows such as _Southland_ (2009-2013), _American Crime_ (2015-2017), and _Seven Seconds_ (2018). However, if you really want to see what an acting powerhouse she is, she's never been better than she was in the second season of Damon Lindelof and Tom Perrotta's criminally underrated _The Leftovers_ (2014-2017), and she brings much of the silent depth with which she portrayed Erika Murphy in that show to _Beale Street_. The scene where she heads to Puerto Rico to try to persuade Victoria that Fonny didn't rape her is one of the most harrowing things you'll see on screen all year, with King conveying her emotional state primarily by her facial gestures (Rios is also superb in this scene, which is probably the best in the film).\r\n\r\n_Beale Street_ is an undeniably beautiful film that depicts the love between two astonishingly attractive people; it's worth noting that in the novel, Fonny is described as having\r\n\r\n> _skin just like raw potato, wet potato rinds and eyes like a Chinaman and all that nappy hair and them thick lips. And so bow-legged he had bunions on his ankle bones; and the way his behind stuck out, his mother must have been a gorilla._\r\n\r\nThis most certainly does not describe Stephan James. Lacking the raw emotion of Baldwin's novel, Jenkins's interpretation turns Fonny and Tish into a Ken and Barbie-esque couple, undermining Baldwin's depiction of them as very much existing in the realistic _milieu_ seen throughout the novel. Taking a meditative approach to the material, Jenkins's adaptation never rings true. Whereas Baldwin's Tish and Fonny are flawed, contradictory, and, most importantly, relatable, Jenkins's protagonists are too-perfect-to-be-real, with every agonisingly serious pronouncement they make to one another pushing them further and further from connecting with the audience on an emotional level.", "created_at": "2019-07-20T21:35:18.834Z"}]