[{"movie_id": 59678, "review_id": "5c307149925141635e6f790f", "rating": 8.0, "review_text": "It’s raining Gollums!\r\n\r\nAttack the Block is written and directed by Joe Cornish. It stars Jodie Whittaker, John Boyega, Alex Esmail, Jumayn Hunter, Luke Treadaway and Nick Frost. Music is by Basement Jaxx and Steven Price and cinematography by Tom Townend.\r\n\r\nWhen a South London tower block comes under attack from aliens, a young gang of lads and the nurse they just mugged have to band together to fight back.\r\nIn Britain we was wondering just when Joe Cornish was going to turn his hand to directing a feature film, here for his debut he tackled a sci-fiction action comedy with a wry bit of social commentary thrown in for good measure – it was worth the wait.\r\n\r\nWith one Edgar Wright hovering about in the producers lounge and Nick Frost on hand as a reassuringly adult comedic presence, it could be argued that Attack the Block has joined the Wright/Pegg production line. Yet when you break it down this does in fact homage a myriad of siege invasion films, but still it becomes very much its own animal.\r\n\r\nCornish dangerously structures his film by introducing us to a young gang of kids who think nothing of mugging a single defenceless woman – with a knife. With the group spouting their turf speak (some none British views may struggle initially with the dialogue), they are not a bunch of youngsters one can easily get on side with. In fact to dislike them in an instant is wholly justifiable and understandable, so much so that once the aliens arrive it’s a human reaction to root for them to rid us of these troublesome youths. So yes, dangerous by Cornish, yet astute as it happens.\r\n\r\nAs the pic progresses and we spend time with the gang, we start to understand their way of life, their part in a tough society. It’s during this key phase that Cornish brings in another structure, that of the victim and the perpetrators having to band together to fight an enemy, surely he isn’t going to make heroes out of this gang of youthful miscreants? So once this scene is set, and the aliens start to unleash toothsome hell on this part of South London, it’s battle royale time. The blood and jokes seamlessly flow together, the score booms and other characters are introduced, some either for a lighter angle – others to annoy us and maybe be set up for alien gnasher fodder?\r\n\r\nThe aliens themselves are a splendid creation, a new addition to an overstocked market. One of the youngsters calls them gorilla wolf things, that’s about right, they be jet black with spiky hair and bio luminescent jaws and claws, they move on all fours. And then it’s the last part of Cornish’s clever structure plan, for as we are given a reason why the aliens are after this particular group, so does characters transformations offer a prudent point. There is hope unbound, not just for people in movie, but for societies fractured by the way of the life afforded them. While the lesson here of people taking responsibility for their actions, to right their wrongs, is written loud and proud.\r\n\r\nSmart and fresh performances  across the board, led by the wonderful Whittaker and a star making turn from Boyega, close out the deal. Attack the Block is a genre spilcer of a picture that brings something new to the table it sits at. Trust Bruv!   8/10", "created_at": "2019-01-05T08:56:41.489Z"}, {"movie_id": 59678, "review_id": "5f98f6e72b531d00387bb2f1", "rating": 8.0, "review_text": "An alien invasion hits the \"hood\" in London reeking havoc with the local gangs. Excellent performances by all invoived including a breakout role for John Boyega (or Star Wars fame).", "created_at": "2020-10-28T04:43:19.044Z"}, {"movie_id": 59678, "review_id": "5f98f78c17792c00363eac36", "rating": 8.0, "review_text": "An alien invasion hits the \"hood\" in London reeking havoc with the local gangs. Excellent performances by all invoived including a breakout role for John Boyega (or Star Wars fame).", "created_at": "2020-10-28T04:46:04.098Z"}]