[{"movie_id": 400928, "review_id": "58f1849b9251412fb1000154", "rating": 5.0, "review_text": "Good, but not great.  A few, not many, funny lines. Best performance by Mckenna Grace.  The best I can say is that it wasn't a good movie but it wasn't a bad movie either.", "created_at": "2017-04-15T02:25:31.744Z"}, {"movie_id": 400928, "review_id": "5a45f8fc925141361f03d518", "rating": 4.0, "review_text": "Extraordinarily conventional. It will surely appeal to devotees of this sort of thing, because it's well acted and has some minor emotional impact, but with the exception of what essentially boils down to a gimmick, _Gifted_ is just like a hundred other okay movies that deal with the same subject in the same way.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2017-12-29T08:12:44.401Z"}, {"movie_id": 400928, "review_id": "5a76fcb0925141059a0449f0", "rating": 8.0, "review_text": "**One's fighting for the child and the other's for her gift!**\r\n\r\nFilms about battle for child custody is a very familiar theme. There are lots of great films you could find. This is just another, but another great among them. There's actually nothing special about it. It's simple and emotional. The characters were slightly different, and agenda for courtroom drama is interesting aspect of the film.\r\n\r\nA single uncle who is a by-default guardian for his niece since her mother had died. But the seven year old kid is a math prodigy like her mother. He wanted her to live a normal life like everybody else in her age. That's what her mother wanted as well. When her grandmother learns about the gift, is now seeking a court intervene to provide all she needed to nurture her gift, since she's very rich. So the kid caught between adult's fight, how the rest of the narration folds are emotionally told.\r\n\r\nI'm not a fan of Captain America, because he's not the Captain Earth or Captain my country. Other than that, Chris Evans is not a big marketable star. But this was a pretty cool performance. The kid too was awesome. The last time I saw her was from 'Mr Church'. Well written and directed. Easily one of the best drama films of the year. A good message film as well. Families should watch it.\r\n\r\n_8/10_", "created_at": "2018-02-04T12:29:36.581Z"}, {"movie_id": 400928, "review_id": "5ed4c70ee4b576001e306817", "rating": 8.0, "review_text": "Click here for a video version of this review: youtu.be/-BWlPAUidmI\r\n\r\n_Gifted_ is a 2017 movie starring Chris Evans, Mckenna Grace, and Octavia Spencer and is a wonderfully sweet movie that tells the story of Mary and her Uncle Frank who live together due to the untimely death of Mary's mother. Mary is not just any seven year old though, she is intellectually gifted and a mathematical genius. Frank wants to give her a normal life while others want her genius to be used to its full potential.\r\n\r\nThis was such a charming movie and I'd be lying if I said that there weren't a couple of scenes that made me feel a little misty eyed. Mckenna Grace is absolutely adorable in this and acts her butt off throughout. The chemistry between her and Evans was so damn good - it's this connection between the two of them and between them and Spencer that makes this movie such a joy to watch. There is a scene in a sunset with Evans and Grace and she is climbing all over him asking him a million questions, like kids do, and it was so perfectly natural, it was a pleasure to watch.\r\n\r\nThis is a really great movie, and while family dramas are nothing new, there was something just really nice about this movie. In amongst the drama there are some funny moments too, just enough to lighten things the right amount. Octavia Spencer has been a longtime favourite of mine, and she's great in this but, for me I enjoyed seeing Evans do something other than Captain America. I wasn't that fussed on _Knives Out_ so it was cool to see him do some proper dramatic acting.\r\n\r\nI really enjoyed this, and with all the madness going on in the world right now, this was a story that really made me smile.", "created_at": "2020-06-01T09:14:54.290Z"}, {"movie_id": 400928, "review_id": "659261f1149565604dda8a06", "rating": 7.0, "review_text": "McKenna Grace is good here as the young \"Mary\" who is clearly rather gifted with it comes to mathematics. Her teacher \"Miss Stevenson\" (Jenny Slate) cottons on quite quickly and after an altercation on the school bus, her uncle \"Frank\" (Chris Evans) with whom she lives after the suicide of her mother (his sister) is being sold the virtues of a new school with a much more focussed agenda. \"Frank\" think she is better growing up surrounded by ordinary kids but a bit of interference from the disappointed head teacher finds him face to face with \"Evelyn\" (Lindsay Duncan). She is the grandmother of \"Mary\" and is determined to wrest control of her future so she can, indeed, attend the new school. What becomes clear here is that \"Evelyn\" is not an unkindly woman, she just has a messily conflicted agenda which gradually unfolds as the court has to make a tough decision. Evans and Grace have a good chemistry here, and when it's the two by themselves on screen the film works quite well at demonstrating what works well for the pair, but also illustrates just why the basic nature of that existence is fuelling the battle against them. I have to say, I didn't really like the ending. The dynamic between Evans and Duncan's characters was never great, but thanks to an one-eyed cat, the last twenty minutes throws it up in the air completely and leave us with a rather unsatisfactory conclusion that maybe made more sense on the page. On-screen it seemed to rather nullify the whole point of the rest of the genuineness of story. Perhaps it's all just about vicarious success? Or just success at any cost? Anyway, it's still a well produced drama with some lively dialogue at times and Octavia Spencer along now and again to dispense some words of support and wisdom to the increasingly struggling \"Frank\". Never make a promise you don't know you can keep!", "created_at": "2024-01-01T06:55:45.157Z"}]