[{"movie_id": 590995, "review_id": "5f9a9af7e942ee0036ad1416", "rating": 5.0, "review_text": "Disappointment that it didn't live up to the first film.\r\nAt least first film was edgy, a little scary, even had goths.", "created_at": "2020-10-29T10:35:35.304Z"}, {"movie_id": 590995, "review_id": "5fb751a49a358d004165796f", "rating": null, "review_text": "Yes, it's a subpar sequel, but not nearly as bad as many people make it out to be. I get it, the movie errs on the side of being too preachy and \"woke\", which is something that was likely to get a lot of criticism, especially considering that this flick was bound to attract a lot of attention from fans of the first movie (mostly people in their mid to late thirties, like myself). Drawing a comparison is somewhat inevitable, given that \"The Craft\" (1996) is widely regarded as a cult flick, but, as a standalone movie, \"Legacy\" works in its own way and, while I can understand why so many people were dissatisfied with it, I would say that it doesn't deserve all these 1/10 scores that it got on IMDb or other websites. This sequel is mostly aimed at a younger audience with a more social justice warrior mindset, for the lack of a more fitting description. While I pretty much tend to roll my eyes at any kind of patchiness, I didn't find it impossible to sit through this flick, like I experienced with other \"woke\" movies.\r\n\r\nWhile in the original film we get a group of girls who were mostly miserable and dark, because of their inner conflicts and the fact that they were mostly ostracized by their peers, \"Legacy\" gives us four girls who are pretty much sparkly and happy. Actually, I would say that, at some point, I found them annoyingly loud and enthusiastic, especially about their magic, which they mostly use to play silly tricks and whatnot.\r\nWhile the 1996 film dwells into the lives of each of the four girls, allowing us to know them and empathize with them, \"Legacy\" mostly focuses on Lily, the main character. As a matter of fact, the other girls' lives are never even explored, which is something that bothered me a lot, because it felt alienating and rushed. Who are \"the three others\"? Lourdes, a transgender latina; Tabby, who we never really get to know and Frankie, a ditzy and likeable girl who, at some point, receives a snarky comment from a popular girl, who makes fun of her for being allegedly ugly.\r\n\r\nI think one of the biggest problems with \"Legacy\" is, precisely, that we don't really get to know who these girls are, while the original was a character-driven type of film. Seriously, these four girls are mostly likeable, they don't harm anyone and they just enjoy their powers, but don't really get to know them and many of their personality treats seem to have a cookie cutter approach. So, they're woke social justice warriors... big deal. Don't we get enough of these types of characters these days? Apparently, not. These girls just don't stand out in any way. It could have been much worse, though; at least it's not as \"woke\" as the \"Black Christmas\" remake from 2019 (now, what the fudge was that?)\r\n\r\nIn \"The Craft: Legacy\" the main antagonist is none other than... patriarchy itself (surprise!). David Duchovny basically plays a lazily written character that could be described as \"the very, very bad man that thinks women are weak and they need to submit to the greatness of the male\". Seriously, how stereotypical and predictable is that? So, while in the original film, the girls have a falling out and are pit against each other, in this sequel, they also have a falling out, but eventually team up to fight a greater evil: men! To be fair, though, not all men in this movie are absolute trash... only 95.6% of them are. In spite of this, \"The Craft: Legacy\" is not really an anti-men statement, but more like a half-assed display on the consequences of male chauvinism does, which can be endured both by men and women. In doing so, the movie offers a bunch of contrived and even caricature-ish situations and characters, like the school bully turned into a social justice warrior, after the girls put a spell on him. Though, clearly, they are the good ones, the girls are not portrayed as absolute angels who can do no wrong and are constantly mistreated by the world. As a matter of fact, at some point, they acknowledge that they have (ab)used their power and force themselves to stop.\r\n\r\n\"The Craft: Legacy\" is definitely not a masterpiece and it will never gain cult status, like the original film, but it's not the unwatchable mess that people make it out to be. It should be mentioned that, while the 1996 flick had a few horror moments, \"Legacy\" doesn't even bother going there, and it ends up being more, like, a teen drama with a few sparkly stars here and there and an evil shapeshifting antagonist.", "created_at": "2020-11-20T05:18:28.074Z"}, {"movie_id": 590995, "review_id": "60669cf7124c8d003f32656d", "rating": 1.0, "review_text": "Sigh... not that I expected anything that equaled the original The Craft even partially, this is an insult to decades of pre-woke era American culture.\r\n\r\nSensitivity and tolerance notwithstanding, this is thematically and aesthetically a major step down from the original film and urinates all over the legacy of that classic contribution to American cinema.\r\n\r\nMost glaring from a visual standpoint is casting of the 4 leads, a double wide boy posing as a girl(!?), a girl who looks like a boy, a legitimately ugly girl, and (at least) a beautiful descendant of the kings and queens of Africa. Why, pray tell would they deviate from the original formulation of alluring and powerful imagery of 4 uniquely beautiful young women and give us THAT mess instead? Because beauty is more than skin deep? Because inner beauty is more important? Because everyone is beautiful? Not quite. Beauty is just beauty, and they decided to leave it out of this film for the most part.\r\n\r\nAdding to the insult of this present day lesson in how to wokefy the sequel of a classic film, they decided to make every masculine character, evil. Great message.", "created_at": "2021-04-02T04:26:31.563Z"}, {"movie_id": 590995, "review_id": "6240532b706e56008bd2506b", "rating": 5.0, "review_text": "Yikes, well there's not much point in gilding the lily - this is dreadful. A sort of elongated episode of \"Buffy\", written by someone who has little, if any, grasp of how to construct a suspenseful story and directed with the same level of skill. It reminded me of female equivalent of \"The Covenant\" (2006) and what David Duchovny is doing here is anyone's guess. In my view, it's well out of it's depth getting a cinema release at all - it's a pretty pointless exercise on just about every count that belongs on daytime teen television.", "created_at": "2022-03-27T12:06:03.931Z"}]