[{"movie_id": 846867, "review_id": "612294f1bbcae00074104f03", "rating": 7.0, "review_text": "Mad God is a terrifying triumph to animation. It is mesmerizing, unique, and disgusting through and through. The ruined city in the film is coated in these overwhelming layers of grunge and unknown fluids that practically ooze onto the audience. The film seems to draw homage from the Labyrinth Cenobites reside in from the Hellraiser films. Apart from taking away that we’re all doomed to repeat the same pain and anguish for eternity, Mad God’s one flaw is reasoning behind its gruesome existence. Dreams and aspirations lead us through life like a treasure map, which more often than not, never come true. There’s nothing out there quite like Mad God. It is frighteningly phantasmagorical and a horrific masterpiece of animation.\r\n\r\nFull review: https://hubpages.com/entertainment/Fantasia-Mad-God-Review", "created_at": "2021-08-22T18:18:25.742Z"}, {"movie_id": 846867, "review_id": "62fa2c171750510084a3b507", "rating": 7.0, "review_text": "Wow, but the quality of the stop-motion animation in this is breathtaking. On a big screen, the detailed movement of characters and settings alike; the clever use of light and shade look superb - it's really quite an astonishing piece of art to enjoy. The story itself is almost incidental - it centres around a gas-mask clad human lowered into a dystopian environment of ruins and hideous mutations where life and limb are at risk every step it takes edging through this murderous and perilously dark and dangerous environment towards a central tower from which, we can safely assume, the root of this brutal evil emanates. As the adventure progresses, we begin to appreciate the story is not so much about the grimy and hostile scenarios, but about the nature of whatever is in this tower that presides, perhaps even thrives, over this abject misery. It is frequently peppered with some deliciously cruel dark humour - things get squashed and squished with a ruthlessness that isn't really menacing, but actually quite entertaining as his trek through this industrial maelstrom continues. I reckon this does need a cinema - so much of the skilful artistry won't really work so well on a television, however big. It has a great, deconstructed, persevering style to it that surprised me - and i did quite enjoy watching.", "created_at": "2022-08-15T11:20:55.497Z"}, {"movie_id": 846867, "review_id": "633a27a70fb398007e4c74bf", "rating": null, "review_text": "As a technical artistic piece demonstrating the expressive power of stop motion cinematography, it is a triumph. As a story, it is a eighth grade goth kid sitting in the back of class, doodling their inner turmoil and profound nihilism. Most of the metaphors relating to our world (e.g., work, medicine, military, birth-rebirth, religion, etc.) rarely rise above that depressed 8th grade standard. Still, I'd rather watch this technical masterclass in cinema than yet another vanilla film that is little more than a pile of cliches. You will certainly not forget it, and the ending is worth staying for as it veers into the best kind of psychedelic metaphysical territory. \r\n\r\nWARNING: would not recommend tripping while watching this, you may have more than a panic attack.", "created_at": "2022-10-03T00:07:03.505Z"}]