[{"movie_id": 502416, "review_id": "5d72aa16209f180014fb2194", "rating": 5.0, "review_text": "So-so thriller, that could've been straight out of the 90s, features some decent performances, particularly Octavia Spencer and Diana Silvers. Nothing special and outside of the language and sexual content, kind of feels like something that would be on the Lifetime Movies network or something. Probably worth a rental, not much more. **2.5/5**", "created_at": "2019-09-06T18:48:54.079Z"}, {"movie_id": 502416, "review_id": "5d94a1c5a097dc0022246ff9", "rating": 5.0, "review_text": "I was sort of annoyed by _Ma's_ promotional campaign. When that very first trailer dropped, I was hooked instantly. It very much played up the mystery. You knew there was something not quite right, but no idea what. I couldn't even be certain the angle they were gonna play up was Octavia Spencer as a villain. Then every bit of marketing material afterwards showed the hand almost immediately. Ma's a headcase no doubt about it and that great act 2 twist we had waiting in the wings was ruined. Then I actually watched the thing, and, no, it's totally fair, because the escalation on her craziness is pretty much complete by the end of day 1. Things from the first trailer that I thought could maybe sow of doubt towards making the audience dubious about her intentions, in the actual movie take place **after** she's already commited murder in broad daylight. So my expectations were off, that's on me. All that aside though, _Ma_ really isn't that great. It is okay, not terrible by any stretch, but probably doesn't merit a revisit. Octavia Spencer's character does provoke both genuine sympathy, and an overwhelming creep-factor, and hitting those two opposing aspects is quite impressive, but there is so much that _Ma_ completely drops, it almost feels unfinished.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-10-02T13:10:29.139Z"}]