[{"movie_id": 515195, "review_id": "5d07013ec3a368087022cd35", "rating": 6.0, "review_text": "‘Yesterday’ takes its genius idea and unfortunately turns it into a generic film. Both director Danny Boyle and writer Richard Curtis have proven their creativity before, but here it's just wasted along with everything else.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-yesterday-great-concept-disappointing-execution\r\n\r\nHead to https://www.maketheswitch.com.au/sff for more Sydney Film Festival reviews.", "created_at": "2019-06-17T02:55:58.925Z"}, {"movie_id": 515195, "review_id": "5e873fdeaf58cb0012e31978", "rating": 10.0, "review_text": "I really enjoyed this movie. Right out of the gate, you must accept that it is a fantasy rather than science-fiction, because the latter genre usually tries to give some sort of explanation for why something happens, but here we just take it as it is. \r\n\r\nThe dialogue is mostly witty and fun, and the characters got my sympathy. I had a slight problem with the two lead characters having always been platonic, as it was never fully explained why that was. But I was able to put that aside. Plus I really liked seeing the third lead character, the Mini Cooper (okay, yes, I have owned one for nearly twenty years).\r\n\r\nPart of the ending could be considered predictable, and part of it was, but another piece of the conclusion astonished me in its originality, so it worked for me. One interesting subplot revolved around a couple of people who shared the knowledge about the Beatles that drives the story, and I was surprised and pleased at how they resolved that subplot. \r\n\r\nAnd yes, to deal with the elephant in the room, most of the songs presented in the movie were better when the Beatles performed them, but isn't that the point? I had no problem setting that fact aside and enjoying this harmless and entertaining film. Oh, and I appreciate what a good sport Ed Sheeran is in this movie, allowing the lead character to more or less beat him in a songwriting contest (though of course Ed really won). In this movie, everybody wins (Well, except of course for the fictional Beatles, unless you can imagine they would prefer where the fantay lands them.)", "created_at": "2020-04-03T13:53:34.130Z"}]