[{"movie_id": 161, "review_id": "57b74810c3a36835260006a6", "rating": 9.0, "review_text": "I got two words for you, mini-bar.\r\n\r\nLiterally fresh out of prison, Danny Ocean is busy setting up a seemingly impossible robbery. The plan, along with ten other experts he has roped in, is to rob the main vault at Las Vegas that houses the takings from the three main casinos.\r\n\r\nThe original Ocean's 11 released in 1960 is an OK film, more watchable for the Vegas setting and the irrepressible cast of Rat Packers than for any purpose or structure. That this Steven Soderbergh remake trumps the original in every department is a triumph of entertainment values over pure star appeal. Some would put a case up for the cast of Soderberg's film using stars to entice the audience in? But really at the time of release it was a stretch to put George Clooney, Brad Pitt and Matt Damon (all excellent here) on the same pedal stool as Frank Sinatra, Sammy Davis Jr. and Dean Martin.\r\n\r\nThe most striking thing about this remake is that the whole cast seem to be enjoying themselves, mainly because they are not being asked to over exert their performances from their very astute director, they really are just asked to turn up, enjoy each other's company and deliver one of the coolest pictures to have been made in the decade.\r\n\r\nThe film is purely out there to entertain, it has geniality pouring out from every frame, this is a character based heist caper full of laughs and derring do shenanigans - even Don Cheadle's ill advised (and pointless character arc) cockney accent manages to create smiles instead of being an on going hindrance. Some critics said the film is far too shallow to have any real worth! What the hell do they want? So the crooks are nice guys, it's a refreshing change to see a Vegas sparkling bright without any seedy undercurrents, where these robbers aren't using AK 47s to obliterate the opposition, it's wits and dashes of cool that fills out their respective armouries.\r\n\r\nThe soundtrack and scoring are themselves cool characters in the piece, whilst a big shout out goes to the bona fide stunt work from the wonderfully elastic Shaobo Qin - which merely puts another cherry on this already delightful cake. All the cast (too many to mention) are great, from Andy Garcia's suave and mean boss, Terry Benedict, to Julia Roberts' (walking like a goddess) Tess Ocean, all things in the film deliver a feel good movie that when all put together, and all things considered, is a film made by lovers of the medium for, well yes, lovers of the medium itself! 9/10", "created_at": "2016-08-19T17:55:28.388Z"}, {"movie_id": 161, "review_id": "5f4b0f9d65e0a200324d1709", "rating": 7.0, "review_text": "Really good watch, would watch again, and can recommend.\r\n\r\nAs far as heist movies go, it's excellent, but I think I'm very picky when it comes to heist movies.  In order to get me behind the criminal protagonist, it needs to be overly complex, but not complicated, and there needs to be an alternative motive, such as \"get the girl\".\r\n\r\nThis entire franchise does a decent job of this, keeping the motives and implementations interesting.  Part of the problem with that is that because of how complex the heist is, have the movie is an explanation of how the heist is going to happen (with JUST enough information left out for misdirects), then there is the actual heist, with some misdirects, and an explanation of the gaps, if not the heist itself, then a resolution.\r\n\r\nThat's the formula for every heist movie ever, which is part of what makes it boring.  It has to be special to really grab a audience and make it memorable.\r\n\r\nThis movie does all this with a great cast, and certainly enough production value.  While it is certainly really interesting and entertaining, I can't really say its a great movie.  We can chalk it up as personal bias, but I do think everyone should see this version as it has some historical value and is well worth the watch.", "created_at": "2020-08-30T02:31:57.190Z"}, {"movie_id": 161, "review_id": "63002b47532acb007bd33c5a", "rating": 10.0, "review_text": "**My favorite movie of all time! A must-see!**\r\n\r\nOcean's Eleven greatest strength is its emersion of the audience into the midst of a story already in motion. The pacing isn't weighed down by exposition; instead, the viewer discovers important history and surprises simultaneously as the characters on screen. The absolutely brilliant cast is effortlessly charming, whose antics and charisma fuel the movie to be a wonderful ride from start to finish. You can't help but feel welcomed into Danny Ocean's crew. With amazing acting, storytelling, clever twists, and exceptional directing, Ocean's Eleven is a must-see and my favorite movie of all time. As a young teen who stood firmly in the grunge camp of wearing ripped jeans and rock 'n' roll t-shirts, Ocean's Eleven convinced me that every now and then... suits are cool too.", "created_at": "2022-08-20T00:31:03.385Z"}, {"movie_id": 161, "review_id": "64d75f4af495ee0290e3aa01", "rating": null, "review_text": "This new version of the classic heist movie is of course slick: sharply written, acted competently, the stunts and special effects well-made. Still, I can’t say I liked it too much. It was sufficient to entertain, I suppose, but will quickly fade from memory. Then again, the action drama genre is not what I call home. You throw in some humor and you stand a chance of holding my attention, which it just about managed.\r\n\r\nThe hero wanting to get his ex-back is easy to cause traps of stereotypical behavior, and this script fell into some of them. Tess Ocean comes off as one of Terry Benedict’s possessions through much of the film. He shows her deference and she srands by his side, but where is there even a flicker offeelings between them? And actually, there is hardly more emotion between her and the hero come to rescue her.\r\n\r\nSo I give this film a less than rousing “It’s okay,” and will move on.", "created_at": "2023-08-12T10:30:34.332Z"}, {"movie_id": 161, "review_id": "64f2e6d274507d00ff8d00b6", "rating": 8.0, "review_text": "As remakes go - I think we will struggle to find one that is better than this across any genre. It's not just that the cast is full of A-listers, it is that Steven Soderbergh has invested just as much time with his story and with the characterisations as he has with the visuals, the gadgets and, of course, just about everyone from Brad Pitt and George Clooney to Julia Roberts and Matt Damon. The premiss being that Clooney \"Danny\" assembles a group of skilled operators with a view to relieving casino owner \"Benedict\" (Andy Garcia) of a great deal of money. Their planning must be meticulous - each having their set tasks that they must deliver precisely to support the overall - dangerous - plan. All looks to be going along well until the boys discover that Julia Roberts (\"Tess\") - the ex-wife of their leader - is now dating their mark. Could that compromise their entire operation? The action builds well, here - the contributions from each - especially, for me anyway, Carl Reiner as the curmudgeonly \"Saul\" and Shaobo Qin as the lithe and supple gymnast \"Yen\" - who reminded me somewhat of Burt Lancaster's equally acrobatic buddy Nick Cravat - are charismatic, enjoyable and impressively they all gel quite well too. The ending is a masterstroke, and there is a suitably fitting \"Clair de Lune\" to sign it all off. Good entertainment all round.", "created_at": "2023-09-02T07:40:02.807Z"}]