[{"movie_id": 244049, "review_id": "534e58450e0a2679e30016f2", "rating": 7.5, "review_text": "Mohanlal was endearing in roles where he played the common man. But, as his stature grew, we saw less of the kind of roles that had brought him stardom. \r\n\r\nAs a big star, he played those ‘larger than life’ roles that had the fans clapping and whistling at the superhuman feats of their idol. \r\n\r\nThe subtlety that was the hallmark of his earlier films became increasingly rare and the sly sense of humour gave way to a louder variety. \r\n\r\nIn his new film Drishyam, director Jeethu Joseph focuses on the endearing persona of the actor by casting him as Georgekutty, an orphan who had dropped out of school after the fourth grade. \r\n\r\nHe has come up in life by tilling his land. Now he is businessman running a cable TV service in a rural area. He is married to Rani (Meena) and they have two beautiful daughters. \r\n\r\nGeorgekutty is stingy and does not like to spend money on anything beyond the basic necessities. His only interest in life apart from his family is watching films. He spends most of his time in front of the TV in his small office. \r\n\r\nHe is so obsessed with movies that he takes every major decision in life by subconsciously taking an example from some film he has seen. \r\n\r\nThese details are revealed in a humorous manner in the first half of the film. There’s an obvious twist just before the interval. Georgekutty’s teenaged daughter gets photographed in the bathroom at a nature camp by a hidden cell phone. \r\n\r\nThe culprit Varun (Roshan Basheer) is the son of an inspector general of police, Geetha Prabhakar (Asha Sarath). Varun is accidentally killed by Rani and her daughter when he comes to blackmail them. It is up to Georgekutty to protect his family from the long arm of the law. \r\n\r\nJeethu Joseph makes this into an ‘edge of the seat’ thriller in the second half by making Georgekutty stay two steps ahead of the investigators. \r\n\r\nGeorgekutty prepares his family to face the torturous interrogations. He also makes sure that his family does not psychologically break up in the face of coercive police tactics. \r\n\r\nMohanlal is spellbinding in this film. That is too simple a statement to describe the magic he has created on screen. \r\n\r\nHe plays a semi-literate man who is nevertheless intelligent. He is conversant in many languages, a skill that he acquired watching all those films on TV. \r\n\r\nHe was mischievous as a teenager, and when he flirts with his wife, but is incredibly mature when dealing with dire circumstances. \r\n\r\nMeena as his wife Rani is a middle-class woman who aspires for a better lifestyle and social standing. She holds her own opposite Mohanlal and is one of the highlights of the film. \r\n\r\nKalabhavan Shajon who usually plays the comic sidekick of the hero, has made a successful transition to a villain in this project. He plays a corrupt police constable who has some animosity against Georgekutty. \r\n\r\nDrishyam can be credited for bringing Mohanlal back to form and pushing director Jeethu Joseph into the big league as he has made a cracker of a thriller.", "created_at": "2014-04-16T10:15:33.375Z"}]