[{"movie_id": 77805, "review_id": "65a5a0e60582240123fe12ff", "rating": 7.0, "review_text": "**A bold and beautifully executed film about one of the first porn superstars.**\r\n\r\nContrary to what many people think, pornography did not appear by magic in the 1970s. I am not an expert on the subject, but I know several images and engravings of pornographic content printed in the 19th century. However, until the middle of the 20th century, this material could only circulate secretly so as not to offend the reigning puritanism. What happened in the 70s was the liberation of this material, which began to be displayed openly and have the air of great artistic expression (often without merit). Linda Lovelace, probably the first porn superstar, is part of the birth of today's porn industry.\r\n\r\nThe film, directed by Rob Epstein and Jeffrey Friedman, is not afraid to address the toughest themes and show us the darker side of the life of the woman who starred in the famous “Deep Throat”, a film so extreme for It's time that it was censored in much of the world, made pornography a well-accepted fashion and consolidated pornography as a cinematographic genre and entertainment industry. Taking advantage of statements by Linda Lovelace herself, several years later, the film shows the abuse to which the actress was subjected in the production, so we should expect from the outset several sex and nudity scenes. I tend to be against the unreasonable insertion of these types of scenes, but in the context we have here they are needed and do not appear freely on the screen.\r\n\r\nTechnically, what caught my attention the most was the careful recreation of the time and environments. Seeing the sets and costumes in this film automatically transports us to the 70s and the height of the Sexual Revolution, an era of questioning, breaking taboos, assuming freedoms and challenging the moral status quo. From the props to the hairstyles, to the cars used in some scenes, everything takes us back to the time and I didn't notice any errors or glaring problems that would ruin the effect. Also the soundtrack, which features some songs from the period by such notable voices as Gladys Knight or Soul Brother Six, is completely in keeping with the general atmosphere.\r\n\r\nAmanda Seyfried has managed her professional career wonderfully and the fact is that she has participated in increasingly significant films since “Mamma Mia”, with a likely financial impact in favor of the young actress. Her choice for this character is a little strange, considering that she doesn't even look like the real Lovelace, but the truth is that the characterization and makeup team worked miracles and Seyfried took advantage of yet another opportunity to show talent and determination. The production, moreover, is full of well-known names. Sharon Stone, who made the public furious almost thirty years ago with a simple crossing of her legs, seems to make a kind of personal catharsis of that famous moment in the role of Lovelace's conservative and puritan mother, and shares the stage with Robert Patrick, who He also did a very good job. I also liked the work of Peter Sarsgaard, who is truly worthy of our hatred. The film also features James Franco and Wes Bentley, among others.", "created_at": "2024-01-15T21:17:26.479Z"}]