[{"movie_id": 10197, "review_id": "5c12aa130e0a263705cfedb1", "rating": 7.0, "review_text": "***A famous director loses his inspiration and seeks aid from the various women in his life*** \r\n\r\nReleased in 2009, “Nine” is a drama/musical about a famous Italian director in 1965 (Daniel Day-Lewis) who loses his inspiration, but its urgent he gets it back because his ninth movie is set to start shooting in ten days and he doesn’t even have a script. He turns to the several women in his life for succor: his wife (Marion Cotillard), his mistress (Penélope Cruz), his costume designer (Judi Dench), his star actress (Nicole Kidman), his mother (Sophia Loren), a fashion journalist (Kate Hudson) and a prostitute from his boyhood (Fergie).\r\n\r\nThis is an adaptation of the 1982 Broadway musical, also dubbed “Nine,” which itself was based on Federico Fellini's semi-autobiographical 1963 film “8½.” It’s very similar to director Rob Marshall’s “Chicago” (2002), but with a different story, cast and location (Rome and points nearby).\r\n\r\nDuring the first half I wasn’t so sure about the story, but I eventually found myself absorbed into the life of the tormented director and his mid-life crisis. His unfaithfulness to his beautiful wife, Luisa (Cotillard), is off-putting of course, but maybe we should have mercy for a man who has scores of gorgeous women offering themselves to him practically every day. It helps that he WANTS to be free from his adulteries and be true to Luisa.\r\n\r\nYet I have a hard time picturing Guido (Day-Lewis) seeking the amorous attentions of Carla (Cruz) above Luisa. Carla is decent, as far as all-around physical beauty goes, but Luisa has better curves. Both of the characters’ have imaginative dance sequences, but Luisa comes out on top even though her routine is less tantalizing.\r\n\r\nDay-Lewis is fascinating as the guilt-stricken director who hasn’t let his fame go to his head. When he asks a cleric for advice about God and his troubles, the vicar responds: “Imagination is God’s garden, don’t let the devil play in it.”\r\n\r\nI generally don’t favor musicals where the characters suddenly jump into song & dance while walking at the park or eating dinner. My wife & I sometimes poke fun of these kinds of musicals by mimicking them while doing mundane activities. For me, musicals only work, generally speaking, when the singing/dancing sequences are legitimate, like a performance at a nightclub or one's imagination, both of which were used in \"Chicago.\" Of course it’s more challenging and takes more creativity to incorporate song & dance routines in this manner and keep the movie seamless & realistic. “Nine” does this.\r\n\r\nThe film runs 1 hour, 58 minutes and was shot in Italy and England.\r\n\r\nGRADE: B", "created_at": "2018-12-13T18:50:59.032Z"}]