[{"movie_id": 243940, "review_id": "5985ae8ac3a36874ed02125c", "rating": 7.0, "review_text": "Well, it's not terribly original with some obvious connections with Frankenstein and other horror films  of that type but I enjoyed it overall. It was quite scary in places and even though the scares were quite contrived for the most part, it did make me jump at times. The special effects were quite well done but could have been expanded a bit more. I gave it 3 1/2 stars.", "created_at": "2017-08-05T11:39:54.825Z"}, {"movie_id": 243940, "review_id": "59fe12c8c3a36867f6024ca6", "rating": 6.0, "review_text": "**The stimulated brain terrorising!**\r\n\r\nActually, this film was made before 'Lucy', but released after that. So I first saw that and now this. Basically, these two films are similar thematic, except the genres are different. I liked Scarlett's film, a very much enjoyable. This film too looked nice, and watching it after that makes to understand it better. I meant scientifically, rather than a supernatural way. So what's extra in this was the usual horror film style jumpy scenes, with loud and sudden sounds.\r\n\r\nLimited cast, and one day event based film. Not a bad writing or the direction and performances. The settings were perfect, and the film did not require strong graphics. The story followed a small medical researcher team who is working on a serum that brings the dead back to life. When their entire work was ceased by the company they were working for, they decide to recreate everything to prove its theirs. Then something goes wrong, following a series of destruction before it all ends.\r\n\r\nLike I said, it was more a science-fictional thriller than your regular horror film. But it borrowed the same style to present on the screen. The events are simple to understand, except that scientific thing. Because there won't be any difference for those who are weak in basic science. It'll be another normal boring horror flick. For me, it's an average film, watchable for once being short and well paced narration.\r\n\r\n_6/10_", "created_at": "2017-11-04T19:19:36.077Z"}, {"movie_id": 243940, "review_id": "6352fd1ec99826007abb6002", "rating": 5.0, "review_text": "**The Lazarus Effect showed some promise but couldn’t decide what to do once the horror began.**\r\n\r\nThe Lazarus Effect had a decent premise - scientists attempting to discover a method to resurrect the recently deceased are forced to test their new experimental treatment on one of their team after she dies in an accident. Only she doesn’t come back the same. She returns sinister, malevolent, and murderous. That concept with a production company like Blumhouse and a cast boasting Olivia Wilde, Donald Glover, and Evan Peters made me think this had to be a solid horror flick. Unfortunately, it didn’t live up to my hopes. The writers of Lazarus Effect couldn’t decide the rules for their own movie. Is evil Zoe battling with the darkness trying to take over, or just evil? Is she superpowered? Is she demonic? Is she preying on the others or just twisted? The script never seemed to figure out what they wanted the character to be. With Zoe being the central focus and character, the failure to solidify and develop her character sunk the rest of the film. Still not the worst. I liked the open ending with the terror multiplying for a potential sequel, but with a mediocre response to this film, a sequel will never happen. The Lazarus Effect doomed itself never to be resurrected.", "created_at": "2022-10-21T20:12:14.783Z"}]