[{"movie_id": 316152, "review_id": "584463ee9251416b2600bcb2", "rating": 8.0, "review_text": "**A country that existed for a brief time in the history of American.**\r\n\r\nOnce again, it proves that the critics are so dumb. In this people to people and people to filmmakers contact era, no one listens to them. Let them do their own sideshow. This was partially based on the real events that takes place in the following years of 1862. When America was fighting a civil war, a man named Newton Knight returned home from the battlefield where he started to help the farmers who were robbed by the armymen. Its like they are fighting their own war, to protect the land and the crops. They knew the consequence and so they were prepared for it.\r\n\r\nThis is over a two hour long film and I think they had covered everything nicely. At some stage it looked like the Daniel Craig's 'Defiance'. But it reveals many events like changing time and the atmosphere, how they adapted to it along to move on. In the opening scene only they had shown us the war, but very soon it moved away to tell what's happening off the battlefield. Like how it's affecting the people. So the resistance emerges and the days going by they gain large power in the region. Very interesting perspective, though everything in the film was not true despite overall plot was inspired by the history.\r\n\r\nMatthew McConaughey alone steered the ship. You will like his performance. The locations were good, but most of them were either farmland or swamp. There's a little event that follows the 80 years later, just to disclose some court law debate over interracial marriage. Not a must see film, maybe if you are an American, then it might be, but other than that its a good watch. I hope the people would realise that and watch it.\r\n\r\n_8/10_", "created_at": "2016-12-04T18:43:58.232Z"}, {"movie_id": 316152, "review_id": "5fbe7207323eba0040fce6fd", "rating": 9.0, "review_text": "Quality film.\r\n\r\n<em>'Free State of Jones'</em> tells the true story of Newton Knight's role in the American Civil War. As you'd hope/expect, it leads to captivating viewing. Matthew McConaughey is superb, while he's supported excellently by Mahershala Ali.\r\n\r\nIt's tough to watch in large portions given the obvious things from the Civil War era, from the war itself but also to slavery. I had never heard of Newton Knight, so it was very interesting for me to see it unfold and learning bits - even with some creative license, I'm sure. It also serves an important message that slavery didn't end with the Emancipation Proclamation.\r\n\r\nI personally found the film very well paced and extremely nicely shot, McConaughey and Ali are the stars but there are also notable performances from the likes of Gugu Mbatha-Raw. It's a great film, one that's worth a watch. Sadness and heart aplenty.", "created_at": "2020-11-25T15:02:31.380Z"}]