[{"movie_id": 53182, "review_id": "53bc178ac3a3686638002411", "rating": null, "review_text": "Thought this movie was pretty good when I wasn't expecting too much from the bad ratings and reviews I'd seen. I was pleasantly surprised at the storyline, and the visuals and battle scenes were pretty epic. Overall I would say this is worth a watch but don't expect too much from the film. The original is better but this is a worthy follow up.", "created_at": "2014-07-08T16:08:42.991Z"}, {"movie_id": 53182, "review_id": "53d49a140e0a2628380036a4", "rating": 6.0, "review_text": "This is one of these movies which will always have its detractors because it is not historically correct. There are certain movies in which you expect a certain amount of historical accuracy and there are certain movies where you do not. This is one of the latter. You must be out of your mind if you ever expected any great deal of historical accuracy from this movie (or any Hollywood production nowadays for that matter). Therefore it pains me to see the reviews that slams this movie with a one-star rating and moans about how it is screwing with the (their) history. I would certainly not call this a great movie but, as a movie, it is far from the one-star range.\r\n\r\nThe movie is watchable, it is even somewhat enjoyable to watch but it is not really a great and epic movie. There are lots of action which is one of the good parts. Some of the scenery, especially the naval ones, are quite magnificent even though they are somewhat overdone in the usual Hollywood way. The bow waves make these heavy, wooden, oar-powered ships look like they are speeding ahead at 30 knots for instance.\r\n\r\nThe action is of the rather gory and blood splattering type. Given all the slow motion scenes with copious amounts of blood slowly floating in the air I would assume this was more out of intention than out of ignorance although the ease by which these ancient swords chopped through bones and necks seemed rather unbelievable. I do not mind blood and gore in my movies but I have to say that the blood and gore in this movie seemed to have taken precedence over the rest of the creative process.\r\n\r\nThe movie simply failed to inspire the awe that one would expect an epic movie of this type would do. Someone said that the movie played out a lot like a video game and to some extent that is true. I never really felt much for any of the characters when watching the movie. I found myself just waiting for the next action scene. The enjoyable part of this movie is really the action, the scenery and the effects, not the story or the characters.\r\n\r\nThe movie is watchable, even enjoyable depending on your expectations but far from great.", "created_at": "2014-07-27T06:20:04.463Z"}, {"movie_id": 53182, "review_id": "545fe5850e0a261fb9009b05", "rating": 4.0, "review_text": "Did they really have to do a second movie?\r\n\r\nMore of the same but with lack of innovation and talent. The story is predictable and unconnected, the same than the battles.\r\n\r\nStapleton's character doesn't have the same power in screen than 300's Butler's.\r\n\r\nProbably, the only thing to save is Eva Green although I think she is walking a path in which she is not gaining points to perform in better future movies.", "created_at": "2014-11-09T22:07:01.956Z"}, {"movie_id": 53182, "review_id": "58a809149251415691004592", "rating": null, "review_text": "Turgid sequel with a towering performance by Eva Green at its center.\r\n\r\nMake no mistake, she dominates this movie and lays scorched earth wherever she goes. The male cast members flex and grimace with all they've got but when Green is on screen she is all you look at.\r\n\r\nIt's definitely one of the best performances in a bad movie I can recall.", "created_at": "2017-02-18T08:43:00.994Z"}, {"movie_id": 53182, "review_id": "6445f448b54002048e26c525", "rating": 1.0, "review_text": "**A very expensive video game made for people who have never been to war, without any basis in true historical facts, and which almost insults the history of Greece.**\r\n\r\nA few years ago, I wrote a short text for the movie “300”, which I found repugnant and an insult to anyone who knows the slightest bit about Greek history. Unfortunately, Frank Miller's graphic novels show that, for him, History is not important. I didn't expect these films to be documentaries, but the amount of exaggeration and absurd anachronisms is unbearable. When I studied Greek History in college, I had to read a very complete book on the subject (among others, but this one particularly impressed me). I would love to be able to use it to slap Miller and the producers of this movie.\r\n\r\nThe great – and only – redeeming quality of this film is its visual exuberance, achieved at the expense of colossal amounts of CGI to great effect, which amplify the fight scenes to the extreme and give the film the appearance of an extremely expensive video game. The use of slow-motion and some sound effects serve to amplify the battle and give it a glorious, choreographed, fake look. I usually say that only those who have never had to participate in a war will like war... after seeing such homoerotic attraction for war, and for naked athletic bodies spurting blood, I am pretty sure that, in this film, very few went through a real war.\r\n\r\nSullivan Stapleton and Eva Green are the only two actors who deserve some attention here, and this is due to the protagonism of their characters, fictional and carnivalesque versions of two historical characters: Themistocles and Artemisia. Lucky for both actors, there wasn't much concern to be historically accurate: Themistocles and Artemisia were older than these two actors. He was, above all, an Athenian politician with a lot of public experience at the time of the events of this film, while she was a queen, the widow of the Satrap of Caria. And contrary to what the movie says, she didn't command the Persian fleet, although she was one of the main commanders.\r\n\r\nAs I said, the film is full of historical inaccuracies: the Persian Wars began with the annexation of Lydia by Cyrus the Great, Persia's first Achaemenid monarch. Included in the conquest were the cities of Ionia, culturally Greek and subject to Lydia. They tried to separate with the support of Athens, but Emperor Darius won them, going against the Athenians. It is then that Themistocles appears, defending the creation of an Athenian fleet capable of facing the Persian, and that Marathon is won, the work of his political rival Miltiades. Darius dies (of natural causes, forget the movie) and Xerxes succeeds him. This was followed, as is known, by the Battle of Thermopylae, where more than 1,400 Greeks died (and not just the famous 300). At the same time, the Battle of Artemisium was fought on the seas, in which Themistocles stopped the Persian fleet. Xerxes makes his way to Athens, which is hastily evacuated by sea before the Persians sack and burn the city. It is Themistocles who then decides to pretend to be a traitor and suggest to Xerxes a decisive attack on the Greek fleet in the Bay of Salamis. There, under cover of a tight bay, the quality of the Greek ships proved decisive.\r\n\r\nWhat gave the Greeks victory was not glory, empty heroism, muscles or six-pack abs. What gave them victory was intelligence, choosing able leaders when it was vital, and choosing military tactics that well balanced the invader's numbers. There were many Persians, but their troops were no match for the Greek phalanx covered in steel (they didn't fight in underpants, as the film shows!): unlike the Greeks, the Persians didn't wear metal armour, they had shields made of plaited wicker and carried, essentially, archers, slingers, short-spear spearmen and a lot of cavalry. Likewise, the Persians had a lot of ships, but their quality was very poor when compared to the Athenian and Corinthian galleys. The Greek victory was essentially a triumph of technique and intelligence over brute force and numbers. And this movie doesn't tell us about that.", "created_at": "2023-04-24T03:15:20.095Z"}]