[{"movie_id": 454992, "review_id": "5b714bc39251414064185bae", "rating": 7.0, "review_text": "Nothing new but still a delight.", "created_at": "2018-08-13T09:13:39.034Z"}, {"movie_id": 454992, "review_id": "5c43fa679251412beedd12e7", "rating": 5.0, "review_text": "Not good, for sure, but way exceeded my expectations.\r\n\r\n_Final rating:★★½ - Not quite for me, but I definitely get the appeal._", "created_at": "2019-01-20T04:34:47.692Z"}, {"movie_id": 454992, "review_id": "63d4df1312b10e0093e76757", "rating": 8.0, "review_text": "I suspect I enjoyed this movie than most people. I tend not to watch spy movies or action films if I can help it. Most of the time when I do, it is because they have a humorous slant. This one certainly has that. As with most serious action movies these days, however, there is a rather large body count here, to the point where it seems almost cartoonish, as if the dead people all are going to spring up and go fetch an anvil or stick of dynamite or something to try to finish off the coyote (Wait a minute, don’t a couple of characters actually do that?).\r\n\r\nThe two main characters have a great chemistry and play off each other well. If I had read a description first, I would have guessed that Kate McKinnon would be the dumped character, but she is wonderful in the loose cannon role of Morgan, so there was a correct move. To a lesser extent this film also serves as a pastiche of the tried and true “Don’t trust anybody” serious spy films. And it is a rom-com also, though a rather abnormal one.\r\n\r\nThere are a few holes in the plot, such as Morgan using a cell phone shortly after stomping both of their phones to death at the airport, but sometimes you just have to let the art flow over you, as Nick says in The Big Chill. (“I think the guy in the hat did something terrible.”) And no, it isn’t believable that these two women would have such an instant instinct for mayhem and murder, but if details like that don’t keep you from enjoying it, perhaps you need to gather a few of your most fun friends, buy a 12-pack, and start watching.", "created_at": "2023-01-28T08:38:43.209Z"}]