[{"movie_id": 333669, "review_id": "581cf67ac3a3681ed100117e", "rating": 6.0, "review_text": "**One wrong move made a small time thief a target.**\r\n\r\nThe first thing is this film came at the worst time in the history of France. If it was set in elsewhere in the world would have had less issue, but the Paris terror attack and this theme had lots of similarity. I mean it was nothing to do with the incident, but the contents are very impactful. Which also might be the reason for the film not doing well. I did not enjoy much this film, for me it was the story that turned me off. It was sympathetic to terrorists in the first half, so I completely hated that part, and then the last 30 or so minutes it got better. I mean not awesome or like that, but just good.\r\n\r\nDirected by 'Eden Lake' famed director. Another very familiar story, but altered like it was for the first time in a film. So most of the parts are predictable, but one twist during the beginning of the third act made it look good. Amazing pace, it just keeps getting bigger and bigger going forward. But as we know, those developments were so clichéd. All the actors were okay, and it has some decent stunts as well. I think it is a good timepass film and nothing else..\r\n\r\n_6/10_", "created_at": "2016-11-04T20:58:34.362Z"}, {"movie_id": 333669, "review_id": "6376726a11c06600c8004654", "rating": null, "review_text": "Well this just goes to show that you can put two hot blokes in the same film, set it in Paris, add some car chases and pyrotechnics - and still end up with a dud. Richard Madden (and his terrible attempt at a Nevada accent) is \"Mason\" an accomplished pickpocket who manages to get himself embroiled in a bombing. Spotted by CCTV, he is soon the quarry of the CIA's \"Briar\" (Idris Elba) before the latter realises that he is not their protagonist and that it is best the pair unite to thwart the real terrorists who are using a campaign of civil unrest to mask their real criminal intentions. James Watkins actually manages to keep the pace of this moving along quite well, but the story is far too thin and there is precisely no chemistry on screen between the gents, or between anyone and \"Zoe\" (Charlotte le Bon) who is also mixed up in all this mayhem. Eye candy can really help a film, and to a certain extent it does here but otherwise this is a standard made for television thriller that is light on just about everything. The condescending tones of the CIA in their dealings with their French counterparts was rather irritating too - no wonder Americans are not always overly welcome in Europe! If this was either man pitching to be the next Daniel Craig, then I'd not give up the day job.", "created_at": "2022-11-17T17:42:02.651Z"}, {"movie_id": 333669, "review_id": "6598a84e0d11f201a50685f5", "rating": 7.0, "review_text": "Pretty good, for what it is. <em>'Bastille Day'</em>, or <em>'The Take'</em> for us in my neck of the woods, is a sound action thriller that suitably entertains.\r\n\r\nIdris Elba has played this sorta role many a time but there's no doubting how strongly he performs in such films. He and co-star Richard Madden are sporting distracting (at least to someone who knows them more for their native tongue) accents, but are a solid pairing... their (admittedly somewhat minimal) buddy cop-esque banter isn't the best, though.\r\n\r\nElba also appears in the end credits singing... not to great effect, I gotta say. Don't get me wrong I know that guy <a href=\"https://www.youtube.com/watch?v=2Qa5gB1tWK4\" rel=\"nofollow\">can very much do music</a>, it's just that <a href=\"https://www.youtube.com/watch?v=0WShPOyXyW4\" rel=\"nofollow\">this song</a> is, erm, not his strongest work, let's just say that.\r\n\r\nIt's largely predictable, though it does things in a manner that kept me interested and enjoying what I was setting eyes on. So it gets a pass from yours truly.", "created_at": "2024-01-06T01:09:34.727Z"}]