[{"movie_id": 187596, "review_id": "53d6cb1ac3a3683a2000014a", "rating": 1.0, "review_text": "Director Steven Brill’s last film was my least favorite movie of 2013 (Movie 43), so expectations were not exactly sky high for Walk of Shame. At first glance, the comedy starring Elizabeth Banks appears to be a mix between The Hangover and Anchorman. Unfortunately, it lacks the jokes or the charm that the former two films had.\r\n\r\nAfter having her boyfriend leave and thinking she lost a once-in-a-lifetime job opportunity as an anchor in a major station, Meghan reacts as any young adult would, by getting sloppy drunk and engaging in a one night stand. After a successful night, she wakes to find out that she’s now the top candidate for the anchor job, she just needs to get to work on time. \r\n\r\nForgetting her wallet and phone, Meghan proceeds to embark on the longest walk of shame ever.. On the way, she makes unlikely friends and goes through zany adventures to make it to the newsroom in time for evening news. That was the intention. Instead, Walk of Shame is a misogynistic, racist, unfunny escapade that fails to bring anything new to the comedy genre.\r\n\r\nThe issue with the film is that the derivation of humor stems from how different Meghan is from everyone else. Early on, Meghan encounters three black men, and sure enough she’s scared that they’re drug dealers evading the cops. Not only is her character racist, Brill’s perspective encourages the audience to be racist. It turns out that these guys, Scrilla, Pookie, and Hulk, are nice gentlemen that’s willing to help Meghan. This is suppose to be funny. The contrast from the expectation of how these gangbangers would act towards an attractive white woman and how the it plays out in the movie is suppose to be hilarious. These presumptions just come off senselessly offensive.\r\n\r\nIt’s not an isolated incident either. Meghan encounters an angry foreign taxi driver, a bunch of incompetent cops, and most damaging, the film paints Elizabeth Banks’ character as a bumbling idiot. Foreigners can’t be trusted, minorities are stereotypes and women are useless, Walk of Shame is an embarrassing concept built on damaging assumptions.\r\n\r\nPoor writing, unoriginal jokes and predictable characters are just icing on the cake for this crude attempt at humor. Steven Brill will have the audience leaving the theaters in a walk of shame with this one.\r\n\r\nRead more reviews at artisticritique.com", "created_at": "2014-07-28T22:13:46.487Z"}, {"movie_id": 187596, "review_id": "5f0e8d759672ed0036473d4a", "rating": 6.0, "review_text": "Decent watch, probably won't watch again, and can't recommend.\r\n\r\nIt's not that it's a bad movie: I'm not a big Elizabeth Banks fan, and you get a lot of her, like 90% of the movie is just her being abused by the world, with very little triumph along the way.  The rest of the movie is basically everyone else in the world forcing, manipulating, and validating her, and it would have been a better experience if she was a stronger character.\r\n\r\nI get (and it's very obvious, very early) that the point is that she's a weak character that is forced to grow through the adversity of this adventure.  I just would have rather seen someone stronger (think American Lara Croft for a moment) run a similar formula of problem, attempt resolution, extraordinary circumstance, new problem, etc.  Hell make it a parkour movie where a free runner had a blackout night, basically \"The Hangover\" meets \"Mirror's Edge\" (video game).\r\n\r\nMy point is, that when you see something and want something else, you don't like what you have in front of you, even if it's a decent (but different) movie that you were expecting.  It an awful part of being human.\r\n\r\nWhile the humor is decent, the repetitive formula creates fulfilled expectation, which dulls the comedy.  It's also not very uplifting.\r\n\r\nI think it's fair to say that Elizabeth Banks is statistically attractive, in a cute dress, and is playing a character who is a local celebrity.  I've also been informed being a white woman is advantageous.  She's basically an ideal candidate to get charity help, except from people that are just as likely to kill her, but it pushes my suspension of disbelief that she isn't able to get people to talk to her, let alone actually help her.\r\n\r\nI'm just realizing that, having been stranded before, on multiple occasions, I may be being a little harsh, but it just doesn't make it as enjoyable for me.", "created_at": "2020-07-15T05:00:37.316Z"}, {"movie_id": 187596, "review_id": "5f11e83022e48000376808ac", "rating": 6.0, "review_text": "Test for https://www.themoviedb.org/talk/5f0e8dcbd9554b0035b11b82?page=1#5f0fc7de20e6a500339f7b7e\r\n\r\nPlease delete or disapprove this review as it was only to retest a bug.", "created_at": "2020-07-17T18:04:32.466Z"}]