[{"movie_id": 1635, "review_id": "52b7eaf019c2952853057045", "rating": null, "review_text": "I have watched this movie soooo many times already and I am still not tired of it. OK I confess I really am a big fan of \"Jordan Two Delta\".", "created_at": "2013-12-23T07:49:04.665Z"}, {"movie_id": 1635, "review_id": "5d88a7c0172d7f00274b209e", "rating": 7.0, "review_text": "Lincoln Six Echo and the Utopian Redemption.\r\n\r\nLincoln Six Echo is having vivid dreams about a past existence, here in this Utopian world he lives in, he's starting to question the function of his world. In this perfectly formed existence the inhabitants dream of winning the lottery, the prize? Relocation to an outside paradise known as The Island. After stumbling upon something sinister, Lincoln escapes with fellow inmate Jordan Two Delta, and now the consequences for both of them are as dangerous as it is for the rulers of this strange and intriguing place.\r\n\r\nIf you are entering a movie that is directed by Michael Bay then one can reasonably assume you know what you are going to get, cue explosions, ear splitting sound mix and a host of carnage set pieces. Bay's formula works and mostly his efforts have entertained the popcorn masses. So it's interesting to find that \"The Island\" does have some intellectual nous in amongst the Bayhem that the director is famed for. Working from a tantalising cloning story written by Caspian Tredwell-Owen (though the similarities to Robert Fiveson's \"The Clonus Horror\" resulted in a law suit being filed), \"The Island\" now more than ever is highly engrossing sci-fi in premise, where certainly the ethics of the story's core are worth scrutinising.\r\n\r\nOne of course can argue that Bay was the wrong director for such interesting material, and yes it's a point to note that the characters and plot arcs are not given any depth or a serious second glance, but really we are here for the bang to go with the buck are we not?. Ewan McGregor (Lincoln) and Scarlett Johansson (Jordan) play it just about right, the bemusement of their situation is coupled with daring do heroics, while suitably tongue in cheek performances come from Sean Bean, Djimon Hounsou and a picture stealing Steve Buscemi. This is not a film that is easy to recommend because it can frustrate as much as it entertains, but entertain it does, and with big screen TVs and glorious home cinema a staple requirement for the movie fanatic, \"The Island\" is something of an essential purchase - check out the highly octane outrageousness of the road pursuit here, it's fabulous through the speakers.\r\n\r\nA serious topic is given a nonsense sheen for sure, but hell what a blast it is. 7/10", "created_at": "2019-09-23T11:08:48.046Z"}, {"movie_id": 1635, "review_id": "5f1a362b2afb250034134a54", "rating": 8.0, "review_text": "Great watch, will watch again, and can recommend.\r\n\r\nEven though this is from 2005, it's amazing that when you have a futuristic world, it holds up over time as the 2020 new tech doesn't seem to matter as much, or you design characters that wouldn't have average technology, this sort of does both.\r\n\r\nEwan McGregor, Scarlett Johannson, Djimon Hounsou, even Sean Bean, Steve Buscemi and Michael Clark Duncan.  This has a great cast and clearly had too much money to work with.  There are all sorts of sci-fi effects, crazy constructed sets, and some really over the top action sequences for this premise.\r\n\r\nAnd this premise is excellent: a clone discovers he's a clone and makes an escape attempt, it's a race for survival.  The writing is excellently paced, and structure with a little too much of an establishing act, but it's useful and not boring, so that's still good.  The leads truly embody the characters, showing a line between ignorance and intelligence: they are ignorant of societal constructs but incredibly intelligent as they've spent the last 3 years attempting to escape a puzzle box.\r\n\r\nThe mechanisms to keep the pursuit of the fugitives going are all rather seemless, and there is open discussion of morality of the facility's actions by most of the cast without harping on about it.\r\n\r\nThere is science and action abound, please enjoy.", "created_at": "2020-07-24T01:15:23.609Z"}, {"movie_id": 1635, "review_id": "630029053e6f2b007d2718e9", "rating": 9.0, "review_text": "**With the right expectations, The Island is a fun action-packed sci-fi flick that is every bit Michael Bay and explosion filled as it should be.**\r\n\r\nI never understood the hate this movie gets. It's a Michael Bay movie to the core, which means you know there will be some insane action, incredible visuals, and there may or may not be a great story. But The Island does a decent job of making you care about the characters as they grow and discover who they are. The cast is excellent. The chase scene is one of the best you will see. It's a big loud over-the-top action blockbuster, but I guess this is a movie that rises or falls to your expectations. If you expect a Michael Bay action movie with some sci-fi influence, you will probably enjoy yourself.", "created_at": "2022-08-20T00:21:25.167Z"}]