[{"movie_id": 11866, "review_id": "643ebedbc6006d04ff80cf38", "rating": 2.0, "review_text": "This could be one of those \"so bad it's good\" movies some day.\r\nIt's a remake of the classic film about men in a hopeless situation when their small plane crashes in the desert. Hope comes back when one of the men reveals he can make an airplane, and the others believe him.\r\nIn such a story, the subplots and side stories make the story. Here, the subplots and side stories are cartoonish and contrived. The characters are totally without motivation. One can almost see the actors wince about being part of such a horribly written story.\r\nIn fact, one almost wonders if it was written for the purpose of some day being a \"so bad it's good\" story. I'm not sure. There really isn't any charm to this movie, no inspiration, no motivation, and that might be too bad to even make the \"so bad it's good\" list.", "created_at": "2023-04-18T16:01:32.029Z"}, {"movie_id": 11866, "review_id": "64f56b45e0ca7f012eb45a72", "rating": 5.0, "review_text": "I think to be fair to this reimagining of the story, it tries to be different from the 1965 version. They shift the location and update the dialogue and up to a point that gives it a fighting chance. A plane gets caught up in a sandstorm over the Gobi desert and crashes. It falls to the survivors to work out a plan before the water runs out. Sadly, though, aside from the efforts from Giovanni Ribisi as designer \"Elliott\" (and that's because at times he resembles Hardy Kruger) the acting is pretty woeful. Dennis Quaid ought to be commended for taking on the Jimmy Stewart role - that was never going to be easy, but he just hasn't the screen presence. The rest of the ensemble form an unremarkable bunch and John Moore's direction does little to deliver any sense of peril or desperation as their predicament gets worse and their personal relationships become more and more fraught. It looks ok, but in the end comes across as little better than an OK television movie that I questioned the necessity for.", "created_at": "2023-09-04T05:29:41.789Z"}]