[{"movie_id": 399404, "review_id": "5a5bcda39251413f650268f7", "rating": 3.0, "review_text": "I have no idea why people are raving about this film, it's a bit crap, it's probably Oldman weakest performance to date, and the cinematography is terrible. Churchill with Brian Cox in the lead role is a FAR superior film on the subject.", "created_at": "2018-01-14T21:37:39.110Z"}, {"movie_id": 399404, "review_id": "5a691ef59251414a1f007385", "rating": 6.0, "review_text": "As with many of the biopics I've seen recently, _Darkest Hour_ is more focussed on delivering you the facts than getting you involved with the characters. It is an interesting idea to have the majority of the story revolve around the of whether or not to sue for peace. That as a core concept in so much as the question of \"Do I take the guarantee of saving my country or do I take the risk of saving the world?\" and beyond that \"Is there even a right answer to that question? And who am I to decide something this big?\" is a great philosophical centre for a movie. But I never felt like I knew why any of these people had the answers that they gave. I get that in a historical context, these aren't characters they are real life people, so they answers they had are the answers we see, but again, we are only given the _what_, not the _why_.\r\n\r\nExcept you can throw all of that away because here comes Gary Oldman in his Oscar nominated transformation to make this movie 100% worth watching.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2018-01-25T00:04:05.805Z"}, {"movie_id": 399404, "review_id": "5d6693d39c24fc0017fac990", "rating": 7.0, "review_text": "It's 1940, and Hitler is attempting to take over Europe.  The film takes an interesting look at Winston Churchill's first five weeks as Prime Minister.  The acting in this movie is quite accomplished; good actors bring insight and depth to the characters.  Overall, it's a well-done, engrossing film.  Gary Oldman's performance as Winston Churchill was very good indeed, and his delivery of Churchill's speeches alone make watching the movie worthwhile!", "created_at": "2019-08-28T14:46:43.047Z"}, {"movie_id": 399404, "review_id": "5e5f73ce303c8500193e7459", "rating": 10.0, "review_text": "I saw this film at TIFF on the big screen and loved it. There's not a weak member of the cast. I really loved the way the photography reflected the sense of gloom that would have been felt by the people facing a new war. Big thumbs up, gives a strong sense of the time and place.", "created_at": "2020-03-04T09:24:30.632Z"}, {"movie_id": 399404, "review_id": "5eb3d6a2ccb15f002084fcc4", "rating": 10.0, "review_text": "Gary Oldman was superb as Churchill.", "created_at": "2020-05-07T09:36:34.018Z"}, {"movie_id": 399404, "review_id": "63b7895693bd6900de098acb", "rating": null, "review_text": "I thought I might have seen this a couple pf years ago, but I still enjoyed it. There have been a few movies about Churchill’s rise to power at the outset of World War II. This one seems to cover the least amount of ground, focusing on his thought processes, the political climate and his personal life leading only up to the beginning of the Dunkirk evacuation.\r\n\r\nI thought there were two things the film did well with its strong writing and actor portrayal: the first was to present Churchill, a larger than life character, as just a life-size person, with the foibles and weaknesses he carried around with him. The other strength was in building depth into some of the secondary characters. His new aide typist, for example, is ready to quit after Churchill yells at her unfairly. It would have been easy to rehabilitate him for that temper tantrum by having him soften towards her and convince her to stay on. Instead she leaves the building, is handed an important communication from the king, and decides for herself to stay on and do the job. Churchill is the focal point pf the film, but again and again he shares the limelight onscreen with others like this, such as the extended scene in the subway.\r\n\r\nSo within it’s narrow focus, I think the movie does a great job telling the story of this interlude from history.", "created_at": "2023-01-06T02:37:10.956Z"}]