[{"movie_id": 62215, "review_id": "63eca7308e8702007a1a8d66", "rating": null, "review_text": "this is nice movies and then best part of the the movies story is good.", "created_at": "2023-02-15T09:34:40.478Z"}, {"movie_id": 62215, "review_id": "6597f106ea37e0089c4bf6ba", "rating": 7.0, "review_text": "Ha! Rarely can a film have a more appropriate title nor can any marriage get off to a less auspicious start. Firstly, after a beautifully photographed and scored series of images of real planets colliding, we are presented with a loved-up couple \"Justine\" (Kirsten Dunst) and \"Michael\" (Alexander Skarsgård) stuck in an eighty-foot white limousine trying to navigate some country lanes to get to their own wedding. Arriving, eventually, on foot and very late we proceed to enjoy a brief speech from her mother \"Gaby\" (Charlotte Rampling) who declares that she has no time for marriage at all - a state of affairs largely arrived at due to some fairly irreconcilable differences with ex-husband \"John\" (Kiefer Sutherland). That does rather set the scene for an at times extremely potent look at just how depression sets in, takes hold and rules ruthlessly the lives of those it touches. This is most certainly not a joyous piece of cinema, but it most certainly an honest one - and both Dunst and Charlotte Gainsbourg as her new mother-in-law \"Claire\" deliver strongly and quite compellingly as we begin to appreciate the rather prophetic nature of the opening few scenes. Conflict is never far away, tempers flare - especially when \"Justine\" speaks her mind to best man and employer \"Jack\" (Stellan Skarsgård) and it's really only in the second part of the film - dedicated to \"Claire\" that a sort of calm befalls the proceedings, aided by the presence of the young \"Leo\" (a stabilising effort from Cameron Spurr!). Be prepared for a slow burn, nothing happens quickly - though it does happen quite powerfully - and I think this may well prove to be Dunst at her very best. Like most Van Trier films, it improves with viewings so I'd give it two or three goes and then I think you'll get more from these nuanced and well constructed - if deconstructed - characters.", "created_at": "2024-01-05T12:07:34.246Z"}]