[{"movie_id": 4147, "review_id": "5f08aa695e12000037e4713d", "rating": 8.0, "review_text": "Damnation Alleyway.\r\n\r\nWhen his son witnesses him enacting a hit, mob enforcer Michael Sullivan finds that the man whom he likened to a father has ordered a hit on him and his family. Too late to save his wife and youngest child, Sullivan goes on the run with his eldest boy and plots revenge along the way.\r\n\r\nHow refreshing to find a gangster movie in the modern age, more so, how refreshing to find a gangster movie set in the early 1930s and not involving foul mouthed Mafioso types. Directed by Sam Mendes and starring Tom Hanks, Paul Newman, Daniel Craig and Jude Law, Road To Perdition is an adaptation of the Graphic Novel that was brought to us by Max Allan Collins & Richard Piers Rayner. The film deals with themes of violence and its consequences and fathers and sons, set to a watery back drop during the Great Depression. It's also a pulse pinging treat of visual magnificence thanks to cinematographer Conrad L. Hall (his last film before he passed away). \r\n\r\nComparisons with great gangster film's of the past are inevitable, but Mendes' film has more in common with something like \"Eastwood's Unforgiven\" and \"John Ford's The Searchers\", the journey of the lead protagonist is fraught and telling, and motivated by circumstance. Yet the trick for first time viewers that Road To Perdition has up its sleeve, is that we don't know how it will work out for Hanks' Sullivan. It makes for a riveting experience with many transcendent rewards along the way.\r\n\r\nAs regards the cast, Hanks is a touch miscast, but his play off relationship with the quite terrific Newman gives the film some solid ground from which to launch the sombre story. Daniel Craig does a nifty line in weasel and Law convinces as a mouldy toothed hired killer who enjoys taking photographs of his victims. Pic has almost philosophical mediations on good and bad, and it's elegiacally drawn by Mendes. The melancholic mood is enhanced by Thomas Newman's musical score, where he reworks his \"Shawshank Redemption\" score for narrative tightness. \r\n\r\nThe film thrives as a poetic and atmospheric piece. The story might be basic, but it manages to rise above that because it be a superbly directed and well acted picture. One that just happens to be beautiful in spite of the bleakness that lingers on the main protagonist and the journey he undertakes. 8/10", "created_at": "2020-07-10T17:50:33.351Z"}, {"movie_id": 4147, "review_id": "6300168f7d41aa007e386f19", "rating": 4.0, "review_text": "**Overall : With so much going for it, The Road to Perdition is surprisingly disappointing.**\r\n\r\nAfter hearing Road to Perdition referred to as a classic multiple times, I was interested. Then seeing that it boasted a cast of Tom Hanks, Daniel Craig, and Stanley Tucci and that Sam Mendes directed it, I was even more intrigued. Finally, after seeing the trailer and its promise of some cool action scenes, I was excited to watch this movie! But sadly, The Road to Perdition greatly disappointed. I will be honest and say that this isn’t a typical movie I enjoy, but the film was long and very slow. The action scenes were few and far between, with almost every second of action showcased in the trailers. The ending didn’t surprise and left me even more frustrated as I watched the entire film. Not a fan.", "created_at": "2022-08-19T23:02:39.256Z"}, {"movie_id": 4147, "review_id": "640da737e18e3f07d054248a", "rating": 7.0, "review_text": "One should bear in mind that this is basically a mafia movie. I say that because it is presented almost as a dramatic coming of age story, which implies a different sort of story altogether. I mean, there is the coming of age element to it, but it is a brutal, violent film true to its mafia roots. For example, father and son feature strongly throughout, with details, backgrounds and character development. Mom and the brother are more like undeveloped pawns in the story.\r\n\r\nThe settings and photography are excellent, nearly worth watching the movie all by itself. I am not sure Tom Hanks is quite up to his usual high standard here, but it may be exactly what the director was looking for.\r\n\r\nI must day that once father and son stopped at a house for assistance, I knew how the movie would end, being a mini-morality tale and all, but I write novels in my spare time, so I am used to thinking about ending variations. The film would not make any of my top 10 lists, but I am glad to have watched this focused, atmospheric slice of noir.", "created_at": "2023-03-12T10:19:35.180Z"}, {"movie_id": 4147, "review_id": "64f42ec37d41aa011b88e7f0", "rating": 7.0, "review_text": "Tom Hanks is \"Mike\" - enforcer for the \"Rooney\" family headed up by patriarch \"John\" (Paul Newman) with his wayward son \"Connor\" (Daniel Craig). When an interrogation goes fatally wrong, the father is furious with the son, who then attempts to have \"Mike\" and his entire family murdered. He manages to save himself and his teenage son \"Mike Jnr.\" (Tyler Hoechlin) but his wife and his other young son are killed - so he determines on revenge. This is probably my favourite film from Sam Mendes and it is certainly my favourite featuring Hanks. Though a bit slow off the mark, the tension builds well as the fleeing pair develop their bond whilst fleecing the mob, exacting their revenge and the youngster learns to drive. There are a few undercooked efforts, however - not least Jude Law's almost comic-book \"Maguire\" and Newman features but sparingly, but in the main the characters develop and grow and the father son relationship matures engagingly until a last fifteen minutes that I felt rather disappointing. The writing is a shade pedestrian, and the narrative a bit too predictable, but it looks great: the attention to detail, the cars, the costumes and the whole style of the film give it an authenticity that I really enjoyed.", "created_at": "2023-09-03T06:59:15.055Z"}]