[{"movie_id": 617653, "review_id": "617c453acb6db50042afa7de", "rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/the-last-duel-spoiler-free-review\r\n\r\n\"The Last Duel became one of my favorite Ridley Scott films, boasting a commanding Jodie Comer who delivers one of the year's most emotionally powerful performances.\r\n\r\nAdam Driver, Matt Damon, and Ben Affleck all offer remarkable interpretations, but the actress fully embodies Marguerite de Carrouges' courage amid so much pain and suffering in a theme-heavy, brutally shocking true story.\r\n\r\nThe perspective-based narrative structure is interesting and efficient enough to overcome its inevitable repeatability issues. Holding technical attributes that will surely get recognition in the awards season - especially Harry Gregson-Williams’ score - the actual duel is one of the most nerve-wracking sequences of the last few years, compensating the audience's patience with a satisfying climax.\r\n\r\nWatch it on the big screen, if possible.\"\r\n\r\nRating: A-", "created_at": "2021-10-29T19:02:18.724Z"}, {"movie_id": 617653, "review_id": "61f04186c5ada500cd8d0cb9", "rating": 8.0, "review_text": "**Analysis and Explanation at Spotamovie.com** - The Last Duel is a story of friendship, love and betrayals. But also of violence, war and weak justice. So even if it tries to focus on the role of women within society in the Middle Ages, the film presents crucial topics and a particular narrative structure. And we think this is a hazardous solution by Ridley Scott and his team, but somehow, it makes sense. And we are going to explain to you why in our analysis. The film is based on a true story, and reveal the courage of a woman who defied a nation and made history. - **The Story** - Two old friends, Sir Jean de Carrooges and Jacques Le Gris, found themselves fighting each other in different aspects of their lives. As a result, their military career takes different paths, as well as their social status and lives. Therefore, they build a story of envy, jealousy and betrayals that will change their stories forever. But why? The movie will provide you with three versions of the truth, and we have the challenging role of understanding who is lying. A gorgeous, highly educated woman will make things harder between the two old friends, Marguerite de Thibouville. What is going to happen? For which reasons a duel will be necessary? And who is Marguerite? - Full Analysis at https://www.spotamovie.com/the-last-duel-movie-review-and-analysis-2021-movie/", "created_at": "2022-01-25T18:29:26.733Z"}, {"movie_id": 617653, "review_id": "62405954706e56008bd25e6a", "rating": 7.0, "review_text": "There is definitely something of Kurosawa's \"Rashomon\" (1950) in the compelling watch that Sir Ridley Scott has stitched together here, depicting well, as it does, the rather pyramidical feudal system that provided the legal and cultural structure of life in 14th century Europe. The film centres around allegations made by \"Lady Marguerite\" (Jodie Comer) that during the absence of her war-hero husband \"Sir Jean\" (Matt Damon) she was subjected to the unwanted attentions of powerful squire \"le Gris\" (Adam Driver). By way of a legal presentation to King Charles VI, the narrative now presents us with three equally plausible tales of just how these events may have unfolded. A tale of the initial friendliness between the men and of the ambition, greed, politics and fickleness that led to their current predicament. I cannot say that Damon is particularly good, nor is the blondly coiffured Ben Affleck particularly impressive as their overlord \"Pierre d'Alencon\", but both Driver and Comer offer us strong and characterful performances as each of their stories are rendered to the Court. The different versions are largely the same, there are but subtle and nuanced variations that you might, were you to be on a jury, have to identify and evaluate - in the end there are no forensics, there is no evidence as such - it is all about whom you believe. Again, this makes the film more interesting. It's not just whom you believe, but whom you want to believe, whom you think you ought to believe. There is the powerful church to consider; the local lords - decisions cannot be made according simply to any \"rule of Law\" or \"code of chivalry\". The duel - letting God decide - is the culmination (we see this at the very start of the film before our deliberations begin), but the cleverness of Scott and the writers here is to present us with as near facts as they can - we are left to make our own assessment. We are left to look at the way in which land and people - high born, or otherwise - were pawns in a game knowingly, or otherwise, that frequently became matters of life or death. The photography reminded me a little of the recent \"The King\" (2019) in that the filthy, muddy, damp and rat-infested conditions in which even the grandees lived are presented authentically and that adds loads to the overall feel of the film. The weather being often cold and wet, the battles being fierce and bloody - all of this contributes well to the strong visual imangery. It is a long film, but I found the episodic nature carried that rather well and the last twenty minutes are certainly worth sticking around for.", "created_at": "2022-03-27T12:32:20.957Z"}]