[{"movie_id": 150689, "review_id": "55ba5eebc3a3684af1004ad4", "rating": 7.0, "review_text": "> Probably the best live-shot Cinderella I've seen.\r\n\r\nDisney has done it again. Everybody knows Cinderella story and what this film gave was as it is with the help of modern CGI works. When I heard about the Disney's live-shot version is getting ready, I had a serious doubt, but not anymore. Nowadays, the filmmakers know how to pull it off a big budget movie with ease. Especially from Hollywood, if one market fails, it will raise in another as the recent example was 'Age of Extinction'. I am glad this movie met a great success despite it was not a surprise material as a story, but was as the quality of product.\r\n\r\nThe movie runs nearly for 100 minutes, that does not feel too long as the narration had a wonderful pace. Everything was awesomely handled by the director of 'Thor'. It's a new era of the live-shot movies, which borrows the stories from the fairytales, folklore and classical animations. Recent 'Maleficent' was one of the great examples and this film as well enters the book of triumph.\r\n\r\nLily James was very good, I haven't seen her much, because she's kind of a new actress in the spotlight. She's cute and adorable, I love to see her in many movies in the future. While Cate Blanchett, I never had any disbelief in her and she delivered it perfectly. An ideal movie for a family to watch at the weekend. I think children would love it, so at least watch it for them, with them.\r\n\r\n7/10", "created_at": "2015-07-30T17:29:15.252Z"}, {"movie_id": 150689, "review_id": "5f582a914e6742003829cb62", "rating": 6.0, "review_text": "Good watch, could watch again, and can recommend.\r\n\r\nI'm honestly concerned that this isn't a movie that anyone is going to watch again and again, but it's a solid watch, and a definite improvement over the 1950 animated classic, though I can't say this touches \"Ever After\" for me.\r\n\r\nThe original story was somewhat lacking, but had fantastic animation for the time, along with voice acting and writing parallel with the movies of its time.  I'm somewhat sad to say that is a fair difference in quality compared to modern standards.\r\n\r\nDisney very much kept this dumbed down for younger audiences, and I expect them to have more fun with scenes like \"lizard footman eats a fly\", but in the very least they steered away from realistic cg talking animals (a creepy factor in many of the live action remakes), though they do make a very specific nod to it at the beginning of the movie.\r\n\r\nWhile I do think they managed to improve on almost ever facet of the original, it certainly isn't without flaws.\r\n\r\nThe casting is all over the place, which, I'm sure, affected the odd character development.  Oddly, the less important characters, the men, in this case, are fine, I really have zero to say other than I rather like Nonso Anozie in anything he's in, and I did think the bit about \"Kit\" was a rather inspired thing.\r\n\r\nI understand that Kate Winslet has had a villainous kick the past few years, and she plays \"stuck up snoot\" very well, but seeing Helena Bonham Carter come in to give us \"the fairy godmother who ain't got time for dat\" really makes me wonder if they just weren't paying her enough to care.  It would have made more sense to let Winslet elevate the fairy godmother (one of the only things that really wasn't) and let Carter goes Bellatrix Lestrange as the Wicked Stepmother.\r\n\r\nSophie McShera did a marvelous job of making me hate her character, and Holliday Grainger kept making me see Katherine Heigl if we could keep her away from tanning beds, so they both did a marvelous job as wicked stepsisters (honestly, probably the best performances of the movie).\r\n\r\nFor some reason though, they made a very strange decision to make all the wicked women gingers, though not with a very convincing dye job.  I don't know if it was supposed to be representative of their tacky fashion and the ability to dye hair at the time, or if Disney really thinks gingers don't have a soul, but it was a blaring message, if illegible.\r\n\r\nWhat makes me think that they don't care at all is Lily James.  She's lovely, she did a good job with the role as written, and I'm dying to see her in anything else to see if any of the oddities were her, or she's done just as good as Winslet with the roles they were given.  \r\n\r\nCinderella is traditionally a \"fairest in the land\" look, given that it's the middle of Europe, I imagine northern was exotic once upon a time, or at least certain people thought so she is traditionally very blonde and very fair.  Lily James is neither (in this, despite some of the posters), so I thought they were taking a more Germanic look with a more honey colored hair....but it is also very oddly colored, and perhaps we wouldn't have notice if it wasn't for her very prominent BLACK eyebrows (which I have nothing against, I actually think they're lovely) which would have been simple enough to die to match.  Alternatively they could have abandoned blonde altogether (plenty of versions do).  It is just very odd to spend millions of dollars to do something purposefully (and repetitively) to make it look like they don't care and objectively make their movie worse.\r\n\r\nOverall, it's this sort of attitude that seeps into the movie at different points.  It could have been a masterpiece, but instead, everyone knows it's a guaranteed paycheck on the title alone and made something that ends up being rather average despite itself.", "created_at": "2020-09-09T01:06:25.817Z"}, {"movie_id": 150689, "review_id": "5fb064cb202e1100411d9e8e", "rating": 7.0, "review_text": "An improvement on Disney's past attempt from 1950.\r\n\r\nI do like the animated version from the studio, but this 2015 release of <em>'Cinderella'</em> makes for a more enjoyable experience in my eyes. Lily James and Richard Madden are smart choices to play Cinderella and Prince, while Cate Blanchett is impressive as the Stepmother. Helena Bonham Carter (Fairy Godmother), Stellan Skarsgård (Grand Duke) and Nonso Anozie (Captain) are also noteworthy.\r\n\r\nThe premise has a few changes, the ending plays out slightly differently compared to the '50 production - to positive effect. It also makes the nastiness of Blanchett's character unmistakably clear, I actually felt hatred for her - which wasn't the case, at least to the same extent, with the original.\r\n\r\nGood viewing.", "created_at": "2020-11-14T23:14:19.144Z"}, {"movie_id": 150689, "review_id": "614ff886aaf897008f227cd4", "rating": null, "review_text": "The best reviewer of Cinderella (2015) might be a child, for its message of kindness and courage wrapped in the Disney classic and illuminated through the eyes and smiles of Lily James (Ella), Richard Madden (\"Mr. Kit\"), Haley Atwell (Ella's mother) et al. calls out the beauty and virtue of child-like simplicity.  I think the great accomplishment of Lily James is her non-verbal communication of this central theme to \"have courage and be kind\" in the midst of the vicissitudes of life, just as Cate Blanchett's non-verbal communication of jaded bitterness masterfully supplies the melancholy contrast of devious conniving.   James brings love into her little world while Blanchett's legacy is her two spoiled rotten daughters played marvelously by Holliday Granger and Sophie McShera.  This remake brings a lot of humor to help get the message across-- primarily in Helen Botham Carter, the hairy Godfather, I mean, the fairy Godmother-- whose quirky kindness charms and delights.  The animals too, as Ella's constant companions, add to the humor.  The casting in this film utilizes the actors' talents quite well. I found myself watching this over and over again, at least parts of it, for the sheer joy of its message.  In a world of negativity, there is something very real about simplicity and purity, if only in a love fantasy.  \r\nA final note must be added about the music-- it contributes its share to the film's message most beautifully.", "created_at": "2021-09-26T04:35:18.570Z"}, {"movie_id": 150689, "review_id": "624181acc616ac0047854159", "rating": 6.0, "review_text": "Lily James takes the title role in this colourful telling of the original rags to riches story. Upon the death of her father, she finds herself little better than a skivvy for her acerbic stepmother Cate Blanchett and her ghastly daughters \"Drisella\" (Sophie McShera) and \"Anastasia\" (Holiday Grainger). Meantime, the handsome prince (Richard Madden) who appears to have had his breeches sprayed onto his body, is unhappy. His father (Sir Derek Jacobi) needs him to take a wife - but whom? Well, the fairy tale sets out the rest of the story and Sir Kenneth Branagh sticks faithfully enough to it. Helena Bonham Carter arrives to turn the pumpkin into a coach and... It's quite an adequate adaptation, this. The attention to detail is superb, a strong testament to the costumier's arts with a fine Patrick Doyle score (and a bit of \"Bibbiddi-Bobbiddi-Boo\") to accompany what is a well cast, and good looking film. There is certainly too much reliance on CGI, there's not a great deal of chemistry between Madden and James, and I could have done with a little more input from Blanchett, Sir Derek - and the entertaining Stellan Skarsgård as the \"Grand Duke\" but for the most part this flows along stylishly. The eagle-eyed amongst us might spot a young Josh C'Connor in an equally tight uniform, too! Is it Disney or \"Slipper and the Rose\" (1976)? Maybe a bit of both, but not so good as either?", "created_at": "2022-03-28T09:36:44.483Z"}, {"movie_id": 150689, "review_id": "624abcc48eda8700625a639c", "rating": 6.0, "review_text": "Lily James takes the title role in this colourful telling of the original rags to riches story. Upon the death of her father, she finds herself little better than a skivvy for her acerbic stepmother Cate Blanchett and her ghastly daughters \"Drisella\" (Sophie McShera) and \"Anastasia\" (Holiday Grainger). Meantime, the handsome prince (Richard Madden) who appears to have had his breeches sprayed onto his body, is unhappy. His father (Sir Derek Jacobi) needs him to take a wife - but whom? Well, the fairy tale sets out the rest of the story and Sir Kenneth Branagh sticks faithfully enough to it. Helena Bonham Carter arrives to turn the pumpkin into a coach and... It's quite an adequate adaptation, this. The attention to detail is superb, a strong testament to the costumier's arts with a fine Patrick Doyle score (and a bit of \"Bibbiddi-Bobbiddi-Boo\") to accompany what is a well cast, and good looking film. There is certainly too much reliance on CGI, there's not a great deal of chemistry between Madden and James, and I could have done with a little more input from Blanchett, Sir Derek - and the entertaining Stellan Skarsgård as the \"Grand Duke\" but for the most part this flows along stylishly. The eagle-eyed amongst us might spot a young Josh C'Connor in an equally tight uniform, too! Is it Disney or \"Slipper and the Rose\" (1976)? Maybe a bit of both, but not so good as either?", "created_at": "2022-04-04T09:39:16.312Z"}, {"movie_id": 150689, "review_id": "63001bf23af929007d8c2b41", "rating": 6.0, "review_text": "**Beautiful and bland at the same time.**\r\n\r\nThe story that's been told 1,000 times. Although this retelling boasts the most impressive costumes and stage design with an excellent cast, there is not much else to set it apart. Everything is familiar, draining some of the magic from this classic story.", "created_at": "2022-08-19T23:25:38.880Z"}, {"movie_id": 150689, "review_id": "6480f2ee64765400ad81215b", "rating": 6.0, "review_text": "I liked the live version way better then the animation one. Well acted and was surprisingly entertaining.", "created_at": "2023-06-07T21:13:18.939Z"}]