[{"movie_id": 839369, "review_id": "6474dad39408ec010026773b", "rating": 8.0, "review_text": "<b>INT. MOCKING-MOORE - DAY </b>\r\n\r\nMay December is an excellent satire with incredibly dark themes at times. Portman's Elizabeth is an actress tasked with researching her next role, a movie based on the massively dramatised life of <i>Julianne Moore's</i> character. Moore and Portman shine in their roles, and both can create believable characters whilst still pushing the unbelievable humour and situations they are put in. Portman, mainly with her fascination with making an actual 'true-to-life' performance as <i>Gracie</i>, copies her quirks and tendencies, providing the audience with laughs. \r\nPrimarily the humour lies in the dark aspects of the film. The funniest, without spoiling, Gracie's relationship with her husband. It continuously evolves over the film, and we finally reach a satisfying conclusion. It's interesting how the comedy-drama has the best character arcs out of all of the dramas that premiered at Cannes. \r\nOverall, <i>May December</i> lands on both feet, standing tall against the competition. Satirical, well-acted and entertaining. \r\n\r\n<b>FADE OUT</b>", "created_at": "2023-05-29T17:03:15.771Z"}, {"movie_id": 839369, "review_id": "653163c06f8d95014d6a2bd2", "rating": 7.0, "review_text": "This actually reminded me a little of \"All About Eve\" (1950) as television actress \"Elizabeth\" (Natalie Portman) arrives at the home of \"Gracie\" (Julianne Moore) about whom she is to star in a biopic. Initially welcoming of her and keen to help, we follow the changing dynamic as we learn that \"Gracie\" has quite a past, and that her husband of 20-odd years, \"Joe\" (Charles Melton) is considerably younger than her and there was quite a furore when they first hooked up that saw the older woman incarcerated. The more she finds out, the more involved \"Elizabeth\" becomes and the more immersed we all become in this quite compelling story of a taboo that rather broke a mould or two and is now surrounded by an atmosphere of hypocrisy, faux-friendships, and lemon drizzle cake. There is a strong, increasingly well delivered, competitiveness between these two women and Melton delivers quite strongly too as the young man who seems devoid of much purpose as he heads towards his forties. The script is quite tight, frequently potent and Todd Haynes's overall style of intimate direction genuinely encourages us to invest a little in one of the women - I didn't manage to invest in both, especially as the denouement loomed (perhaps just a little predictably). This film quite successfully presents us with quite an interesting character study that works both ways in their relationship - and is well worth a watch.", "created_at": "2023-10-19T17:13:36.172Z"}, {"movie_id": 839369, "review_id": "6560d3db2b113d00eba77ddb", "rating": 5.0, "review_text": "In moviemaking, there’s subtlety, and then there’s subtlety carried too far. In the case of director Todd Haynes’s latest, the filmmaker unfortunately indulges himself far too much in the latter. This story of an actress (Natalie Portman) who visits a middle-aged sex offender (Julianne Moore) to prepare for a role she’s about to play in a movie about her subject’s life never seems to find a footing to stick with and explore. The narrative examines many different aspects of the back story behind the lives of the characters to be portrayed in this pending production without ever really resolving any of them by the time the credits roll. This includes not only the protagonist’s reasons for pursuing her once-underage husband (Charles Melton) – actions that got her jailed and made her fodder for countless tawdry tabloid cover stories – but also the nature of the actress’s real motivations in conducting such an excessively intense in-depth study of her character. In the process, virtually everyone comes across as somewhat unsavory, and, considering that the truth is never clearly revealed about any of them, it begs the question, why should we care about any of this? The film depicts all of this so subtly that it goes beyond nuance, veering into the realm of enigmatic, thereby further reinforcing the notion of why any of us should care. Ironically, these underplayed elements are in stark contrast to some rather obvious (and terribly trite) symbolism, particularly in images related to themes of transition and transformation. The picture’s inconsistent changes in tone don’t help, either, vacillating between allegedly serious drama and a seemingly underdeveloped desire to break out as an exercise in full-fledged camp (which, by the way, probably would have made this a much better offering). The script’s meandering flow and glacial pacing also don’t help, leaving viewers scratching their heads more often than not as to where this story is headed. In the end, all of the foregoing is ultimately quite unfortunate, because there’s definite potential in this project, but it’s never adequately defined and fleshed out. Leads Moore and (especially) Portman turn in admirable efforts to make this material fly, but they simply don’t have enough to work with to make that happen. While there appear to be allusions to themes like the difficulty involved in dealing with long-buried feelings and the fact that we may never be able to adequately grasp the truth behind them (either as outsiders looking in or as active participants in the midst of such dealings), the cryptic handling of those ideas undermines whatever meaningful messages or cinematic value they might have, making all of this seem like just such a big waste of time. Director Haynes has an impressive filmography behind him with such releases as “Poison” (1991), “Far From Heaven” (2002) and “Dark Waters” (2019), but, regrettably, “May December” certainly can’t be counted as part of that list.", "created_at": "2023-11-24T16:48:27.272Z"}]