[{"movie_id": 10790, "review_id": "58a396259251414b2c000393", "rating": 5.0, "review_text": "I am honestly surprised that this film got such a high rating on this site and many other sites, for that matter. It seems like I may be one of the few who didn't like it and even though \"The Abandoned\" is a watchable horror/drama flick that can be mostly appreciated for the nice imagery, I mostly found it redundant and tedious. To me, it was like an hour and a half of pointless sequences and bogus scares and while I do appreciate creative and artistic dark imagery, it can become ineffective when the story is not held properly. I mean, directors like Dario Argento can get away with plain stories, pointless sequences and underdeveloped characters... because he makes his films entertaining and puzzling. Nacho Cerdá, on the other hand, cannot. flawless and the setup is brilliant as well, but the movie still doesn't work. Why? because it's tedious! I'm pretty sure that several \"serious\" movie lovers will claim that people who think this film is dull, it's because they are untrained watchers who can only appreciate torture porn and fast-paced films with a lot of action. Well, it's really not my case, because I actually have great tolerance for low-paced films. The low-pace, in several films serves a purpose, but not with this film.\r\n\r\nIn \"The Abandoned\", a film producer named Marie, who lives in the United States with her young daughter, goes back to her homeland in Russia, when she is informed that she has inherited an old house from her parents. Unfortunately for her, the place is situated in the middle of nowhere and Marie is not exactly familiarized with the Russian language or the culture in general. Without having a clue of anything, she intends to visit the place anyway with the help of a guide, who disappears in the middle of the night under strange circumstances. Completely desperate and with no one else to turn to, Marie starts looking for her guide, without realizing that something is waiting for her out there: Secrets from the past, that have been waiting for over 40 years, and that she's about to discover in the worst possible way.\r\n\r\nThis was really a great disappointment for me. I was expecting a promising story, exploring a family drama and all I got, was the same worn out plot about the impossibility of escaping fate and our past (I think we had enough of that silliness already). I guess \"The Abandoned\" is overall watchable. Definitely not a masterpiece, but still not the worst movie ever. A movie that is going to be appreciated mostly by people who are in favor of those long and unnecessary situations that lead to nothing whatsoever and video-game sequences that don't add anything at all. By the way, the story supposedly takes place in Russia, even though it was actually filmed in Bulgaria and they didn't do a very good job hiding it. It's not the first time that a movie supposedly takes place in one coun", "created_at": "2017-02-14T23:43:33.053Z"}]