[{"movie_id": 228150, "review_id": "545b80510e0a261fb6001e59", "rating": null, "review_text": "April, 1945. As the Allies make their final push in the European Theatre, a battle-hardened army sergeant named Wardaddy commands a Sherman tank and his five-man crew on a deadly mission behind enemy lines. Out-numbered, out-gunned, and with a rookie soldier thrust into their platoon, Wardaddy and his men face overwhelming odds in their heroic attempts to strike at the heart of Nazi Germany.", "created_at": "2014-11-06T14:06:09.065Z"}, {"movie_id": 228150, "review_id": "58c17284c3a3687da8005ebb", "rating": 7.0, "review_text": "'Fury' has fantastic set pieces. The special effects are incredible and the sound is brilliant. The film is very gory and there are lots of explosions and body parts flying all over the place.\r\n\r\nI could tell that the movie was trying to follow in the footsteps of 'Saving Private Ryan' by stealing a lot of the characters and trying to recreate the depth and heart of that film. However, it didn't realise that 'Saving Private Ryan' took a lot of ideas from old war movies and paid homage to them whilst delivering awe-inspiring and moving scenes of battles.\r\n\r\n'Fury' did not have this. A lot of the dialogue and interaction between characters was laughable. The romance that tried to be thrown in at the middle of the film did not work and just seemed bizarre, The characters were one-dimensional and just seemed like walking stereotypes. The film felt more like 'Tropic Thunder' than 'Saving Private Ryan'. \r\n\r\n'Fury''s lack of long shots of the landscapes and battles meant that the film did not seem as vast or beautiful as other films of the genre.\r\n\r\nHowever, the action scenes were very well done and it was exciting and superbly directed.\r\n\r\n★★★½", "created_at": "2017-03-09T15:19:32.166Z"}, {"movie_id": 228150, "review_id": "5adad958c3a36803fa0051d1", "rating": 4.0, "review_text": "I knew that quite a few people had complained about the realism in this movie even though it hold high ratings on most movie sites. I was hoping that the complaints were mostly nitpicking like wrong model of Sherman tank and such like. Well, I am afraid that it was a bit more than that. I would say that this movie is clearly written by some Hollywood writer sitting in his comfy chair and never ever having been close to any military activities, not to mention live action, in his life.\n\nI can live with a movie being inaccurate or somewhat unrealistic if the rest of the movie is good but I have to say that I did not really like the movie even after trying to filter out the unrealistic nonsense.\n\nThe movie is very dark and gritty and there are really no likeable characters in it whatsoever. Well, the clerk that got thrown in as a tank machinegun gunner was perhaps somewhat likable but then him getting assigned as a tank machinegun gunner in the first place was one of those nonsensical bits. In this movie the “heroes” are not really any better than the Nazis. The scene where “Wardaddy” forces previously mentioned clerk to shoot an unarmed POW is just disgusting. I am sure this is not too far from reality in some cases during the war but I’ll be damned if I am watching a movie to be entertained by it.\n\nHaving said that I must also say that the movie was very well done in terms of acting and cinematography with one exception. The ridiculous overuse of tracer bullet effects. Tracer bullets do not look like you are in a Star Wars movie and yes I have been using tracer bullets during my military service, obviously unlike the producer and consultants (if they had any) of this movie.\n\nThe pacing of the movie was somewhat uneven. Some of it was fairly fast paced but then some parts, like the part in the apartment of the two German women was quite slow and somewhat dull.\n\nThe “last stand” at the end was just silly and nonsensical. It started pretty much right away when the poor clerk spots the arriving German infantry just using his eyes. Then it just takes forever until they actually arrive so our “heroes” have all the time in the world to prepare. There would of course be no way for a lone Sherman to hold off an assault like that and the Germans would of course not be charging around shooting useless fine caliber weaponry against said Sherman. Also when they had all this time to prepare why the f… did they leave some of the ammo outside the tank? Obviously because some dumb scriptwriter thought it would make for a good scene. And do not get me started on the fact that the Germans apparently just stops in their tracks every time the director thinks it is time for some slow scene inside the tank.\n\nThe ending? Well I do not like bad endings and this one certainly did not give me any feeling of reward for having suffered through over two hours of this movie. Needless to say I am a tad disappointed.", "created_at": "2018-04-21T06:25:28.613Z"}, {"movie_id": 228150, "review_id": "5b32ab53c3a368533200efbc", "rating": 8.0, "review_text": "WWII through the eyes of a Sherman tank crew\r\n\r\nRELEASED IN 2014, \"Fury\" details the exploits of 'Wardaddy' (Brad Pitt) and his Sherman tank crew during the final month of the European theater of World War II. A meek new guy who knows little about tanks, Norman (Logan Lerman), joins the crew and must learn to kill. Making a final push into the heart of Nazi Germany, the Fury crew makes a heroic stand when their tank breaks down. \r\n\r\nWriter/director Dick Ayers wrote the screenplay for 2001's excellent \"Training Day.\" In \"Fury\" he successfully shows the soldiers’ view of WWII through the eyes of a Sherman tank crew. I know of no other war film that sets out or accomplishes this; Oddball and his crew from \"Kelly's Heroes\" (1970) perhaps comes closest.\r\n\r\nI mainly judge films by whether or not the story keeps my attention. After all, what good is great action, thrills and incredible special effects if the story (or the way it's told) is dullsville, like, say, \"The Mummy Returns\" (2001) or \"Man of Steel\"(2013)? \"Fury\" kept my attention from beginning to end and the characters are all memorable. Speaking of which, the three remaining crewmembers are 'Bible' (Shia LaBeouf), 'Coonass' (Jon Bernthal) and 'Gordo' (Michael Peña). \r\n\r\n'Bible' is fittingly an evangelical who strives not to lose his spirituality while brutally annihilating people in the name of war, whereas newcomer Norman is a mainline Christian (Episcopalian). A handful of scripture passages are quoted during the course of the movie, including a couple near the end by Wardaddy. This is an interesting revelation because Wardaddy has become hardened by the war after three years fighting from North Africa all the way to the nucleus of the Nazis. This implies that he was a devoted believer before the war but only a glimmer of his former spiritual affection remains. There are other quality character bits interspersed throughout the film, like how annoying drunk bastages may not be so bad once they sober up.\r\n\r\nBeyond the above, the film offers the typical tragic insights about the nature of war. The long final stand in the last act may be unlikely, but it makes for a heroic and thrilling ending to a war movie (yes, it's a MOVIE, not a friggin' documentary). At the end of the day \"Fury\" arguably ranks with the best WWII movies, like \"Where Eagles Dare\" (1968), \"Enemy at the Gates\" (2001), \"The Eagle has Landed\" (1976), \"Bridge on the River Kwai\" (1957), \"The Dirty Dozen\" (1967), \"The Thin Red Line\" (1998), and \"Inglourious Basterds\" (2009). As far as comparing it to the overrated \"Saving Private Ryan\" (1998), the first half hour of that movie is great, but the rest of it leaves much to be desired (remember the lame dog tag sequence?); \"Fury\" is leagues better IMHO. \r\n\r\nThe melancholic and moving score by Steven Price is a highlight. Alicia von Rittberg (Emma), Anamaria Marinca (Irma) and Jason Isaacs are featured in fairly notable roles. Speaking of Emma, the brief romance between her and Norman is decidedly forced, which is one of the few negatives of \"Fury,\" but I get the point of that sequence.\r\n\r\nTHE FILM RUNS 134 minutes and was shot in England. \r\n\r\nGRADE: A-", "created_at": "2018-06-26T21:08:35.401Z"}, {"movie_id": 228150, "review_id": "642a176aac8e6b0111c6740d", "rating": 9.0, "review_text": "This film is about a tank crew in WW2 that is going into the final days of the war and still facing Hell.\r\nThe characters are very credible, and this passes the ultimate test of \"credible characters in incredible circumstances\". \r\nThe five members each have a different level of humanity, from the novice to war who still has total humanity down to the one tank crew member who is a total brute. Yet even he has some humanity left in him, but he hardly shows it.\r\nThe other three are the tank commander (Brad Pitt), who handles brutality of war with objectivity, his second, who handles brutality by trying to be right with God, and the other one uses comedy to handle it.\r\nI've been in the military, and it is quite common for \"clerks\" to be tossed into war like cannon fodder, because that is what \"clerks\" are viewed as being by everyone else, from officers down to the one stripers.\r\nIn fact, the clerks are considered to be the most disposable members of the forces. \r\nWe know that today. People didn't always know it in WW2.\r\nThe final self sacrifice at the end seems a bit much, but when you take into consideration that it's a spare of the moment decision, and mistakes are made with quick decisions, it's plausible. Not probable, but plausible.\r\nAlso, the final battle scene with five men doing so well against an incredibly larger force; well, that is sold to us by the amount of smoke around the tank, and the fact that if you are on the other side, surrounding the tank, you wonder if you are shooting at your own teammates across from you. \r\nI think it would have been a better movie if the five soldiers all just abandoned the tank and tried to walk back to safety, but that's just me.\r\nOther than that, it was an exceptional film that passes all the tests.", "created_at": "2023-04-03T00:01:46.826Z"}, {"movie_id": 228150, "review_id": "64ebc276c613ce00c9f2c1b4", "rating": 8.0, "review_text": "Very rarely am I able to enjoy a movie just as much as I did during my initial watch, but this film genuinely took me back to my grandfather's couch in 2015. The cast was amazing, with Jon Bernthal's performance standing out the most to me. Brad Pitt, Logan Lerman, & Shia LeBouf also were great in this movie, as this was arguably one of the greatest collective casts of that year. I initially was a little let down by the cinematography, but as the movie progressed it definitely recovered. Characterization is another thing that stands out significantly in this movie. Grady (Jon Bernthal) is probably the best example of this, though the depth given to Boyd (Shia LeBouf) & Trini (Michael Pena) through their characterization was amazing as well. The final aspect of the film that I loved was the dialogue. Though it wasn't Game of Thrones, the ability to bring depth, characterization, symbolism, and so many others things to the story through dialogue was very well done.\r\n\r\nThis is one of David Ayers greatest pieces of work and I highly suggest this movie!!!", "created_at": "2023-08-27T21:39:02.460Z"}]