[{"movie_id": 258230, "review_id": "59ac9cef925141078a039845", "rating": 7.0, "review_text": "**An alternate way to confront the reality.**\r\n\r\nBased on the British novel, made by a well known Spanish director. This film might remind you the titles like 'Finding Neverland', 'Where the Wild Things Are', 'Neverwas' et cetera, but still it is unique. Particularly for the message it carried out. Many lines were awesome, inspiring for those whose world are crumbling down. Emotional, as well as one of the best recent children's films.\r\n\r\nThe story of a boy whose mother is severely ill. He starts to have weird dreams, following, an appearance of a tree-monster from the nearby cemetery. The monster is to tell a few tales and at the end of it, he has to tell the truth about his nightmares to him. So as the days go by, it becomes more challenging to him to confront the reality. He can't run away from all, but to face it and those are the remaining narration.\r\n\r\nWhile being a kid, they believe every fantasy tale have narrated to them. Even a picture of those tales would influence to have an imagination in their daily life activity. This film does not hide anything from the viewers just to bring a breathtaking twist at the finale. So, you would know what's happening, but why, is the puzzle to solve. Even that is not a hard nut to crack. Though the purpose of the film is to reveal how some children cope a tragic event in their life, like perhaps the film 'Before I Wake', with misunderstanding the words said by the grown ups to them. This is really a wonderful film for kids, as well as for adults. I Hope you won't miss it.\r\n\r\n_7/10_", "created_at": "2017-09-04T00:23:11.261Z"}, {"movie_id": 258230, "review_id": "62f873046e938a007a3b21d3", "rating": 7.0, "review_text": "This is a very enjoyable tale. It's targeted to younger viewers, and therefore the characters are not at all complex. In spite of that shortcoming from an adult's POV, the overall effect is wonderful and emotional. Definitely worth the time.", "created_at": "2022-08-14T03:59:00.291Z"}, {"movie_id": 258230, "review_id": "63851718a410c8007920d4f6", "rating": 4.0, "review_text": "**It's not a hateful or forgettable movie, but it's far from being lively or happy.**\r\n\r\nDespite its weaknesses, I confess I liked this film, and that maybe comes from the fact that it touched me personally. Being a film that is so focused on the pain of losing someone dear, on how a person faces situations of suffering and manages to digest it, it was a film that cost me a little to watch because I also lost a very dear person recently. I expected a more cheerful film with a more lively tone. That, yes, partially frustrated my expectations, and I believe that other people will also say the same. However, I cannot say that I hated what I saw.\r\n\r\nIn fact, the script focuses on a young teenager who has to live his day-to-day life, at school and at home, while mentally and psychologically preparing himself for the imminent orphanhood, as his mother is very ill and, we know it, will die soon. And in the midst of all this, he ends up imagining, in a very realistic way, a big monster that comes to visit him and that forces him to deal with the feelings he is feeling, and to deal with situations, and also with a grandmother with who has relationship problems.\r\n\r\nDirected by J.A. Bayona is a relatively average film. The script is predictable, the \"monster-tree\" is something we've seen in other films, but it's always a good idea, especially if it's supposed to be a wise and ancient monster, as is the case here. Lewis MacDougall is the young man who will have the lead role in the film, and he does it quite well, even though the script is not very demanding on him. I also enjoyed Felicity Jones' performance, even though the actress doesn't really have much to do. And I feel sorry for Sigourney Weaver, because she's a good actress in the wrong role. It was a massive casting error, and it would have been preferable to cast a genuinely British actress in the role, rather than an American with a notoriously faked accent.\r\n\r\nTechnically, the highlight obviously goes to the CGI, which is good enough and does an interesting job, especially in the scenes where the tree “awakens” to move and reveal its real appearance. I also liked the soundtrack, even if it's not the most memorable or interesting, and the cinematography, which does its job flawlessly. Liam Neeson was, once again, responsible for the voice of the monster. The actor is already a veteran of dubbing and has given voice to many fantastic characters in other films, so it was a sure bet for the production.", "created_at": "2022-11-28T20:16:24.654Z"}]