[{"movie_id": 44129, "review_id": "5476d686c3a368218d001240", "rating": 7.0, "review_text": "The story is quite flat and stereotypical. No ups and downs. Everything goes as expected and, of course, we have a hopeful positive ending for the needs of the US viewer.\r\n\r\nThe cast is impressive and direction, cut and performances are OK.", "created_at": "2014-11-27T07:45:10.645Z"}, {"movie_id": 44129, "review_id": "5e21da7d397df0001298770e", "rating": 6.0, "review_text": "The Company Men calmly reflects a recessive economic climate through a downsizing company. Financial stability is the sole craving in everyone’s life. The upper class. The middle class. Every class. The notion to which one will never encounter the fear of losing their personal possessions and their career position. Corporate employees specifically seek the solidity in their salaries, to be able to provide for their own pride and families. When the economic recession devastated the States last decade, its impact was critical. Innocent workers essentially lost their lives, driving themselves into the descent of debt.\r\n\r\nWells’ well-intentioned drama explores the collapse of a shipbuilding corporation, following various employees that have been made redundant and/or steering the metaphoric sinking ship. It’s an off-beat peculiarity that forces Wells’ direction to be enticing and inadvertently unappealing simultaneously. The characters themselves, particularly Marketing VP Walker, HR Manager Wilcox and CEO Salinger, are insufferably narcissistic. Walker especially who envelops himself in pride, given the immense financial loss he encounters that prevents him from fully supporting his family and being able to play at luxurious golf club houses. The response to his firing, whilst natural in the sense that he refuses to release the life that he leads, abnormally thinks more about himself than his family. The overwhelming aura of egotism, not just from him, constrains these characters to be unlikeable.\r\n\r\nYet the peculiarity in Wells’ execution is that, despite the vehement behaviour, there’s a sympathetic undertone throughout. Not because you relate to the characters, but the scenario instead. Wells delicately leaves several moments to hang, simmering on a bed of dismissal, that forces you to position yourself in the characters’ shoes. With that in mind, he manages to transform the unappealing characteristics of these employees and turn them into tolerable motives. Slowly but surely, through enduring perseverance, opportunities are tackled. And that’s exactly the purpose of The Company Men.\r\n\r\nIt illustrates the tenacity of the human spirit during uncertain times. The orienteering session being a prime example of depicting this motive. Anyone who has been in a situation such as redundancy will relate to this film for its situational representation, not for its characters. That’s no criticism on the acting though, as each performance is competently given without resorting to melodrama. Cooper in particular gave a nuanced and credible performance, that left his character’s fate somewhat unpredictable.\r\n\r\nMy main issue however is the scope of The Company Men. Instead of focussing on just one employee, Wells’ decided to explore the entirety of GTX’s corporate ladder. Whilst harmless for its narrative structure, it did downplay the severity of the recession. Almost making light of the national economic declination. Solely following one employee through this hard time would’ve produced greater character development whilst also tackling the recession from each angle. Wells’ intentions were clear, just didn’t entirely work for me on an emotional level. Fortunately Deakins’ cinematography consistently entranced with his beautiful autumnal shots, but that’s not surprising let’s be honest.\r\n\r\nMuch like precariously balancing on the corporate tightrope, The Company Men occasionally stumbles with its peculiar narrative and character choices yet seemingly gets the job done with assured performances and a heartfelt motive. Remember, remain positive even in the darkest of moments.", "created_at": "2020-01-17T16:02:05.906Z"}]