[{"movie_id": 97020, "review_id": "53943385c3a368641d002a13", "rating": 6.0, "review_text": "I must confess that, when I sat down to watch this movie, I was prepared to be disappointed. Well, it was not as bad as I feared but I was not really impressed either. There are some good parts in the movie and, of course, the special effects are more up to todays standards. However it lacks a lot of the appeal, the over the top gory violence and the cartoonish wow-factor that the original has. I guess it is because they wanted that silly PG-13 rating in the hope of raking in more cash. It is not the first time Hollywood greed have ruined a good movie unfortunately.\r\n\r\nThe beginning of the movie is not bad. Taking out Murphy with a simple car bomb was rather disappointing though. Again here the movie lacks the gritty and brutal aspect that the original had. The parts where Murphy is awaken in the secret(?) research and manufacturing facility and him freaking out when discovering what he as become was enjoyable.\r\n\r\nThen it really starts to go downhill in what I usually refer to stupid Hollywood scripting. Ten minutes before Robocop is about to make his public debut then they do a huge info dump into his brain? That is just so poor unintelligent scripting. Of course it went to hell.\r\n\r\nThe special effects are quite okay but again the scripting is just nonsense. Most of the time this highly intelligent combat cyborg is just rushing straight into the fire blasting away like some Terminator/Rambo wannabe. Sure it makes for some good firefights but it is still poor scripting.\r\n\r\nThen the ending. What was that? I do not refer to the actual ending where Murphy, luckily, prevails but the part after that with the TV-presenter (or whatever he was in the end) rambling on about traitors etc. That was just there to show the audience that they hoped to do a sequel but the nonsensical outburst did not really much sense. Actually I thought that those TV-presenter scenes where generally just a nuisance.\r\n\r\nOn the whole it is not really a bad movie but it is sorely lacking the appeal of the original. Too a large extent this is due to it being reduced to a teenage no-rude-language-please type of movie lacking the dark and gory aspect of the original. The poor script doesn’t help of course. I am not sorry that I spent time watching it but the feeling afterwards where a bit…meh.", "created_at": "2014-06-08T09:57:25.595Z"}, {"movie_id": 97020, "review_id": "54387bb40e0a266fdc00024b", "rating": 4.0, "review_text": "Decent remake with well done FX and with quite an impressive cast that keeps a proper level... but flat.\r\n\r\nNo only it doesn't contribute anything new to the prior movie but also lacks on humor and deeper psychological insight.", "created_at": "2014-10-11T00:37:08.562Z"}]