[{"movie_id": 299534, "review_id": "5cbf94670e0a266b96fba5ef", "rating": null, "review_text": "The epic Marvel Saga that started over ten years ago has been building up to the inevitable clash with the powerful tyrant Thanos (Josh Brolin).  Last year’s “Avengers: Infinity War” set the stage for the highly-anticipated conclusion; “Avengers: End Game” and at long last it has arrived.\r\n\r\nPicking up shortly after the events of the last film, the Avengers must deal with the aftermath of what Thanos has done. The team is naturally divided between wanting revenge, wanting to set things right, and just wanting to take what they have and go on. \r\n\r\nAs time passes and they struggle to accept the reality of their situation; an unexpected individual returns and with them comes the seeds of a new plan to make things right. Naturally Tony Stark (Robert Downey Jr.) is skeptical but eventually warms to the possibilities of the idea thanks to a new scientific breakthrough that makes it possible.\r\n\r\nInspired, Tony sets out to put an elaborate plan in motion that will allow the team to try to fix things and to stop Thanos once and for all.\r\n\r\nWhat follows is an extended and at times nostalgic heist where various members of the team work to assemble the pieces needed for the plan as they believe they only have one chance to make things right.\r\n\r\nThe film is essentially three acts in one. The first deals with the recap and expansion of their situation and the planning. The second act is basically a heist where action and comedy are blended with some touching moments.\r\n\r\nThis all leads to the final act which is the FX laden set piece where the ensemble cast gathers to fight the forces of evil in a battle to save the Universe.\r\nThe film is epic in scale and length as it clocks in at over three hours but the movie is filled with so much content that the time goes by quickly and you have a hard time believing three hours have elapsed.\r\n\r\nIt is also a difficult film to review as you cannot recap elements of the film in any great detail without giving away elements that are sure to delight the fans. Suffice it to say that my only real issue with the fil and it was minor; was that it took a while to get to the action but at least there was plenty to keep you entertained along the way.\r\n\r\nAs this phase of the Marvel Film Universe winds down and plans are put in place for the next five years; “Avengers: End Game” is a satisfying conclusion to the epic saga that was started many years ago and weaves elements of many of the past Marvel films into an entertaining tale which features all of the best elements that have made the series of films such big hits.\r\n\r\n4.5 stars out of 5", "created_at": "2019-04-23T22:40:39.757Z"}, {"movie_id": 299534, "review_id": "5cc07fa00e0a2615fdf464d3", "rating": 9.0, "review_text": "Hey, so, just some really quick thoughts I wanna get down, 'cause it's after 1 o'clock in the morning, and I wanna get some sleep so I can wake up well rested to see _Endgame_ again.\r\n\r\nPutting it out there right from the get-go, _Avengers: Endgame_ is my favourite MCU movie. It's my favourite movie of the year too, but I've only seen like ten or so 2019 releases, and this is the 22nd Marvel Cinematic Universe film, so that seems far and away the bigger deal. I can't say it's perfect, there's some conflicting stuff within its own runtime that really doesn't seem to gel (though a re-watch may prove me wrong on that), and it's not like every moment was the no-holds-barred-zero-exception best version of that moment from start to end. But God I loved this thing.\r\n\r\nI will say this though, the reason that I loved it, is this thing is fan service galore. If you do not care for the franchise's 21 movies preceding this point, then _Endgame_ is not the movie to turn you around on that. That may come in a future installment, but this one is a culmination. It's the end of _Infinity War_ but also Phase 3, but also a wrap-up and genuine ode to/send off for everything that Marvel has done over the past 11 years. That to me was incredible, and I am eternally greatful, but I cannot imagine it working for people who have no vested interest in these characters.\r\n\r\nTo me though? My first 9 out of 10 rating in **three years**.\r\n\r\n_Final rating:★★★★½ - Ridiculously strong appeal. I can’t stop thinking about it._", "created_at": "2019-04-24T15:24:16.492Z"}, {"movie_id": 299534, "review_id": "5cc307bfc3a36809ab86e2fd", "rating": 10.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nDon't worry. This is going to be a pretty vague review. Right now, as I'm writing this sentence, I'm still processing what I saw and how am I going to explain how I felt without spoiling a single tiny thing. First of all, it's such a mix of feelings. On one hand, I'm extremely happy that I was lucky to be alive during this epic time and that I was able to follow these characters that I love and care about so much. On the other hand, I'm obviously sad that it finally reached the end of this (hopefully) first incredible saga. There are no perfect films and one with so many heroes will always have struggles balancing it all (Infinity War already had this issue). \r\n\r\nHowever, the Russo brothers did everything they could to deliver a phenomenal story, and they did. I don't think this could have been any better. Its last hour exceeds any expectations. It's epic, emotional, action-heavy, and it has one of my favorite shots in the entire history of cinema. It's pure magic, and the VFX team will surely get an Oscar for it. The action reminded me of the biggest Lord of the Rings' battles, and it was impeccably filmed, filled with riveting and chill-inducing sequences. Nevertheless, don't expect this high-intensity feeling throughout the whole runtime. The other two acts are a slow-burn build-up to a payoff that's going to make you pretty much either \"love\" or \"like\" this movie. I absolutely love it! \r\n\r\nThis is easily one of the best MCU films, if not my new number one. I can't deny that the 3-hour runtime has some unnecessary scenes, but even if they don't have a significant impact on the plot or even in the characters, they still contribute to the enormous build-up. Seeing this family that we grew up with just talking with each other or having lunch, at the same time that they deal with the consequences of Thanos' snap, is inexplicably captivating and heartwarming. Characters like Natasha (Scarlett Johansson) and Steve (Chris Evans) supporting each other is simply beautiful. Their comradery and chemistry are worthy of some tears here and there.\r\n\r\nSome people didn't really enjoy Infinity War so much due to the lack of screentime that some characters had. This time around, there are fewer characters to work with, so the balance is better. Everyone gets an important role, from Captain America to Ant-Man (Paul Rudd) to Nebula (Karen Gillan), and even Rocket (Bradley Cooper). Every single character has a major moment. If you take one out of the movie, it just doesn't work anymore. This is not only great work from the directors, but also from the writers. \r\n\r\nChristopher Markus and Stephen McFeely are not even going to be remembered because fans will always think of the cast first. Most of them will also remember the directors. But the writers?! If I stand at the door of the theater at the end of the film and question everyone about who are the writers, I strongly believe most of the audience won't know. Every dialogue, every sentence, every word carries so much impact on the narrative. Literally, I cried and got chills just by hearing two freaking words with the perfect timing in between. The amount of grief that the words of the ones who've lost everyone and everything carry is palpable and, for me, those are the most emotional moments of the movie: seeing how everyone is suffering from their own losses, not the deaths themselves.\r\n\r\nThe humor is mostly on-point, but it's still connected to my only real issue with the film, which is the second act's tone. From the moment the team decides what to do, we already know that this is a 1 in 14 million chance of success like Dr. Strange (Benedict Cumberbatch) said, so the stakes and pressure are massive! With this level of tension, I didn't expect such an “easygoing” and “funny” vibe throughout, except for one particular sequence. They do a great job once again of pairing up certain Avengers together, but most of them go through these too comedic plot points for such a crucial and serious mission. Fortunately, this act carries enough action and emotional drive to make this problem not that big of an issue.\r\n\r\nVisually, this is arguably the best-looking superhero film ever. From the mind-blowing visual effects to the gorgeous cinematography, everything is perfect. The costumes are gritty and muddy when our heroes are in a battle, their faces are all filled with blood, and I have no words to describe how jaw-dropping that last act is. I can't wait to change my desktop wallpaper once THAT shot is available. I dropped a single tear just by looking at it. No one talks, no one does anything. It's just an amazingly beautiful image. The score is epic as hell. So much that I'm listening to it right now as I'm writing this review, and I'm getting chills all over my body. \r\n\r\nI can't really write much more, to be honest. I will acknowledge the cast because they are brilliant. Each and every single member delivers an outstanding performance, but if I had to choose the ones that both surprised me and had the most impact on me, they would be Johansson's, Evans', and Robert Downey Jr's (Tony Stark / Iron Man). “New” characters like Captain Marvel (Brie Larson) blend seamlessly, and the payoff is unbelievably satisfying. In terms of predictability, it goes more or less as I expected, but it still carries a few surprises throughout. Nothing is ever like we imagine or theorize about, so expect the unexpected, and don't judge a movie by if it fits your crazy, unrealistic theories that never crossed the producers and directors' minds in the first place!\r\n\r\nAll in all, I don't know what to do now. The only thing I'm sure of is that I want to see it again, as soon as possible. The last hour is f*cking insane. I couldn't fall asleep properly because I couldn't stop thinking about it. Endgame surpasses all expectations. It's everything I wished for and so much more. I could easily spend a whole day at the movie theater and watch three sessions in a row. It's that good. One of the best comic-book films of all-time, without a single doubt. Thank you to Kevin Feige and everyone who worked hard to bring the MCU to where it stands now. I can't even think of how are they going to produce something at the level of Infinity Saga. Maybe they never will. Maybe we'll have to wait another decade or two for something like this. Until then, see you at the next Endgame screening! Enjoy! Oh and #DontSpoilTheEndgame!\r\n\r\nPS: it's not a perfect movie, I know. It doesn't exist one. Yes, Endgame has some issues regarding its pacing and tone, but I would be lying to myself if this isn't everything I dreamed of. I felt the same way with Civil War, regarding the rating to give, and I ended up giving it an A after a first viewing. As soon as I watched the second time, I changed it to an A+. I don’t need to wait for that second viewing with Endgame … And thank you to my audience for being incredibly respectful. No yelling, no crazy laughs, no stupid people doing stupid stuff. Thank you so much for not ruining one of the best cinematic experiences of my life!\r\n\r\nRating: A+", "created_at": "2019-04-26T13:29:35.406Z"}, {"movie_id": 299534, "review_id": "5cc5b3b1c3a36849368181c9", "rating": 10.0, "review_text": "okay so if your like me you questioned this movie due to the fact that i personally thought nothing could beat infinity war well after seeing it i can honestly say we have a new champion this was absolutley excelent so hilarious action packed the 3 hrs passes extremily fast my only thing is the use of god.... bothered me and i suggest if your offended by that wait till dvd so you can mute the parts also a reminder to parents 'no matter how bad you want to see the movie dont do like people in my theater did and bring your 3 year old 'but besides that awesome movie", "created_at": "2019-04-28T14:07:45.890Z"}, {"movie_id": 299534, "review_id": "5ccace3f0e0a262fb3fee8b3", "rating": null, "review_text": "We waited till day 5 of release in theaters. There was a slow start to the movie so i don't recommend taking little ones under the age of 10. After all the anticipation and hype,Avengers Endgame did not disappoint. Waa a perfect \"ending' to the series. Very well done", "created_at": "2019-05-02T11:02:23.563Z"}, {"movie_id": 299534, "review_id": "5cd7cf4ec3a3681d16c096ba", "rating": 9.0, "review_text": "These kind of movies are among the few movies that I can be bothered to go to an actual theater to watch nowadays. For most movies I just wait until they come out on disk (preferably Ultra HD Blu-ray if it’s available) and watch them on my home theater rig. So this weekend me and the kids went to the theater to watch Avengers: Endgame.\r\n\r\nI have to say that it was better, even much better, than I feared. I really feared that the SJW retards at Marvel would take this opportunity to completely re-organize the Marvel universe to their liking. Like how they completely ruined both professor Xavier and Wolverine in that abysmal Logan movie. Luckily, this did not really happen. Maybe the financial reality of their failing SJW comics and Disney doing a bit of culling of the most extreme of the Marvel retards, the ones who fail to understand that super hero movies are meant to entertain and not be their personal agenda channel, are starting to take effect.\r\n\r\nIt was actually a quite good movie with plenty of action, some humor and, of course, lots and lots of special effects. Even the story made somewhat sense, at least in the context of a Marvel movie, even though the writers resorted to time travel.\r\n\r\nThe movie starts of somewhat dark and grim but I guess that was to be suspected. It cheered up as it moved along and then ending … well to me at least it was mostly satisfactory.\r\n\r\nI was not too thrilled about the “new” Hulk although I warmed up to him a bit during the film. Thor? The less that is said about him the better actually. The rest of the merry bunch was in pretty good shape and I am quite happy that we did not get to see to much of Quill’s usual shenanigans. I really hate that character.\r\n\r\nI was quite positively surprised at the huge and quite cool battle towards the end. I was thinking, or rather hoping,  that at some time they were just going to reverse Thanos’ crap and that would be it but instead we get to watch another huge confrontation with pretty much everyone involved at the end. Very cool action and FX indeed.\r\n\r\nThere were some silly plot holes of course. As always when writers resort to time travel. An obvious one would of course be that, when they knew they only had enough Pym particles to complete one trip for each person why did they just not go back in time to get more the first thing they did? Especially since they later did exactly that. Also, Captain Marvel (in her new SJW hairdo) flies through a barrage of fire, smashes through Thanos’ ship like it was nothing and then struggles to combat Thanos himself? There were a bit of this silliness spread around but not too much for me to be bothered by it.\r\n\r\nThere were a few casualties of which I am saddened by two of them. I think at least one of them was unnecessary and probably agenda based. I also strongly disliked the rubbish with Captain America at the end. He has never been one of my favorite characters so I do not really care much about him being around or not but that rubbish sob-scene where he hands over his shield to a “politically correct” person was really unnecessary. I guess it must have been put there to appease the Marvel SJW retards.\r\n\r\nAnyway, my bottom line is that I was greatly entertained by this movie. It had all the good stuff, real super heroes, action, special effects and not too much of the crap that has been spewing out of Marvel the last years.", "created_at": "2019-05-12T07:46:22.833Z"}, {"movie_id": 299534, "review_id": "5ce3e58dc3a3683bd81e14bb", "rating": 10.0, "review_text": "Awesome!", "created_at": "2019-05-21T11:48:29.873Z"}, {"movie_id": 299534, "review_id": "5d1fb1e694d8a849843eb1e2", "rating": 6.0, "review_text": "***How can they possibly save half of all living beings in the Universe?***\r\n\r\nHow are the surviving Avengers & Co. possibly going to save half of the Universe that died? My wife & I had this discussion before viewing. It basically comes down to two options (assuming the events in \"Infinity War\" weren’t just a dream): magic or time travel. All I’ll say is: What they came up with was in ways reminiscent of the plot convolutions of \"Back to the Future II\" (1989).\r\n\r\n“Endgame” (2019) begins strong with the devastating reality of half of all living beings in the Universe suddenly vanishing. It starts to get lethargic about an hour in, but perks up with the three teams trying to apprehend the Infinity Stones so they can maybe reverse what happened at the end of the previous film.\r\n\r\nEverything naturally leads to a huge battle in the last hour that I found boring, not to mention that the epilogue tended to drag on with too much of it being tedious. Still, there are lots of worthy bits throughout, like the opening, the unpredictable first encounter with Thanos, Thor getting flabby, the moving match between Black Widow and Hawkeye at the cliff’s edge, and much more. \r\n\r\nUnfortunately, the myriad protagonists work against the film because it can’t concentrate on any one or two characters for very long. Captain Marvel is short shifted and decidedly dull. Plus the movie’s overlong at 3 hours, 1 minute.\r\n\r\nGRADE: B/B-", "created_at": "2019-07-05T20:24:06.417Z"}, {"movie_id": 299534, "review_id": "5dc32f3f9d893900183425f3", "rating": null, "review_text": "The amazing fight scenes and CGI aren’t enough to mask the fact that the overall plot of going back in time to change reality is just plain stupid and lazy - and this is addressed to the writers. I did know that there was gonna be some time travel involved, but the way Marvel explained and executed it didn't too well for me. They can't get away with just putting it all in \"Quantum.”", "created_at": "2019-11-06T20:38:23.541Z"}, {"movie_id": 299534, "review_id": "5dc38a0e99259c00157a95b0", "rating": null, "review_text": "Sure the final fight with Thanos is more than epic, but I expected more than that. I wanted substance and a plot that didn't rely on \"quantum\" for all the questions and explanations.", "created_at": "2019-11-07T03:05:50.406Z"}, {"movie_id": 299534, "review_id": "5dc393138d22fc00123d43d8", "rating": null, "review_text": "Sadly, I didn't enjoy this one as much as I did with the first \"Avengers\" movies.", "created_at": "2019-11-07T03:44:19.985Z"}, {"movie_id": 299534, "review_id": "5dc399489d89390015350e9e", "rating": null, "review_text": "Honestly, it felt like it was too much of a set-up for me. Having Antman isolated in the Quantum realm was just too convenient and it felt like Marvel was just looking for a foundation for the script they had for this movie that wasn't even as good as the previous ones.", "created_at": "2019-11-07T04:10:48.762Z"}, {"movie_id": 299534, "review_id": "5dc56e676f8d950010c2e33d", "rating": null, "review_text": "Needed more Dr. Strange action! Felt like the final fight scene with Thanos could've been choreographed a lot better especially when you have a magic caster who could dish out different spells like Dr. Strange. But alas, he was instead given the duty of holding off the impending doom from crashing down on his team.", "created_at": "2019-11-08T13:32:23.252Z"}, {"movie_id": 299534, "review_id": "5dc579d59c24fc0018bebb24", "rating": null, "review_text": "Not a big fan of the ending. But I guess when you have only 0.000000000001% chance of winning you can't expect it to be the best ending there is.", "created_at": "2019-11-08T14:21:09.928Z"}, {"movie_id": 299534, "review_id": "5de2a4e33faba000130a8805", "rating": 4.0, "review_text": "First of all, good popcorn movie, if you are hardcore fan of marvel or visual effect in general, this is a movie for you. \r\n\r\nHowever, it is clear that imagination of Marvel studio keeps deteriorating. The process and ending is clear about 10% into the movie. Zero development of character. Amateur plot twist. All cliche and low class humor. It is 21st century and they still cling on adult fairy tale and plain visual stimulation. The whole purpose is to let fans know what happens to the character. Good business investment but great shame to the art of movie industry. It is a blatant exploitation of grandpa IP with zero innovation. \r\n\r\nHero fantasy lived in half a century ago. Time to learn from modern Japanese manga and anime (I am not talking about One Piece or Naruto). Stop stitching up individuals from different background and call it a universe, it's laughable at best.", "created_at": "2019-11-30T17:20:35.974Z"}, {"movie_id": 299534, "review_id": "5e00e904d1a89300148c8561", "rating": null, "review_text": "The amazing fight scenes and CGI aren’t enough to mask the fact that the overall plot of going back in time to change reality is just plain stupid and lazy - and this is addressed to the writers. I did know that there was gonna be some time travel involved, but the way Marvel explained and executed it didn't too well for me. They can't get away with just putting it all in \"Quantum.”", "created_at": "2019-12-23T16:19:16.912Z"}, {"movie_id": 299534, "review_id": "5e00ee5f65686e0015977731", "rating": null, "review_text": "Great ending but I still can't get over the fact that the writers had to kill my all-time favorite Avenger, Iron Man. Still, it was a sacrifice that must be taken for the greater good. I love the movie!", "created_at": "2019-12-23T16:42:07.364Z"}, {"movie_id": 299534, "review_id": "5e010230d1a89300198cee67", "rating": null, "review_text": "I kind of expected Tony Stark to be the one to take the fall but what caught me off guard was Cap's decision to return to his original timeline. Man, I can take losing one main Avenger but two? It was just heartbreaking.", "created_at": "2019-12-23T18:06:40.837Z"}, {"movie_id": 299534, "review_id": "5e011acd65686e001398cfc5", "rating": null, "review_text": "That final fight with Thanos was epic! Great idea by the writers to have everybody be teleported back when Cap needed them the most. Officially the greatest superhero movie of all time!", "created_at": "2019-12-23T19:51:41.971Z"}, {"movie_id": 299534, "review_id": "5e0286340284200016b21b19", "rating": null, "review_text": "With all the hype surrounding this film before its release, it was hard not to have high expectations once it finally went out.I myself am one of those people. Fortunately, it did pretty well and didn't disappoint. To me, it would've been better if all their time traveling somehow created ripple effects in the present to make it more realistic but I guess you can only fit so much content in a film.", "created_at": "2019-12-24T21:42:12.630Z"}, {"movie_id": 299534, "review_id": "5e08fa14d285af0013932672", "rating": null, "review_text": "It's not just the hype that ruined this movie. Without the hype and just by looking at it for how it was written, you can tell that it's filled with plotholes.", "created_at": "2019-12-29T19:10:12.692Z"}, {"movie_id": 299534, "review_id": "5e091d81fea0d70016bb8410", "rating": null, "review_text": "All throughout this movie it felt like something was missing. And then I remembered, Stan Lee isn't around anymore.I hope wherever that great man is, he is happy knowing that all his previous films have culminated into a worthy finale.", "created_at": "2019-12-29T21:41:21.917Z"}, {"movie_id": 299534, "review_id": "5e0e0c4bfd4f8000155f3d12", "rating": null, "review_text": "I regret not seeing this in theatres when it came out. This is one of those films that you need to see on the big screen so you can appreciate it truly for the masterpiece it is.", "created_at": "2020-01-02T15:29:15.599Z"}, {"movie_id": 299534, "review_id": "5e0e16136dc6c000134d1fb6", "rating": null, "review_text": "To be honest, I got emotional seeing this movie on the big screen. Each actor delivered an outstanding performance and really contributed to the ending of the Avengers saga.", "created_at": "2020-01-02T16:10:59.338Z"}, {"movie_id": 299534, "review_id": "5e0e20156dc6c000154ccccf", "rating": null, "review_text": "I think it was only right that they had Iron Man make the sacrifice to save the universe. This made him truly the protector of the Earth.", "created_at": "2020-01-02T16:53:41.421Z"}, {"movie_id": 299534, "review_id": "5e0e29e49974ee0017a65741", "rating": null, "review_text": "The action scenes were good and had enough twists in the plot to keep it from becoming predictable.", "created_at": "2020-01-02T17:35:32.499Z"}, {"movie_id": 299534, "review_id": "5e0e407cfd4f8000135f179a", "rating": null, "review_text": "There wasn't much action in this movie compared to the other ones but it definitely had one thing more than the others: soul.", "created_at": "2020-01-02T19:11:56.746Z"}, {"movie_id": 299534, "review_id": "5e0e528f68b1ea00187f9d2e", "rating": null, "review_text": "The final act was amazing and in my honest opinion, one of the best stories in the MCU. Ten great years of storytelling, Thank you MARVEL!", "created_at": "2020-01-02T20:29:03.796Z"}, {"movie_id": 299534, "review_id": "5e0f061d663b8700157e8912", "rating": null, "review_text": "Too much of the film was spent on the dull sentiments and tedious character development that it was hard for me to enjoy it. At some point I even asked myself if this was still a superhero film or a drama.", "created_at": "2020-01-03T09:15:09.459Z"}, {"movie_id": 299534, "review_id": "5e0f2d385907de0012d7b534", "rating": null, "review_text": "I'm 100% a marvel fanboy but this film is far from the movie I had in mind", "created_at": "2020-01-03T12:02:00.240Z"}, {"movie_id": 299534, "review_id": "5e104d8b6f43ec00175a08f6", "rating": null, "review_text": "For someone who is just watching this for the sake of staying current on today's popular culture, it was okay. Not as great as the previous ones but I can kinda see why this had to take on a more dramatic tone as opposed to the usual flashy Marvel movie.", "created_at": "2020-01-04T08:32:11.172Z"}, {"movie_id": 299534, "review_id": "5e1211e5d8af670012bcdc8e", "rating": null, "review_text": "It's sad that the only thing that was memorable for me in this movie was that final fight with Thanos. Other than that, all the other scenes were either incomprehensible or just plain boring.", "created_at": "2020-01-05T16:42:13.759Z"}, {"movie_id": 299534, "review_id": "5e12454a5907de0014ddaa64", "rating": null, "review_text": "Are they going to make a part 2? They need to consider doing one if they don't want all those past films to end on a fail.", "created_at": "2020-01-05T20:21:30.872Z"}, {"movie_id": 299534, "review_id": "5e1259cad64ac20016644da6", "rating": null, "review_text": "It's sad to see that Marvel \"fans\" are hating on this film and not even trying to understand why this film is different from the flashy, action-packed, Avengers film that we've gotten so used to. The aftermath of Infinity War left a scar on each of the remaining heroes. That's what they're dealing with here, not some giant robot or intergalactic force out to destroy the world.", "created_at": "2020-01-05T21:48:58.975Z"}, {"movie_id": 299534, "review_id": "5e12c5ba5907de0014deb6f9", "rating": null, "review_text": "What a great ending to an epic saga! I knew from the start this was gonna be a tear-jerker and they sure didn't disappoint!", "created_at": "2020-01-06T05:29:30.208Z"}, {"movie_id": 299534, "review_id": "5e12c9d0d64ac2001464fd57", "rating": null, "review_text": "The film may not have outstanding action scenes as the previous ones but it had a tremendous amount of story and depth which, to me, seems fair taking into consideration the aftermath of Avengers: Infinity War.", "created_at": "2020-01-06T05:46:56.575Z"}, {"movie_id": 299534, "review_id": "5e12cdca8741c400123da1bb", "rating": null, "review_text": "It's a bit confusing at first but once you really delve deeper and let yourself be engrossed in the story, you start to understand and enjoy it.", "created_at": "2020-01-06T06:03:54.827Z"}, {"movie_id": 299534, "review_id": "5e12d1d48741c400173ddd50", "rating": null, "review_text": "I really love how it felt like everyone who survived \"the snap\" felt that they lost somebody precious in their lives. It gives such a real sense of family.", "created_at": "2020-01-06T06:21:08.188Z"}, {"movie_id": 299534, "review_id": "5e20d4e5397df0001296453d", "rating": null, "review_text": "Some of the scenes were unnecessary and could've been just cut out entirely and the movie would still make sense. I expected more from this 3-hour film but it turned out to be just a complete waste of time.", "created_at": "2020-01-16T21:25:57.595Z"}, {"movie_id": 299534, "review_id": "5e20de6abfeb8b0013cca877", "rating": null, "review_text": "Loved this movie. Everybody else that's asking for more action on this film need to re-watch Infinity War and think long and hard about how much the effects of the snap can affect one's mental health. Even heroes bleed.", "created_at": "2020-01-16T22:06:34.883Z"}, {"movie_id": 299534, "review_id": "5e20f356bfeb8b0013ccd266", "rating": null, "review_text": "Amazing! We have been waiting for this for so long since Iron Man started and the Avengers were created. A masterpiece that has undergone a decade in the making.", "created_at": "2020-01-16T23:35:50.383Z"}, {"movie_id": 299534, "review_id": "5e21da5bbfeb8b0013cefede", "rating": null, "review_text": "I have to admit, I got so emotional all throughout the movie and some parts brought me to tears. The cast was phenomenal and I think every superhero got to have their spotlight.", "created_at": "2020-01-17T16:01:31.900Z"}, {"movie_id": 299534, "review_id": "5e24a3b18f26bc00157944d5", "rating": null, "review_text": "To be honest, I was not expecting the plot of the movie to be with time travel. The movie was great, but some parts were not explained properly and they just lumped it to just a \"quantum theory\". Overall, it appeased the masses, both Marvel and non-Marvel fans.", "created_at": "2020-01-19T18:45:05.226Z"}, {"movie_id": 299534, "review_id": "5e24ab211bf2660016fb2642", "rating": null, "review_text": "Hands down to Stanley, the Russo Brothers, the cast and all the people behind this movie. The culmination of several movies eventually leading to this one great of a story, in the end, satisfied the forever kid in me.", "created_at": "2020-01-19T19:16:49.322Z"}, {"movie_id": 299534, "review_id": "5e24b417d6c30000174238a1", "rating": null, "review_text": "What a rollercoaster ride the movie Avengers: Endgame was! Even though it has some slow scenes, I was really moved by the character building, how the story was elaborately planned, and the heartbreaks that we had to endure along the way. I must say, it had an epic and emotional ending we never thought we wanted.", "created_at": "2020-01-19T19:55:03.907Z"}, {"movie_id": 299534, "review_id": "5e24ba74d6c3000013423b58", "rating": null, "review_text": "All I can say is that this movie gave me the chills! Truly fascinating. A fitting conclusion that lives up to the hype.", "created_at": "2020-01-19T20:22:12.021Z"}, {"movie_id": 299534, "review_id": "5e24c418bfeb8b0013d46327", "rating": null, "review_text": "I was expecting a lot from the Endgame, it is a culmination of many years of MCU movies, and the plot of this movie just added more questions to the ones I had when Infinity War ended. Too many plot holes, but hopefully it can be explained in the next phase of MCU.", "created_at": "2020-01-19T21:03:20.485Z"}, {"movie_id": 299534, "review_id": "5e24ca198f26bc0013797ee2", "rating": null, "review_text": "As a Marvel fan, all I can say is that I am very much thrilled, and satisfied with how the Endgame turned out. The CGI was great, the story on point, and it brought back to life all the superheroes that I love.", "created_at": "2020-01-19T21:28:57.468Z"}, {"movie_id": 299534, "review_id": "5e24cfaabfeb8b0013d475d1", "rating": null, "review_text": "EPIC! Endgame has all that there was: comedy, drama, action, fantasy, and many more. I love how it was the finale of MCU's current generation of movies, bringing together storylines and characters from 21 previous movies. A truly wholesome experience.", "created_at": "2020-01-19T21:52:42.018Z"}, {"movie_id": 299534, "review_id": "5e259d0c8f26bc00137b2b6b", "rating": null, "review_text": "As much as I would love to, I don’t want the current generation of MCU's characters to end. We all loved Robert Downey's Ironman, Chris Evans’ Captain America, and they left a mark in our hearts that can never be replaced. I will root for the next phase of MCU movies, but I don’t think it will have the same allure as the first one.", "created_at": "2020-01-20T12:29:00.977Z"}, {"movie_id": 299534, "review_id": "5e26fa16168935001234a424", "rating": null, "review_text": "GOOSEBUMPS!!! That moment when Doctor Strange brought everyone together to help Capt. America, it's like the spark needed to fire up the hope of every Avengers fan!", "created_at": "2020-01-21T13:18:14.802Z"}, {"movie_id": 299534, "review_id": "5e270ca9c68b6900143dc1d4", "rating": null, "review_text": "Scarlet Witch's rage was terrifying! She proved to everyone not to mess with her, with her man, or else, there'll be hell to pay.", "created_at": "2020-01-21T14:37:29.703Z"}, {"movie_id": 299534, "review_id": "5e2906d798f1f10018f527d3", "rating": null, "review_text": "I want to commend Hawkeye and Black Widow's friendship. It's not a battle for who will live but a battle for who will die.", "created_at": "2020-01-23T02:37:11.387Z"}, {"movie_id": 299534, "review_id": "5e2912a498f1f10018f53625", "rating": null, "review_text": "Spidey and Mr. Stark 's reunion tugged my heartstrings. The relief on Tony's face said it all.", "created_at": "2020-01-23T03:27:32.164Z"}, {"movie_id": 299534, "review_id": "600e1f41e8d0b4003efd9f6b", "rating": 10.0, "review_text": "What a sensational end to this particular arc of the MCU. Quality film!\r\n\r\n<em>'Avengers: Endgame'</em> is all of what I expected/wanted and more. I got goosebumps twice throughout the (masterfully paced) 181 minute run time, I can't say many films have inflicted that on me! Love the ending and the way the Infinity Saga story wraps up.\r\n\r\nThe action is ultra thrilling, the score is fantastic and the effects remain great. I will say I don't think they nail the screen time for all involved outstandingly - that's not a negative, at all, it's just the fact that <em>'Captain America: Civil War'</em> and <em>'Avengers: Infinity War'</em> did it to an incredibly higher degree previously.\r\n\r\nThe cast are marvellous, pardon the pun. Robert Downey Jr. and Chris Evans remain superb and are still the most standout, though you also have the likes of Chris Hemsworth, Josh Brolin, Scarlett Johansson, Bradley Cooper and Mark Ruffalo - love the look of Hulk in this one, btw.\r\n\r\nI've only become properly aware of all of the MCU in the last two weeks or so, yet this still gave me a memorable experience seeing this main story crescendo like this - I imagine it would've been quite the journey 'live' from ten years or so prior to the release of this.\r\n\r\nLook forward to continuing with <em>'Spider-Man: Far From Home'</em> and the end of Phase Three, and then - all things well - beyond.", "created_at": "2021-01-25T01:30:41.132Z"}, {"movie_id": 299534, "review_id": "6103c10edb72c03bfb2b6ea4", "rating": null, "review_text": "It Was Next Level.", "created_at": "2021-07-30T09:06:22.005Z"}, {"movie_id": 299534, "review_id": "63bf86f823be460098085dba", "rating": 8.0, "review_text": "Walking in, given Marvel's latest publicity, I was expecting, well, I was expecting an absolute cringe fest, and thankfully I didn't get it. In fact, there were only a couple of absolute cringe moments and each dealt with Brie Larson, particularly her appearance in the final fight.\r\n\r\nThankfully though, Marvel showed a lot of restraint with that and as a result the movie really belonged to the characters that we all have invested over a decade of love and loyalty in....and honestly that was a relief. There were times where the film looked like it wanted to go the other way, and put the OG Avengers in the backseat. So, credit for not doing that.\r\n\r\nIt feels a lot more like Kill Bill 2 in atmosphere than a real Super-Hero movie, all the really fun big fights were reserved for the first film and what's left is a long closing act that is more concerned with tying up loose ends than delivering on over-the-top action. And it works for a send off film after a decade of investment.\r\n\r\nSo what you have feels very much like an intimate and sentimental film made by old friends at send off...or a funeral...but in either case it is absolutely appropriate.\r\n\r\nUnfortunately, you have the enormously epic CGI battle at the end and I, for one, am kind of done with that trope. It's starting to bore me now, and, honestly, I would prefer something a little more authentic. But, that being said, the film at least called for it.\r\n\r\nWe've seen battles like that before, Black Panther, Aquaman, Infinity War, Lord of the Rings, and, honestly those CGI armies lack any real intimacy. So the end is kind of a bore compared to the rest of the film.\r\n\r\nThe highlight in the film would be Thor with Hulk coming in as a close second. They steal the show from the moment they are introduced and the trademark MCU humor that Black Panther and Captain Marvel utterly lacked. And the humor was a source of comfort after two films that made vague threats of taking themselves far too seriously for a superhero flick.\r\n\r\nThe wrap-up was more than satisfying if not heart-wrenching at moments making it a great send off for a decade of time and money invested in the characters, however the legacy that the MCU is passing on seems in trouble nonetheless and we can only hope that it doesn't go the route that the MCU has been teasing and toying with and continues to deliver fun superhero movies and not the heavy-handed or deadly serious films they have threatened the audience with.", "created_at": "2023-01-12T04:05:12.336Z"}, {"movie_id": 299534, "review_id": "63e70b381277780081a30d99", "rating": 10.0, "review_text": "**Avengers: Endgame is a once-in-a-lifetime masterpiece that did the impossible by exceeding sky-high expectations and delivering a proper send-off to a beloved cast of superheroes.**\r\n\r\nAvengers: Endgame had 21 years of rising fan expectations, the pressure to conclude a saga spanning dozens of films, and the need to adequately resolve one of the most surprising and desperate cliffhangers in history… The Russo Brothers not only delivered on all the hopes and dreams of legions of fans but shattered expectations and box office records. Who would have thought that two guys whose resume was limited to the paintball episode of Community could perfectly balance the MCU’s carefree goofy personality with the hopeless and impossible story of the Avengers’ failure to save half of the universe? Endgame takes the time to tell the story of each original Avenger, showing their growth, pain, and heroism in a way that gives each hero a powerful and satisfying send-off. There are so many moments of this film that will go down in cinematic history that had the crowd in the theater erupting in applause and wiping away tears. I’m not sure we will ever bear witness to a film like Avengers: Endgame, with 21 movies and 21 years of storytelling culminating in one of the most epic finales of all time. Whoever says that comic book films can’t be Oscar-worthy masterpieces ignores the history made by Avenger: Endgame.", "created_at": "2023-02-11T03:27:52.249Z"}]