[{"movie_id": 1422, "review_id": "579155ee9251415aab002740", "rating": 10.0, "review_text": "I decided to celebrate the Summer Solstice by watching 'The Departed'. Don't ask me why. I had previously loved the Hong Kong-made 'Infernal Affairs' trilogy on which this is based. Usually I hate when international masterpieces get remade, but this was a sterling exception. This was controversial when it took in a cartload of Oscars, particularly finally a directorial nod for Scorsese, but don't be misled--it's easily one of his finest works.\r\n\r\nThis is my Golden Rule on both remakes in general, but especially American remakes of international (particularly foreign-language) great films. When in doubt, check the label:\r\n\r\n1. Director? (check)\r\n2. Cast? (check)\r\n3. Script? (check)\r\n\r\n'The proof is in the pudding!'", "created_at": "2016-07-21T23:08:30.635Z"}, {"movie_id": 1422, "review_id": "5ea427886d1bb2001fa38c93", "rating": 8.0, "review_text": "The only one that can do what I do is me. Lot of people had to die for me to be me. You wanna be me? \r\n\r\nThe Departed is directed by Martin Scorsese and written by William Monahan, Alan Mak and Felix Chong. It stars Jack Nicholson, Matt Damon, Leonardo DiCaprio, Mark Wahlberg, Martin Sheen, Ray Winstone, Vera Farmiga, Anthony Anderson, Mark Rolston and Alec Baldwin. Music is by Howard Shore and cinematography by Michael Ballhaus.\r\n\r\nAn Irish gang in South Boston becomes aware there is a rat in their midst, whilst the police force has a mole to contend with - with each one trying to out each other before the other does...\r\n\r\nMartin Scorsese remakes Hong Kong thriller Infernal Affairs (2002) for the English speaking world, and promptly bagged his first Best Director Oscar in the process. It's a thrilling picture packed with suspense and edginess, a psychological gangster picture driven by two men leading double lives that is leading them to the abyss. When the violence comes it erupts in thunderous strokes, all while the narrative pulses with paranoia. There are some irksome contrivances, but with a uniformly strong set of turns from the cast, great musical accompaniments, and a director returning to gangster form, The Departed is a sure fire winner. 8.5/10", "created_at": "2020-04-25T12:05:28.320Z"}]