[{"movie_id": 4148, "review_id": "5dd6f06912aabc00168cb184", "rating": 5.0, "review_text": "***What if Jack & Rose married and settled into the conventional American grind?***\r\n\r\nThe Wheelers are a couple with two kids living in the suburbs of Connecticut in the ’50s. Frank (Leonardo DiCaprio) marches off to the big city five times a week, ten hours a day, to a job he hates whereas April (Kate Winslet) takes care of things on the home front, including their hardly-seen children. April's dream of being an actress has failed and she vents her frustrations on Frank. Emasculated, he has a meaningless affair to prove his manhood to himself. Meanwhile April suggests a wild idea for them to move to Paris because Frank's war tales describe it as a place of exhilaration and April desperately wants him to regain that aura of vitality he had when they first met. Will they escape the comatose corner they've painted themselves into or will they join the masses of (supposedly) living dead in their midst?\r\n\r\nEleven years after their mega-hit \"Titanic\" (1997), Kate and Leonardo reunite for \"Revolutionary Road,\" released in January, 2009. Kate has shed her unappealing baby fat and is now a curvy beauty whereas Leonardo is a man and no longer has that boyish vibe.\r\n\r\nI enjoy a good drama now and then, like the excellent \"Snow Angels\" (2007), the potent \"Grand Canyon\" (1991) or the masterpiece \"Dead Poets Society\" (1989), but \"Revolutionary Road\" fails to achieve the greatness of those films, mainly because the characters and their story are fairly boring. The film's just not that engrossing, which is my core criterion for evaluating any flick. In quality and theme, it’s reminiscent of “Joe Versus the Volcano” (1990).\r\n\r\nLike “Joe,” it’s a slyly offbeat drama despite being about American conventionality. The best parts involve Michael Shannon as John, the mentally disturbed son of the real estate lady (Kathy Bates), a fascinating character. Everyone else in the Wheeler's lives thinks their plans to give up their suburban paradise are crazy (big surprise). But John sees the brilliance and necessity of the plan. In other words, the only person who 'gets' the plight of the Wheelers is this nigh-insane dude. But he's not really crazy. John is gifted at seeing through a facade to get to the core of a matter, the awesome or awful truth. And he has no inhibitions about speaking his mind, good or bad. At heart, John is a beatnik, the 50's precursor to the hippie. He represents the first wave of the 60's counter-culture, a generation of youth who discerned the cracks in the post-war \"paradise,\" and rebelled, for better or worse.\r\n\r\nSome important questions are raised: Is life just having a marriage, a family, a well-paying job (you loathe) and a nice home in the pleasant suburbs, plus cigarettes and drinks without end? Or is there more? What about love? What about genuineness? What about unrealized, unused or ignored talents and dreams? What about (gasp) God?\r\n\r\n\"Revolutionary Road\" has some other positives: it's expertly made, has a good score by Thomas Newman and evokes some haunting moments.\r\n\r\nSome have suggested that the film is one POSSIBLE outcome if Jack had survived the end of “Titanic” and married Rose: The once spirited, carefree Jack settles into the robotic grind to pay the bills while Kate is left frustrated at home in suburbia. Regrettably, it’s overall mediocre due to the unengrossing characters and their story, which of course links to the theme its espousing. \r\n\r\nYet it does have flashes of greatness and it makes you reflect on its points. In some ways, the same message is addressed in \"Dead Poets Society\" (and \"Grand Canyon,\" to a lesser degree): rejecting the box society tries to confine you, throwing caution to the wind, and going after your dreams. The difference is that \"Dead Poets Society\" (and \"Grand Canyon\") accomplished this with absorbing stories whereas \"Revolutionary Road\" doesn't. Generally speaking, that is. Yet it's still worth catching if its themes trip your trigger.\r\n\r\nThe film runs almost 2 hours and was shot in Connecticut & New York City.\r\n\r\nGRADE: C+", "created_at": "2019-11-21T20:15:37.235Z"}, {"movie_id": 4148, "review_id": "5f7260511f748b003728949c", "rating": 10.0, "review_text": "Can you change your life for love? What’s the border between craziness and frustration? Are we really living our lives? This fantastic movie won 20 awards and 73 nominations. It’s an incredible story and let’s discover why.\r\n\r\nThe movie is set in Connecticut during the mid-1950 and inspired by the book “Revolutionary Road” written by Richard Yates. It’s a story of love, marriages, families and abortion, ambitions and frustrations, of dreamers and conformists. It’s the daily tale of all of us, on the road of our lives. Looking for an often unachievable and unknown happiness.\r\n \r\nYou will ask yourself “what’s the purpose of this life”? It is just about having a good job, a great house, a wife, children? Or there is something more? Like the love for yourself, for your talents, your passions, your desires and dreams. But to find the right answer requires painful choices to be made, and this where this masterpiece guide us.\r\n\r\nFrank and April Wheeler are the protagonists and to give them voice and action, we have two of the most talented and incredible actors in Hollywood: Leonardo Di Caprio and Kate Winslet, directed by Sam Mendes, in one of his most successful films. It’s not a movie for everyone. It’s very sophisticated, well-crafted, a masterpiece, in my opinion. \r\n\r\nYou can read my full analysis for free at this url: https://bit.ly/2HxJTJq", "created_at": "2020-09-28T22:14:41.876Z"}]