[{"movie_id": 283995, "review_id": "59007a4292514161aa00a8bd", "rating": 7.0, "review_text": "I didn’t enjoy this as much as the first one. Too long — could have been about 30 minutes shorter. I don’t mind long movies, but they shouldn’t feel long. There’s some good humour throughout the movie and the characters are enjoyable, particularly Rocket who is my favourite! Story is pretty thin. Some good action sequences, of course. Overall, an average movie. Has lost some of the freshness of the original.", "created_at": "2017-04-26T10:45:22.429Z"}, {"movie_id": 283995, "review_id": "59169e02c3a36842d602cb3f", "rating": 8.0, "review_text": "_Logan_, 2017's first Marvel offering, was a movie I loved because of just how little it relied on its comic book origins, completely forgoing the superhero tropes and going in its own unique and totally enthralling direction.\r\n\r\n_Guardians 2_ however, is a movie I loved because of just how intensely it embraced its comic book origins. The Kirby-isms shine through brilliantly and every couple of minutes I found myself grinning like an idiot at some new reference or stylistic choice.\r\n\r\n_Logan_ might be the super hero movie for people who don't like super hero movies. _Guardians 2_ is the super hero movie for people who have steeped themselves deeply in the lore of super heroes. But I absolutely adore them both for the same reason: How they made me **feel**.\r\n\r\n_Final rating:★★★★ - An all round good movie with a little something extra._", "created_at": "2017-05-13T05:47:46.781Z"}, {"movie_id": 283995, "review_id": "59235659c3a368049600178a", "rating": 8.0, "review_text": "The David Hasselhoff of all reviews, obviously.\r\n\r\nDo you have any tape?\r\n\r\nGuardians of the Galaxy Vol. 2, directed by James Gunn, is an action-packed Marvel comedy. The guardians unravel the mysteries of Star-lord aka Peter Quill's (Chris Pratt) broken history while avoiding constant danger. Oh. And did I mention the soundtrack? Muy bueno! 8)\r\n\r\nUnlike most sequels, Vol. 2 might actually be better than Vol. 1.\r\n\r\nThe entire cast is more likable than the first film. Drax the Destroyer (Dave Bautista) has more comedic lines like, \"When you're ugly and someone loves you, it means they love you for who you are.\"\r\n\r\nRocket Racoon (Bradley Cooper) still maintains a sentimental but adorably tough persona. And Baby Groot is cute as ever whenever he says,\"I am groot.\" In his baby-voice.\r\n\r\nOne of the more noticeable differences is the relationship between Gamora (Zoe Saldana) and Star-lord. It's not as intimate. We were all hoping for a sci-fi sex scene. We don't get it!\r\n\r\nThe fight scenes are nothing less than spectacular. There's a scene with Yondu (Michael Rooker) where he's using a whistle-controlled weapon to kill an entire space crew of villains ALL IN SLOW-MOTION!\r\n\r\nJust go watch the film. It's worth it for the cgi-artwork alone.", "created_at": "2017-05-22T21:21:29.928Z"}, {"movie_id": 283995, "review_id": "598ee4b2c3a36874a300f3c6", "rating": 10.0, "review_text": "“Guardian’s are back to save the galaxy once again”\r\n\r\nI felt in this movie the true star was baby Groot the part that how he understands and gives out his understandings in his own style which makes us laugh out loud. Got to see a funny side in Drax the before edition he was always angry this one he always laughs I like the part he keeps saying positive things and suddenly ends it with a negative touch. Now to talk about gamora and quill love is in the air but she keeps denying it. Quills line “We keep searching for something our whole life and we never realize that it has been with us the whole time”. Always hated yondu but this movie made me change. Did not get to see Thanos, I know he is been kept for the big picture. Rockets awesome one liners especially TASERFACE made me burst out with laughter. An awesome family entertainer with action comedy and adventure. And not to forget mantis she was so freaking innocent. Waiting patiently for the next part in this series loved this one. would recommend this movie for everyone. \r\nNotable Acting\r\nChris Pratt (Peter Quill/Star-Lord) famous for his acting in Jurassic World\r\nZoe Saldana (Gamora) famous for her acting in Avatar and Star Trek into darkness\r\nDave Bautista (Drax) he is a famous WWE wrestler and also acted in movies like 007 spectre\r\nVin Diesel (Baby Groot) famous for his movie series fast and furious\r\nBradley Cooper (Rocket) famous for his movies like silver linings playbook and the hangover\r\nMichael Rooker (Yondu) \r\nKaren Gillan (Nebula) famous for the movie Oculus and the tv series Doctor Who\r\nPom Klementieff (Mantis) \r\nKurt Russell (Ego) famous for his movies the hateful eight, the thing and death proof\r\n\r\nMy Rating 10/10", "created_at": "2017-08-12T11:21:22.940Z"}, {"movie_id": 283995, "review_id": "59ec98a2925141245f003768", "rating": 8.0, "review_text": "**Guardians' date with the creator.**\r\n\r\nThe first film was the most unexpected. That was one of the most colourfull space films I have ever seen. Youthful, energetic, fantastic visuals and so the same followed in this sequel as well. Not the same good, but stood to the expectation of the first film's success. This story does not have a great adventure in the galaxy. A simple quest, but a thrilling action-adventure. Now this accidental space gang is set to meet the creator.\r\n\r\nIt's time for Peter to meet his father, Ego. As he still upset with his mother's death, his encounter with his father was not as expectedly smooth. On the other side of the story, Rocket, Yandu, Baby Groot make their escape from the captivity. They all end up on the Ego's planet where the rest of the film going to take place. Being the guardians of the galaxy, their fight against the whoever threaten the safety of the universe once again tested with their strength as a team.\r\n\r\nJames Gunn did it again. And I'm confident that he's going to do the same for next as well. All the actors were fantastic like the previous film. This time, little fun with little Groot. Anybody who loved the first would love it too. Being a franchise from Marvel universe, it is yet to join the 'Avengers'. So far so good. I'm now expecting one of the best of best trilogies. Bring it on the volume 3.\r\n\r\n_8/10_", "created_at": "2017-10-22T13:09:54.814Z"}, {"movie_id": 283995, "review_id": "5c8425ca0e0a2642fe6365c2", "rating": 3.0, "review_text": "I hate this movie. I'm fine and quite proud to be in the minority with this one. I can't stand how Guardians of the Galaxy Vol 2 thinks family dynamic is just two people bickering about how much daddy didn't love them as kids. It makes no sense to me why James Gunn or Marvel think that every scene needs to have multiple jokes thrown in no matter what the tone of the scene is supposed to be. Drax's overused laugh was annoying. Yes, I get it, Baby Groot is dumb. Hahaha.... Oh, now you're ugly shaming a character and playing it for jokes?\r\n\r\nOne note characters, a stupid plot of nothing interesting happening, and of course Starlord's father, a celestial, is nothing more than an evil being setting out to destroy the universe. Does Marvel not realize that villains can have other kinds of motivation?\r\n\r\nThe only two good things about this movie are the soundtrack and the fact that the events have no effect on the overarching MCU plot. So next time I do a Marvel marathon, I can skip over this trash.", "created_at": "2019-03-09T20:44:58.715Z"}, {"movie_id": 283995, "review_id": "5e20f7ba397df00014969262", "rating": null, "review_text": "This film is a big \"watch and learn\" nudge to poorly directed comic book films. James Gunn showed us how to effectively use humor to ante up the storytelling, and even took us to Slow-motion 101 Class.", "created_at": "2020-01-16T23:54:34.133Z"}, {"movie_id": 283995, "review_id": "5e24a16a8f26bc0015793fa9", "rating": null, "review_text": "I AM MARY POPPINS Y'ALL! Glorious cameos and easter eggs. Not gonna speak much about it to avoid spoilers. Great movie.", "created_at": "2020-01-19T18:35:22.625Z"}, {"movie_id": 283995, "review_id": "5e24a656a894d600123a4b5f", "rating": null, "review_text": "VISUALS VISUALS! VISUALS! If only my eyes and my head can take it, I would love to watch this on 3D. The team did a superb job on this one!", "created_at": "2020-01-19T18:56:22.883Z"}, {"movie_id": 283995, "review_id": "5e24ad941bf2660016fb28cd", "rating": null, "review_text": "Awesome Mix Number 2 was amazing! The songs and how they were strategically scored in every scene set up the right mood. Got their playlist on repeat!", "created_at": "2020-01-19T19:27:16.821Z"}, {"movie_id": 283995, "review_id": "5e24b73a1dcb770012ca15e0", "rating": null, "review_text": "It feels like Vin Diesel influenced the film too much. His #FAMILY theme from the Fast and Furious franchise was all over the film!", "created_at": "2020-01-19T20:08:26.441Z"}, {"movie_id": 283995, "review_id": "5e24bdb8397df000129dbea5", "rating": null, "review_text": "You can clearly see that Marvel trusted James Gunn. Everything he did, even the slapstick-LooneyToon-ish kind of humor were perfect. He clearly had fun conceptualizing and visualizing everything.", "created_at": "2020-01-19T20:36:08.020Z"}, {"movie_id": 283995, "review_id": "5e24c709397df000129dd0bf", "rating": null, "review_text": "Solid character development and motivation. Can't gush about it now to avoid spoilers. All I can say is: \"Watch it.\"", "created_at": "2020-01-19T21:15:53.557Z"}, {"movie_id": 283995, "review_id": "5e24cc93397df000149e61ae", "rating": null, "review_text": "Two words: BABY GROOT! Groot was there to make the nerds' wives and girlfriends stay and watch the film. He's cute, adorable and everything that your Disney princesses would love!", "created_at": "2020-01-19T21:39:31.144Z"}, {"movie_id": 283995, "review_id": "5e24d42dbfeb8b0013d479c6", "rating": null, "review_text": "The villain, like any other Marvel villains except Loki, sucks. Unclear motivations + can be defeated by the power of love. You know, all that jazz. But aside from that, the entire movie was a very enjoyable watch.", "created_at": "2020-01-19T22:11:57.531Z"}, {"movie_id": 283995, "review_id": "5e26f4411685da0013ded9e7", "rating": null, "review_text": "Overall, the second installment delivered very well. It was crazier than the first film, and it was packed with better character development and AWESOME VISUALS! Must....resist spoiling the film.", "created_at": "2020-01-21T12:53:21.189Z"}, {"movie_id": 283995, "review_id": "5e2705e1c68b6900143db85b", "rating": null, "review_text": "Not as fun as the first one, but it was still jam-packed with all a Marvel movie will be: humor, action, drama, and BABY GROOT!", "created_at": "2020-01-21T14:08:33.032Z"}, {"movie_id": 283995, "review_id": "5e2710c54ca676001a3f29db", "rating": null, "review_text": "Baby Groot was so, so cute! Honestly, I'd pay to watch a whole movie with just Baby Groot as the focus.", "created_at": "2020-01-21T14:55:01.797Z"}, {"movie_id": 283995, "review_id": "5e2909f598f1f10014f54404", "rating": null, "review_text": "What would you get when you put together a group of misfits and call it a day? Hilarious, full of classic songs and drama that you should not miss.", "created_at": "2020-01-23T02:50:29.133Z"}, {"movie_id": 283995, "review_id": "5e2917a398f1f10012f545b6", "rating": null, "review_text": "It is a pretty good sequel to Volume 1. What we thought to be an epic dad-son moment was just a facade, and honestly, to Quill, who just wanted a father all this time, it was a bit sad.", "created_at": "2020-01-23T03:48:51.927Z"}, {"movie_id": 283995, "review_id": "6008e91543d9b1003e38b6da", "rating": 8.0, "review_text": "Another enjoyable entry, <em>'Guardians of the Galaxy Vol. 2'</em> is very good fun.\r\n\r\nI actually didn't find the story in this as interesting as in the first film, but the humour - which is still up to the mark in <em>'Guardians of the Galaxy'</em> - is much greater here; it got more laughs from me, that's for sure. The ending to this is also entertaining.\r\n\r\nChris Pratt and Co. are just as enjoyable as before, with Dave Bautista particularly standing out to me here; if only due to his amusing moments. I like the addition of Pom Klementieff, I can see a spot for her in the crew. Kurt Russell and Elizabeth Debicki make for contrasting newcomers, Russell is just about good but I felt Debicki and her lot were underused/unintriguing.\r\n\r\nNot the most compelling plot, which I found more predictable than what the MCU usually produces, but the strong action end and noteworthy humour elevates it to become a pleasant film to watch; if a drop from the original.", "created_at": "2021-01-21T02:38:13.401Z"}, {"movie_id": 283995, "review_id": "63c2c3a805a53300c11100f7", "rating": 10.0, "review_text": "Well, the soundtrack rocked. It was wonderfully classic. Wonderfully sentimental. Wonderfully awesome again. And it was fun how music suddenly became their thing as a team.\r\n\r\nBaby Groot was fun, funny, and adorable all at the same time...and it worked because he was also a lot more violent than the adult Groot, which made it stand far and away from the overly saccharin nightmare that he could have been.\r\n\r\nStar Lord unfortunately matured a bit. He wasn't anywhere near the...can I say d**che bag here? Jerk is too strong of a word and you never really got the impression that he was really an idiot in the first one. In any case it was that annoying quality that made him such a great character in the first movie.\r\n\r\nIn the sequel Peter has grown and some of the traits that made him so fun to watch are still there...just muted as he became more of an adult.\r\n\r\nIt works for the plot, and he is still a lot of fun to watch, but a part of the appeal was that he was sort of Peter pan and it hurts wa6tching someone like that grow.\r\n\r\nThe only really weak point was Mantis and only really because she was clearly going to join the team and clearly not doing much of anything.\r\n\r\nAs the whole, you have another departure away from the overly serious...or sometimes moderately serious cape flicks...which a refreshing getaway, so long as its understood that Guardians and the like are departures from the norm and not a harbinger of Batman & Robin camp again.", "created_at": "2023-01-14T15:00:56.223Z"}, {"movie_id": 283995, "review_id": "646cf6a6706b9f01724763e9", "rating": 6.0, "review_text": "Only slightly better then the first in my opinion. Not cause it was that great of a movie. Only because of the Groot and it was pretty funny, that's it!", "created_at": "2023-05-23T17:23:50.570Z"}]