[{"movie_id": 390051, "review_id": "594a261d92514145a800993b", "rating": 5.0, "review_text": "Between this and _Maggie_, Arnold Schwarzenegger has proven that he's more than just the '80s muscle man we had always given him credit for. Aftermath may not be great, but there's some emotion in there, a relatively satisfying payoff, and as a vehicle for Arnie's dramatic chops, it works fine.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2017-06-21T07:54:05.287Z"}, {"movie_id": 390051, "review_id": "596794069251413418003b51", "rating": 7.0, "review_text": "**Not about the plane crash, but the aftermath of the event.**\r\n\r\nThe best part of this film is it was based on the real. This is the story that follows after the event of two planes crashed head to head in the mid air. Focused on Roman, the one who had lost his wife and daughter in the crash and the Jake, an air traffic controller who was on the duty on the day.\r\n\r\nRoman was not happy for how the officials treated him, and the declaration of the result of the event. On the other hand, Jake was mentally disturbed, that's affecting his family. A year later, when everything was coming back to normal with a book on the plane crash is getting released, a twist in tale emerges and fast forwarding to a few years, the story comes to an end.\r\n\r\nThere's no judgement on the crash, that's how the story carefully evolved. Like how it happened and whose fault it was. If you understand the title properly, you won't ask that, because the film is not about that. It was the aftermath of the crash. Like how people related to the event coped with. I think decently written screenplay with good performances. But the film was slow.\r\n\r\nEverything about the film was the opening and the end parts, the rest of the film was just a drag in the name of gap between the events and letting us know more about the film's two main characters. So, overall a simple film, but depicting the real event matters here. Once viewable film, especially if you are the actor's fan, then the percentage goes up. Though expect less from it or from him, as he's not young anymore and this film is not an action flick, just a decent drama.\r\n\r\n_6.5/10_", "created_at": "2017-07-13T15:38:46.266Z"}]