[{"movie_id": 13813, "review_id": "63debc718741c4007db01255", "rating": 7.0, "review_text": "**_Survival in the woods during WW2_**\r\n\r\nAs Nazi forces sweep through Eastern Europe in 1941 the Bielski brothers (Daniel Craig, Liev Schreiber and Jamie Bell) seek refuge in the deep forests on the border of Poland and Belorussia (Belarus). More and more desperate Jews join their ranks for common protection and to oppose the occupying Germans. How can they all survive in the woods during the next four years of war?\r\n\r\nReleased in 2008-2009, \"Defiance\" is a drama/war film that has a lot going for it: a story based on actual events, good actors, authentic locations (filmed in Lithuania, a mere 100 miles or so from the actual sites), effective cinematography and a quality score. I personally love survival-type films and \"Defiance\" fills the bill, although it's not great like, say, \"The Last of the Mohicans\" (1992).\r\n\r\nThe filmmakers throw in all kinds of dynamic things to maintain the viewer's attention: Numerous gun battles, an airstrike and a tank, which are all faithful Hollywood-isms. It would've been better to simply focus on the characters and their gritty survival story. How about a deeper examination of individuals reduced to basic necessities? What about a study of people stripped of all civilized influences, struggling with the animalistic side of their psyche, as depicted in the excellent \"Sands of the Kalahari\" (1965)? How about the immaterial yet palpable bond of love which unites and gives life even in the worst possible conditions? There's some of this, of course, but I wanted it to go deeper, like in \"The Flight of the Phoenix\" (1965).\r\n\r\nOne thought-provoking scene concerns a man seeking to join the ever-growing group in the woods wherein he is asked what he does in order to determine how best to utilize his skills. He ponders it a moment and replies that he's \"an intellectual.\" There's of course little use for an intellectual in such a forest community. The region was largely agrarian and so the peasant-types were skilled in at least one practical area as farmers, craftsmen or laborers. But what use was an \"intellectual\"?\r\n\r\nHow many of us are intellectuals and would largely be useless in such a scenario? We'd learn new skills real quick, huh? So the picture works on a what-if level: How long will our present society endure as it is before many of us are forced to live primitively in the sticks? If that happens, I hope you're more than just \"an intellectual.\"\r\n\r\n\"Defiance\" is worthwhile if the survival-in-the-woods plot piques your interest. It's superior to the similar \"Tears of the Sun\" (2003), but IMHO not quite as good as \"Hornet's Nest\" (1970) and \"Sands of the Kalahari,\" although it's not far off.\r\n\r\nThe movie runs 2 hours, 17 minutes.\r\n\r\nGRADE: B/B-", "created_at": "2023-02-04T20:13:37.298Z"}]