[{"movie_id": 76170, "review_id": "5203e200760ee308b5136f20", "rating": 3.5, "review_text": "I am a big fan of The Volverine movies but this one didn't have to much in it! I even watch it again to see if I miss anything. I would say this is a good movie to watch when you have some free time not a MUST watch movie! still a good one at it!", "created_at": "2013-08-08T18:22:56.612Z"}, {"movie_id": 76170, "review_id": "528336e919c29554ef15c05d", "rating": 7.0, "review_text": "I was also a little disappointed. Especially the giant\r\nsamurai suite raised question marks. I wonder what will happen next since Wolverine's claws are cut off.\r\n\r\nDr. Green (alias Viper) reminds me of Poison Ivy (Batman). Somehow I didn't like that. Yukio, the red head, is cool tho.", "created_at": "2013-11-13T08:23:05.904Z"}, {"movie_id": 76170, "review_id": "53f11c930e0a2675bf003f95", "rating": 5.0, "review_text": "Seeing Hugh Jackman as the wolverine is always a pleasure but this one is not thrilling at all. Just skip it unless you are a real fan.", "created_at": "2014-08-17T21:20:19.794Z"}, {"movie_id": 76170, "review_id": "5a79aab9925141775902258b", "rating": 7.0, "review_text": "This is definitely a good and entertaining movie. For me however, it falls short of being great due to a couple of things that I really did not like. Be warned that the rest of this review contains a few spoilers if you have not watched the movie before reading this.\r\n\r\nThe movie begins quite well. I liked Wolverine getting into that bar taking revenge on the idiot hunting bears with poisoned darts. Then it did not continue so well. My main issue is that they screw with Wolverines healing powers really early on in the movie so that he is handicapped for a good chunk of it. I really did not like that. Now this does not stop there from being quite a few cool action sequences. The fight sequence on the Japanese bullet train was quite cool although a wee bit too drawn out perhaps.\r\n\r\nEventually he manages to get his powers back although the happiness does not last very long. In the final combat they actually deprive Wolverine of his adamantium claws and it doesn’t look like he gets those back. What the f… is that? Sure, he regrows his original bone claws but that is not the same thing. Wolverine should have his adamantium claws, full stop. This is something I really dislike with a lot of Hollywood producers and directors now. They feel that they have to create some shock effect by destroying icons and constants in the world of movie fantasy. Like blowing up the Enterprise over and over again. I just hate it and for me this is the one thing that really stops this from being a great movie. Either they somehow give him back his proper claws or they can just as well make a reboot as far as I am concerned.\r\n\r\nIt is quite sad that they, I will not say ruined but at least, diminished the movie in this way. Otherwise it would have been a great movie. It has a lot of nice action, a not too bad script and Hugh Jackman is very good as Wolverine. Actually the only one I thought was somewhat si so is Dr Green who’s acting is rather pathetic.\r\n\r\nAll in all a good and entertaining movie that could have been a lot better if it was not for the Hollywood dimwits who felt they had to put something shocking in it and screwed it up.", "created_at": "2018-02-06T13:16:41.477Z"}, {"movie_id": 76170, "review_id": "5e20f5f2cf4b8b0017ef3eaf", "rating": null, "review_text": "Finally! A movie worth of one of the most iconic Marvel characters of all time! X-Men 3 was good, but this one was the most legit one.", "created_at": "2020-01-16T23:46:58.449Z"}, {"movie_id": 76170, "review_id": "5e21ddcdbfeb8b0011cf0d37", "rating": null, "review_text": "What would you give to be mortal again? Well, this movie gives the opportunity for Logan to be mortal. Spectacular fight scenes, much better than X-men Origins was.", "created_at": "2020-01-17T16:16:13.499Z"}, {"movie_id": 76170, "review_id": "5e24a51a5ed8e9001760b2c6", "rating": null, "review_text": "EXTREMELY BAD-ASS! A mix between modern technology, Marvel fantasy, and ancient Japanese mythology. Any Marvel fans will be thrilled to see this movie!", "created_at": "2020-01-19T18:51:06.162Z"}, {"movie_id": 76170, "review_id": "5e24ac6aa894d6000f3a4c41", "rating": null, "review_text": "Solid 10/10 rating. Fight scenes were fast-paced, well-shot, and felt very real! A straightforward dramatic film!", "created_at": "2020-01-19T19:22:18.140Z"}, {"movie_id": 76170, "review_id": "5e24b6041bf2660016fb31ef", "rating": null, "review_text": "Hugh Jackman always nails it with his adaptation for Wolverine. I will feel very sad when the time comes that he will have to retire to being Wolverine.", "created_at": "2020-01-19T20:03:16.714Z"}, {"movie_id": 76170, "review_id": "5e24bc388f26bc0013796949", "rating": null, "review_text": "I don’t understand the hate some people have with this movie. For me, it was a pretty decent film. It ain't perfect, but still, it was pretty good.", "created_at": "2020-01-19T20:29:44.101Z"}, {"movie_id": 76170, "review_id": "5e24c5c6bfeb8b0013d466a0", "rating": null, "review_text": "This movie is really violent for a PG-13. And they don't hold back with this one. It is really on the edge and that is what makes it pretty awesome.", "created_at": "2020-01-19T21:10:30.874Z"}, {"movie_id": 76170, "review_id": "5e24cb6c1bf2660012fbb969", "rating": null, "review_text": "I am disappointed with this one. It has plot holes all over the place, the script was poorly written, and it just got away with Jackman's superb acting. Maybe next time.", "created_at": "2020-01-19T21:34:36.284Z"}, {"movie_id": 76170, "review_id": "5e24d1b81bf2660014fbcc79", "rating": null, "review_text": "Wolverine was finally given the attention that he deserves. After the disappointing movie that was Origins, I think they redeemed it with this one. Awesome portrayal and character-focused.", "created_at": "2020-01-19T22:01:28.509Z"}, {"movie_id": 76170, "review_id": "5e26f039ed2ac2001039dcde", "rating": null, "review_text": "As an adaptation of the Japanese mini-series, I think this one is pretty good for a Wolverine-based movie. Also, if you haven’t watched it yet, stay longer in the theater for the post-credit scenes. One of the best so far!", "created_at": "2020-01-21T12:36:09.738Z"}, {"movie_id": 76170, "review_id": "5e270144ed2ac20017397ed0", "rating": null, "review_text": "The Wolverine was a fascinating take on the iconic mutant and how his past converged with his present. The action scenes were savage and vicious, gritty and almost dark.", "created_at": "2020-01-21T13:48:52.797Z"}, {"movie_id": 76170, "review_id": "5e270fab4ca676001a3f270f", "rating": null, "review_text": "Wolverine, but gritty and more human than mutant! This movie showed the toll of immortality, and the price you are willing to pay for one to take it away.", "created_at": "2020-01-21T14:50:19.739Z"}, {"movie_id": 76170, "review_id": "5e29088c98f1f10014f5413d", "rating": null, "review_text": "It was a fascinating film, and if you have seen Logan, you'll be able to see that it is like a prelude for it.", "created_at": "2020-01-23T02:44:28.257Z"}, {"movie_id": 76170, "review_id": "5e2915861685da0013e25d75", "rating": null, "review_text": "It has evaded many red flags for it to be considered as a PG-13 movie, and honestly, kids should not watch it as it is not suitable for them.", "created_at": "2020-01-23T03:39:50.887Z"}, {"movie_id": 76170, "review_id": "638baea87390c000841a15ee", "rating": 6.0, "review_text": "This second solo outing for the eponymous \"X-Man\" sees him rescue a Japanese soldier from the Nagasaki bomb. Many years later, that solider - \"Yashida\" (Hal Yamanouchi) - has become a wealthy and successful industrialist determined to leave his fortune to his strong-willed and capable granddaughter \"Mariko\" (Tao Okamoto). It's soon clear, though, that that succession plan is going to face it's problems - not least from her own father \"Shingen\" (Hiroyuki Sabada) and the Yakuza replete with their own group of combat-ready mutants. When an attempt is made to kidnap the woman at the old man's funeral, \"Logan\" (Hugh Jackman) gets more than he bargained for - and is now faced with a dilemma the like of which he had hitherto thought impossible. Moreover, this development actually puts both him and his charge at considerable risk. The plot takes a further twist when they both discover that there may yet be an even more dangerous foe awaiting them. Though this looks good, the story is weak and the characterisations all largely undercooked as the emotional undercurrents for \"Logan\" - still reeling from his loss of \"Jean Grey\" - drags the story into a mire of sentiment that makes this actually quite heavy going at times. As with the \"Origins\" film (2009) the nature of his battle skills require much too much close quarter and repetitive combat scenes that, after a while - and after he has, for the umpteenth time, emerged from a battle against overwhelming odds without breaking a nail - become jaded and dull to watch. The denouement scenes here seem to go on interminably, but without any sense of jeopardy - we all know what is going to happen and no amount of acrobatics and pyrotechnics makes that inevitability any more exciting to watch. Jackman himself is nowhere near his best here, either - it is almost as if he is as tired of this role as I am now. The supporting cast do little more than make up the numbers and though it's watchable enough, I did struggle and seriously hope we will see no more of these en-seul efforts.", "created_at": "2022-12-03T20:16:40.622Z"}]