[{"movie_id": 672, "review_id": "61d51b36497560004227721d", "rating": null, "review_text": "Awesome 👍", "created_at": "2022-01-05T04:14:46.346Z"}, {"movie_id": 672, "review_id": "638132fb514c4a008789433e", "rating": 8.0, "review_text": "_Harry Potter and the Chamber of Secrets_ is a worthy sequel that improves upon the first and expands the lore in a grand way.\r\n\r\nThe quality in this film is vastly superior to the first in terms of CGI and acting, which is par for the course as the main trio grows into their roles and as actors. It is evident that the CGI team had adequate time before this film's release because for 2002 the effects are spectacular. From Dobby the Elf to the Basilisk in the Chamber of Secrets, this movie nails creature models and creates very believable interactions between the models and the actors.\r\n\r\nDespite this film not having the impact in terms of discovering the magical world of Hogwarts for the first time, the story is able to improve upon its predecessor delivering an all-around stronger plot. There is a real sense of mystery surrounding the Chamber of Secrets and the suspense and hysteria it creates around Hogwarts is very intriguing. The stakes and the plot progression feel elevated here, creating a more seamless experience.\r\n\r\nLike previously stated, the main casts acting is improved drastically. Each actor is coming into their own and really is getting comfortable with their character. Rupert Grint steals the show with his comedic timing and cowardly presence. Emma Watson is great again but does not carry the entire trio like she had to in the previous film. There are plenty of new additions this time around and all of them were splendid. I particularly liked Dobby and Gilderoy Lockhart.\r\n\r\nHarry Potter and the Chamber of Secrets improves upon the first in almost every aspect, and that is all you can ask for a sequel.\r\n\r\n**Score:** _79%_ | \r\n**Verdict:** _Great_", "created_at": "2022-11-25T21:26:19.504Z"}, {"movie_id": 672, "review_id": "64f42d0e3d43e0011b1c00fd", "rating": 7.0, "review_text": "This second book in JK Rowling's \"Harry Potter\" series sees our trio of wizarding weans start to develop a much closer relationship with each other; and we begin to realise the challenges young \"Harry\" (Daniel Radcliffe) is to face as he grows up. This is much more sinister than the opener; Alan Rickman's \"Prof. Snape\" starts to come into his own as his evil nemesis v Maggie Smith as his professional proponent and \"Dumbledore\" (Richard Harris) starts to develop more as a character too. I could possibly have done without \"Moaning Myrtle\" but the story is well adapted and moves along quickly, with a little more humour than the original too. Again, the score and effects are hugely complementary to what is simply a cracking fantasy adventure story.", "created_at": "2023-09-03T06:51:58.913Z"}]