[{"movie_id": 913814, "review_id": "6213e550c9044c001b4317b6", "rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/brian-and-charles-spoiler-free-review-sundance-2022\r\n\r\n\"Brian and Charles will definitely end up as one of the most endearing, funniest, feel-good stories of the whole year. Jim Archer takes David Earl and Chris Hayward's original screenplay and uses their extraordinary, amusing performances to bring to life a narrative about true friendship and authentic human connections.\r\n\r\nThe light humor consistently forces the audience to let go of strong, loud laughs, either through genuinely hilarious interactions between the two protagonists or using physical comedy and brilliant song selection.\r\n\r\nIt may not be never-seen-before content or as inventive as expected, but it manages to deliver a memorable, entertaining, heartfelt story with beautiful messages.\r\n\r\nA must-watch!\"\r\n\r\nRating: A-", "created_at": "2022-02-21T19:17:36.568Z"}, {"movie_id": 913814, "review_id": "62aca6cb34e15204691ea87e", "rating": 7.0, "review_text": "Familiarities aside, _Brian and Charles_ is written in a way that tugs at your heartstrings and reminds us that we should be judged by what’s inside even if our insides are a plethora of tangled cords and flashing lights and not a beating, blood pumping heart. The film touches on loneliness and bullying that is easy to sympathize with if you’ve ever suffered from either. _Brian and Charles_ may revolve around a creative nerd as he succumbs to a violent bully, but the film is so pure and so wholesome that a little beach fanatic robot created in a cow shed makes you feel more human than any other film has in a long, long time.\r\n\r\n**Full review:** https://hubpages.com/entertainment/Brian-and-Charles-2022-Review-Cinematic-Naivety-At-Its-Finest", "created_at": "2022-06-17T16:07:39.252Z"}, {"movie_id": 913814, "review_id": "62c47199a313b80059631374", "rating": 6.0, "review_text": "David Earl is \"Brian\". He lives in a cottage in a rural Welsh location where he regularly turns his hand to inventing. Much like \"Caractacus Potts\" in \"Chitty Chitty Bang Bang\" (1968), his inventions are far fetched, half baked and frankly rather daft. Until, that is, he decides to convert an old washing machine into a robot. Miraculously - probably thanks to a mouse and a terrific thunderstorm - this robot comes alive, decides he wants to be called \"Charles\" and the two start to bond in a sort of parent to infant fashion. The latter having sped-read a dictionary is curious and inquisitive and determined to explore beyond the bounds of their small holding. \"Brian\", however, is much more wary of the reaction of their fellow villagers - a suspicion that is well founded when the local bully \"Eddie\" (James Michie) espies said creation and decides to procure him for his own daughters. Now it falls to to \"Brian\" and his parrot-loving friend \"Hazel\" (Louise Brealey) to rescue \"Charles\" from quite a grizzly fate. This film takes for ever to get going. Much of it is told as a monologue between \"Brian\" and the camera that I found missed many more times than it hit. \"Charles\" does come out with some witty observations that reminded me of the \"out of the mouth of babes...\" quote and that decent naivety and innocence is engaging for a time, but the joke wears really quite thin and resorts a little to rural stereotyping that didn't endure well for what felt like much longer than 90 minutes. It's an amiable enough watch, but perhaps wait til it appears on television in due course.", "created_at": "2022-07-05T17:15:05.111Z"}]