[{"movie_id": 256961, "review_id": "59dbe94f9251412514066b4c", "rating": 3.0, "review_text": "**Destination Las Vegas!**\r\n\r\nOne of the worst week for me as most of the of films I've seen were not up to any good. Okay, fine, the first part was decent. I thought a little refresher, somewhat funny too, so on such scenario, anticipating a sequel is common, but this is not what I wanted. After seeing this, I come to realise that the sequel was a bad idea. Seems funny, but no impact. In fact a little boring to see the same old comedy tricks again. Especially mocking a fat man is too offensive at the present era. So the hashtag on body shaming would go viral on social media.\r\n\r\nThey did not get a decent story. Even the film characters, including the villains were too old fashioned. Even this film had made in the 90s, might have not received well too. The concept of going vacation-come-convention, we had seen this before, are not we! Yeah, Paul after his short marriage and losing mother, he and his daughter heads to Las Vegas. Being watchful father and meeting his old friends, the adventure begins, when some criminal activity is going on behind the conference. His plan to save his daughter, as well as thwart the crime are the remaining focus of the film.\r\n\r\nI felt for a character like Paul Blart, casting Raini Rodriguez as his daughter was a little too much intentional. Yeah, the film was full of television guys every corner. Its not just direction, or performance failed, it was the writing. This kind of comedies is now considered ancient, that's why Rowan Atkinson stopped doing his routine comedies. But now it's certain that there won't be a third. If you had seen the first and not sure about this, believe me, you won't miss anything. Instead, I would suggest you to re-watch the original. That ain't a masterpiece, though a much better one.\r\n\r\n_3/10_", "created_at": "2017-10-09T21:25:35.383Z"}, {"movie_id": 256961, "review_id": "64b27c8b0bb07600caf84b73", "rating": 2.0, "review_text": "I like Kevin James. I watched every episode of \"The King of Queens,\" and his special \"Kevin James: Sweat the Small Stuff\" is one of my favorite stand-up comedy concerts of all-time. He's a big guy with a flawless delivery, and he can be very funny. He can also be very unfunny.  Paul Blart (Kevin James) is a mall cop living in New Jersey with his daughter Maya (Raini Rodriguez). His wife (Jayma Mays, with a few seconds of screen time) from the first film has left him after six days of marriage, and his mother (Shirley Knight, also with a few seconds of screen time) is killed by a milk truck, so he is feeling pretty low. Maya has been accepted to UCLA, and finds out on the same day that Paul is invited to a security officer convention at the Wynn Resort in Las Vegas. He is still basking in the glory of his exploits in the first film, and he and Maya head west. Maya is smitten right away with resort employee Lane (David Henrie, given nothing to do), and Paul deals with a supporting cast of freakish security officers from around the country, as well as a team of art thieves led by Sofel (Neal McDonough, slumming and wasted). This sets up a long, dry series of pratfalls and lame action sequences as Paul battles the baddies after Maya and Lane are kidnapped.\r\n\r\nAs they did in the first film, James co-wrote the screenplay with comedian Nick Bakay, so the laughs should be here. It's weird that James doesn't seem to have a handle on his own creation. Is Paul a stupid oaf, or a genius detective trying to break out of his boring job? Here, we get both characteristics. His arrival in Vegas and dealings with the casino staff is supposed to be fish-out-of-water funny, but fall flat because James plays Paul as a sociopathic jerk. I could not stand this guy. The only scenes I smiled at were when hotel manager Divina (Daniella Alonso) kept finding herself attracted to Paul, and even that running gag didn't get going until after their first awkward encounter; and Muhrtelle (Bob Clendenin), the casino employee with the banana. The film is rated (PG) and family friendly, so the violence here are guns with silencers that never hit their target, and Paul falling down a lot. A supporting roster of familiar faces and character actors- look at that cast list!- stand around and watch Paul fall down a lot. Paul falling down a lot isn't that funny. The Wynn Resort is nice to look at and makes for a great action film setting, but this is not that action film. I don't see another \"Paul Blart\" film on the horizon, this one did poorly at the box office, but since it was released six years after the mediocre first film, you never know.", "created_at": "2023-07-15T11:01:31.803Z"}]