[{"movie_id": 964980, "review_id": "6439143437b3a900d4fe30f0", "rating": 7.0, "review_text": "Matt Damon is on strong form here as the out-of-shape Nike basketball executive Sonny Vaccaro. At the usual routine selection meeting at the start of the season he realises that their paltry $250k budget isn't going to enable them to sign anyone with enough impact to lift his company from a distant third behind Converse and Adidas in the market. A bit of lateral thinking and some convincing of marketing VP Rob Strasser (a good effort from Jason Bateman, too) takes him before the bare-footed, grape coloured Porsche owning, Phil Knight - the CEO (Ben Affleck) with an off-the-wall plan to put all of their eggs in one basket and go for the upcoming Michael Jordan. Scepticism abounds, not least because the man's agent (Chris Messina) makes it clear that Jordan has no interest at all in signing with them. Vaccaro is not a man to take no for an answer and what now ensues demonstrates how his unorthodox methods, his honesty, determination and his ability to coax, cajole and persuade managed to create something that is not just the stuff of sporting history, but of visionary commercial history too. A few potent appearances from Viola Davis illustrate that Vaccarro was not the only shrewd individual at the negotiating table and there are some lovely, almost head banging, appearances from Messina as the deal edges ever closer (or does it?). Affleck also appears infrequently, but he is effective - indeed his one set piece scene with the Jordans is actually quite cringeworthy to watch. It's a well known story so the plot hasn't any jeopardy. That said, though, Affleck manages to create a sense of will they/won't they that sustains this characterful and entertaining drama for just short of two hours and puts the engaging dynamic between Damon and Bateman to good use. The script is quickly paced, frequently pithy and has a natural flow to it that - save for Chris Tucker's portrayal of Howard White which I found just a bit too Jesse Jackson for me - all works well. I am not sure this is a film you will remember down the line, but I did enjoy it.", "created_at": "2023-04-14T08:52:05.001Z"}, {"movie_id": 964980, "review_id": "6444c961a06efe0578a5398a", "rating": 8.0, "review_text": "“Air” is a sports marketing drama that delivers satisfying entertainment with a feel-good, universal appeal. Never would I have guessed that a film about business deals and shoe marketing would be so engaging, but this true story about the game-changing partnership in 1984 between an NBA rookie named Michael Jordan and the athletic apparel company Nike is gratifying on all levels. You don’t have to be a basketball fan or even know anything about Jordan to enjoy this film. It’s a biopic all right – but of the men behind the Air Jordan sneaker line, not the superstar athlete.\r\n\r\nDirected by Ben Affleck (who also co-stars), the film explores the history of how the legendary Air Jordan sneaker line was birthed into existence, telling the story of the high-stakes business gamble that had the potential to make or break Nike.\r\n\r\nWhen scout and basketball division lead Sonny Vaccaro (Matt Damon) sets his sights on the talented UNC rookie (who has recently been drafted by the Chicago Bulls) to be the athlete that Nike needs to boost their shoe line, he is met with resistance from his team of reluctant colleagues. They’re skeptical at first, but eventually find Sonny’s passion to be contagious and hop on board.\r\n\r\nMuch of the narrative is focused on the behind-the-scenes company men, discussions about money, and valid concerns about taking a huge risk on Sonny’s gut feeling that this kid has the potential to become an international sports superstar. There’s a lot shown about the creativity process, brainstorming sessions, and outside-the-box marketing that helped Nike sell their shoes to an up-and-coming NBA player. Although it may sound like it, this isn’t a dry business story, but an enjoyable film filled with casual charm.\r\n\r\nAffleck includes a who’s who of Nike in the 80s, from Peter Moore (Matthew Maher), Nike’s Creative Director and the man who designed the Air Jordan sneaker (and also had the brilliant idea to put Jordan’s silhouette on the product line), Howard White (Chris Tucker), who influenced the basketball player to sign with the company, Marketing Director Rob Strasser (Jason Bateman), and Nike co-founder Phil Knight (Affleck), who credits the Air Jordan as the product that saved his company.\r\n\r\nA secondary plot line involves Sonny’s efforts to convince Jordan’s bulldog agent David Falk (Chris Messina) and family, in particular his smart and savvy mother Deloris (Viola Davis), to sign with Nike over the more popular competing brands Converse and Adidas. Discussions between Sonny and Deloris deliver the film’s most powerful scenes, especially when you see a tenacious mother who knows her son’s worth and has no problem holding her own in a room full of corporate suits. It’s unusual to find a film that keeps the audience invested in the story from both sides, and I found myself hoping for Sonny to land a great contract but also for Deloris to get the best deal possible for her son and family.\r\n\r\nTo reveal more about the story would constitute major spoilers, especially if you are unfamiliar with the history of the shoe, but Affleck’s storytelling is so engaging that it will keep you emotionally invested even if you know the eventual outcome.\r\n\r\nAs a director, Affleck has an enviable, natural flair for telling true stories. His casual style and instincts are on full display here. The film is an example of one of those instances that are few and far between, where the subject matter is the perfect match for the director. This is a story that obviously is close to Affleck’s heart, and it’s reflected throughout the film.\r\n\r\n“Air” is a well-made movie about the American Dream from two different sides of the equation. There aren’t many missteps here, and everything from the direction, lively screenplay (written by Alex Convery), and warm performances all flow together in perfect harmony.\r\n\r\n**By: Louisa Moore / SCREEN ZEALOTS / WWW.SCREENZEALOTS.COM**", "created_at": "2023-04-23T06:00:01.959Z"}, {"movie_id": 964980, "review_id": "64633e8de3fa2f0187b9b73a", "rating": null, "review_text": "A staggering tale of an unhinged perseverance which is backed by a captivating screenplay.\r\n\r\n\r\nAir is a story so frivolous and flat , that the courage of Ben Affleck should be lauded with our hats down. A simple plot which would fit within 3 lines of a page is magically presented to us as a fascinating and appealing peace of history which changed the strature of business in sports in America and revolutionized a global culture, Nike's collaboration with the greatest basketball player in the history of the game, \"Michael Jordan\". The 2 hours doesn't feel long when you have a dazzling screenplay & a marvelous ensemble cast with their pragmatic conversations. Ben Affleck really puts in a fine effort to yield such sensational performances for the star studded cast. \r\n\r\nBrilliant is an understatement for the ensemble cast. I have never seen a better grounded performance of Matt Damon than this. He is sensational. Jason Bateman and Viola Davis add the much needed spark with their magnetic performances. Good to see Chris Tucker back and boy he just gets his sense of humor right each time. The banters between Matt and Chris Messina is the highlight for me. Ben Affleck is a master in terms of direction, the way he manages veterans into building such a collaboration is astounding. \r\n\r\nOverall, If you believe in uplifting stories behind sports and redefining moments of history which changed the world we live in today then Air is a great addition to your watchlist. \r\n\r\nInstagram @streamgenx", "created_at": "2023-05-16T08:27:57.116Z"}, {"movie_id": 964980, "review_id": "64656d62006b0100e6b2b9d5", "rating": 9.0, "review_text": "Slightly forced 1980s aesthetic/nostalgia trip aside, <em>'Air'</em> is quality!\r\n\r\nThe 80s was before my time, so I guess I'm not best placed to talk about it, but the constant shots of 80s things with 80s music with extremely 80s enviroments did get a tiny bit tiresome to me. I recall people saying similar-ish with <em>'Stranger Things'</em> season 3, though I found the mix of it there to more befitting. I'm nit-picking, I know, but it just was super noticeable to me here.\r\n\r\nAnyway, enough of that unimportant stuff. The film is great. The whole cast do terrific work, particularly Matt Damon, Viola Davis (the phone call scene between those two is excellent), Jason Bateman and Ben Affleck. I'd say the secondary portion of the almost 2hrs is the stronger, prior to that I was intrigued but not invested... by the end I was both. It's a predictable story, but that doesn't make it any less enjoyable.\r\n\r\nThe decision to practically not have a Michael Jordan character in a movie about Michael Jordan is an interesting one. It feels a tad awkward when he is in a scene and they intentionally 'hide' him. I get why, and it mostly works, but it does feel dorky at a point or two.\r\n\r\nOverall, very good. To be honest, ignore my above nit-picks - it's most definitely worthy of a watch.", "created_at": "2023-05-18T00:12:18.625Z"}, {"movie_id": 964980, "review_id": "6557dd8c53866e00c5b2e107", "rating": 7.0, "review_text": "MORE SPOILER-FREE MINI-REVIEWS @ \r\n\r\n\"Air soars with a chemistry-filled cast, offering lively performances across the board, with Matt Damon standing out in particular. Alex Convery's excellent script showcases some of the sharpest writing in recent sports biopic history, blending humor and drama seamlessly, despite not breaking any new ground within the subgenre, adhering to familiar tropes and overall structure. The kinetic dialogue keeps every scene incredibly entertaining, making the almost two-hour runtime fly by. Ben Affleck continues to prove his talent as both director and actor. Surprisingly engaging even for non-basketball enthusiasts. A highly enjoyable, well-executed original story about how one shoe changed the world.\"\r\n\r\nRating: B+", "created_at": "2023-11-17T21:39:24.393Z"}]