[{"movie_id": 14292, "review_id": "550cad289251414691004180", "rating": 7.0, "review_text": "Disney doing what they do best with this sort of material.\r\n\r\nIt's a feel good sports movie based around the true story of Coach Herb Brooks (Kurt Russell) who had the unenviable task of leading the 1980 U.S. Olympic hockey team in the Winter Olympics at Lake Placid. Where the all conquering Russian squad were waiting.\r\n\r\nWe follow Brooks as he assembles a youthful squad then pushes them to the limits, mentally and physically, all while facing pressures in his home life as he gives his all on the ice rinks. If you know your sports history then there's obviously no surprise factor here, but there's good insight into squad dynamics, of coaching and toughness involved in the many facets of high level sport. Russell leads his young cast admirably, while the action scenes during the matches have a kinetic energy that's most impressive. 7/10", "created_at": "2015-03-20T23:28:40.774Z"}, {"movie_id": 14292, "review_id": "5fa047f65f2db1003a27e7eb", "rating": 8.0, "review_text": "I do love a sports drama, which is fortunate as Disney sure do a lot of them!\r\n\r\n<em>'Miracle'</em> is very good, as it details the events of the 1980 Winter Olympics between the hockey teams of the US and the USSR. The constant connections to world events can feel a little forced in parts, but I entirely get what they were going for - it doesn't hamper things at all, anyway.\r\n\r\nKurt Russell is superb as Herb Brooks, he's far and away the best and most interesting character/actor onscreen. Russell nails the role. Elsewhere, Noah Emmerich does a solid job, as do those who portray the players - even if none of them stick in my memory much.\r\n\r\nThe score is strong, as are most things about this film. It probably goes on for a tad too long, they could've cut thirty minutes without losing anything major. It doesn't drag though, to its credit.\r\n\r\nIn conclusion, this 2004 production is 100% worth a watch.", "created_at": "2020-11-02T17:55:02.999Z"}]