[{"movie_id": 121, "review_id": "51ea5212760ee3602024ac6f", "rating": 10.0, "review_text": "Peter Jackson has always maintained that The Two Towers is \"the second act\" of his epic undertaking, and perhaps the true greatness of the middle chapter will only be clear when viewed in context. As a stand-alone film, however, The Two Towers is not quite as good as Fellowship. (Nor, indeed, does it extend the universe or deepen the relationships in the manner of The Empire Strikes Back.) That it still merits the full five stars is merely an indication of how high the benchmark has been set.\r\n\r\nPicking up pretty much where Fellowship left off, this is a considerably darker film, with Frodo (Wood) falling further under the influence of the Ring (giving rise to some seriously spooky hallucinations), while Saruman (Christopher Lee) wreaks even more havoc. There's also the first appearance of Saruman's spy, the sinister Wormtongue (Brad Dourif), and the complex Gollum, a brilliant combination of computer trickery and raspy vocals from Andy Serkis (the campaign for a Best Supporting Actor Oscar starts here).\r\n\r\nOther newcomers include Faramir (David Wenham), the understandably miffed brother of the recently deceased Boromir, and Éowyn (Miranda Otto), who spends much of her time casting winsome glances in the general direction of Aragorn (Mortensen). Eventually the plot complexities become more coherent, setting the action up for the forthcoming finale, The Return Of The King.\r\n\r\nAs we've come to expect, this is spectacular stuff - from an opening which sees Frodo troubled by dreams about the demise of Gandalf, through to the climactic Battle Of Helm's Deep, which is nothing short of breathtaking. But Jackson cleverly tempers the louder, brasher sequences with some heartstring-tugging moments - peasants despondent as they are forced to abandon their villages, Aragorn and Arwen's troubled relationship, and, of course, the return of Gandalf (Sir Ian McKellen, superb as ever), one of the film's most powerful, memorable images that may well leave Ring devotees a little misty-eyed.\r\n\r\nHowever, those who still believe that the trilogy is beyond criticism may find their views challenged by The Two Towers. It's just as long as the first film, but gets the heroes no closer to a final victory. And, where the first movie developed its emotional tone from the brightness of The Shire to a darker climax, the sequel is more of a one-note affair, shadowy in both look and content.\r\n\r\nThis is particularly true of the Ringbearer's quest, which adds the not-insignifcant Gollum to the party, but suffers more than the other story strands from the cross-cutting and finishes with a nearly identical pep talk from Sam to the tearful speech that climaxed Fellowship. Of course, given the nature of the material, and Jackson's desire to be faithful, this is all understandable. And by the time we all end up under siege at Helm's Deep, it's unlikely anyone will give a toss about narrative arcs: like Gollum, this is simply gob-smacking, mind-blowing, never-seen-before stuff.\r\n\r\n\r\nVerdict - It may lack the first-view-thrill and natural dramatic shape of Fellowship, but this is both funnier and darker than the first film, and certainly more action-packed. An essential component of what is now destined to be among the best film franchises of all time. \r\n\r\n5/5\r\n\r\n- Caroline Westbrook, Empire Magazine", "created_at": "2013-07-20T09:02:10.990Z"}, {"movie_id": 121, "review_id": "5aa436d1c3a3687c06010e30", "rating": 6.0, "review_text": "That Damned Ring.\r\n\r\nRELEASED IN 2002 and directed by Peter Jackson, “The Lord of the Rings: The Two Towers” adapts the second part of JRR Tolkien’s popular fantasy trilogy about adventures on Middle-Earth. The surviving ‘Fellowship’ of the first film has been divided into three small groups for this one: The Hobbits Frodo and Sam (Elijah Wood and Sean Astin) team-up with the mad Gollum (Andy Serkis) to make their way to Mordor, but are captured by Faramir (David Wenham), the brother of the deceased Boromir. Aragorn (Viggo Mortensen), Legolas the Elf (Orlando Bloom) and Gimli the Dwarf (John Rhys-Davies) encounter the once-great King Theoden (Bernard Hill), who has fallen under the spell of Saruman (Christopher Lee) via his devious minion Grima Wormtongue (Brad Dourif). Meanwhile the Hobbits Pippin and Merry (Billy Boyd and Dominic Monaghan) try to enlist the help of huge tree creatures. Gandalf is also on hand (Ian McKellen). These story threads culminate in the great Battle at Helms Deep in the third hour.  \r\n\r\nThis three-hour fantasy/adventure starts out more engaging than the first film, which was laden by its overlong, convoluted and (for the most part) unnecessary prologue. Like that movie, the characters are colorful, the tale is imaginative, there’s a lot of brutal action rounded out by quieter moments and everything LOOKS and SOUNDS great. Unfortunately, after the first act, Jackson opts for CGI porn (excessive use of CGI with the corresponding dizzying visual effects). The first film did this too, but this one ups the ante and so there’s not as much spectacular New Zealand cinematography (i.e. real forests, mountains, rivers, etc.). If cartoony CGI is your thang then you’ll likely appreciate this installment more than me.        \r\n\r\nThere are other problems: While the characters are imaginative, they’re also shallow and rather dull, at least for mature people who require more depth to maintain their interest. Also, the wide-spanning (meandering) story with numerous characters and hard-to-remember names tends to be disengaging. I was never much captivated by the characters and their causes, although uber-fans of Tolkien might be.  \r\n\r\nAnother problem is the lack of prominent female protagonists. We have Miranda Otto as Éowyn, Théoden's niece, who falls in love with the noble Aragorn and that’s about it, except for cameos by Liv Tyler as Arwen and Cate Blanchett as Galadriel. “Mythica: A Quest for Heroes” (2014) cost LESS THAN $100,000 to make, which is a mere fraction of the $94 million it cost to make this blockbuster and the filmmakers knew enough to include a couple of prominent babes as key protagonists in the story. \r\n\r\nDespite these negatives, “The Two Towers” was an ultra-ambitious undertaking and is a must for fantasy/adventure aficionados who liked the first movie.                      \r\n\r\nTHE MOVIE RUNS 2 hours 59 minutes and was shot in New Zealand.  \r\n\r\nGRADE: B-/C+", "created_at": "2018-03-10T19:49:37.379Z"}, {"movie_id": 121, "review_id": "5f6037a5156cc70036db8ed3", "rating": 9.0, "review_text": "Still probably my favorite of the three, while it's pretty streamlined and far more action centric with little development compared with Fellowship of the Ring and Return of the King, I always find this one really entertaining with the Helm's Deep battle. **4.5/5**", "created_at": "2020-09-15T03:40:21.954Z"}, {"movie_id": 121, "review_id": "602c713cd94035003f74dafe", "rating": 9.0, "review_text": "I might not have enjoyed it as much as the first film, but <em>'The Lord of the Rings: The Two Towers'</em> is still a terrific film no doubt.\r\n\r\nVisually it still looks superb, I really do love the look of these films so far. The main plot is engaging and very interesting, while things like the costumes et al. remain at a high level. There is also top action, including some noteworthy battle sequences.\r\n\r\nThere are, though, a few bits I found less great - still very good in the grand overall scheme, but just comparably with the 2001 release. I found the pacing to be slightly off in moments, while a few of the new cast members didn't connect to me - e.g. Bernard Hill. The side story, meanwhile, with Billy Boyd and Dominic Monaghan didn't interest me at all... they spend too much of the run time just walking through a forest.\r\n\r\nElijah Wood remains good though. I did enjoy seeing the journey of Frodo and Sam (Sean Astin). Andy Serkis also gets more screen time with that aforementioned duo as Gollum, which is most definitely only a major positive - a fun character! Any scene with those three = outstanding.\r\n\r\nOverall, as noted, it is still an excellent film. One very much worthy of following <em>'The Lord of the Rings: The Fellowship of the Ring'</em>, despite a few 'issues' I have with it.", "created_at": "2021-02-17T01:28:28.169Z"}, {"movie_id": 121, "review_id": "643e248dd7a70a053caaeb6b", "rating": 10.0, "review_text": "An awesome middle story of the trilogy.\r\nThe world of hobbits, elves, dwarves, and others finds a fellowship of nine beings separated to go on different paths. One is dead. Two are captured by orcs. One is presumed dead, but returns in a more powerful form. Three go to war. \r\nThe other two become the focus of this story. Hobbits Frodo and Samwise take a magic ring into the land of a devil and his beings, and find a guide, the pathetic Gollum, to aid them.\r\nMeanwhile, the three at war meet with the most interesting and multi dimensional character, King Theoden, and aid him against an onslaught of orcs and Uruk Hai. \r\nA lot of subplots go on, making this an unusually good connecting piece to the first and third films.", "created_at": "2023-04-18T05:03:09.057Z"}, {"movie_id": 121, "review_id": "64f42d7e9e45860100309f70", "rating": 8.0, "review_text": "Having used the first film to magnificently, if - at times - a little too earnestly, set the scene and establish the characters, Peter Jackson now cleverly interweaves the continuation of the story as \"Frodo\" (Elijah Wood) and \"Sam\" (Sean Astin) take their evil talisman and make their way to the treacherous \"Mount Doom\" - alighting on the untrustworthy \"Gollum\" (a wonderful Andy Serkis) en route - to destroy it. Meantime \"Gandalf\", \"Aragorn\"; \"Gimli\" and \"Legolas\" must track down \"Pip\" and \"Merry\" and stop \"Rohan\" from being over-run by the marauding hordes of \"Saruman\". This is certainly my favourite of any of the Wingnut Productions - the drama is compelling, exciting and the performances from all really draw you into the jeopardy of our questers. The imagination of the author is now in full swing as battle lines are firmly drawn - even the mud seems to be taking sides; the trees certainly do! The CGI is less effective in this film; particularly when used against the close up and the \"Treebeard\" scenes where it is oddly static and sterile, but the siege and battle scenes at \"Helm's Deep\", some poignant bonding moments between the elf and his dwarf companion and again the terrific accompaniment from Howard Shore make this, for my money, one of the best adventure films ever made. The director's cut - at a meagre 235 minutes - flew by on the big screen and sets it all up for a gripping finale in \"Return of the King\".", "created_at": "2023-09-03T06:53:50.746Z"}]