[{"movie_id": 454626, "review_id": "5e5bf6a9357c00001329c781", "rating": 4.0, "review_text": "I had high expectation for Sonic, simply because I love the concept of \"super-speed\" but it didn't deliver. The latest trailer had all the good scenes. A lot of scenes involving super-speed are incoherent and made no sense. You cannot have a missile frozen in time and a the same time a button push going faster (that's just one example). Jim Carrey nailed the role as Eggman.\r\n\r\nhttps://wefishmovies.herokuapp.com/views/movie-info.php?tmdb_id=454626", "created_at": "2020-03-01T17:53:45.083Z"}, {"movie_id": 454626, "review_id": "5e7d5ae7109dec1ebb02fd1c", "rating": 6.0, "review_text": "In what could only be a dead-of-winter miracle in the Upside Down, I just saw an inspired-by a video game movie that wasn’t absolutely terrible. There is nothing about “Sonic the Hedgehog” that seems like it will be watchable, much less actually good, but I’ve been proven wrong by this lively, wacky, and campy family film. There’s oodles of fun to be had here by both adults and kids.\r\n\r\nThis live action adventure comedy is based on the blockbuster SEGA game that centers around a speedy bright blue hedgehog named Sonic. Basing a movie on a flimsy gaming character will be ill-advised at least 95% of the time, but this movie finds the ideal balance between a lively (if basic) original story and well-placed Easter eggs for fans. Here, Sonic (voiced by Ben Schwartz) has a series of misadventures on Earth with his newfound human friend Tom (James Marsden), a small-town police officer. The two have to work together to stop the villainous Dr. Robotnik (Jim Carrey) from capturing Sonic for his evil experiments.\r\n\r\nThe themes of friendship and loneliness are at play, and the cast does a great job keeping things fun. Marsden is ridiculously likable and goofy as an everyman, and Schwartz brings an empathy that carries the majority of the film with his voice performance. Best of all is Carrey, hamming it up with a manic stamina that’ll remind you why you always loved him in the first place.\r\n\r\nThere are plenty of action scenes and rude humor (and a couple of strange, over-the-top scenes that read as advertisements for Olive Garden), which are all entertaining enough to recommend “Sonic” for a fun family night out at the movies.", "created_at": "2020-03-27T01:46:15.323Z"}, {"movie_id": 454626, "review_id": "5e89f7656c74b9001597a16f", "rating": 5.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nSonic the Hedgehog was one of my Most Anticipated Movies of 2020, not because I expected it to be one of the best films of the year, but due to the controversy that surrounded it. The original design of Sonic was awful, and a lot of people still blame the VFX artists/animators unfairly. These people work extra hours, they're underpaid, and they were given an impossible schedule to deliver a masterful work. Fortunately, most people now recognize that the studio and all of its execs are the ones to blame.\r\n\r\nThe Internet voiced its opinion in a very polite manner (as usual), but this time, an unprecedented event occurred: the studio actually listened and decided to delay the movie until Sonic received a better treatment visually. Now, I firmly believe that, in any other case, this would be extremely dangerous. I don't think the audience should have this much power over the studios, especially through social media. I mean, if studios changed their films every time people criticized a design or an adaptation decision, movies would be constantly delayed. However…\r\n\r\nIn this particular case, I'm super glad they did it. One question a lot of people might ask is, \"how would this film perform with the old design?\". It would be horrible. There's absolutely no chance of people enjoying this movie with the previous Sonic. This new design not only honors the character's visuals, but it complements the film's tone. Jim Carrey delivers an incredibly cartoonish performance, which would become way too out-of-place if Sonic looked (awfully) real. Having both the hero and villain being/acting like a cartoon, that awkwardness doesn't exist.\r\n\r\nSonic truly is the best part of the whole thing. If you've played the games and if you carry an emotional connection to this character, there are tons of scenes for you to enjoy. Sonic looks wonderful, sounds fantastic (excellent voice work from Ben Schwartz), and best of all, his personality resembles the videogame character. Everything that's directly Sonic-related is perfectly faithful to the source material, which will definitely please every Sonic fan. That's pretty much my main message: if you're a fan of the little blue guy, I can't imagine anyone being disappointed.\r\n\r\nUnfortunately, he's honestly the only great aspect of the movie. It's really cool to watch Jim Carrey going back to his roots and having so much fun with his role. However, he's very hit-and-miss. When he's condescending someone, he's quite funny, but Carrey's mannerisms don't always work. Still, once again, I believe he's very faithful to the original Dr. Robotnik, who was by no means a \"normal\" person. James Marsden is really good as Tom, but his character never goes beyond \"Sonic's pal\".\r\n\r\nMy main issues are regarding the screenplay. No, I never expected it to be an Oscar-worthy narrative. I just wanted a simple story that allowed Sonic to shine, and in the film's defense, it's indeed a basic plot. However, the sheer abundance of cliches, the lack of any surprises, and the logical questions raised by some narrative decisions are too much to handle, in my opinion. There are three product placement scenes that are some of the laziest, obvious, cringe-worthy examples since the Transformers' movies. It feels like the film stops to have a few commercials.\r\n\r\nSubplots that serve as tension-building during the movie fail to have a resolution by the end. Storylines that were once important are entirely forgotten and never addressed again. Every single character serves as comic-relief, everyone gets to be the \"clown\". I repeat: I never expected a brilliant screenplay. But is it too much to ask the writers to have as much dedication and creativity as the VFX artists who handled Sonic? The latter group worked like crazy to deliver a perfect design. Why can't the writers try harder to offer a more compelling, unique, and rational story?\r\n\r\nThe way Dr. Robotnik comes into play and the level of permission he has to do whatever he desires to is laughable. Everything human-related raises too many eyebrows and rolls too many eyes. I've commented about the film online, and some people addressed me by saying, \"you're overanalyzing /you're expecting too much from it\". I wholeheartedly understand these observations, I genuinely do. The thing is: I don't believe I'm overthinking, let alone expecting it to be a masterpiece. Why should people simply accept that a movie \"can't be better than what it is\"? Why can't people ask for the potential that a Sonic film has? Why should I be content that it's \"not bad\"?\r\n\r\nI'm completely honest: I wanted to like this movie way more than most people. The whole controversy concerning Sonic's design and the unfair blame that the VFX artists received, left me with an overwhelming desire to absolutely love this film, so I could support the massive work that these people went through. I love everything that's Sonic-related in the movie. His design, voice, and personality are spot-on, and I can't imagine a single fan of the little blue hedgehog being disappointed. However, even with a really good cast and a 90s' Jim Carrey, Sonic the Hedgehog is packed with extreme cliches and narrative decisions that roll too many eyes. Some of the most obvious and cringe-worthy product placement since Michael Bay's Transformers. Characters built from Hollywood's recycling box and side stories are thrown away with no resolution. It's a fun adventure that any family can enjoy on a Sunday afternoon, but I can't lie to myself: I wish it could have been more entertaining and less frustrating story-wise.\r\n\r\nRating: C+", "created_at": "2020-04-05T15:21:09.180Z"}, {"movie_id": 454626, "review_id": "5e90f04537b3a9001b8b0b8f", "rating": null, "review_text": "The world needed a hero -- it got a hedgehog. Powered with incredible speed, Sonic embraces his new home on Earth -- until he accidentally knocks out the power grid, sparking the attention of uncool evil genius Dr. Robotnik. Now, it's supervillain vs. supersonic in an all-out race across the globe to stop Robotnik from using Sonic's unique power to achieve world domination.", "created_at": "2020-04-10T22:16:37.121Z"}, {"movie_id": 454626, "review_id": "5e911f08180dea0011163b63", "rating": 8.0, "review_text": "Jim Carrey as a bad guy... great bad guy, full of zeal for being the worst bad character ever, and not being his usual self. Sonic - the main character is fun, even if his backround story sucks when compared to other characters. Still, it is fun, full of energy, and a good movie to share with kids.", "created_at": "2020-04-11T01:36:08.738Z"}, {"movie_id": 454626, "review_id": "5ebd92103d3557001ddc7fc0", "rating": 7.0, "review_text": "Cute, family-friendly, comedy that's entertaining enough and sees Jim Carrey back in whacky, over-the-top form that's been missing the past decade plus it seems, and he works so well in this kind of film. Nothing innovative and the visual effects are hit or miss, however Sonic's design was well done (so thankfully the initial version was scrapped and redone from scratch). **3.5/5**", "created_at": "2020-05-14T18:46:40.642Z"}, {"movie_id": 454626, "review_id": "5ec3bbf23d3557001eea672e", "rating": 3.0, "review_text": "My roommate is a **huge** Sonic fan, and she loved it. I never really cared for the games as a kid, but I liked them a lot more than I did this movie. \r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2020-05-19T10:58:58.328Z"}, {"movie_id": 454626, "review_id": "6036838cb76cbb0040cb14fa", "rating": 6.0, "review_text": "Good watch, could watch again, and can recommend.\r\n\r\nThis is surprisingly good, and I went in with really low expectations.  Sonic has a long and very weird fanbase, along with a series of weird, weird choices in game designs.\r\n\r\nThe concept is very forced, but once you get past that and into actual Sonic content, it is actually a lot of fun.  Jim Carrey does a wonderful version of Dr. (Eggman) Robotnik, and the change to him originating in on Earth 1 actually works really well.\r\n\r\nI feel like there is a possibility for a series of movies surrounding the dark organization Robotnik was from.  Carrey, Marsden, and the Sonic character have a some great chemistry.\r\n\r\nWhile its not a great movie, it's definitely a lot of fun, and I think that is the right choice for a Sonic movie.", "created_at": "2021-02-24T16:49:16.427Z"}, {"movie_id": 454626, "review_id": "6256774d323eba07e51afa11", "rating": 10.0, "review_text": "Very good film for milineals", "created_at": "2022-04-13T07:10:05.919Z"}]