[{"movie_id": 173897, "review_id": "58a50e97c3a3684f01001a30", "rating": 5.0, "review_text": "Some cool ideas but Anderson brings a new level of visual incoherence to the action scenes that is confounding and irritating rather than thrilling. It's as if he hasn't watched a single action movie in the last decade.\r\n\r\nNot to mention so many stupid jump scares I had to wonder if he was trying to get a job with Blumhouse.\r\n\r\nStill, Milla Jovovitch retains a steely charisma that remains compelling, but deserves far better material. Hopefully with this being the 'final' film she will be free to go and find it.", "created_at": "2017-02-16T02:29:43.400Z"}, {"movie_id": 173897, "review_id": "58b6862cc3a3680ee2007729", "rating": 7.0, "review_text": "I was scared by \"previews\" which said the editing was too chaotic.  My experience is mixed.  In the first 1/3 of the film, there is a ridiculous number of cuts in the action scenes (didn't like it), but afterwards this wasn't a problem.  So yeah, chaotic filming at the start, but much more enjoyable/conventional for the middle and end.\r\n\r\n(P.S. There is at least one VERY scary scene in the first 1/3... despite the chaotic cinematography!)\r\n\r\nThis film TRIED to tie up all the loose end of the franchise, but it didn't do very well.  At least we get to see Claire Redfield again... she looks hot as always, but we don't see her much, and she doesn't have anything to say about K-Mart or her brother, Chis Redfield!\r\n\r\nThe biggest disappointment for me was the lame death of the \"big bad\" ... that is, Wesker.  I won't spoil his demise here, but let's just say it was Dues Ex Machina... (for those without a Latin background, it means an ass-pull by the writers!)\r\n\r\nI guess Wesker was too awesome to defeat in a fair fight!  Anyway, the final battle of Alice was against *SPOILIER* Dr. Isaacs!  Actually the final battle was against Dr. Isaacs and his clone!!\r\n\r\nI have mixed opions about this film... it tried, and in some sense succeeded in giving a finality to the movie franchise.  But it also failed in many ways.  The 3D was pretty crappy compared to the last two films ( I just learned they filmed this one in 2D and then up-converted it to 3D in post-production... unlike RE 4 and RE 5 which were REALLY filmed in 3D... so yeah, the human eye [at least my eye] can spot the difference between real art and AFTER-THE-FACT-POST-PRODUCTION cinematography).\r\n\r\nAlso, they completely skipped what happened in Washington DC (the end of the previous film).  There is one line in the movie which referenced this... basically \"Wesker betrayed Alice and didn't REALLY give her back full power of the T-Virus\".  As a fan, I found this lame 1-liner very dissatisfying for the series finale! :(\r\n\r\nSo now you may think I am an RE hater, but that isn't the full truth.  I felt this film was *literally* too dark, and the 3D was merely acceptable (not fantastic like prior films), but it did give a conclusion and explored upon things like clones of Alice...\r\n\r\nI guess the only/biggest fault is the plot in the final scene... an air-borne virus, which will literally take years to work (according the movie itself!) manages to kill hundreds of thousands of zombies IN AN INSTANT... at the movie's climax... this is too convenient/stupid to be believed by anyone... even an RE Fan like me.  I'm sorry, but can you say EPIC FAIL?\r\n\r\n== EPILOGUE ==\r\nThis film tries, and in a few cases succeeds, to tie up the Resident Evil franchise.  But the fake-3D *FAILS* compared to the real-3D of the prior two films.  The horror factor REALLY IS much better than the last 3 or 4 films... but is it enough???", "created_at": "2017-03-01T08:28:28.209Z"}, {"movie_id": 173897, "review_id": "594a7167925141459b00d707", "rating": 6.0, "review_text": "I would say that my expectations for this movie was pretty much spot on. I expected a visual action feast with a fair amount of gore in it and that is pretty much what I got. Things like a well developed script and stuff like that, well obviously the producer thought asking for such things would be nitpicking.\r\n\r\nIt currently holds a 5.6 rating at IMDb and 60% user score on TMDb which is fairly well deserved. Of course there are always reviewers giving it single star ratings and saying it is the worst film ever. That is just bullshit. These people have obviously never seen a really bad movie.\r\n\r\nMilla Jovovich is again playing the hot zombie killing chick from the previous movies and although she tragically lost her superior T-virus strength in one of the previous installments her capacity for dealing death and mayhem as well as absorbing hits still borders on being super hero stuff. Unrealistic but fun to watch.\r\n\r\nDespite my comments on the script earlier there is actually one with a paper thin thread intended just to bring the story from point A to B with a maximum of violence and special effects in between. I do think the tanks that they had cooked up looked cool although they were just visual candy a’la Mad Max. I mean come one, a tank with ventilation shafts all over the place so all you had to do was pour some gazoline over it and light a match? Stupid to say the least.\r\n\r\nThere were a few other things was more designed for looks than realism. For instance a certain ventilation fan that were used to drag out some of the events. Who the f… designs a ventilation fan with a dozen or so rings of blades? It is a ventilation fan for Christ sake, not a jet engine turbine. Oh, yes of course, stupid me, otherwise they would not have to spend so much time crawling through it.\r\n\r\nI did like the various mutated zombies as well by the way. The flying thing at the beginning and the end was quite cool. Some people seems to have had an issue with the fast, sometimes very fast, clipping of scenes. I have to say that it did not disturb me that much. Not that it added much either though.\r\n\r\nSpeaking of the end. Well, I guess it was okay. The end itself was not too surprising. It was dragged down by the stupid nonsense with Dr. Isaacs though. The only time an exploding grenade resulted in anything less than a semi-atomic eruption of flames was of course when the director had decided that he needed the bad guy for a few more scenes. Lazy and stupid script writing.\r\n\r\nOn the whole I enjoyed the movie as much as I expected to. It was an okay movie. Good for a evening fix of zombie splattering and Milla Jovovich (okay so what, I am a male of traditional sexual orientation you know). It could have been a lot better but it was not really horrendously bad either.", "created_at": "2017-06-21T13:15:19.811Z"}, {"movie_id": 173897, "review_id": "599768cf92514164140008b8", "rating": 4.0, "review_text": "**Time to bring down the remaining of Umb Corp.**\r\n\r\nThe series never meant to be story based. Well, at the first it was fine, but then it turned out be more a video game style than the normal commercial films. So if you are going to watch it, your expectation from it should be the action-adventures. Of course, nothing happens without a reason, that's where the story was born. This is the sixth film in the series and they are saying it is the final, but have to wait and see in a couple of years, whether another film will be made or they are going for television as hinted out.\r\n\r\nThe main character is long dead, that's what they say to us every time. And then a new sequel with the same character and their explanation is, clone. That's seems okay, but that being a regular thing is what annoying. This film is enjoyable, like I say, watching a game played by someone sitting next to us. But not the best of the series or the year, nor its kind. Just to enjoy the action sequences. All the top, knowing about Olivia Jackson made me almost to cry. She's the real hero, hats off.\r\n\r\nAs I said, the film was not necessary if you go by the story. It was just another mission, a fight to bring down the last remaining Umbrella Corp and possibly to reveal more secrets about it and everything so far happened. I always wondered how this franchise survived this long. Yeah, every time a decent box office pushed the filmmakers and actors to go for another one. The film's main ingredient, graphics were acceptable, and performances too. So, it is only for the selected audience, but you can ignore it if you are not that interested in it.\r\n\r\n_4/10_", "created_at": "2017-08-18T22:23:11.279Z"}, {"movie_id": 173897, "review_id": "5fb988636a34480041193119", "rating": 5.0, "review_text": "Liked it a tad better than the first time, however still a bit convoluted conclusion and the biggest knock is they completely ignored any potential left from Retribution, that being the zombie siege on the White House with our heroes (and villain) taking one last stand. Instead, Jill Valentine is killed off-screen (I guess) as was Alice's \"daughter\" and instead we get a Dr. Isaac being a religious fanatic (well Dr. Isaac's clone of course) and a band of misfit characters (including Ruby Rose before she became famous I think), plus the return of Claire (Ali Larter) after being MIA in the last film.\r\n\r\nThere were some elements that weren't too bad, and the fight and stuntwork was alright, but as with the previous FIVE movies, nothing terribly memorable. And they leave it open-ended because, of course. Have to think any future installments will end up on whichever streaming service Sony makes a deal with... **2.5/5**", "created_at": "2020-11-21T21:36:35.830Z"}, {"movie_id": 173897, "review_id": "64dae12a59e8a9011c8a5d50", "rating": 6.0, "review_text": "For the final chapter, Alice has escaped to racoon city. Now the umbrella company is going to try to take down the last safe haven they have.", "created_at": "2023-08-15T02:21:30.094Z"}]