[{"movie_id": 223702, "review_id": "5831985192514162d802302c", "rating": 4.0, "review_text": "If you've watched the red band trailer, you've seen everything worthwhile that _Sausage Party_ has to offer.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2016-11-20T12:34:25.556Z"}, {"movie_id": 223702, "review_id": "5835d9449251416c6301934b", "rating": 7.0, "review_text": "**An uprising to liberate it the supermarket.**\r\n\r\nHow many R rated animated films have you seen? This is not a hentai, but the Hollywood's rare animated-adult-comedy. Most of the big names are here, especially the young generation. The film took me by a surprise. I did not know when it was made and what its genre, but the posters made me very curious the with double meaning punchlines. It was a silly story, something like a parody of Pixar's 'Toy Story', but a very enjoyable film as it is a rare product.\r\n\r\nIf you check the last two decade's records, the animation films tore apart the live-action films in the box office clash. It is shocking, but the fact that animations make good revenue. This film is a trend setter in animation genre that targets the adult audience. Like Hollywood found its counterpart from the Japanese hentai. It just cost only $20 million to make and the production quality was not very standard, but acceptable. Hope there will be more like this in the future, but I would seek a sequel for this.\r\n\r\nSeth Rogen was the main man behind this film. The rest of the cast too was good. Nothing but theirs voice lending made all the difference, especially you would know who were who, while a watch, that kind of familiar it was. The story of supermarket products from all the categories who fight for their freedom.\r\n\r\nI really enjoyed, it was short too, as well as a fast narration with some good adult jokes. There are a couple of negatives about it, like the first one was there's no innovation in it, like it is very familiar, but a different kind of comedy. And the next one was all the characters, I mean the supermarket products are American. So if you are a non-American, nearly 90 per cent you won't get what those items are. The adults should watch this, because I don't know when you will get another one like this in the future. So I definitely favour it.\r\n\r\n_7/10_", "created_at": "2016-11-23T18:00:36.779Z"}, {"movie_id": 223702, "review_id": "5ac9374692514162a2048857", "rating": 3.0, "review_text": "I got yelled at in the theater for snoring around the 70 minute mark. I didn't know I snored until Sausage Party. All I really saw were the intro scenes and an orgy at the end. The theater had more comfortable seating than I'm used to, and I just want to say I'm truly sorry to anyone around me that I disturbed", "created_at": "2018-04-07T21:25:26.683Z"}, {"movie_id": 223702, "review_id": "5e6de0f6459ad600186465c1", "rating": null, "review_text": "WTF? It was like Seth Rogen r***ed the shit out of Dreamworks animation. Seriously, WTF?!", "created_at": "2020-03-15T08:01:58.927Z"}, {"movie_id": 223702, "review_id": "5f94a9b8435abd003475f914", "rating": 6.0, "review_text": "Those scenes at the end... they really went for it!\r\n\r\n<em>'Sausage Party'</em> is as dumb a film as you'll find, it's purely nonsensical and extremely crass at times - pretty stereotypical too. Even with that being true, it does have some amusing gags in there; it got a few laughs out of me. It's uneasy, yet somewhat refreshing, to see an animated film be so raunchy. They do take it too far though, especially at the conclusion.\r\n\r\nSeth Rogen is the lead as Frank, he is exactly what you'd expect from a Rogen character; drugs et al. There are a number of other well-known names, from James Franco to Salma Hayek to Jonah Hill to Kristen Wiig. I can't say any of them stand out in my memory, admittedly. Animation-wise I found it fine.\r\n\r\nI commend them for going the full distance with this, but that probably harms the film in the long run. Adult animated films definitely have an open market and it would be cool to see it rise, but this film takes it too far into the lewd territory for my own liking - I didn't hate it though.", "created_at": "2020-10-24T22:24:56.611Z"}]