[{"movie_id": 70, "review_id": "5c1a63310e0a2657b61c54a7", "rating": 6.0, "review_text": "***Female “Rocky” with a downbeat and contradictory close***\r\n\r\nReleased in 2004 and directed by Clint Eastwood, “Million Dollar Baby” stars Eastwood as a cantankerous boxing trainer who owns a working class gym in Los Angeles, which is maintained by one of his former boxers, the narrator of the story (Morgan Freeman). A waitress from the sticks of Missouri (Hilary Swank) shows up and asks that Frankie (Eastwood) train her, which he refuses to do because she’s too old at 32 and he “doesn’t train girls,” probably because he had an unexplained falling out with his daughter years earlier. Eventually he begrudgingly agrees.\r\n\r\nThe bulk of the film is basically a female version of “Rocky” (1976), except that I prefer the potent drama in this one. The three main characters are well fleshed-out with an all-around reverent tone, not to mention an occasional bit of mild amusement. Frankie and Maggie (Swank) slowly develop a father/daughter-type relationship and it’s touching.\r\n\r\nThe third act, however, takes a left turn that is seriously downbeat. It departs from sports movie formula with a message that contradicts everything the first two acts pushed, which is inexplicable. Sure, I ‘get’ the point: A certain person basically sacrifices everything to do what’s (supposedly) best for the situation and honor the will of a dearly loved soul. Nevertheless, it’s a dark turn that leaves a sour taste because it refutes the positive message of the first two-thirds of the story.\r\n\r\nThe film runs 2 hours, 12 minutes and was shot in Los Angeles.\r\n\r\nGRADE: B-/C+", "created_at": "2018-12-19T15:26:41.514Z"}, {"movie_id": 70, "review_id": "6203291e5b124000d2fcbcb9", "rating": 10.0, "review_text": "Unreal! I didn't expect <em>'Million Dollar Baby'</em> to be so astonishingly brilliant.\r\n\r\nI've said it many a time before but for full context, I do not read up about films before watching them - aside from making sure the film isn't part of a franchise, checking the run time and seeing the genre - so I was expecting this to be a cliché-filled, but still great, sports flick. It's so much more than that.\r\n\r\nIt's way more deeper and has an everlasting impact that I hadn't anticipated. Even across the opening chunk I was predicating the obvious cliché ending, but as the film progresses and, especially, as the final portion rolls around it just absorbed my total attention - I was fully engrossed... hook, line, and sinker. Some film!\r\n\r\nThe cast are simply stunning. Clint Eastwood gives an absolutely fantastic performance, Hilary Swank is truly sensational - especially at the end, damn - and Morgan Freeman is Morgan Freeman; what an actor and what a voice, using him as narrator was a great move. Elsewhere, and though less dramatically, Jay Baruchel, Anthony Mackie, Margo Martindale and Michael Peña also feature interestingly.\r\n\r\nIt's quite the journey the film takes you on, which I just found utterly enthralling to watch unfold. Perfect pacing, perfect acting. I loved watching every second of it and will undoubtedly be revisiting it.\r\n\r\nI noted days ago that I was rather surprised to learn that Eastwood's <em>'<a href=\"https://letterboxd.com/film/unforgiven/\" rel=\"nofollow\">Unforgiven</a>'</em> had been so heavily acclaimed, on this occasion with this 2004 film I am the complete opposite. I don't care much for awards et al., but I am delighted to see all involved receive their props for this. Chapeau!\r\n\r\nMarvellous, just marvellous.", "created_at": "2022-02-09T02:38:22.989Z"}, {"movie_id": 70, "review_id": "637ea927229ae200c83808bf", "rating": 3.0, "review_text": "**Million Dollar Baby is an extremely well-done film that takes an abrupt turn to deal with incredibly sobering subjects that are definitely not what I thought I signed up for.**\r\n\r\nI know it’s supposedly a masterpiece, and I will lose some cred for saying this, but Million Dollar Baby was a dreadful movie. I spent the first half of the film falling in love with the hopeful, talented, and inspiring Maggie Fitzgerald and her redeeming of the cranky and lonely trainer, Frankie Dunn. But when the second half takes its giant turn, the story shifts from an endearing sports narrative about overcoming opposition and redemption to hopelessness and agony. Clint Eastwood directed a powerful story with impressive mastery, but the subject matter robbed the film of any enjoyment. For many, Million Dollar Baby deserved Best Picture at the Oscars. For me, I wish The Incredibles had claimed that victory.", "created_at": "2022-11-23T23:13:44.007Z"}]