[{"movie_id": 9885, "review_id": "4fd02b1a19c2956c2e001774", "rating": 9.0, "review_text": "Just when you thought it was safe to go hiking in the bushes again...along comes Mick Taylor. Kristy, Ben and Liz are three pals in their twenties who set out to hike through the scenic Wolf Creek National Park in the Australian Outback. The trouble begins when they get back only to find that their car won't start. The trio think they have a way out when they run into a local bushman named Mick Taylor. Wait until you get a load of what Mick has in store for them. Their troubles have just begun.", "created_at": "2012-06-07T04:16:26.000Z"}, {"movie_id": 9885, "review_id": "5db0d23fd05a030016bf6033", "rating": 7.0, "review_text": "I could tell you - but then I'd have to kill you!\r\n\r\nThree young travellers are making their way across the Australian outback in search of Wolf Creek, a mystical site where a meteorite struck and created a crater. After achieving their mission they endure car trouble and fearing that they are stuck in the middle of nowhere, they are relieved when help comes in the form of big Mick. At first he's a likable sort of man, but then Mick starts to show signs of strangeness as the evening progresses, and then the travellers fall asleep...\r\n\r\nDirected and written by Greg McLean, this Australian film opens with the ominous warning that it is based on real events. Clearly intent on grabbing the viewer by the throat with its raw and real feel, it should be noted however that the film is actually an amalgamation of ideas drawn from real Oz killers like \"Bradley John Murdoch\" and \"John Bunting\". Casting aside the film's boast of real life credentials, the question hangs on if it's actually any good?. \r\n\r\nMcLean has crafted a genuinely unsettling picture, one that upon theatrical release didn't in truth live up to the hyperbole that was so boisterously marketed back in 2005. Now that the furore has long since passed and the tag-lines running about \"A new dawn in terror\" and that the \"Reality is here\" have since faded away from memory, what is actually left to sample?.\r\n\r\nMcLean's film builds up nicely by letting us get to know our three soon to be troubled protagonists. Then it's enter Mick Taylor from outback stage right, and here is a larger than life bogeyman and one of the modern eras better, and yes, scarier creations. Taylor, excellently portrayed by John Jarratt, debunks the myth of the chirpy Aussie bushman, becoming the polar opposite to \"Crocodile Dundee\" (given a mention in one particular uneasy exchange). Then the terror starts, grim violence and unnerving dialogue seamlessly blends together, all shot in a docu-style on Hi-Def DV. \r\n\r\nHowever, with this narrative trajectory, where the usual formula escape attempts begin to arise, comes the exasperation that so often blights the horror genre. One particular opportunity that lands at Liz Hunter's feet, an opportunity that any sane person in the world would have taken, beggars belief, but then I guess if common sense ruled there would be no post script at the end - which is a post script that blatantly wants us to believe that what we have just watched really happened...\r\n\r\nThe last quarter is a touch rushed, and that's a shame since we have spent so much time in the company of the three actually likable and believable youths. It rather feels like a quick horror fix than the intended protracted line in terror that Mclean and co were going for. Nevertheless, it does actually work, and crucially it does frighten and hold the utmost attention. \r\n\r\nThe performances are strong, dodgy British accents aside, with the girls (Cassandra Magrath & Kestie Morassi) in particular convincing as being truly terrified. While the piece is, surprisingly in context of the material, beautiful at times. Red sunsets and the crisp dusky desert come vividly out the screen thanks to Will Gibson's excellent photography. Wolf Creek will not and can't hold up on repeat viewings, but it is still an effective entry in the horror genre, and with Jarratt's Mick Taylor there is a character that's unlikely to be forgotten in a hurry. 7/10", "created_at": "2019-10-23T22:20:47.267Z"}]