[{"movie_id": 395834, "review_id": "5a0523249251417e12007a3b", "rating": 7.0, "review_text": "The icy tundra of Wind River is an oppressive backdrop for this vicious crime thriller, with tones of Western.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2017-11-10T03:55:16.841Z"}, {"movie_id": 395834, "review_id": "5a9c42800e0a2630b8043bad", "rating": 8.0, "review_text": "RELEASED IN 2017 and written & directed by Taylor Sheridan, \"Wind River\" chronicles events at the remote Wind River Indian Reservation where a curiously barefooted young Native woman is found dead in the wilderness; a Fish & Wildlife tracker (Jeremy Renner) and an FBI agent (Elizabeth Olsen) team-up to solve the mystery. Graham Greene plays the Reservation police chief, Gil Birmingham appears as the victim’s grieving father and Jon Bernthal & James Jordan are on hand as security guards at a drill site. There are several others.  \r\n\r\nThe film is based on hundreds of actual stories similar to it. The issue of assault against Native women on Reservations, many mysteriously disappearing, has existed since the inception of the Reservation system, but in the past 15-20 years it has exploded and yet gets no attention, which was the motivation for the film. In ages past the tribes (e.g. Eastern Shoshone and Northern Arapaho) would migrate out of the area during the unrelenting winters, but the Reservation system basically forces the tribespeople to permanently stay where people weren’t meant to live year round (or so it is argued).\r\n\r\nThis is a straight-forward crime drama/murder mystery/thriller taking place completely in wintery conditions in the remote modern American West. The story starts kind of dull, but interest slowly builds until everything eventually explodes in the second half. If you like stories where the clues slowly lead to the culprit/culprits you’ll probably like this movie. Renner is a quality taciturn Westerner and likable Olsen with her cutie face & figure is strong on the female front. The action scenes are effective because they’re sudden & realistic and not over-the-top cartoonish.                                \r\n\r\nTHE MOVIE RUNS 1 hour 47 minutes and was shot in Utah (Coalville and Park City Studios) and Wyoming (Wind River Reservation, Fremont County and Lander). \r\n\r\nGRADE: A-", "created_at": "2018-03-04T19:01:20.106Z"}, {"movie_id": 395834, "review_id": "5ab3ec549251417af600bbdb", "rating": 10.0, "review_text": "I love this film for many reasons. It's not an overly complicated film. But it is well done. The setting is a Native American Reservation in Wyoming. The land is starkly beautiful.  Winter here is harsh and unforgiving. I love the outdoors, and I love the tough, isolated, lifestyle of those living far from civilization, so I enjoyed this film from the start.  The cast is very good, the acting also.  I don't need a lot of surprise twists and a shocking ending in a detective story in order to enjoy a film, so it doesn't bother me at all that this one doesn't have that.  The things which make this film different make it more enjoyable to me. \r\n\r\nI am frankly tired of the 'action/mystery' movies and the familiar formulas and techniques they employ: the rapid shift of camera perspectives used to simulate fighting action,  the 70's reminiscent, 'fast n furious' car stunt segments with their blaring music, etc.   Pharmaceutical companies, oil companies, preachers,  and social conservatives are so frequently employed as villains in such films that it's beyond boring now. This film is different.  \r\n\r\n\r\nIt tells a story about the brutal death of an Indian girl, and her missing boyfriend. We see the actions of a few dedicated, over worked, law officers trying to solve the crime and bring the perpetrator to justice, and a civilian tracker contracted to help them. It pushes no hidden or thinly veiled agenda.  \r\nIt's just a story, set in the modern west,  about human nature, crime, and justice.", "created_at": "2018-03-22T17:48:04.946Z"}, {"movie_id": 395834, "review_id": "62cc8fbe595a5612ba112711", "rating": 7.0, "review_text": "I reckon that this is my favourite performance from a really well cast Jeremy Renner. He is an animal hunter who is shocked when he discovers the corpse of the daughter of one of his oldest friends. She has been brutally raped and murdered in their pristine snowy wilderness. The crime - on a Wyoming native American reservation pits local and state law officers against one another, but fortunately FBI agent \"Jane\" (Elisabeth Olsen) is soon on hand and so they team up with each other for what turns out to be quite a perilous investigation with not only the criminal to track down, but with a local community rife with mistrust and brutality not necessarily on their side either. As the mystery gradually unfolds before us, we are treated to some beautiful snowscape cinematography and to some well delivered efforts from Renner, Olsen, the legendary Graham Greene and some solid contributions from a supporting cast of largely indigenous acting talent. The story is a bit on the bleak side, there is little here for us by way of a let up in the relentless nastiness of the plot, but it is rarely dull and certainly worth a watch if you want something that will keep your brain engaged as well as your eyes.", "created_at": "2022-07-11T21:01:50.103Z"}, {"movie_id": 395834, "review_id": "630017af33a3760082359664", "rating": 8.0, "review_text": "**Overall : Wind River’s writing, acting, and setting result in one of the best murder thrillers of the last several years and a predecessor to one of the greatest shows on television - Yellowstone.**\r\n\r\nThis exceptional mystery thriller faces off against the imposing desolation of the immense Wyoming wilderness. What would be a good story and mystery on its own is elevated to an incredible level by the isolation and hopelessness of the hostile environment. Back up, support and help are hours away as the small handful of law enforcement trying to cover hundreds upon hundreds of square miles lead the murder investigation alone. One wrong move, and it’s over. This movie’s tone, quality, and writing feel incredibly similar to the TV show Yellowstone which should be no surprise as Wind River is written and directed by Taylor Sheridan, the creator of Yellowstone.", "created_at": "2022-08-19T23:07:27.852Z"}, {"movie_id": 395834, "review_id": "646234426e0d72015c0f92ee", "rating": 9.0, "review_text": "Wind River is a gripping crime drama that captivates its audience with its stunning cinematography and powerful performances. Set in the harsh and unforgiving landscape of Wyoming, the film tells the story of a young woman's brutal murder and the unlikely team of a tracker and an FBI agent who come together to solve the case.\r\n\r\nHowever, the film is not without its flaws. The plot is at times far-fetched, with some details feeling contrived and hard to believe. The climax, which features an overdramatized shoot out, felt out of place and took away from the film's realistic tone.\r\n\r\nAdditionally, there is a strange and unsettling scene in which the victim's mother self-harms herself in a way that feels unnecessary and out of place. While the scene may be meant to emphasize the mother's grief and trauma, it comes across as gratuitous and uncomfortable to watch.\r\n\r\nDespite these flaws, the film's incredible cast, led by Jeremy Renner and Elizabeth Olsen, deliver powerful and nuanced performances. Their chemistry on screen is palpable, and their interactions are often filled with tension and heart.\r\n\r\nFurthermore, the direction by Taylor Sheridan is masterful, with his unique vision of the American West driving the plot and setting the tone. Wind River is a thought-provoking and emotionally charged film that, while flawed in places, is still highly recommended for fans of crime dramas and powerful storytelling.\r\n\r\nScore: 87%\r\nVerdict: Excellent", "created_at": "2023-05-15T13:31:46.303Z"}, {"movie_id": 395834, "review_id": "64cca6422f266b09ef1220a6", "rating": 8.0, "review_text": "“Wind River” opens with a bang — literally. The first scene, a guaranteed tough watch for animal lovers, introduces us to Fish & Wildlife agent Cory Lambert (Jeremy Renner). Cory is performing the lone sniper-like duties of his job, picking off a pack of livestock-hungry wolves one by one with his high-powered rifle. It sets the tone for the rest of the film, a story of savagery, loneliness, and slow burning pursuit.\r\n\r\nWhen Cory discovers the dead body of a local native American teenage deep in the rugged Wyoming wilderness, the FBI calls up rookie agent Jane Banner (Elizabeth Olsen) to lead the investigation simply because she’s close to the area. The pair work together with local law enforcement to track down clues in an attempt to solve the mystery of the potential homicide. This is a deliberately paced thriller, with clues slowly unfolding to reveal the completed puzzle. The entire story feels a bit like an extended episode of “True Detective,” especially when the film insists on following a straightforward crime drama formula and timeline. But for nearly every piece that’s solved, there’s a sudden outbreak of bloody violence.\r\n\r\nFans of writer / director Taylor Sheridan will quickly note the very similar themes (and even scenes) from his earlier work. This is a clear celebration of rugged masculinity in our hero as well as a savage tale of violence among men. As with his other screenplays, this one is beautifully and authentically written, a story of uncompromising brutality and human insight. The dialogue is heartfelt and genuine; when a father learns his daughter has been raped and has died, he just asks to “sit here and miss her for a minute.” Anyone who has ever had to deal with unforeseen grief can relate.\r\n\r\nThese are fully developed characters that are naturally (and simply) written, which means it’s up to the audience to fill in many of the blanks as to their motivations, desires and back story. This is a major part of what works about this film; these characters are not completely spelled out, making them all the more human. (It’s also partly what fails in the story too: there are several bothersome plot details that are overlooked and ignored altogether, like a possible connection between the similar deaths of two teenage girls several years apart).\r\n\r\nSheridan is also behind the camera on this feature, and he has a particularly good eye for choreographed tension and violent action sequences. He’s also skilled at picking a talented crew that compliments his material in both the content and setting. The film’s appropriately somber, ominous score (by Nick Cave and Warren Ellis) is absolute perfection. The main bloody shootout scene and the snowy, desolate setting is gorgeously photographed by Ben Richardson.\r\n\r\nThis isn’t to say that there aren’t a few directorial choices that will divide audiences (such as a major flashback scene where we are shown the factual events in a bloody, disturbing, unflinching look at the crime, including a graphic rape).\r\n\r\nBut this is more than just a competent directorial debut for Sheridan. While it’s not as well directed as the films he simply wrote (“Sicario,” “Hell or High Water”) and it’s certainly not as commercially accessible to the average moviegoing public, it’s impressive nonetheless.", "created_at": "2023-08-04T07:18:26.986Z"}]