[{"movie_id": 89708, "review_id": "5b96543f0e0a261978033a47", "rating": 5.0, "review_text": "In 1993, filmmakers Ron Fricke and Mark Magidson presented a deeply moving portrait of features universal to all human societies, warned of ecological collapse, and depicted how technology was changing our lives in <i>Baraka</i>. Shot on 70mm film in 30-odd countries, this was one of the most visually impressive films ever made, and its lack of any dialogue or narration allowed viewers to engage in their own individual reflections about the panorama on the screen. Two decades later, the team returned with <i>Samsara</i>, a sequel that wasn't really necessary.\r\n\r\nOne reason that <i>Samsara</i> is not very good is that it often seems a shot-for-shot repeat of <i>Baraka</i>. The filmmakers revisit many of the same locations (such as Thai prostitutes, a chicken-processing plant, home appliance factories, landfill gleaners). Again Buddhism, the Ka'aba and high church Christianity are depicted, but because the film does not go on to any other religions than what was on <i>Baraka</i>, these rituals feel this time like cheap exoticism instead of unquenchable anthropological curiosity. SAMSARA also lacks the dramatic arc of <i>Baraka</i>, coming across as a random succession of images instead of the journey from sacredness to horror and back that we found in its predecessor.\r\n\r\nThat is not to say that <i>Samsara</i> is completely without interest. There is an astonishing clip of performance artist Olivier de&nbsp;Sagaza, and the freakish Dubai landscape is depicting in a detail that few (even those who have been there) have seen. <i>Samsara</i> is all in all a darker film, and while depictions of the wreckage of Katrina, a Wyoming family that are proud to own an arsenal of guns, and a wounded veteran may fail to really shock viewers in the West who have already been exposed to such images for years, scenes of garish funerals in Nigeria and Indonesian men making the rounds in a sulphur mine (even though they know it is killing them) are stirring and memorable. Of course the visuals are rich, and in Bluray format on my HD projector the film is just as stunningly detailed as its predecessor.\r\n\r\nHowever, <i>Samsara</i> lacks enough new things to say, it surprisingly doesn't offer continual rewards on rewatching, and just by the fact that it exists out there it potentially dilutes the impact of <i>Baraka</i>, once a singular film. I was entertained enough to give this a 3-star rating, but I would still recommend <i>Baraka</i>, and even for those who have seen and loved <i>Baraka</i>, I would not recommend moving on to this film.", "created_at": "2018-09-10T11:23:43.023Z"}]