[{"movie_id": 504827, "review_id": "6292b88fed2ac25b0c58b875", "rating": 7.0, "review_text": "_The Bob’s Burgers Movie_ is a laugh out loud funny and beautifully animated film with undeniably fantastic music. It’s unfortunate and slightly soul crushing that the film feels almost like a filler episode of a television series. It’s absolutely fun in the moment and you’ll laugh your buns off, but whether the film holds any substantial value over time is something we’ll all have to ask ourselves by the time the film is released on Blu-ray and DVD.\r\n\r\n**Full review:** https://hubpages.com/entertainment/The-Bobs-Burgers-Movie-2022-Review-A-Longer-and-More-Polished-Bobs-Burgers-Episode", "created_at": "2022-05-29T00:04:31.173Z"}, {"movie_id": 504827, "review_id": "62a06b577b7b4d00693a87c9", "rating": 6.0, "review_text": "\"Bob\" and \"Linda\" are facing ruin. Their burger restaurant isn't paying it's way and when the bank manager gives them a week to repay their business loan, or lose all their kitchen equipment - things look bleak! Not so bleak as they look the next morning after a great sink hole has appeared outside of their restaurant. Luckily, though, in best \"Passport to Pimlico\" (1949) tradition, their daughter \"Louise\" is mucking about near the hole and falls in. Treasure? No, not quite - a skeleton which turns out to be the body of a long lost \"Carnie\", and a murdered one at that. A quick police investigation leads to the arrest of their landlord and local grandee \"Fischoeder\" on a murder charge. Maybe because \"Louise\" always sports a pink bunny-eared hat, but she smells a rat, and together with her siblings \"Tina\" and \"Gene\" sets off to get to the truth before the family loses it's livelihood. Perhaps I just didn't get the memo, but this is not very good. It is a sort of \"Scooby Do\" meets a \"Carry On\" affair, that relies for the most part on some pretty infantile humour, some curiously drawn - chinless - animations and the odd song. Certainly, the dialogue is quickly paced but it's hardly ever funny, and I really struggled to remain engaged after about twenty minutes. Perhaps I need my humour to be a little more sophisticated, less puerile and maybe not so prone to stereotype. Sorry - this just wasn't for me.", "created_at": "2022-06-08T09:26:47.197Z"}, {"movie_id": 504827, "review_id": "631fa18b7fcab3007af1f7ad", "rating": null, "review_text": "I wish it felt more justified in being feature-length and not just a season finale plot. But still: very entertaining! The vocal performances are fun (H. Jon Benjamin, my beloved), the jokes hit pretty well, and it's very watchable. Guess I need to finally check out the show!", "created_at": "2022-09-12T21:15:55.223Z"}]