[{"movie_id": 42194, "review_id": "60bab8eb8d2f8d004154409d", "rating": 5.0, "review_text": "Boring watch, probably won't watch again, and can't recommend.\r\n\r\nI tried and fell asleep on this 3 times.  There is plenty of things happening, but who cares, really?\r\n\r\nThe movie goes far out of the way to disconnect the audience from the characters, world and action.\r\n\r\nMaybe I'll update this if I can ever get through it, but I can't see it being better than what I think it is right now.\r\n\r\nUnless you're just a big Tekken fan, go watch \"Dead or Alive\" instead.", "created_at": "2021-06-04T23:36:11.897Z"}, {"movie_id": 42194, "review_id": "63c170f6a5743d00961e9693", "rating": 6.0, "review_text": "**Tekken blends 80s fighting movie elements with early 2000s action and storytelling to make a decent video game film filled with nostalgia, good choreography, and a ridiculous amount of cheese.**\r\n\r\nTekken is one of the most 80s movies released in 2010! The story follows a dystopian future where evil corporations control the world and throw an annual fighting tournament to appease the disgruntled masses. The slums of this movie look torn right out of Demolition Man or Judge Dredd, and many of the costumes rock the 80s aesthetic as well. But none of that is necessarily a bad thing. As far as video game movies go, Tekken was pretty solid. The character designs stay faithful to the games, the fight scenes are entertaining and have solid choreography, and the acting, while cheesy, is alright. Tekken doesn't do anything new with a script that follows the same beats as The Running Man, Death Race, or any other dystopian death game movie, but that is a reoccurring formula for a reason - it's fun! Without knowing much about the games, I was able to enjoy this cheesy old-school action film that felt equal parts 80s and early 2000s. It's not exceptional, but it is entertaining if you want to enter a time machine to decades past and see some people get punched.", "created_at": "2023-01-13T14:55:50.857Z"}]