[{"movie_id": 157433, "review_id": "5cb0896fc3a3683c2bac7d28", "rating": 5.0, "review_text": "The things that this 2019 _Pet Sematary_ add to the original may not strictly speaking be improvements, but at least it's not a shot for shot remake, which it was looking like it might have been based on the trailers. A couple of those additions I was not particularly fondof, one's a massive spoiler so I'll let that slide, but the biggest one I knew going into it, 'cause of the trailers, which is: As much as I appreciate John Lithgow, I really wish they had kept this guy (or an emulation of him, I more mean) on as Jud Crandall.\r\n\r\nUnrelated sidenote, but when I was young (and I found out about _Pet Sematary_ overall through the Ramones song of the same name) my dad always told me that it was called _Pet Sematary_ and not _Pet Cemetary_ because Americans spelt it that way. That guy lied about... Just everything.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-04-12T12:49:51.801Z"}, {"movie_id": 157433, "review_id": "5d574488bc86576e722f03fb", "rating": 5.0, "review_text": "_**Not a patch on the book, and the new ending is awful**_\r\n\r\n> _This place was thick with spirits; it was tenebrous with them. You could look around and see something that would send you raving mad. He would not think about it. There was no need to think about it. There was no need to –_\r\n\r\n> _Something was coming._\r\n\r\n> _Louis came to a total halt, listening to that sound…that inexorable, approaching sound. His mouth fell open, every tendon that held his jaw shut simply giving up._\r\n\r\n> _It was a sound like nothing he had ever heard in his life - a living sound, a big sound. Somewhere nearby_, _growing closer, branches were snapping off. There was a crackle of underbrush breaking under unimaginable feet. The jellylike ground under Louis's feet began to shake in sympathetic vibration. He became aware that he was moaning._\r\n\r\n> _(_oh my God oh my dear God what is that what is coming through this fog?_)_\r\n\r\n> _Whatever it was, it was huge._\r\n\r\n> _Louis's wondering, terrified face tilted up and up, like a man following the trajectory of a launched rocket. The thing thudded toward him, and there was the ratcheting sound of a tree - not a branch, but a whole tree - falling over somewhere close by._\r\n\r\n> _Louis saw something._\r\n\r\n> _The mist stained to a dull slate-gray for a moment, but this diffuse, ill-defined watermark was better than sixty feet high. It was no shade, no insubstantial ghost; he could feel the displaced air of its passage, could hear the mammoth thud of its feet coming down, the suck of mud as it moved on._\r\n\r\n> _For a moment he believed he saw twin yellow-orange sparks high above him. Sparks like eyes._\r\n\r\n> _Then the sound began to fade. As it went away, a peeper called hesitantly - one. It was answered by another. A third joined the conversation; a fourth made it a bull session; a fifth and sixth made it a peeper convention. The sounds of the thing's progress (slow but not blundering; perhaps that was the worst of it, that feeling of sentient progress) were moving away to the north. Little...less...gone._\r\n\r\n> _At last Louis began to move again. His shoulders and back were a frozen ache of torment. He wore an undergarment of sweat from neck to ankles. The season's first mosquitoes, new-hatched and hungry, found him and sat down to a late snack._\r\n\r\n> The Wendigo, dear Christ, that was the Wendigo - the creature that moves through the north country, the creature that can touch you and turn you into a cannibal. That was it. The Wendigo has just passed within sixty yards of me.\r\n\r\n> _He told himself not to be ridiculous, to be like Jud and avoid ideas about what might be seen or heard beyond the Pet Sematary - they were loons, they were St. Elmo's fire, they were the members of the New York Yankees' bullpen. Let them be anything but the creatures which leap and crawl and slither and shamble in the world between. Let there be God, let there be Sunday morning, let there be smiling Episcopalian ministers in shining white surplices…but let there not be these dark and draggling horrors on the nightside of the universe._\r\n\r\n- Stephen King; _Pet Sematary_ (1983)\r\n\r\nIn Stephen King's celebrated (and massive) _oeuvre_, his 1983 novel _Pet Sematary_ (the misspelling is intentional) is something of a curio. Although reasonably well received at the time, critics have never considered it worthy of the kind of attention lavished on work such as _The Shining_ (1977), _The Stand_ (1978), _The Deadzone_ (1979), _The Dark Tower_ series (introduced in 1982), _It_ (1986), _Misery_ (1987), _The Green Mile_ (1996), or _Under the Dome_ (2009). Fans of King, however, have long championed it as one of his most emotionally devastating and philosophically complex works, whilst King himself considers it the scariest novel he's ever written. And although on the surface, the plot is as schlocky as they come, buried underneath is an examination of grief and how it can compromise one's ability to act rationally. Much as _The Shining_ was really about alcoholism and a descent into madness, _Pet Sematary_ is about emotional trauma, guilt, the importance of family, and the question of what happens after we die.\r\n\r\nWritten by Jeff Buhler (_The Midnight Meat Train_; _The Prodigy_), from an initial script by Matt Greenberg (_Halloween H20: Twenty Years Later_; _Reign of Fire_; _1408_), who's credited with \"screen story by\", and directed by Kevin Kölsch and Dennis Widmyer (_Starry Eyes_), _Pet Sematary_ comes in the midst of something of a resurgence for the Stephen King adaptation industry. Recent adaptations include Nikolaj Arcel's risible _The Dark Tower_, Mike Flanagan's excellent _Gerald's Game_, Andy Muschietti's massively successful and massively overrated jump-scare-reliant _It: Chapter One_ (all 2017), with Flanagan's _Doctor Sleep_, Muschietti's _It: Chapter Two_, James Wan's _The Tommyknockers_, and Mike Barker's _The Talisman_ (amongst others) currently in production, whilst on the small screen, _Mr. Mercedes_ is entering its third season and _Castle Rock_ its second, with new versions of _The Stand_ and _The Dark Tower_ forthcoming. However, for me, much like _It: Chapter One_, _Pet Sematary_ doesn't really work. It's certainly better that Mary Lambert's 1989 filmic adaptation, for which King himself wrote the script, but it pales in comparison to the novel. Granted, most films suffer when compared to a source text; even Stanley Kubrick's _The Shining_ (1980), although a masterpiece as a standalone film, is a terrible adaptation of the novel. _Pet Sematary_, which relies far too heavily on jump scares, is especially disappointing in this sense insofar as it starts off very strongly, taking care to respectfully modernise the novel's themes and examine the characters' underlying emotions, before descending into absolute stupidity in the last act. King was fully on board with the film (he was fully on board with _The Dark Tower_ too), but Buhler changes numerous aspects of the story; some of these changes work very well, but many don't, with a new ending, in particular, substituting cheap shock for the lingering sense of psychological and esoteric hopelessness with which King's original so memorably concludes.\r\n\r\nLouis Creed (the prolific Jason Clarke), a doctor from Boston, moves to the town of Ludlow, Maine with his wife Rachel (Amy Seimetz), their eight-year-old daughter Ellie (Jeté Laurence), three-year-old son Gage (Hugo and Lucas Lavoie), and Ellie's beloved cat, Church. In the woods surrounding their house, Ellie finds a pet cemetery but is cautioned against exploring further by their friendly neighbour, Jud Crandall (John Lithgow). Several weeks later, Louis and Jud find Church dead, and Jud, who has grown very close to Ellie and doesn't wish to see her suffer, takes Louis to an ancient Mi'kmaq burial ground behind the cemetery, instructing Louis to bury Church. The next day, Louis is stunned when Church returns home, although considerably more aggressive than before he died. Jud explains that anything buried in that place comes back to life, although very different from how it was, with local legend suggesting that returnees are possessed or controlled by some sort of malevolent spirit. A few days later, the Creed family suffers an unspeakable tragedy, and guessing what Louis plans to do, Jud tells him not to return to the burial ground. Louis, however, has no intention of heeding his warnings.\r\n\r\nKing's _Pet Sematary_ is a very loose retelling of W.W. Jacob's 1902 short story, \"The Monkey's Paw\" from _The Lady of the Barge_ anthology, in which a man is given three wishes, setting off a chain of events that results in the death and subsequent resurrection of his son. When the film version was first revealed, there was a lot of online grumbling about the big change from the original - it's Ellie and not Gage who is killed in the film, and whom Louis decides to bring back (if this was supposed to be a twist, someone forgot to tell the marketing people, because it's right there in the trailer). Speaking to _Flickering Myth_, Clarke defended the change, explaining,\r\n\r\n> _it's pretty easy to justify. You can't play that movie with a three-year-old boy. You end up with a doll or some animated thing. So you're going to get a much deeper, richer story by swapping for a seven-year-old or nine-year-old girl. The reward will come. People who are upset will hopefully see the benefit of it. But a lot of people didn't have an issue. Stephen King didn't have an issue with it._\r\n\r\nHe makes a good point. Indeed, speaking to _EW_ the following month, King himself said,\r\n\r\n> _it's something different. They did a good job. Boy, I saw all the stuff that came online when people realised that it was Ellie rather than Gage that got run over in the road, and I'm thinking like, \"Man, these people...\" It's so nuts. You can take Route 301 and go to Tampa, or you could take Route 17 and go to Tampa. But both times, you're gonna come out at Tampa! You know what I'm saying? It didn't change anything for me. I thought, \"Okay, I understand why they did it, because it's maybe easier to work with a zombie when she's a little girl than a toddler\"._\r\n\r\nPersonally, I think the alteration actually improves the story - as in the novel, it's Ellie with whom Louis and Rachel have portentous conversations about what happens after we die, and having her be the one killed establishes a more coherent thematic through-line.\r\n\r\nSpeaking of themes, much like the novel, the film is primarily focused on grief. I've always loved King's ability to \"hide\" serious themes behind what are ostensibly rote horror stories (he's so good at hiding them that literary academics don't believe they're even there, refusing to afford him a place on the canon); in 2003, Yale University's Sterling Professor of Humanities Harold Bloom famously said,\r\n\r\n> _the decision to give the National Book Foundation's annual award for \"distinguished contribution\" to Stephen King is extraordinary, another low in the shocking process of dumbing down our cultural life. I've described King in the past as a writer of penny dreadfuls, but perhaps even that is too kind. He shares nothing with Edgar Allan Poe. What he is is an immensely inadequate writer on a sentence-by-sentence, paragraph-by-paragraph, book-by-book basis. The publishing industry has stooped terribly low to bestow on King a lifetime award that has previously gone to the novelists Saul Bellow and Philip Roth and to playwright Arthur Miller. By awarding it to King they recognise nothing but the commercial value of his books, which sell in the millions but do little more for humanity than keep the publishing world afloat. If this is going to be the criterion in the future, then perhaps next year the committee should give its award for distinguished contribution to Danielle Steel, and surely the Nobel Prize for literature should go to J.K. Rowling._\r\n\r\nIn 2014, he told the BBC, \"_Stephen King is beneath the notice of any serious reader who has experienced Proust, Joyce, Henry James, Faulkner and all the other masters of the novel_\".\r\n\r\nAnd yes, _Pet Sematary_ does feature a sentient zombie child, so it's unlikely to ever achieve the status of the fiction of, say, Virginia Woolf, but its core is the emotional trauma suffered by Louis and how his uncontrollable grief drives him to do something unspeakable. His heartache is such that his logic centre simply stops functioning; not only does he completely accept the fact that Ellie can be brought back, but he also ignores Jud's warnings that she will not be his Ellie. Like in the book, he's a man of science, who clashes with Rachel about what to tell Ellie regarding death - she wants to talk about an afterlife, he wants to focus on the finality of death as something natural and unavoidable. This is a smart choice by King, as Louis becomes the one who refuses to let death have the final word, with his conscious mind unable to accept the random tragedy that has befallen him, and whose entire purpose in life comes to be focused on the fact that Rachel was (at least in part) correct, that there is something after death. He must forget everything he has ever known about the corporeal world in order to travel the path down which Ellie's death launches him; this gives him an inbuilt arc, from a man of medicine to a believer in resurrection.\r\n\r\nRachel's arc, and again, this is excellent writing by King and well handled in the film, moves in the opposite direction to Louis's - she accepts the finality of Ellie's death, and reacts in horror when she learns what her husband has done. Her arc is rendered more complex insofar as she also suffers crippling guilt because of the death of her sister Zelda (Alyssa Brooke Levine) when they were still children. Suffering from severe spinal meningitis, Rachel couldn't help but look at Zelda as a monster. One night, whilst their parents were out, Rachel made dinner for Zelda, but because she was afraid of her, rather than bringing it to the room in which Zelda was confined, she used the faulty dumb waiter to send it to her, leading to Zelda falling into the shaft and breaking her neck (a hideous death unflinchingly depicted in the film). Whereas Louis's arc is more concerned with the question of what it takes for a rational man to abandon everything he knows to be unassailably true about the nature of existence, Rachel's looks at questions of survivor guilt and how one is supposed to come back from having one's life shattered (of course, it's the very fact that Rachel had this early-life trauma that gives her the tools with which to cope with Ellie's death).\r\n\r\nThis is seriously heavy, unsettling stuff, and it's how King engages with it that has made the novel such a fan-favourite. And for about two-thirds of the runtime, the film deals reasonably convincingly with these issues. Sure, it moves faster than the novel, but that's more to do with the nature of medium than anything else. Even after Louis brings Ellie back, the film is still fairly leisurely paced, letting us observe his disintegrating mental state (one especially good scene sees him lying in bed next to the newly resurrected Ellie, with Clarke playing him as a man trying to convince himself that what is happening is perfectly normal). Whereas Kubrick largely ignored the themes of alcoholism and abuse in _The Shining_, Kölsch and Widmyer go in the opposite direction - grief and guilt are really the only things on which they focus. At least up to the point when they seem to forget about them entirely, as the third act descends into a ridiculously campy series of murders, attempted murders, and all-round violence, reminding me of the end of Shakespeare's _Titus Andronicus_, where Lucius kills Saturninus because Saturninus killed Titus because Titus killed Tamora because Tamora had Lavinia raped because Titus defeated Tamora in battle.\r\n\r\nThe last half-hour or so of the film is as superficial and immature as anything in any King adaptation, and the new \"twist\" ending not only doesn't work on its own terms, it completely undercuts both King's original themes, and how well the film itself had handled those themes earlier on, replacing King's bleakly poetic _dénouement_ with something right out of \"_horror clichés for dummies_\". In general terms, I've no problem with filmmakers altering the end of a literary adaptation; the finale of Frank Darabont's _The Mist_ (2007), for example, is completely different from King's novel, but it replicates the tone and spirit of the original, eliciting similar emotions from the audience. However, if you're going to alter the end of an adaptation, you absolutely need something that works, both in the context of the adaptation itself, and in its relationship to the original. _Pet Sematary_'s new ending does neither. The whole point of the end of the novel was that Louis learns nothing from his experience bringing Gage back, convincing himself that there were tangible reasons it didn't work, and under different circumstances, Gage would have returned as the Gage he was in life. The tragedy of the novel is that, lost in madness and despair, Louis repeats his mistakes. The end of the film has none of this, with the final shot more of a silly \"dun-dun-duuuun\" moment than anything with any emotional complexity.\r\n\r\nThe new ending may be the biggest problem, but it's by no means the only one. Another is something common to many films - an overly idealised family. An especially egregious example of this was Jordan Peele's _Us_ (2019), and there's more of the same here; much more so than in the novel, the Creeds are a picture postcard family, where everybody just loves everybody else so much, dad is always cracking jokes, sister hates annoying little brother (but loves him really), and parents talk to their kids like they're already fully grown adults. It's easy to see why this trope is usually found in horror and revenge movies - the more idealised the depiction when everything is going well, the more heartbreaking it will be when things go wrong. But just because the purpose is apparent, doesn't mean it isn't a cliché, and the Creeds of the film elicit some serious eye-rolling. Another big problem is the aforementioned trailer, which not only tells us about the switch from Ellie to Gage, but which also gives away a major plot point from just prior to the finale, which, if I hadn't already known about from the novel, would have been ruined. Speaking of Ellie, she doesn't just get hit by a truck, she's flattened by a massive tanker that should have turned her into a pancake, but when Louis picks her body up, she's still whole, and when we see her in the coffin, there's literally not a mark on her. Why make the crash so spectacular in the first place when the body has to be intact for the rest of the movie?\r\n\r\nThe film also leaves out a lot (almost all) of the backstory concerning the burial ground. So, there's no extended flashback telling the story of Bill Bateman and what happened when he resurrected his son Timmy, whose body had been shipped home after he was killed in WWII, although Louis does briefly come across a news article about a Vietnam veteran named Timmy Bateman who returned from the dead many years previously. Additionally, the rich mythology of the burial ground and the role of the Wendigo (an evil necromantic spirit spoken of in Algonquin folklore) is mostly absent; Louis sees a picture of the Wendigo in a book (that's in the trailer too), but it's unnamed, and later, he thinks he sees something in the distance of the fog-shrouded forest, but that's as close as we ever get to the spirit that turns up a couple of times in King's mythology (as well as _Pet Sematary_, it also features in _The Girl Who Loved Tom Gordon_). These changes aren't overly surprising, however, as they speak to the streamlining that all narratives must undergo when being adapted for the screen.\r\n\r\nThere is one extremely irritating omission, however. In the film, Jud is full of dire warnings about the evil of the burial ground and the danger of using its powers (\"_sometimes, dead is better_\"; \"_that place has a power...its own evil purpose_\"), which makes you wonder why he told Louis about it in the first place. The film tries to explain this by showing us that Jud doesn't want to see Ellie upset over Church's death, which makes not a lick of sense and is grossly out of character, evidenced by the fact that literally the day after showing Louis the burial ground, Jud is already warning him about its dangers. In the novel, however, he has a different reason. When his wife, Norma (absent from the film), has a heart attack, Louis saves her life, and in return, Jud tells him about the burial ground by way of thanks. It's still a poor way of having Louis learn about the site, but it's a damn sight better than \"_I didn't want your daughter to be upset about her cat dying, so I'm going to tell you how to make a demon cat!_\"\r\n\r\nAs a novel, _Pet Sematary_ is a study of grief and childhood trauma first, a horror narrative second. Investigating our psychological reaction to death, the book probes how far we might go to ensure a loved one never leaves us. As a film, _Pet Sematary_ seems to be charting a similar course, until it abandons this tack in favour of a shock-for-shock's sake ending. Much like _It: Chapter One_, there is an over-reliance on predictable and silly jump scares, and ultimately, what could have been a mature and emotionally affecting story gives in to the worst excesses of the genre, betraying both itself and the original novel.", "created_at": "2019-08-17T00:04:24.597Z"}, {"movie_id": 157433, "review_id": "5e6e41f22f3b170017447f01", "rating": 6.0, "review_text": "A place to bury our pets and remember them. I know it seems scary, but it's not. Perfectly natural, just like dying is natural. \r\n\r\nDirected by Kevin Kölsch and Dennis Widmyer and written by Stephen King, Matt Greenberg, Jeff Buhler. It stars Jason Clarke, Amy Seimetz, John Lithgow, Jeté Laurence and Hugo and Lucas Lavoie. Music is by Christopher Young and cinematography by Laurie Rose.   \r\n\r\nDr. Louis Creed and his wife, Rachel, move from Boston to Ludlow, in rural Maine, with their two young children. Hidden in the woods near the new family home, Ellie, their eldest daughter, discovers a mysterious cemetery where the pets of community members are buried.\r\n\r\nNot as bad as I was fearing it would be, but is it really any better than the original film?. Itself a simply ordinary adaptation from what is a very good book, you would have thought the 2019 version would at least bring some fresh life to the story. Yet albeit that some changes have been made (one of which was moronically shown in the trailers), it's still a re-tread that has failed to entice newcomers to this world. \r\n\r\nThere's some good on show, though. Child actor Jeté Laurence is excellent, particularly in the latter part of the pic. The design for the Pet Sematary and the surrounding areas are splendidly eerie, with photographer Rose deserving a better film really. While the sound work out at the special place is also bang on the tonal money.\r\n\r\nThe ending has provided much division, but personally it was a change that I liked. Two writers and two directors came up with this adaptation, but they didn't get much right between them and the pic feels like a compromised cash cow. Stick with the book and get The Ramones album of the same name instead. 6/10", "created_at": "2020-03-15T14:55:46.497Z"}, {"movie_id": 157433, "review_id": "63bf741523be4600892c758d", "rating": 1.0, "review_text": "I can see why some people would love this. They took all the story, all the characters, all the depth, and crammed it all into all of five minutes, and then upped the action and violence to 11.\r\n\r\nThe end result was the remake of a horror movie that had some head to it into a horror movie that you don't really need to pay attention to to follow.\r\n\r\nIn other words, they made it a mindless, soulless, action packed gory mess... unfortunately action and gore without a plot or characters is pretty boring to watch.", "created_at": "2023-01-12T02:44:37.324Z"}]