[{"movie_id": 334541, "review_id": "58a1a900c3a3682599003b88", "rating": 1.0, "review_text": "I watched this movie based on its high score, I found the movie to be too long and maybe should have been edited down to 90 minutes or less. I usually go for exteneded versions of movies as I like to really get into the characters and don't normally like it to be over to quickly.\r\nThis was one of those occasions where instead of entertainment it was a chore to watch, I didn't find the actors performances anything special or the context of the story.\r\n\r\nOverall very boring and if I am going to score this it would be a 1 out of 10. I did stick with it to the end and gave it its best shot, but not for me.", "created_at": "2017-02-13T12:39:28.564Z"}, {"movie_id": 334541, "review_id": "58a306f19251415387007359", "rating": 8.0, "review_text": "American dramatist Kenneth Lonergan’s third feature, after his career has been punishingly stalled by the ill-fated MARGARET (2011), made in 2005 as a much-anticipated follow-up to his sterling debut YOU CAN COUNT ON ME (2000), then embroiled in the lawsuit purgatory with the film’s producers and only would be permitted for a limited release 6 years after, MANCHESTER BY THE SEA impacts as a resounding comeback and it is as good as you can get while toiling away with thumping grief and inconsolable guilt. \r\n\r\nLee Chandler (Affleck), a building janitor in Boston, he is the dour and withdrawn everyman type who distances himself from rest of the world and occasionally courts unwarranted bar brawl to unleash the smothering anger, so routinely the film will slowly mine into his profoundly buried tale-of-woe which would explain how he has fetched up to the current walking-dead state, and in this case, it is a helluva calamity, the most heart-rending accident could ever happen to a parent, and he has no one but himself to answer for. Receiving the news that his brother Joe (Chandler) died in a sudden heart attack, brings Lee back to his hometown, the titular Manchester-by-the-Sea where flashback adroitly interleaves into the narrative to refresh Lee’s memory (edited with pellucid correlations with what he experiences now) where the concealed secret incubates, and would eventually unfolds in the murky, snow night accompanied by Tomaso Albinoni and Remo Giazotto’s ADAGIO IN G MINOR, a sublime sequence transmits a synesthetic frisson which can knock dead its armchair viewers. \r\n\r\nIn Joe’s will, he names Lee to be the guardian of his son, the 16-year-old high-school jock Patrick (Hedges), which takes Lee aback, a resultant, seemingly life-affirming uncle-nephew bonding process takes its spin sensibly on veracity and wrestles with both Patrick’s suppressed grievance toward his father’s demise (Lee’s heart condition has been long diagnosed, so that it is more like a time-bomb ticking situation), and Lee’s attempt to re-settle in the town on the face of aghast memories and unrelieved penitence, in a pivotal scene, when Lee’s ex-wife Randi (Williams) pleads him for forgiveness and reconciliation after she has been finally capable of moving on to form a new family and embrace a new life, but feels obliged to proffer some extrication for him too, but things are different for the culpable party, not everyone can make peace with the past, however rational it might sound, some pain can be alleviated through time but other stays, thus one must brave himself to live with it for the rest of his life, that is the affirming life-philosophy Lonergan tries to pass on to his audience through studiously delving into the realistic double-bind based on an über-dramatic back-bone, which appears to be an abiding mythos in all his three directorial works to date. \r\n\r\nCasey Affleck finds his footing in inhabiting Lee with a simmering intensity underneath his alternatively inscrutable/apathetic/distraught veneer, a performance is so aptly up his alley (a combo of hang-dog frustration and whimpering elocution) and to call it the performance of the year wouldn’t be such a stretch. Michelle Williams, shoe-horned in a peripheral role, but manifests herself as a sniveling and imploring scene-stealer just in one scene, she dangles us with immense curiosity about how her character has gone through the catastrophe, but essentially this film is Lee’s story.  Lucas Hedges gets a windfall for being cast in a plum role and nominated for an Oscar, which could be a double-edged sword for the future of his budding career, but as credible and affecting as his portrayal is, the credit should mostly given for Lonergan’s well-rounded script of a rather bratty teenager; also Kyle Chandler is virtually next-in-line for a renaissance on the big screen after starring a string of high-caliber Oscar-baits, from ARGO, ZERO DARK THIRTY (both in 2012), to THE WOLF OF WALL STREET (2013), CAROL (2015) and now this, all in small roles but his presence looms larger each time. \r\n\r\nThe cinematography is bracingly crisp and un-showy, a modest production design and an unobtrusive score borrows many classical pieces, MANCHESTER BY THE CITY is a contemplative continuation in the aftermath of a latter-day Greek tragedy, which elevates Lonergan’s status as one of the most outstanding cinematic story-teller currently from USA soil, and one can bet, co-producer Matt Damon must secretly rue the day that he couldn’t commit himself to Casey's role which would have earned him a coveted Oscar statuette as an actor, and in hindsight, his preference to star in Zhang Yimou’s Chinese monster fantasy THE GREAT WALL (2016) now looks like a dumb decision.", "created_at": "2017-02-14T13:32:33.461Z"}, {"movie_id": 334541, "review_id": "58b0985792514174ed000b9c", "rating": 8.0, "review_text": "**The life doesn't reflect how we want.**\r\n\r\nFirst of all it was not based on any book, but you can see that book kind of effect in the storytelling. One of the best original screenplay, I won't be surprised if it wins the Oscars for that. I actually struggled in the opening to catch the storyline. Because the past and present overlapped while sharing the presentation alternatively. But it was about the present with flashbacks popping out regularly to join the tale by comparing/revealing the earlier events. So after few occasions, I got used to it and enjoyed my rest of the watch.\r\n\r\nI always love good drama films. But not all the drama films I have seen are the masterpiece. So despite it was received so well from all the quarters, I kept my expectations low. The initial parts were okay, but its only during the final stage I begin to like it more. Especially the Casey's performance. I have seen him in many great films, in the big roles, but I think this one is his best, particularly from the positive perspective of the character he had played. Looks like the decade belongs to Affleck brothers. They have given great performances recently and acted in the great films that will be remembered for a long time.\r\n\r\nThis is the story of the Lee, a man who works as a janitor. One day he receives a call that his brother had passed away as he was suffering from the illness for a some time. Since his brother got divorced, all the responsibility comes under his belt, including his teenage son. Now those two struggles to join the force, but somehow manages all. Meanwhile, till the conclusion, the Lee's life before that point were disclosed to us, like how he struggled in his own life before coming to end in the current situation.\r\n\r\nI could be wrong, but Casey Affleck's going to win the Oscars for his performance. Andrew Garfield is the other guy standing between his chance. I'll be happy whoever wins between them. I like Michelle Williams, but her Oscars nominee is meaningless. What, she appeared for 10-15 minutes in the entire narration which can be tagged as a guest appearance than a full fledged role. This is a fine drama, one of the year's best, deserved all the Oscars nod it got. Surely worth a watch and I recommend it.\r\n\r\n_8/10_", "created_at": "2017-02-24T20:32:23.445Z"}, {"movie_id": 334541, "review_id": "591026a0c3a36864c602ceac", "rating": 9.0, "review_text": "Great characters movie. There is little to say about this movie that has not been told yet.\r\n\r\nThe story is simple but interesting and well told. The photography and the location of Manchester-by-the-sea is a very well chosen and the directing is very good.\r\n\r\nAnd on top of everything else is its cast. A very well chosen cast that performs at a fantastic level with Casey Affleck delivering one of the most breathtaking performances of the last years. You can feel his pain with every attitude and gesture.\r\n\r\nThe encounter in the street with Michelle Williams is just astonishingly well done while the one at his brother's room after having picked up his things from Boston is a summit on the movie.\r\n\r\nA very good movie and a very well deserved Oscar.", "created_at": "2017-05-08T08:04:48.877Z"}]