[{"movie_id": 26466, "review_id": "5b989f480e0a263dbe0051c8", "rating": 9.0, "review_text": "**Fantastic Psychological Thriller!**\r\n\r\nIf you're browsing for movies to watch, go into this movie cold; without watching the trailers or any other reviews. A skillfully made thriller that reveals more details upon rewatching. If you enjoy mindf**k movies or science-fiction/psychological thrillers, you will love this film.", "created_at": "2018-09-12T05:08:24.550Z"}, {"movie_id": 26466, "review_id": "5db5e60bd40d4c0018fe2131", "rating": 8.0, "review_text": "Loopy Looper!\r\n\r\nTriangle is written and directed by Christopher Smith. It stars Melissa George, Liam Hemsworth, Michael Dorman, Jack Taylor, Joshua McIvor, Henry Nixon, Emma Lung and Rachael Carpani. Music is by Christian Henson and cinematrography by Robert Humphreys.\r\n\r\nAfter their boat is damaged during a weird storm, a group of friends board a drifting ocean liner to find it seemingly deserted. One of the group, Jess (George), has the distinct feeling she has been on the ship before...\r\n\r\nIt at first glance seems to be a standard ghost ship type of film, where a group of pretty people are in serious peril, but this is much more. It proves to be complex piece, one in fact that kind of demands a second viewing to fully appreciate the twisty nuances within. Beautiful photography highlights some of the teasing imagery, which ascentuates the etheral tone to proceedings. Then once the story starts to reveal itself, your undivided attention is sought to fully grasp the deep psychological barbs at work. 8/10", "created_at": "2019-10-27T18:46:35.132Z"}, {"movie_id": 26466, "review_id": "61548cc5af58cb002afa6016", "rating": 4.0, "review_text": "This review may contain spoilers.\r\n\r\nI liked the beginning and end. The problem is the middle - I just felt like I was watching the same movie over and over. And over. 🙄 She didn't develop much as a character and not enough changed or happened to keep it from dragging on. Just a lot of her running around with the same expression on her face and slamming Hemsworth's head into the coat hook (ick).\r\n\r\nMost importantly of all: get get a real bird to fly about or don't have one at all.", "created_at": "2021-09-29T15:56:53.511Z"}, {"movie_id": 26466, "review_id": "635aca7a002134007afb93e4", "rating": 7.0, "review_text": "**_If you’re going on a sea trip, don’t cheat Charon_**\r\n\r\nOff the coast of the Sunshine State, a yacht excursion is threatened by a sudden storm wherein the survivors seek succor on a passing vessel, but it turns out to be no ordinary ship. \r\n\r\n\"Triangle” (2009) is a mystery/fantasy mixed with horror that inserts the myth of Sisyphus into the present-day scenario of a yacht outing, combining “Ghost Ship” (2002) and the contemporaneous “Dark Country” or, going back decades, \"Haunts of the Very Rich\" (1972). The TV flick \"Ghost Voyage\" came out over a year earlier and covered similar terrain.\r\n\r\nWhile “Triangle” had ten times the budget I slightly prefer “Ghost Voyage” due to the emphasis on character and possible redemption, despite its cartoonish CGI. This one’s lonelier and bleaker but has its points of interest, including Melissa George as the lost, joyless protagonist. Yet it’s the brilliance of the concept and how it’s executed that scores the highest marks.\r\n\r\nWhen it’s over, the more you reflect on the details, the more impressed you are. However, it's a one-of-a-kind flick and not everyone will appreciate what it offers.\r\n\r\nI should add that the movie has zero to do with the Bermuda Triangle à la “Satan’s Triangle” (1975). ‘Triangle’ is simply the name of the sailboat.\r\n\r\nThe film runs 1 hour, 39 minutes, and was shot entirely in Queensland, Australia.  \r\n\r\nGRADE: B/B-", "created_at": "2022-10-27T18:14:18.793Z"}]