[{"movie_id": 332567, "review_id": "5790a7179251416bb40007ea", "rating": null, "review_text": "All you should need to make a good movie is a girl and a shark, but Serra fails to deliver the basics, instead fashioning a movie that too often resembles a female oriented riff on an '80s Old Spice commercial. The Shallows is a damp squib.\r\n\r\nRead the full review at http://www.themoviewaffler.com/2016/07/new-release-review-shallows.html", "created_at": "2016-07-21T10:42:32.000Z"}, {"movie_id": 332567, "review_id": "57b6f356925141389d000784", "rating": null, "review_text": "\"Jaume Collet-Serra’s woman-vs-wild thriller is beautiful, bigscreen Hollywood nonsense that manoeuvres/manipulates the viewer into the kind of submissive state only the finest summer crowd-pleasers can achieve...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2016/8/19/the-shallows.html", "created_at": "2016-08-19T11:53:58.269Z"}, {"movie_id": 332567, "review_id": "580e47bdc3a368599e001882", "rating": 7.0, "review_text": "**Very close to the shore, yet too far and dangerous to attempt.**\r\n\r\nI'm sure you have seen shark attack films like 'Jaws', 'Deep Blue Sea' et cetera, and yep this another one to add to that collection. But this was something very neatly done, I mean for the most of the parts. Looked so real, so I thought it might end up top among its similar theme. In the end, I was little disappointed, because of the shark. The portrayal of shark was very natural, until the last half an hour. Then it becomes the common film gimmick when the animal was obsessed to kill its target at any cost.\r\n\r\nI am a huge animal fan, but I have never seen a live shark in my life and that does not mean I don't know anything about them. Thanks to the nature television networks and what I saw in this film was very disappointing if you love wild animals. I am not supporting the shark here, I'm just talking about its behaviour. It was not right, other than that, I definitely enjoyed the film. In fact, except the final few minutes, since the shark got pumped up, I had no issue and the best shark attack film. But the final battle ruined overall favour I'm going to give to it, what I thought this film deserved.\r\n\r\nGreat location, and Blake Lively was unbelievably awesome. In the initial part, she was very sexy, but once the narration shifted its focus on surfing and later shark attack, everything changed. The entire film was edgy, I think very nicely written screenplay. It was a limited cast film and nearly the whole film takes place very close to the shore. A good start, neatly maintained mid part, but a below par conclusion, that's what I think about the film. Slightly missed to be a great film in the line of '127 Hours'. In fact, this looks like a sea version of that film. But I still recommend it, because it's worth.\r\n\r\n_6.5/10_", "created_at": "2016-10-24T17:41:17.950Z"}, {"movie_id": 332567, "review_id": "58d2ad229251411fc5000d46", "rating": 6.0, "review_text": "As a shark fanatic (thanks, Jaws), I was excited to see The Shallows. When I first saw the trailer, I thought the concept--more 127 Hours than Jaws--was interesting: A single person, alone on a rock, trapped a mere 100 or so yards offshore, in shark-infested waters.\r\n\r\nMost shark movies follow the Jaws formula to a T: Shark attacks a bather, someone in position of authority decides something must be done and the beaches should be closed, someone of higher authority thwarts that attempt, more people die, our hero finally has to confront the monster. \r\n\r\nBut The Shallows produced a new and fresh take on the same old fish tale. The first half of the movie is similar to Open Water, relying on tension and little fanfare. Then, the shark explodes onto the screen for a few moments, and the movie suddenly becomes a high octane thriller. Basically, though the shark is the main antagonist of this story, all the scenes with the shark in them are much less interesting. I was more engaged with Blake Lively and that damn seagull. She was likable, and I bought into the survival story and was really rooting for her.\r\n\r\nThere were moments, when The Shallows relied on suspense, that the film become Hitchcockian in tone. We know the shark is out there, but we can't see him. The second we do, the suspense dies instantly. Parts of the movie were small and intimate, much like an independent film. And those were the strengths.\r\n\r\nBut it almost feels as if the director wanted to do a mash up of a simple suspenseful stalking movie, combined with elements of a survival movie. And again, all that worked for me.\r\n\r\nBut the sensationalism of the shark stuff was over the top in my opinion. It gave the movie an uneven feel. It was, at times, both a suspenseful stalker type movie with survivalism thrown in, and, then, seemingly out of nowhere, it became an over-the-top summer blockbuster type movie. \r\n\r\nIt gives it the look of a movie where director and producer didn't see eye to eye. It really seems like the shark action sequences were forced into the movie. They just didn't fit the overall tone. That's this movie's biggest downfall. Yes, the shark has to be there, yes he has to be dangerous. But the way it is presented through the film needs to fit the overall tone of the movie. At one point, the shark eats three people in the course of-- what?--an hour or so? So what was set up, was a small movie. An intimate movie. Something closer to The Blair Witch Project or Open Water, but what we got in the end, was something closer to Friday the 13th.\r\n\r\nThis movie could have been so much more, by being so much less. Excess is not always best. \r\n\r\nIn all fairness, The Shallows could have been much worse too. The things that did work, worked well--well enough that with some inventive direction, could have carried the film by themselves. But alas, the over the top violence and sensationalism trumped suspense and creative storytelling, which downgrades The Shallows from something special and unique, to just a \"good\" movie.\r\n\r\nThe locations were beautiful, and seeing them in 4K HD on a huge screen was quite impressive.", "created_at": "2017-03-22T16:58:10.844Z"}, {"movie_id": 332567, "review_id": "59f24230c3a36806c4037319", "rating": 8.0, "review_text": "**An exceptional movie involving a hungry shark**\r\n\r\nPlot is simple yet so catchy and interesting. After a few minutes you\r\nwill start to care about the main protagonist, so much that you will\r\ncross your fingers hoping for the best. Everything (or almost\r\neverything) is going to feel realistic, and there is not anything wrong\r\nwith the main antagonist ... it is totally well made. \r\n\r\nGreat performance by Blake Lively (Nancy Adams) too. I will also\r\nmention the impressive landscapes because they literally left me\r\nspeechless. I would have appreciated a more detailed background story\r\nbut I will not complain as this movie was a really great experience. \r\n\r\nWatch it, especially if you are into suspense and sharks!\r\n\r\n_(8 stars out of 10)_", "created_at": "2017-10-26T20:14:40.406Z"}, {"movie_id": 332567, "review_id": "6300173f097c49007aa1e0d7", "rating": 7.0, "review_text": "**Overall : Blake Lively takes a shallow premise and elevates a basic shark movie to the next level with her excellent performance.**\r\n\r\nI was skeptical that an entire movie set on a buoy could be any good, but I was wrong! The Shallows is a sensational shark movie! The whole film fell on Blake Lively's shoulders to carry it all with her acting, and she delivered. The tension, bravery, fear, and struggle show through Lively's portrayal of Nancy with crystal clarity. As a shark movie fan, this one has depth 😉.", "created_at": "2022-08-19T23:05:35.324Z"}]