[{"movie_id": 51052, "review_id": "5fdcee0fb6c264003e060232", "rating": 7.0, "review_text": "A good watch.\r\n\r\nI had a fine time watching <em>'Arthur Christmas'</em>. The plot is a little light, with a fairly simple event taking a relative while to resolve itself, but it's still a pleasant festive animated film - with neat animation.\r\n\r\nThere are a number of familiar names on the voice cast, too many to name in actual fact. My personal standout is Hugh Laurie as Steven, though James McAvoy, Bill Nighy and Jim Broadbent are all enjoyable too.", "created_at": "2020-12-18T17:59:43.863Z"}, {"movie_id": 51052, "review_id": "63a67d68389da100baf6a3b1", "rating": 7.0, "review_text": "It is actually quite hard to find innovative ways to tell Santa stories now, but this one does do quite well on that score. It all centres on Santa's now almost entirely automated delivery process using a sleigh clearly inspired by the starship \"Enterprise\". Horror of horrors, though, when the youngest member of the Claus family - the eponymous \"Arthur\" - discovers that one young girl isn't going to get her expertly wrapped bicycle! His dad \"Steve\" is content to put it down to a technical glitch, and his grandad (the sitting Santa) is too tired to bother, too. It falls to \"Grand Santa\", \"Arthur\" and his old fairy-dust powered, reindeer-pulled, sled to get the bike to the little \"Gwen\" before the sun comes up on Christmas morning. What now ensues are a series of fun escapades as the old man (he rather reminded me of Wilfred Bramble's \"Steptoe\" character) and his enthusiastic young dreamer have to navigate the world - at high speed - and find a small Cornish village that shares it's name with one or two other places around the world, whilst avoiding the authorities who are rapidly concluding that space aliens are on the loose. A solid and entertaining voice cast - especially Bill Nighy and James McAvoy as our intrepid delivery boys deliver an entertainingly paced script well, with some enjoyably crafted animation and a suitably jolly score from Harry Gregson-Williams. It's fun, this - and offers plenty for younger and older alike.", "created_at": "2022-12-24T04:17:44.662Z"}]