[{"movie_id": 59967, "review_id": "50dd00f919c29525f00e8724", "rating": null, "review_text": "movie was a little slow and drawn out.  action was ok but story was little weak.", "created_at": "2012-12-28T02:16:25.746Z"}, {"movie_id": 59967, "review_id": "514eafe419c295727a17e39a", "rating": 6.0, "review_text": "I am normally fairly hesitant concerning time-travel movies because it is next to impossible to get them right. They more or less always become very unrealistic and full of paradoxes. I would almost go as far as to say that producers making serious (non-comedy) time travel movies are the ones that are scientifically too stupid to realise that it is just going to be a mess, or they do not really care about the issues hoping that the audience also will not care.\r\n\r\nThis movie is really proof of this. It is full of paradoxes and annoying “but if this happened now then that couldn’t have happened then and vice versa”. Maybe some people can force themselves overlooking these things but I have some difficulty doing so. I fully agree with the statement that one of the characters in the movie was making: “\"This time travel crap, just fries your brain like an egg…\".\r\n\r\nAnyway, trying to pierce through the cloud of time-travel issues and enjoy the movie, it is not a bad movie. Given that it really had no chance of succeeding in the science area, or have a plot which didn’t defy all logic (time travel you know) it does indeed make a valiant try to entertain. It is not one of Bruce Willies standard all-out action-filled roller-coasters. That is not to say that there is no action but there is also plenty of time for trying to actually tell the story in the movie. The movie is actually quite dark and melancholic. The future seems to be fairly dirty, run down and ridden with criminal organisations.\r\n\r\nAs if time-travel itself wasn’t bad enough the story also involves 10% of the population having developed psychic powers. Most of them good for nothing except cheap show tricks like levitating small objects. Most of them…except our future crime lord which of course is found to have super-psychic powers. Also, of course, the kid had to behave like a spoiled brat with anger problems which was somewhat annoying.\r\n\r\nThe ending, which I will not divulge here of course, was not very surprising and left quite a few open questions. On the whole I would say that the movie was entertaining but it is far from going on my top ten list.", "created_at": "2013-03-24T07:48:52.230Z"}, {"movie_id": 59967, "review_id": "521480dd760ee36df40976c4", "rating": 4.0, "review_text": "The plot is full of flaws. Quite like a even worse inception.", "created_at": "2013-08-21T08:57:01.516Z"}, {"movie_id": 59967, "review_id": "5df9927b6097500015317d2d", "rating": 5.0, "review_text": "neither here nor there\r\n\r\nTime travel can be an exciting plot device - if the writers take time to check and get everything right. Unfortunately, with Looper, they did not. Nor did director or producers choose a clear direction what this movie was supposed to be, what its pace and atmosphere should be like. So it turned out to be full of wasted potential. Good ideas, characters, situations, plot elements it all had at some points - but none developed, really. \r\n\r\nThat's more disappointing that if it had had no potential. Wasted opportunities... in a loop.", "created_at": "2019-12-18T02:44:11.519Z"}, {"movie_id": 59967, "review_id": "63e43e0ffac50200849f56b7", "rating": null, "review_text": "**Half-baked and weak genre mix with a pale Bruce Willis**\r\n\r\nThe main character is an anti-hero and isn't able to win the viewer over story emotionally - that would be OK if the story were at least coherent - but it isn't. The time travel logic doesn't work. The telekinesis nonsense seems incredibly pointless. The love story(s) is or are hardly comprehensible. And many plot elements are started without being brought to a meaningful end. Too bad - there was potentials there. So the whole thing is nothing more than a solid ordinary movie, despite all the genres that are (unnecessarily) mixed up in it.\r\n\r\nThe only ray of light for me in the movie: The mask and facial expressions by Joseph Gordon-Levitt, who manages to give a fun impression of a young Bruce Willis.", "created_at": "2023-02-09T00:27:59.946Z"}, {"movie_id": 59967, "review_id": "63ed7e891b7294007c4a6ab8", "rating": 8.0, "review_text": "<em>'Looper'</em> is entertaining!\r\n\r\nI had a fun time with this one. I guess that would come as little surprise given I do like basically everyone onscreen from other flicks, while that is true that isn't the sole reason for my enjoyment. The story is intruiging and is presented nicely by the filmmakers, I found it to be well paced too.\r\n\r\nJoseph Gordon-Levitt gives a strong performance, even with make-up that occasionally makes him look just like Sean Connery's 'disguise' in 1967's <em>'<a href=\"https://letterboxd.com/film/you-only-live-twice/\">You Only Live Twice</a>'</em>. Bruce Willis is solid throughout, as are Emily Blunt and Jeff Daniels. There are a few other noteworthy faces in there too, like Paul Dano and Garret Dillahunt.\r\n\r\nWell made and well worth a watch. Recommended.", "created_at": "2023-02-16T00:53:29.085Z"}]