[{"movie_id": 238713, "review_id": "562bc74dc3a3681b590054a7", "rating": 7.5, "review_text": "> A redefined wonderful spy movie.\r\n\r\nI know Melissa McCarthy since 'Gilmore Girls', but never thought she would rise this far, especially to dominate in a movie with the presence of the big names around her, that too in an action film equivalent to top quality. She's one of my favourite actresses, even I enjoyed thoroughly her under-appreciated 'Tammy'. So this is where the action stars become comedians and comedians action stars. Indeed, it worked out so well.\r\n\r\nIt shames comedy-spy flicks like 'The Pink Panther', 'Johnny English' etc. From the director of 'The Heat', helmed another perfect female oriented comedy. Jude Law was a decent as usual, but Jason Statham was unbelievably awesome in his tiny part. I had plenty of good laughs, the loud ones after a long time. I still remember the unicorn joke and I can't stop laughing. And roof over a bike, gadgets and so on... I find Melissa McCarthy's line deliverance are so funny and I enjoy her films specially for that reason.\r\n\r\nI know they used a stunt double and blue/green screens in the crucial segments for a better result. But still she excelled in all stunt sequences that required physically herself in front of the camera. One of the trivia says, after the end of each day shooting, she looked like fell down an elevator shaft. Her hard work definitely paid off very well.\r\n\r\nThere are lots of adult oriented comedy, so strictly it is for grownups only and may be matured teens. I'll be definitely disappointed if they won't make a sequel for this. If they do, I hope they retain all the cast, especially Statham along the lead actress. And finally I'm looking forward the director-actress's the third collaboration, 'Ghostbusters'.\r\n\r\n7½/10", "created_at": "2015-10-24T18:00:45.014Z"}, {"movie_id": 238713, "review_id": "5b93411dc3a3685681001b92", "rating": 4.0, "review_text": "These things are really, **really** not for me. I found a couple of laughs in Statham's role but beyond that _Spy_ did nothing for me. I know folks who do enjoy this, and other Feig/McCarthy films, but I genuinely do not understand the appeal, maybe Spy is better than the others, maybe not, but it did absolutely nothing to turn me around on these collabs.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2018-09-08T03:25:17.772Z"}, {"movie_id": 238713, "review_id": "5dc3e9578d22fc00183db97a", "rating": 9.0, "review_text": "I have just got to say that I am a bit biased, simply because I love this movie. Jason Statham and Melissa McCarthy are awesome together in their roles, and even though Jude Law does a decent job as well, this movie is all about Melissa and Jason to me.\r\n\r\nI find the language of the character of Jason Statham to be very ugly, but still, it is needed to make his character be in the way it is supposed to be. And to be honest, he is completely hilarious!\r\n\r\nMelissa is something very similar, and she is perfect for her role as an analyst that has to work undercover, taking the place of all other agents whose identities have been revealed to the \"enemy\".\r\n\r\nYou will get lots of reasons to laugh throughout the movie, and it is incredibly easy to enjoy every second.\r\n\r\n<h3>A little warning</h3>\r\nYou should be warned though... if you like this kind of humor, it is awesome. But, if you like to eat lemon and feel angry when people behave in stupid ways in movies (like in Mr. Bean and in Dumb and Dumber), this is most likely not a movie for you!\r\n\r\nBut, if you like crazy humor, you should go ahead and watch this movie - it is pure gold!", "created_at": "2019-11-07T09:52:23.214Z"}, {"movie_id": 238713, "review_id": "65966ce8a6c10411a9fa5bfd", "rating": 8.0, "review_text": "Sometimes, the soul longs for the dramatic artistry evidenced on stage, such as Zoe Caldwell in Medea (1982 - Cort Theater in New York City).  Other times, the mind seeks to escape into the comedic stylings of an actor you really respect like Melissa McCarthy.  Spy espies our desire for adventure, action, and righting the wrongs of our world and is not to be missed!\r\n\r\nSusan Cooper is like many of us.  Shi is intelligent and seeks to do the right thing.  Shi can be kind, giving even, but doesn’t wish to be stepped on by anyone.  Shi is fun and funny.  In the end, shi surprises us with her street smarts and well-trained (yet scary) moves.  Susan is our womin.  Shi is simultaneously us and who we wish to be.  Rose Byrne shocked me with how well shi played the sociopathic (yet farcical) Rayna.  Byrne and McCarthy had the right on screen rapport.  McCarthy was excellent in portraying Susan as a sympathetic Arctic fox.  \r\n\r\nThe handsome and wonderful Jude Law plays the clever and professional Bradley Fine, who we believed had betrayed us.  In the end, he remains fine indeed.  I had zero clue that Jason Statham could be so hilarious!  I usually don’t like his films or characters.  Rick Ford is the exception.  His timing and believability were incredible!  I have seen this film twice and twice delighted in it.  I hope you do.", "created_at": "2024-01-04T08:31:36.557Z"}]