[{"movie_id": 81005, "review_id": "52fd4f92925141092d011f3f", "rating": 4.0, "review_text": "Boring and with low quality animations.", "created_at": "2014-02-13T23:04:50.547Z"}, {"movie_id": 81005, "review_id": "5a584e2cc3a3681e6200409b", "rating": 7.0, "review_text": "Me and the kids watched this movie yesterday evening. We all liked it quite a lot. This is a very enjoyable family movie. It is, not surprisingly, a new twist on the old Jack and the Beanstalk story. The basic elements are there, Jack, beans, beanstalks and, of course, giants. A few new elements are thrown in like a Crown to control the giants, a treacherous bastard responsible for the entire mess and a few other things.\r\n\r\nThe giants are very well done. The CGI is good to very good most of the time. As can be expected, it is the giants that make up this movie. I would say that they are slightly scary (for kids) and rather funny at the same time. Unfortunately the same cannot be said about the human actors. The acting is generally not so good and sometimes downright abysmal. It is rather surprising for such a relatively big production to have such poor TV-show quality acting.\r\n\r\nThe bottom line is that it is a very enjoyable family movie. If you watch it as an adult I guess you must have a liking for special effects and CGI, which I do, in order to enjoy it.", "created_at": "2018-01-12T05:57:00.024Z"}, {"movie_id": 81005, "review_id": "5c0013180e0a26486a01c456", "rating": 6.0, "review_text": "***Medieval fairy tale with a noble hero, a beautiful princess and hordes of barbaric giants***\r\n\r\nReleased in 2013 and directed by Bryan Singer, “Jack the Giant Slayer” has plot similarities to 1962’s “Jack the Giant Killer” with Nicholas Hoult playing the wholesome farm boy, Eleanor Tomlinson the winsome princess and Ian McShane the king. The rural protagonist slays a couple giants and rescues the royal maiden, but that’s where the similarities between the two movies end. This one lacks an evil wizard and his dark castle, which are substituted by the brutal giants and the colossal beanstalk that leads up to their awesome realm above the clouds.\r\n\r\nDespite the almost $200 million spent mostly on the CGI giants & their world, “Jack the Giant Slayer” just isn’t as compelling as “Jack the Giant Killer,” which had super-cheesy effects, albeit charming. Yes, the giants & their realm look superb, as far as cartoonish CGI goes, but more time & money needed spent on the characters and their story to hook the viewer. In other words, despite all the action/adventure and millions blown on CGI, the story’s generally meh.\r\n\r\nNonetheless, the flick’s good enough if you favor CGI-laden films like “King Kong” (2005) and “Avatar” (2009). Hoult and Tomlinson are more-than-worthy as the protagonists with Hoult being reminiscent of Richard Thomas. I just wish the script fleshed them out more and made us care about them and their considerable challenges.\r\n\r\nThe film runs 1 hour, 54 minutes and was shot in England (Surrey, Norfolk & Somerset). ADDITIONAL CAST: Ewan McGregor plays a knight, Stanley Tucci a royal bastage and Eddie Marsan his inane crony.\r\n\r\nGRADE: C+/B-", "created_at": "2018-11-29T16:26:00.189Z"}]