[{"movie_id": 11973, "review_id": "55b3409ac3a3682ff40143d5", "rating": 9.5, "review_text": "The art of political film making in all its glory.\r\n\r\n\"Communicate with the Soviets? We can't communicate with the Pentagon - and it's just across the goddamn river!\"\r\n\r\nOctober 1962, for 13 days the American government fought to avert a nuclear war when it was discovered that the Soviet Union had deployed nuclear missiles in Cuba. This is that story.\r\n\r\nMany superlatives can be chucked at Thirteen Days, and all are viable. In simple terms it's an intelligent and gripping political thriller, superbly scripted and performed by a cast firing on all cylinders. It's a treat to find a film of this type that educates while it pitches you into a world of political intrigue, to provoke real life thoughts even as the suspense takes a hold. Yes it's talky, of course it is, but these conversations are real and riveting. And while there's not a duff performance in the acting pack, Bruce Greenwood deserves special praise. He is the leader, the fulcrum, there's not a false note by him, JFK becoming the role he was born to play.\r\n\r\nSuperlatives were invented for films like Thirteen Days. Assuredly so. 9.5/10", "created_at": "2015-07-25T07:54:02.811Z"}, {"movie_id": 11973, "review_id": "64ab5f05e24b93013ab9c276", "rating": 10.0, "review_text": "Kevin Costner at least tried to do an accent in this movie, which probably means he got a new agent, a yes man that didn't bother to give him the advice that doing believable accents isn't his thing.  It's almost like listening to your average Brit trying to sound like an American and completely overdoing it.\r\n\r\nDo we really sound that exaggerated to them?\r\n\r\nWho cares, ignore the above, it's still a good movie... despite Costner's accent.  Or, possibly, in spite of it.\r\n\r\nIt trashes Dean Achenson, and as a historian the only thing I like to see MORE than Dean getting his just deserts is Allen Dulles getting his... and it throws a jab at that a**hole too.  In 2000 that would have been seen as pure liberal honesty, but now it sort of comes across as far right.  I mean the movie is literally about avoiding Nuclear War with Russia as the entire Democratic party and the progressive movement seem to want to push us closer and closer to it.\r\n\r\nIt's one of the better political films you can see, and it builds the pressure to the point where you are terrified that the world could end despite the fact it has long come and gone.  And the shift from Jack and Bobby to Ken O'Donnel, a humble appointment secretary is probably one of the best approaches and best ideas any Historical Drama has ever had.\r\n\r\nStart to finish it is one of the best political thrillers of all time.", "created_at": "2023-07-10T01:29:41.948Z"}]