[{"movie_id": 267193, "review_id": "57b50047c3a3686a11002655", "rating": 7.0, "review_text": "> These brothers joining hands mean the world is in trouble.\r\n\r\nI thought it might be a spin off to 'The Man from UNCLE', but it wasn't. From the action-thriller director known for 'Transporter' films and this is his first comedy, yet it has some great stunts. It is about the two brothers who meets after a lot time separation. Now they're two opposite kinds, professionally and socially. So coming together means trouble is inevitable wherever they go in the world. Against all the odds how they accomplish their task that forced them to do it is the rest of the film.\r\n\r\nIf you like Sacha's trademark comedies, you might like it as well. Like always his part was excellent in this, especially jokes were very hilarious. Though the story was weak, but the rest of the film was not bad. The overall film leaned on its comedies and that's how the narration somewhat successfully carried out till the end. An enjoyable film, but you might hesitate to rate higher, because this is not the best film of the year, definitely not for me, I've seen a lot better ones.\r\n\r\nBesides, Mark Strong was amazing. He was always been a co-star, but here he's equal to Sacha and he did some good stunts as well. I think the film is passable, because it is one of the recent decent comedy. I can suggest it for those who're seeking some laughs. It might won't bring the loud ones, but surely will raise your cheeks. The film is for adults for the R rated jokes, there are some unexpected scenes that I was surprised for them. I enjoyed it and I'm sure I won't remember it for very long, that kind of film it is.\r\n\r\n6.5/10", "created_at": "2016-08-18T00:24:39.596Z"}, {"movie_id": 267193, "review_id": "57e6021e925141395e002c77", "rating": 4.0, "review_text": "There are some (emphasis on 'some') good moments in _Grimsby_. I sniggered twice (and would have a third time if that moment hadn't already been in the trailer) and there are a couple of surprisingly solid action sequences, primarily the ones with Mark Strong helming them.\r\n\r\nThat said, I still didn't like the movie. It's oft lazy and the quote unquote \"humour\" is almost entirely of the gross-out variety. It's like \"HEY LOOK A DICK! HEY LOOK SOME POOP! FUCK YOU GIVE US YOUR MONEY!\".\r\n\r\nMust admit, I've never seen a \"football hooligan/espionage/action-thriller/adult-comedy/family drama\" before though.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2016-09-24T04:33:34.658Z"}, {"movie_id": 267193, "review_id": "5d8c249e326ec100201f93f6", "rating": 4.0, "review_text": "Some of it was kinda funny, but mostly the gross-out humour was plastered on with a trowel. There didn't need to be that much time spent inside an elephant. \r\n\r\nAlso what's with all the super dated music cues?\r\n\r\nMeh", "created_at": "2019-09-26T02:38:22.637Z"}]