[{"movie_id": 260514, "review_id": "5a7706c30e0a26642d04b97f", "rating": 7.0, "review_text": "**The new age begins!**\r\n\r\nHaving seen enough animated feature that possible eligible for the 2018 Oscars, I'm really disappointed with the result of some of the big titles. Yes, including this one, not big films, except 'Coco' are up to any impressive. The bright side is, after a long time, 2D animation might win. This was an okay film. Though I liked the story outline, but did not like how it all was narrated.\r\n\r\nI have seen the evolution of 'Harry Potter'. I meant the cast, particularly the main three. For a decade, the little kids grew into older teenagers. But for an animation character, there's no concept of ageing. They always remain same. This film just gave a new perspective. I mean it talked about being or growing old and how it impacts our lives. That we can't hold forever our safe position. Sooner or later, the youngsters will take over it.\r\n\r\nMcQueen is enjoying his racing, competing with his friendly opponents. But it all changes when a young rookie rewrites the history. Without able to cope with the new generation and their aggression, how McQueen and Co like to counter the latest threat is the film's story. Liked such inspiring storyline. I mean it would inspire more the middle aged people than anybody else. But it is a fun film for all ages, particularly the kids. It is just like turning 'Rambo' into 'Creed', I just want a new beginning in the next sequel.\r\n\r\n_7/10_", "created_at": "2018-02-04T13:12:35.620Z"}, {"movie_id": 260514, "review_id": "5af57f0dc3a3682a6f004c21", "rating": 7.0, "review_text": "A worthy follow up to the original film, miles better than Cars 2.  They wisely focus the action back on Lightnin' McQueen and keep Mater to a bare minimum.  It's not going to change lives, but a solid animated feature nonetheless.  Even when Pixar is coasting they still deliver a very pretty looking film, albeit a little shallow.\r\n\r\nOne thing bugs me though, why in a world of anthropomorphic vehicles, with no signs of humans, do they have door handles...?", "created_at": "2018-05-11T11:31:25.209Z"}, {"movie_id": 260514, "review_id": "5f32a313f1b5710033f48686", "rating": 7.0, "review_text": "I agree <em>'Cars 3'</em> improves upon <em>'Cars 2'</em>, not by much though.\r\n\r\nThe story for this does feel more rounded than the preceding film, even if it ends rather lamely. The whole production builds up around Lightning McQueen, rightly, before strangely having a conclusion that focuses on newbie Cruz Ramirez. I like the idea of what they were going for, but the way the do it is actually quite poor - it feels too forced, as well as chucking most of the development for McQueen across acts one and two out the window.\r\n\r\nWith that said, it isn't a massive hindrance. I still had a fun time with this. Owen Wilson remains good as McQueen, while Cristela Alonzo gives an accomplished performance as Ramirez. One thing I do rate about Alonzo is that Disney didn't go down the obvious, lovey-dovey route with her. \r\n\r\nNone of the rest of the cast standout all that much, though it's cool to hear Kerry Washington as Natalie Certain. Mater (Larry the Cable Guy) is arguably underused, which is weird as he is overused in the 2011 sequel - they don't seem to know how to fit him in ideally.\r\n\r\nThe overall premise itself is interesting, while the animation remains in top gear. The ending doesn't fit perfectly for me, but I can still recommend that you give this a viewing.", "created_at": "2020-08-11T13:54:27.301Z"}, {"movie_id": 260514, "review_id": "63dc7fc59369a2007cdd95ce", "rating": 6.0, "review_text": "**The end of a franchise that was never really worth our interest.**\r\n\r\nI never really wanted to see the “Cars” movies. As I said before, I was already an adult when they appeared, and I particularly felt the almost invasive force of the propaganda machine that, by all means, tried to foist the film on us, almost in the same way that Jehovah's Witnesses go to people's homes to sell their perspective of religion. “Cars” was everywhere, and the merchandising involved was a billion-dollar business in itself. Therefore, I preferred not to see them. I don't like to feel that things are being forced on me. I saw this film, the last of the trilogy, right now.\r\n\r\nComparing this film to the first in the franchise could be considered an honest effort. The two films are quite similar, although the first has an ascendant, due to its novelty. As for the script and the story itself, both are complete clichés: if one talks about the success of a novice “outsider”, full of nobility and desire to win, the third film already shows us that everything has an end, and that there is to know how to leave the scene and give way to others in an honorable and dignified way. It is the eternal question of the passage of generations and their conflicts. In the middle of these two films, “Cars 2” is completely out of place, just having a character as the protagonist who only appeared a few minutes in the first film. “Cars 3”, as cliché as it may be, rediscovered some of the merits and values of the first film.\r\n\r\nEven so, and despite the commercial and critical success, I don't think it's honest to compare any film in the “Cars” franchise with the films “Toy Story”, “Up” or “Inside Out”. In these films, Pixar bet on creativity, that is, on the creation of an original story and very original characters. That never happened in \"Cars\". Just think of the huge amount of cartoons that include, albeit in an accessory way, talking cars. It's an old idea, one that Pixar has merely retreaded and brightened up, with CGI animation techniques it masters like few others. Quite simply, it was a way to earn lots of money with little effort.\r\n\r\nIn this film, we once again have the technical brilliance, attention to visual detail and the sharpness and quality of digital animation that Pixar has accustomed us to. It would be too bad for the studio not to be able to honor its credits and fail even at this! In addition to the magnificent animations, the mixing, sound and editing work was really taken very seriously and done by good professionals. The work of the voice actors also deserves no notice, with the return of Owen Wilson and other outstanding voices, joined by Cristela Alonso. All were well, in an impeccable work.\r\n\r\nIf we have already spoken about the script, we can only talk about the comic: the film makes several attempts at humor, and if the jokes seem to be well-placed in the plot, the truth is that they have almost no strength or impact, and simply do not make people laugh. They're not funny. Attempts to thrill or move the audience also failed utterly, largely due to the Franciscan poverty of the characters, merely sketchy and barely able to capture our sympathy.", "created_at": "2023-02-03T03:30:13.813Z"}, {"movie_id": 260514, "review_id": "6453b8efc04429010161f64a", "rating": 8.0, "review_text": "I like this one just as much as the 1st. Playing it off like he's an old washed up race car. It's pretty funny.", "created_at": "2023-05-04T13:53:51.660Z"}, {"movie_id": 260514, "review_id": "6570675241ad8d06e3cc359e", "rating": 6.0, "review_text": "Hmmm! This outing for the now well past his best \"Lightning McQueen\" reverts back more to the first film, only by now we are all maybe just a bit tired with the formula? The shiny red champion is having to face the reality that technology and engineering have evolved since 2006 and he is simply no longer the best. Of course, he's not going to give up and with the \"Piston Cup\" looming, he determines to recover from what looked like a career ending crash. To that end, he coaxes up-and-coming engineer \"Cruz\" and his own motivator \"Smokey\" - who worked with the legendary \"Hudson Hornet\". He needs discipline, he needs to re-learn all he knew, he needs to listen - if he is to seriously challenge the all-conquering \"Jackson Storm\". There are a few nice touches to this, but essentially it's a rehash with a little too much cheesy sentiment and I found the musical numbers just a bit more intrusive, too. There's also a little more pontificating here. The script exudes loads of virtues but rather more in your face than by using the humour and personalities to illustrate loyalty, affection and dedication. There's still plenty of lively action animation and it doesn't hang about, but for me this franchise has matured now, and needs to get to a motor museum near you.", "created_at": "2023-12-06T12:21:38.778Z"}]