[{"movie_id": 10138, "review_id": "589c57e1c3a3686ef900437d", "rating": 7.0, "review_text": "It was understood that the theaters would be sold out but when the three of us came there we just couldn't accept NO for an answer. So we were finally able to buy tickets BUT we were seated separately. It was fine though. The movie kept me entertained. Except for the guy near me who was snoring pretty loud, the movie was great.\r\n\r\n\r\nOf course Robert Downey Jr was amazing as always. There might be weird critics with this movie but for me, I liked it. The action scenes were just right. It wasn't too much and it wasn't too little. It was weird seeing Don Cheadle though play Terrence Howard's character. I like Terrence better. And then there's Scarlett Johansson who is really sexy although I think there weren't that many acting for her in this movie. There weren't many lines. And what was weird also was that in this movie, the chemistry between Tony Stark and Pepper was not that much compared to the first movie although in this movie they actually ended up together. But all in all I liked the movie. Seeing old characters from the first movie and new characters. I can't wait for a 3rd Iron Man movie.\r\n\r\n\r\nMy rate for this movie is B+.", "created_at": "2017-02-09T11:52:01.092Z"}, {"movie_id": 10138, "review_id": "5a5620389251417aa6023438", "rating": 3.0, "review_text": "Yet another ridiculously high rated Marvel movie, we get it Marvel fanboys you just love it when a new Marvel movie comes out, so much that you forget any flaws in it and give it a 10 or a 9 anyways.\r\n\r\nBut come on seriously? Wouldn't you rather they spent a little time at actually writing a somewhat decent script and making it a bit more entertaining than to praise EVERYTHING they do to the skies just because you want a new chapter in the Marvel universe?\r\n\r\nCause this is NOT a good movie, 35 minutes of decent at best action and 85 minutes of nonsensical blabber.\r\n\r\nMickey Rourke was the only highlight in this movie, the scene at the racetrack with him was really cool but then he just became a wasted opportunity just like the rest of the movie.\r\n\r\nA really boring turd of a film.", "created_at": "2018-01-10T14:16:24.141Z"}, {"movie_id": 10138, "review_id": "5b1521e60e0a262ddc008184", "rating": 6.0, "review_text": "**A long form review originally posted in 2010:**\r\n\r\nI find, the best way to look at this movie, is as two movies. Sounds strange I know, but bear with me.\r\n\r\nOn the one hand you have this Super Hero movie, it's about the main character, Iron Man (Robert Downey Jr.), flying around doing comic book-character type stuff, and it's this pretty okay action film that's worth taking a look at. Then, there's this drama with a hint of comedy, this other film isn't really a genre, it's just about the characters interacting with each other, it's about the main character, Tony Stark (Robert Downey Jr.), driving around doing billionaire-playboy type stuff, and this movie, is fucking great. Part script, and part flawless acting, this movie sets _Iron Man 2_ apart from any other Super Hero film out there. It was explored in the first film, and you get a similar thing there, but in this movie the division is more clear, and it bizarrely benefits from it.\r\n\r\nWhen films go franchise-style, it's inevitable that there will be scheduling conflicts, it's an unfortunate part of the industry, particularly when you have a deadline to meet, and for whatever reason, an actor will be unable to return to their original role. Such an event takes place in _Iron Man 2_ when Lt. Col. James \"Rhodey\" Rhodes (originally played by Terrance Howard) is replaced by Don Cheadle. I personally think that Howard was better suited to the role, simply because he looks more like Rhodey does in the comics. But their way of dealing with the changeover is simple, and clever, the character's first lines, whilst making perfect sense in context, are \"Look, it's me, I'm here, deal with it. Let's move on. Drop it.\" Very classy.\r\n\r\nAlthough Mickey Rourke (_Get Carter, Sin City, The Wrestler, Man on Fire, The Expendables_) manages a very convincing evil Russian; Ivan Vanko, who's a perfectly good character, Whiplash as a villain is unfortunately somewhat lacking. Sam Rockwell (_The Green Mile, The Hitchhiker's Guide to the Galaxy, The Assassination of Jesse James by the Coward Robert Ford, Frost/Nixon, Moon, Conviction_) plays Justin Hammer, corporate rival of Stark's. Scarlett Johansen (_Eight Legged Freaks, The Girl with a Pearl Earring, The Island, The Prestige, The Spirit_) is another good addition to the cast, in the role of Natalie Rushman A.K.A Natasha Romanoff A.K.A Black Widow. Samuel L. Jackson (_Jurassic Park, Pulp Fiction, Jackie Brown, The Starwars Prequel Trilogy, Shaft, S.W.A.T, Kill Bill Volume 2, Snakes on a Plane, 1408, The Spirit, Inglourious Basterds_) portraying S.H.I.E.L.D Director Nick Fury, rounds out the newbies in the cast. And it's all good news.\r\n\r\nThe Hammerdrones are an attempt at revamping the whole boss-battle that was such a let down in the original film, which honestly, once again didn't really work out. Once again it's a case of the character interaction that makes the film what it is. The effects also went a long way in the line of helping out the film, 'cause they were awesome. There are a couple of negatives in the script, just those moments when the suspension of disbelief is not... suspend-y enough. As for example the line; \"Congratulations sir, you have created a new element\", is a little flawed.\r\n\r\nThough if I was forced to choose between them, I would probably say that _Iron Man_ is the better of the two films, but _Iron Man 2_ has a better re-watch value in my opinion, which I prize highly. I wait with baited breath for the next Marvel film to come out, _Thor_.\r\n\r\n63%\r\n\r\n-Gimly", "created_at": "2018-06-04T11:26:30.345Z"}, {"movie_id": 10138, "review_id": "5c84278892514127691f7b64", "rating": 3.0, "review_text": "Honestly, it took me three tries to get through this movie once. It kept putting me to sleep.\r\n\r\nThe cast do everything they can to make their scenes entertaining, but Iron Man 2 is a just an absolute waste of two hours and $200 million. 1: The stupidly integrated villain Ivan Vanko who is given no backstory or true relatable motive (even Mickey Rourke was pissed at how his character was handled). 2: The pointless subplot of how Tony Stark has to create a new element to save himself. 3: The sloppy introductions of both SHIELD and Black Widow. There's very little here that is of any actual entertainment value, or at least to balance out how tedious the whole movie is to watch. No wonder why Jon Favreau left to make more personal works.", "created_at": "2019-03-09T20:52:24.937Z"}, {"movie_id": 10138, "review_id": "5ed43badaaec71001f6f1b34", "rating": 6.0, "review_text": "Says a lot, but took now a decade to finally see this sequel. Certainly belongs in the lower tier of the MCU as the plot really felt disjointed and even though it was only two hours, really short for a comic book movie nowadays, still felt so much longer. That said, had a few okay moments yet can't really say anything stood out. **2.75/5**", "created_at": "2020-05-31T23:20:13.902Z"}, {"movie_id": 10138, "review_id": "600234dc2f7915003e99efc3", "rating": 7.0, "review_text": "<em>'Iron Man 2'</em> is good, nothing special, but good.\r\n\r\nRobert Downey Jr. is just as entertaining in the lead role, while the specials efforts are again pleasing. The score, which I found slightly lacking in <em>'Iron Man'</em>, is improved. The plot isn't as interesting, or all that creative, but it's done well enough that I didn't ever feel bored; though some of the pacing is off.\r\n\r\nI like Don Cheadle so it's good to see him come in, even if his character is rather forgettable. Scarlett Johansson is also a solid addition, though Sam Rockwell didn't do anything for me in his role. Mickey Rourke is fun enough as Ivan.", "created_at": "2021-01-16T00:35:40.244Z"}, {"movie_id": 10138, "review_id": "62d2439e5f4b7300560d0724", "rating": 7.0, "review_text": "**A predictable sequel that continues the story of the first film without, however, being as good as it is.**\r\n\r\nAfter an excellent first movie, this was a predictable sequel, but I have to admit that the movie is a bit over the top and that, sometimes, it feels like a very expensive video game. Furthermore, the main character, Tony Stark, is perhaps one of the nastiest and most irritating comic heroes, and this movie seems to try to accentuate that by turning the protagonist into a spoiled playboy who has expensive toys and looks at women like if they were, also, toys. Okay, I know the character was also portrayed like that in the original books, even though I'm not a comics fan. But the movie could give something that made Tony Stark someone we could really care about.\r\n\r\nIn this film, the hero will face his first great antagonist, the son of a Soviet scientist that Stark's father knew. At the same time, Stark has to face the US Army, who are eager to get their hands on the combat suits he created, discovering that his father knew of a new chemical element, not yet officially discovered, and in which lies the key for the survival of Stark himself. With these brief lines, we can see, right away, that the script is not exactly one of the strong points of the film. The feeling that remains is that the script shoots in several directions, trying to create a more complex story, but that something got in the way and prevented that objective.\r\n\r\nThe cast basically has the same names as the previous film. Robert Downey Jr. is back to the red armor for yet another film, where he has shown himself to be deftly sarcastic and irritating without losing his heroic pose. Mickey Rourke is a welcome addition to the cast, playing the villain. The actor was able to adapt to the character quite competently. Samuel L. Jackson, Gwyneth Paltrow and Don Cheadle also return, but they don't do more than they did in the previous film, still fulfilling what was asked of them. Scarlett Johansson deserves a praise for her work here, but the rest of the cast just do what needs to be done.\r\n\r\nThe film is yet another very expensive blockbuster, abundantly financed by Marvel, and it is very obvious that it will become one of the most watched films of the season. With so much money and financial interest involved, the film was doomed to a loud and flashy bet on high-quality, but still obviously false, effects and CGI. The film has a lot of action and the fights are excellent, although obviously choreographed and stilted. The cinematography is crisp, vibrant, and magnificently beautiful. The film bets a lot on quality props, good sets and costumes, as well as a good soundtrack.", "created_at": "2022-07-16T04:50:38.667Z"}, {"movie_id": 10138, "review_id": "63471af39bcd0f007d3245fc", "rating": 5.0, "review_text": "Watched in chronological order 2022.\r\n\r\nGenius bachelor who's also an idiot makes more advanced toys and fights his company betraying him. Dead daddy's secret message saves the day. Meh.", "created_at": "2022-10-12T19:52:19.388Z"}, {"movie_id": 10138, "review_id": "64a503b05a991500c603bf87", "rating": 6.0, "review_text": "Again an ok movie. Now there's 2 iron man's kind of dumb. I hated that part of the movie but storyline once again is the only good thing.", "created_at": "2023-07-05T05:46:24.032Z"}]