[{"movie_id": 615457, "review_id": "605ebcc346f354005353fdfc", "rating": 6.0, "review_text": "Although writer Derek Kolstad (the 'John Wick' franchise) hasn't quite nailed it this time around - and the nitpicker in me took issue with a few plot lines - it's still a wild and crazy escapist romp that'll leave any action fan happy - myself included. Oh yeah, and Christopher Lloyd and RZA are in this too, kicking arse and taking names, if that helps.\r\n- Jess Fenton\r\n\r\nRead Jess' full article...\r\nhttps://www.maketheswitch.com.au/article/review-nobody-john-wicks-cousin-is-just-as-badass-but-with-more-laughs", "created_at": "2021-03-27T05:04:03.997Z"}, {"movie_id": 615457, "review_id": "60931bf4a06efe007a43b903", "rating": 7.0, "review_text": "Sometimes a story doesn't have to be sensible or original. It just has to deliver the goods - lots of guns, knuckle sandwiches, and explosions garnished with dry humour and melodrama. With Nobody, you got them all, plus a newfound action star. I watched this 2 in the morning and I had some good fun.", "created_at": "2021-05-05T22:28:04.704Z"}, {"movie_id": 615457, "review_id": "60e7542843250f002d190b15", "rating": 6.0, "review_text": "Are you waiting on the new john wick 4? then this will keep you entertained until then. Its not same quality of film or action but good popcorn movie to waste some time. The movie just movie just goes Bang Bang Bang all the way so wont get easily bored with it.", "created_at": "2021-07-08T19:38:16.316Z"}, {"movie_id": 615457, "review_id": "60eae12f42d8a500461533e4", "rating": 6.0, "review_text": "As I have stated in other reviews, I am not a fan of action thriller movies as a genre. I have liked enough of them to make me willing to try them, but it is the exception for me to enjoy them, not the rule. So a fair action thriller is less likely to hold my attention than, say, a fair western or sci-if movie.\r\n\r\nAll that is just to say as a preamble that this movie held my attention and interest, which was all it needed to do. I gave it a try because I like Bob Odenkirk, though I must say I don’t see him as an action hero.\r\n\r\nNeither the story nor the characters were particular gripping for me, but as I said, it was entertaining enough for me to stick with it, despite the excess of deaths. I am not complying about the violence,I  should clarify, just the body count. It is almost like the director came out before every scene, clapped his hands, and instead of saying “Here is what I want from each of you,” he asked “Here is how many dead bodies I want.” It is almost cartoonish. Violence can be powerful and sizzle in the viewer’s gut, but when there is way too much of it, it loses its power and even its relevance.\r\n\r\nSo although I have no idea if the average action thriller crowd liked this movie, I will say that if you are not a fan of violence, action films or Bob Odenkirk, I would give it a miss.", "created_at": "2021-07-11T12:16:47.642Z"}, {"movie_id": 615457, "review_id": "61166795350398005ce97d23", "rating": 5.0, "review_text": "It's fun if you turn your brain off. Ilya is a master of mayhem and Odenkirk is awesome as always so even when the story sputters and stretches for cohesiveness it delivers more than enough fun action to keep you invested. That said, it does not stick the landing and the ending (no plot spoilers) was kind of a disappointment. I'm not expecting high art or even anything particularly special from a standard \"dude goes on a rampage\" narrative but for a film that started off having real impact from the fight scenes (unlike say John Wick who is basically Marvel level superhuman) it gives that up and turns our anti-hero into just another invisible character wrapped in so much plot armor it's hard to feel invested in the events that unfold.", "created_at": "2021-08-13T12:37:41.044Z"}, {"movie_id": 615457, "review_id": "612a378da4af8f00624cc444", "rating": 7.0, "review_text": "Let me put this out there first, I am a big fan of Bob Odenkirk. So my review might be more biased. Regardless of if you are a fan or not this movie was super fun. Loved the mannerism in which the ordinary life of most folks is merged with the extraordinary past life of the character.", "created_at": "2021-08-28T13:18:05.060Z"}, {"movie_id": 615457, "review_id": "6157485769eb900061d018e9", "rating": 8.0, "review_text": "**Full Analysis at SpotaMovie.com** - When life becomes monotonous and exhausting, you need a bit of action. “Nobody” gives you one hour and 32 minutes, intense and full of frustrations, adrenaline, and pure madness. So, is there a better way to relieve your stress? Let’s find out. - **The Story** - Hutch Mansell is an ordinary man with a wife and kids. His life is not precisely exciting. His daily routine is exhausting in its boredom, and the people around him don’t let shine his best qualities. Then, one night, his life changes when two thieves break into his home in the middle of the night. Inside Hutch’s mind, there is now frustration, and the criticisms of the people around him make him feel useless and underestimated. To find himself, he needs to look into his past, where his life was different. So the other side of Hutch resurrects and with it the “best part” of himself. A night can change everything. It can bring fresh ideas, new perspectives or sometimes just troubles. And we are talking about big ones. Who is Hutch? What is he going to do? And what can push a man to his limits? - Check it at https://www.spotamovie.com/nobody-2021-movie-review-and-analysis/", "created_at": "2021-10-01T17:41:43.734Z"}, {"movie_id": 615457, "review_id": "6165b3d1a802360043e9284e", "rating": 7.0, "review_text": "With exceptional stunt work (Greg Rementer, Dan Skene) and remarkable directing (Ilya Naishuller), Nobody mainly works due to the surprising casting of Bob Odenkirk (Little Women) as the badass yet vulnerable protagonist. Derek Kolstad - creator of the John Wick franchise - basically writes what could easily be characterized as a spin-off of the popular action saga starring Keanu Reeves, which has its pros and cons. \r\n\r\nOn one hand, the formulaic narrative isn’t unique in the slightest, holding a cliche, weak villain, and a lack of compelling characters besides the main one. On the other hand, it features insanely gory, bloody, well-choreographed fighting sequences, where Odenkirk absolutely shines - the actor performs a shockingly impressive amount of stunts. \r\n\r\nExpectations-wise, it offers the high entertainment levels audiences crave, so I can’t help but recommend it.\r\n\r\nRating: B", "created_at": "2021-10-12T16:12:01.739Z"}, {"movie_id": 615457, "review_id": "61cb39b7647654008fd855a0", "rating": 8.0, "review_text": "I have to confess that I like you-f…-with-the-wrong-guy type of revenge movies so I guess it is not very surprising that I liked this movie.\r\n\r\nPeople have compared it to John Wick but I do disagree with that. Sure the basic premise of the story is quite similar but that’s it. To me these are quite different movies albeit in the same genre or even sub-genre.\r\n\r\nJohn Wick is much more classy both in John Wick’s style and the entire setting of the movie with it’s entire secret society. John Wick is also much more over the top in the action parts. Nobody is more gritty and he is slightly closer to a normal person than John Wick.\r\n\r\nThe movie starts of a bit slow actually. Well, at least in my opinion. Nobody is mostly walking around moping and looking sad. He also more or less gets beaten up right away which made me get a bit concerned as to whether this was going to be a movie I liked or not. I got really concerned when he managed to get himself tasered of all things. What the f…?\r\n\r\nLuckily he picks up on the bad-assery and it gets better as the movie progresses. Towards the end it gets really good actually, first when he frees the bad guy from the burden of all that ill gotten cash and then the showdown at the little work shop where Nobody barricaded himself together with… nah, that would be a spoiler, you have to watch the movie.\r\n\r\nThe bad guy is actually quite a good bad guy. Hollywood has been really lousy at creating good bad guys lately but this one, a real far out psychopath as well as a Russian mobster, fits the role perfectly.\r\n\r\nJust to be a bit picky, a 4.9 litre 72 Challenger? Now I may of course be wrong but to my knowledge there is no such thing as a 72 Challenger with a 4.9 litre engine (also a 4.9 litre engine is really not very impressive). Did some lazy writer just pick a number?\r\n\r\nAnyway, this was definitely a good movie. Quite enjoyable.", "created_at": "2021-12-28T16:22:15.017Z"}, {"movie_id": 615457, "review_id": "623655b9d7cd060045a46a8c", "rating": 8.0, "review_text": "This was an unexpected pleasant surprise. I bought the blu-ray strictly because Bob Odenkirk is on the cover and as a fan of Breaking Bad (BB) and Better Call Saul, I wanted to see what this movie was about. I had no idea of what the story was, so I started watching this completely fresh. I was entertained throughout the entire film. I was surprised how believable Bob's character was throughout. The other other thing that surprised me was Mr. Odenkirk's fitness, youthfulness and the contrast of this character with the ones he plays in BB and Saul. The story was engaging but not very original. Somewhat like John Wick as I expected but it had it's own flavor of a regular guy with an unexpected past. A lot of the film required me to suspend reality and accept that what I was watching could happen knowing that it was unlikely that it would. The villains were evil and some of the scenes with the villains are over the top but fun to watch nevertheless. The movie ends with me wanting to know more about Bob's character Hutch, his comrades and what his past was both before and after he met his wife and had a family. I would recommend this to anyone who is a fan of Bob Odenkirk and enjoys a lot of great fights and battles in a fast action movie.", "created_at": "2022-03-19T22:14:17.750Z"}, {"movie_id": 615457, "review_id": "627efc14873f000050f6082b", "rating": 9.0, "review_text": "An absolute blast!\r\n\r\n<em>'Nobody'</em> is a supremely entertaining action flick. Most of it actually feels fairly usual for a film of this sort, yet the way everything is presented is great! The pacing is perfection, the musical choices are fully on point and then you also have strong cast performances.\r\n\r\nBob Odenkirk is of course (rightly) super acclaimed for that role as a certain lawyer elsewhere, so it's nice to see him doing other things. He is superb in this from beginning to end. Aleksei Serebryakov also gives a good performance, as also seen in television's <em>'McMafia'</em>. Christopher Lloyd and RZA are fun, too.\r\n\r\nThe action is top notch, especially the fight stuff, and the humour - whilst not in your face - is noteworthy as well. It all comes together to make a fantastic 90 minutes that truly fly by. Gimme 'Nobody 2'.", "created_at": "2022-05-14T00:47:16.429Z"}, {"movie_id": 615457, "review_id": "62c8bf1195665800fd27194d", "rating": 8.0, "review_text": "_Nobody_ is a bloody good time, and I mean that literally. The action in this movie is on another level, so many creative shots and gruesome kills that had my whole body jumping in the best way possible. The slow mo shots were some of my favorite, allowing you to see every little detail of the atrocity that just occurred. The plot in this film is a little far-fetched, but that is kind of the point since the tone of the entire film is satirical. The entire second half of the movie happens due to chance. The one Russia entering the bus just so happens to have connections to the story's antagonist group. If you are able to stretch your imagination for this film, it can be overlooked for the most part. I really enjoyed how far removed Hutch was from his previous life in the beginning, leading him farther and farther down a path of self loathing and depression. It really juxtaposes the switch in his mind that reverted him to becoming a weapon capable of killing dozens of men at once. You can really see Hutch becoming alive again once he retakes his former mantle and that is all due to Bob Obenkirk’s fantastic performance. While this movie wasn’t perfect, it still was an incredibly fun ride and kept a smile on my face throughout the entire film.\r\n\r\n**Verdict:** _Great_", "created_at": "2022-07-08T23:34:41.489Z"}, {"movie_id": 615457, "review_id": "64b9483fefd3c200aed69394", "rating": 7.0, "review_text": "Got this movie for free with my reward points. So never heard of this movie or even knew what it was about. It is actually a pretty good movie. It's really a nobody who is just tired of life beating him down. Just like me lol. All of sudden he just snaps and starts making people pay.", "created_at": "2023-07-20T14:44:15.219Z"}]