[{"movie_id": 1991, "review_id": "57895dcd9251411e290048f5", "rating": 9.0, "review_text": "My least favourite Tarantino film by a mile but still solid and great fun. I seriously hope he abandons his wish to only do two more films (after his recent 'The Hateful Eight') and then retire, but chacun son gout, as the French would say, and everyone should be able to do whatever they want as long as they don't hurt anyone else, right? And if anyone of recent vintage (the past 25 years) deserves that, it's Tarantino, I suppose, but still, I hope he's lying.", "created_at": "2016-07-15T22:03:57.569Z"}, {"movie_id": 1991, "review_id": "5a3bd3fd0e0a264cc122093f", "rating": null, "review_text": "I am apparently one of the few who saw \"Grindhouse\" when it came to town. Great, grisly fun in the theater on the big-screen. A double-feature complete w/ fictional \"previews,\" several of which became feature films themselves (\"Machete,\" and \"Hobo with a Shotgun,\" which wasn't one of the previews shown in my hometown.)\r\n\r\nBut then the dumb decision was made to split the two features into separate, longer ones. Bye, bye fun previews (except on YouTube.) Hello, longer films that were just the right length in the theater.\r\n\r\n\"Death Proof\" especially suffers from extra-padding and more of Tarantino's blah-blah-blah dialogue. Instead of a breezy film about a whack-job who gets his jollies terrorizing women in his souped-up stunt-car rides, we get a talky film w/ action scenes that take forever to get going. And when they do, they're too easy to pick apart and criticize.\r\n\r\nStuntman Mike dispatches four young women w/ the first vehicle were shown (having already murdered his unwilling ride-hitching companion) and the Police decide to speculate on his intentions, vs. trying to prove them. Some justice system in Texas.\r\n\r\nLater (or perhaps earlier; some viewers feel the 2nd 1/2 of the film actually takes place before the 1st...an opinion I don't agree with) Stuntman Mike goes after three women taking a joy-ride while re-enacting a particular hood-riding stunt. After a few minutes of bumper tag, he is shot by the sudden appearance of a revolver (which was where during the chase...taking a nap?) \r\n\r\nAt this point Psycho Mike becomes Blubbery Mike and somehow is caught up w/ after he'd taken off in a great hurry; apparently they equipped certain 70's muscle cars w/ GPS's sent back from the present.\r\n\r\nI can't explain why, but in the theater \"Death Proof\" was silly (if nasty) fun. But watching at home brings all manners of \"Oh, come on\" moments that really detract from appreciating it in the same way. The bar scenes drag on, and on, and on. The talk scene at the diner goes on, and on, and on. The scene where a local yokel is asked to let the three ladies test drive his car goes on, and oh you get the picture. \r\n\r\nSorry, QT. You turned a 6/10 flick into a 4/10 slog-fest. Those \"mast-head\" scenes aside, \"Death Proof\" has little to recommend it to anyone not a fan of Tarantino's work...which has been awful since \"Basterds,\" and even that film is over-rated in spots.", "created_at": "2017-12-21T15:32:13.203Z"}, {"movie_id": 1991, "review_id": "5bc3f7510e0a266e5d055667", "rating": 6.0, "review_text": "A soured stuntman (Kurt Russell) targets young women with his death-proof cars\r\n\r\nCreated by writer/director Quentin Tarantino, “Death Proof” was originally the second part of the double feature called “Grindhouse,” released in 2007.  The other movie was “Planet Terror” by Robert Rodriguez. Both were standalone stories, although vaguely connected. They were a deliberate attempt to recreate the experience of a double feature at a B movie house in the mid/late 60s-70s with the prints intentionally marred by scratches and blemishes, etc. Trailers for fake movies, like “Machete,” were part of the package.\r\n\r\nThe plot of “Death Proof” involves an embittered stuntman (Kurt Russell) and his psycho obsession with murdering young women of dubious character with his death proof stunt cars (but only the driver’s side). It’s like a melding of “Faster, Pussycat! Kill! Kill!” (1965), “Village of the Giants” (1965) and “Vanishing Point” (1971), but with a more modern vibe and Tarantino’s unique brand of moviemaking.\r\n\r\nThe first half is very good, opening with the excellent “The Last Race” by Jack Nitzsche, which was the theme song for “Village of the Giants,” an instrumental. But the movie’s hindered by the inane chatter of the girls. The dull drivel goes into overdrive in the second half, particularly that involving Zoe Bell, Tracie Thoms and Rosario Dawson. Yet viewers are eventually rewarded by a thrilling car chase in the country that’s supposedly Tennessee, but obviously Southern Cal.\r\n\r\nRussell’s character is perversely charismatic and the movie perks up whenever he’s on screen. There are no less than eight female co-stars playing mostly classless types (thankfully, not all of them) and, depending on your tastes, four of them are quite alluring: Mary Elizabeth Winstead, Rose McGowan, Vanessa Ferlito and Sydney Tamiia Poitier (yes, Sidney’s daughter).\r\n\r\nThe film runs 1 hour, 53 minutes and was shot in Austin, Texas, and Buellton, California.\r\n\r\nGRADE: C+/B-", "created_at": "2018-10-15T02:11:29.354Z"}, {"movie_id": 1991, "review_id": "5ddd6b3f4284ea0017faba3a", "rating": 9.0, "review_text": "There are few things as fetching as a bruised ego on a beautiful angel. \r\n\r\nWarning: Spoilers\r\n \r\nDeath Proof is directed and written by Quentin Tarantino. It's part of a double feature production that Tarantino and Robert Rodriguez released as Grindhouse. With Rodriguez contributing Planet Terror. Death Proof tells of a psychopathic stunt man played by Kurt Russell who stalks pretty young ladies and then murders them by way of road accidents caused by his \"death proofed\" stunt car. Joining Russell in the cast are Zoë Bell, Rosario Dawson, Vanessa Ferlito, Jordan Ladd, Sydney Tamiia Poitier, Tracie Thoms, Mary Elizabeth Winstead and Rose McGowan.\r\n\r\nMany trials and tribulations followed the release of the Grindhouse project; poor opening weekend, two film's meant to be together ultimately separated on disc, with different cuts etc etc. It's all rather boorish in truth and really both Death Proof and Planet Terror stand up on their own two feet even if the whole \"Grindhouse\" homage\" is somewhat lost in home viewing. So on to Death Proof, a film that finds Tarantino on deliciously agreeable form. Delivering a chicksploitation psycho killer piece that bubbles nicely under the surface to then explode into one of the most thrilling finales in recent times.\r\n\r\nNow in its longer cut, Death Proof is split into two parts. The first part has one group of girls (Poitier, Ladd & Ferlito) out in Austin, Texas, celebrating the birthday of one of them. It's here we are introduced to Stuntman Mike (a terrific Russell), who is stalking them. For this first half there's lots of talk and relationship posers plotting away. It's a slow build, and in light of QT's pre release promise of 200mph thrills, it may lose some viewers hungry for action and murder death kill from the off. But hang in there, listen to the dialogue, get to know the characters, particularly the girls (how often do we get to know victims in slashers eh?), and then bang! Pay off number one as carnage is unleashed in multi-angles and action replays. A memorable blood show played out to the awesome drum beats of Dave Dee, Dozy, Beaky, Mick & Titch's pop classic Hold Tight.\r\n\r\nPart two. And our second group of girls, an aesthetically pleasing bunch that contains Zoë Bell, Mary Elizabeth Winstead, Tracie Thoms & Rosario Dawson. Again there's much talk, but oh what talk. These are girls I could sit and listen to for ever. This may not be QT's most quotable movie, but it isn't shy of coolness in the writing. Just sample the whole gun conversation as the camera revolves around the table, a sharp sharp moment in the film; all that's missing is a Madonna story, you know? Some may argue it's indulgent from the director, I say it's finding a director very relaxed and at one with his protect. Besides, it's a critical passage of play that's setting us up for the exhilarating climax as Bell (real life stunt-woman) straps herself to the bonnet of a speeding Dodge Challenger. What follows is ripping cinema, free of CGI and string work, not only does QT homage those car movies of the 70s he loves so much (Vanishing Point, Dirty Mary Crazy Larry et al), but he's also patting the back of the stunt-men and women who bring so many action moments to life. And as this long car chasing sequence raises the pulses, it starts to unravel that Death Proof is subverting the norm. Bravo boys and girls.\r\n\r\nHilarious, riotous, troubling, sexy and sleazy, Death Proof is unsurprisingly proving divisive. But I for one wouldn't be at all surprised if in ten years time it is regarded as being one of his best movies. The Grindhouse project may not have worked as a whole, but this portion on its own provides thrills and cheek in equal measure as Tarantino gets behind the wheel and takes us on one hell of a ride. Kicking soundtrack too! 9/10", "created_at": "2019-11-26T18:13:19.961Z"}, {"movie_id": 1991, "review_id": "5e2065450102c900133c4ab5", "rating": 7.0, "review_text": "Death Proof evidently illustrates that Tarantino’s thirst for blood will never run out of fuel. The second feature of Rodriguez/Tarantino’s homage to the “Grindhouse” exploitation genre, is one that reeks of petroleum. Emphasising the raucous vehicular mayhem of muscle car extravaganzas that plagued cinemas in the 70s. But, this isn’t just an exploration into “death-proof” automobiles, commonly driven by stuntmen. Oh no no! This is a Tarantino exploration, and if we know that deranged genius by now, expect prolonged conversational scenes from his taut screenplay, authentic scenes of violence and feet. Lots of feet.\r\n\r\nA stunt driver hunts down young women. That’s it! It’s as simple as one jaded stunt double, driving recklessly across America, crashing into women at ridiculously high speeds. This is Tarantino’s interpretation of a slasher. Instead of a machete or other bladed utensil, it’s a burning tyre to the face or body flying through the windscreen. He intelligently displays all aspects of a car and fully utilised each component as a tool or limitation for the characters. Whether it be clinging onto the bonnet at maximum velocity or imprisoned in the passenger side of a roll cage. The vehicles, much like the characters, are constantly at the forefront of Tarantino’s screenplay.\r\n\r\nUnfortunately though, and this is his most common tendency, his script is anchored by overlong expository conversations that diminish the roaring entertainment. For example, Abernathy and her group of gal pals rest and chat about Bell’s yearning for test-driving a Dodge Challenger. Whilst the elongated take, with Tarantino rotating the camera round the table beautifully for a whole ten minutes, was exceptional directing, it detracted from the blazing car crash that occurred just moments ago. And the reason for this was due to the courageous decision in change of characters halfway through the feature. The initial four girls were not exactly lap dancing their way out of that crash. Yet the principal commitment in altering characters, whilst narratively jarring, had significant purpose in defying audience expectations.\r\n\r\nInitially, we’re led to believe that “Stuntman Mike” is about to produce the same exhilarating “accident” again. But Tarantino knows what you’re thinking. He isn’t stupid (except when choosing to act in his films...). And so he changed the structure by flipping it upside down. The hunter becomes the hunted. And it worked, effortlessly! Staring at real stuntwoman Bell as she plays “Ship’s Mast” on the Challenger, whilst the antagonistic Russell continually bulldozes his car into theirs. Tarantino glides the camera across the landscape, exhibiting one of the most exhilarating car chases in quite some time. It’s fun, energetic and a major contribution to air pollution. And then concluding on a freeze frame? Genius.\r\n\r\nDeath Proof is the resurrection of a bygone sub-genre through the healing qualities of Tarantino’s frivolous vitality. It rarely took detours and drifted excitedly round tight corners, albeit with limited exploitative violence and prolonged conversational scenes. Death Proof really is Tarantino-proof.", "created_at": "2020-01-16T13:29:41.271Z"}]