[{"movie_id": 9890, "review_id": "5f32dbfd1967570039b3b74f", "rating": 3.0, "review_text": "_**Confused comedic remake of the original 1975 film**_\r\n\r\nA couple (Nicole Kidman & Matthew Broderick) moves from the Big Apple to Stepford, Connecticut, where many of the wives of the village are wholly dedicated to their husbands, home & garden and keeping themselves well-groomed and primed for sex. The husband joins the mysterious all-male organization of the town which seems to be up to something fishy. Bette Midler plays Joanna’s best friend while Glenn Close & Christopher Walken are on hand as high society leaders.\r\n\r\n“The Stepford Wives” (2004) is a confused comedic remake of the iconic 1975 film. It starts out like it might be a fun farce, and it is to some degree, but it’s hindered by an annoying stereotypical “gay” character and doomed by befuddled writing, the result of bad-management wherein rewrites and reshoots ruined the story's continuity and created plot holes. \r\n\r\nThe most glaring example is the implication that the wives are replaced by robots; for instance, one woman is used as an ATM machine. At the end, however, Joanna (Kidman) discovers they've just been brainwashed by microchips inserted in their brains. If the latter is true, why was there an android version of Joanna? Do the men have a choice of a robot model or a human-with-a-microchip model? Do they choose “accessories”? It’s never elucidated. \r\n\r\nThe film runs 1 hour, 32 minutes, and was shot in Connecticut and New York/New Jersey.\r\n\r\nGRADE: D+", "created_at": "2020-08-11T17:57:17.049Z"}, {"movie_id": 9890, "review_id": "63174f6aba131b007c561bf8", "rating": 5.0, "review_text": "Despite an A-list cast, this is a really poor and disjointed film that is much more about the stars than it is about any cohesive story. Television executive \"Joanna\" (Nicole Kidman) has burned the candle at both ends for too long, has a bit of a breakdown, and is shunted off to the manicured hedges and lawns of Stepford in Connecticut by her rather insipid husband \"Walter\" (Matthew Broderick). It doesn't take them long to realise that this is conceivably the most sterile, charm free place on the planet. All their neighbours have wives who would vie for the most vacuous woman prize - doting on their looks, their dresses, their hair, their gardens - whilst their men folk, under the watchful eye of \"Mike Wellington\" (Christopher Walker) and his uber-glamorous wife \"Claire\" (Glenn Close) seem to live the life of Reilly. Luckily, \"Bobbie\" (Bette Midler) offers \"Joanna\" the vaguest of lifelines as the only other voice of near sanity in this oasis of feminine perfection, but how long before they succumb too - or can they resist the mysterious effects of the spa and the gentleman's club? There is really very little to like or enjoy in this. For it to have worked, it would have required much more humour and charisma on screen. The narrative meanders in just too flat and stolid a fashion, with little for us to get our teeth into. Middler has probably the best chance at injecting a degree of personality into the thing, but even she struggles with the wordy dialogue and the lacklustre delivery. It looks good, effort has certainly been expended there - but the rest of this is just poor and disappointing. The 1975 film isn't great, but it's way better than this.", "created_at": "2022-09-06T13:47:22.237Z"}]