[{"movie_id": 428078, "review_id": "5c56d4ee0e0a26031bc84368", "rating": 4.0, "review_text": "Shocking nobody, _Mortal Engines_ was not very good. Trying to jam way too much into two hours than is reasonable, it instead delivers on zero things. I guess I was **kind of** interested in the character of Shrike, but that was really the whole of my positive experience with _Mortal Engines_. Maybe if this thing had come out about eight years ago in the **height** of the bizarre Steam Punk obsession that gripped the globe (even if it was a weird sort of obsession where everybody called everything they like, and themselves Steam Punk but it really wasn't required to have any relation to actual Steam Punk) then the movie could have at least done well financially, but there's no world wherein this version of _Mortal Engines_ is a consumate film.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2019-02-03T11:47:58.569Z"}, {"movie_id": 428078, "review_id": "5caebd509251412fa6215d63", "rating": 9.0, "review_text": "Good attempt.  Different, unique, and the sets are great.  Yeah, it has some weak points, and some of the writing/editing could have been better.  But this is a refreshing  change in the usual sci-fi stuff that has been coming out. Marvel and DC are flooding the market with their super heroes (not all bad, just too much) I detest all these vampire/werewolf/zombie crap (all of it) This is a nice change, and I enjoyed it! \r\nI did not know what to expect when I started to watch this, but I was pleasantly surprised. Ignore the negative reviews. Those are probably written by zombies/vampires/werewolves....", "created_at": "2019-04-11T04:06:40.224Z"}, {"movie_id": 428078, "review_id": "5cb9e750c3a3687f8f80b801", "rating": 9.0, "review_text": "I have to say that I liked this movie a lot. It is kind of fantasy, science fiction (emphasis on fiction here) and steam punk (or perhaps I should say diesel punk) mixed together.\r\n\r\nThe world is a fairly dark post apocalyptic world where moving predator cities prays on each other. The entire concept is really quite ridiculous of course but it makes for some really fantastic and spectacular special effects and I am a sucker for spectacular special effects.\r\n\r\nIn addition the overall story holds together fairly well. That is, in the context of the ludicrous world that is the background of this story in the first place of course. It is quite straightforward without too much annoying social or green preaching that plagues so many movies nowadays. Somewhat predictable but overall a good vehicle for the plentiful action.\r\n\r\nI also liked most of the characters. Both the bad guy and the good guys had decent charisma with the exception of Tom who was a bit of a naive whiner although he got it together towards the end.\r\n\r\nThere where  few flaws. Nothing really major except that, in one scene at the end, the city of London was shown against the wall and it was bloody tiny compared to the wall. The main bad guy’s last resort was to pummel London against the wall and was expected to break it down. Before in the movie London was depicted as really huge. That scene really screwed that and made him delusional.\r\n\r\nApart from that, end Tom’s whining and naivety, I really liked this movie. It was the kind of over the top, fantasy/fiction movie with a big budget that you do not see every day. Of course the dickwads, a.ka “critics”) at Rotten Tomatoes and other mainstream media assholes did their best to tell everyone how bad it was. As usual that’s just the stuff that comes out of the south end of a north bound bull.", "created_at": "2019-04-19T15:20:48.445Z"}]