[{"movie_id": 11451, "review_id": "6022de859979d20040e4cfb9", "rating": 7.0, "review_text": "Really good watch, would watch again, and can recommend.\r\n\r\nIt's fun to see a callback to a movie like Herbie, and this certainly leans into it.  This is also basically the last movie where Lindsay Lohan is still looks good on screen, or at least cute.  Lohan and Herbie pretty much carry the movie despite some good supporting parts by the rest of the cast.\r\n\r\nWhile I'm used to seeing Justin Long playing a support role, and Matt Dillon is the \"villain\",  it is a bit odd to see Michael Keaton play such a small, if appropriate, role.\r\n\r\nThe unbelievability of Herbie being a racecar and the crazy amount of effort that is put into making Herbie a real character should be a downside of the movie, but it makes it remarkably charming in the best of ways.", "created_at": "2021-02-09T19:12:05.105Z"}, {"movie_id": 11451, "review_id": "658c06475cd16e6d0cd2793e", "rating": 5.0, "review_text": "\"Fully Loaded\" with what though? \"Herbie\" must have had a tax bill to pay, else what is our mischievous little VW doing in this? He's now the property of \"Maggie\" (Lindsay Lohan) who has family pedigree in motor car racing. Her dad \"Ray\" (Michael Keaton) was hugely successful but he doesn't want his daughter to follow in his footsteps! Anyway, she takes \"Herbie\" to mechanic \"Kevin\" (Justin Long) and he agrees to fix her up and get her road ready. The idea - well they need to raise some cash so he can fix up his garage and she can get to college. \"Herbie\" is on board for this, and his enterprising track antics ensure that she defeats all comers and earns a race against champion \"Trip\" (Matt Dillon) that could net them $10k. \"Trip\" smells a rat and also, to be fair, \"Maggie\" starts to tread on the affections of her car - \"Herbie\" takes a bit of a huff and... Can they patch up their differences and take out the arrogant and sly \"Trip\"? Can the family taboo that's lingered for years finally be put to bed? Will she hook up with \"Kevin\"? (Whatever happened to Justin Long?). Who knows, maybe even some oil-on-oil action for \"Herbie\" and a sleek new yellow number? It's got very little to do with the \"Love Bug\" (1969) this - it's essentially a showcase for Lohan and she does just about enough to keep it from crashing and burning. That said, there are no characterisations to speak of and the self driving car has long since stopped being innovative. I didn't hate it, but it could just as easily been an edition of \"Knight Rider\" without the flashing red light.", "created_at": "2023-12-27T11:11:03.917Z"}]