[{"movie_id": 515001, "review_id": "5df5cf7065686e001883d652", "rating": 10.0, "review_text": "Through his use of music and uncanny ability to find humour and heart in the darkest of moments, Taika Waititi has created an everlasting story that gives the power back to the persecuted and hope to the lost. ‘Jojo Rabbit’ will make you cry from laughter, cry from emotional pain, and cry with hope. It is simply stunning in all its facets, and a truly remarkable and unexpected film.\r\n- Jess Fenton\r\n\r\nRead Jess' full article...\r\nhttps://www.maketheswitch.com.au/article/review-jojo-rabbit-taika-waititi-strikes-comedy-gold-again-with-adolf-hitler", "created_at": "2019-12-15T06:15:12.284Z"}, {"movie_id": 515001, "review_id": "5e0c64f0a84ff70015347cbb", "rating": 7.0, "review_text": "Manages to somehow be one of the most raw and confronting looks at various aspects of WWII I've ever seen, and yet also often genuinely very funny. I'm not sure if that's really something that you should do... But Taika did anyway, and I loved it.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2020-01-01T09:22:56.624Z"}, {"movie_id": 515001, "review_id": "5e1c4bfcd5dbc20017f3827b", "rating": 8.0, "review_text": "Funny, light-hearted and delightful, Jojo Rabbit is a charming, and at times poetic, celebration of friendship, romance and peace, and a cheerful ode to our capability, and bravery, to save and love beyond boundaries.", "created_at": "2020-01-13T10:52:44.315Z"}, {"movie_id": 515001, "review_id": "5e21335e397df0001697591e", "rating": 9.0, "review_text": "**_A hilarious piece of political satire that isn't afraid to be serious_**\r\n\r\n>_The great danger of lying is not that lies are untruths, and thus unreal, but that they become real in other people's minds._\r\n\r\n- Christine Leunens; _Caging Skies_ (2004)\r\n\r\nWe live in dangerous times. In this era of political regression, racists, xenophobes, neo-Nazis, white supremacists, white separatists, and fascists, once confined to the periphery of civilised society, have wormed their way back into the cultural mainstream, preaching hate and intolerance under the guise of terms such as \"nationalism\" and \"patriotism\". Meanwhile, politicians validate such groups by doing precisely nothing to curtail them and refusing to condemn them (\"_very fine people on both sides_\" and so forth). Far-right political parties have gained worrying footholds in numerous European countries, running on populist platforms of Islamophobia and anti-immigration, playing on peoples' fears of the Other, exploiting the dearth of facts in sociopolitical discourse, and trading in disinformation (and the less said about the current administrations in the US and UK, the better). Anti-establishment political rage is on the increase, as hordes of people disavow traditional centrism; think of Brexit, the election of Donald Trump, the _Movimento 5 Stelle_ in Italy, the _Alternative für Deutschland_ in Germany. Scholars and sociocultural anthropologists have posited that hateful right-wing ideologies are more validated now than at any time since the rise of fascism in places such as Italy in 1922 and Spain in 1936. And the best known example of this kind of fascist thinking, of course, is the Third Reich in Germany, beginning with the rise to power of Adolf Hitler in 1933.\r\n\r\nAnd so, it's entirely fitting that a film set in this very _milieu_, which argues that love, tolerance, and kindness can defeat hateful indoctrination, has come along at this precise moment; because although this is a film set in Germany in 1945, it's really about the here and now. Based loosely on the 2004 novel _Caging Skies_ by Christine Leunens, _Jojo Rabbit_ is a political satire written and directed by New Zealand filmmaker (and Polynesian Jew) Taika Waititi (_Eagle vs Shark_; _What We Do in the Shadows_; _Hunt for the Wilderpeople_; _Thor: Ragnarok_). Courting significant controversy when it was announced (a comedy about Nazis? For shame. Especially when one considers that the novel is deadly serious) and sharply dividing critics upon release, the film has proven a significant hit with audiences, and has just scored an impressive six Academy Award nominations, including Best Picture.\r\n\r\nPositing that the first casualty of indoctrination is objective truth, Waititi follows in the footsteps of filmmakers such as Charlie Chaplin (_The Great Dictator_), Mel Brooks (_The Producers_), Roberto Benigni (_La vita è bella_), and even Quentin Tarantino (_Inglorious Basterds_), in attempting to defang Nazi ideology by rendering it utterly absurd and mercilessly exposing it to mockery. Marketed as an \"_anti-hate satire_\", the film has no easy task – to use Nazism as the (mostly) humorous background to what is essentially a _bildungsroman_, without it seeming exploitative or dismissive of the real suffering endured by real people. And Waititi manages this tricky balancing act exceptionally well. The satire and slapstick elements are as funny as anything in his filmography, and the film's more serious moments (of which there are several) arrive like an absolute gut-punch. This could have gone wrong in so many ways – if it wasn't funny, if the emotionality felt contrived, if the serious moments seemed manipulative, if the whole thing just came across as disrespectful and in bad taste – but Waititi navigates these dangerous waters magnificently. _Jojo Rabbit_ is, in fact, that rarest of films – a comedy where the serious moments feel completely earned and a drama with something important to say where the comedy enhances the seriousness.\r\n\r\n_Großdeutsches Reich_, 1945. The European war is all but over. Germany's army has been pushed back to the homeland and allied forces are approaching from multiple directions. However, the propaganda machine continues to ensure that the populace are relatively unaware that _Der Führer_ is on the brink of total defeat. In the fictional town of Falkenhem, ten-year-old Jojo Betzler (an astonishing debut by Roman Griffin Davis) lives with his whimsical mother Rosie (Scarlett Johansson doing probably the best work of her career). His father, he believes, is fighting on the Italian Front, whilst his older sister Inge recently died of influenza. And, oh yeah, his imaginary best friend is none other than Hitler himself (a ludicrously over the top Waititi), or at least Jojo's childlike conception of Hitler. Believing absolutely in his duty to the state, Jojo and his actual flesh-and-blood friend Yorki (a hilarious Archie Yates) attend a camp for the _Deutsches Jungvolk_ branch of the _Hitlerjugend_. The camp is run by the cynical Cpt. Klenzendorf (a powerful performance by Sam Rockwell that was outrageously ignored by the Academy), who was forced to leave the front line upon losing an eye. Helping him manage the camp are his effeminate second-in-command Finkel (Alfie Allen) and the completely insane Fräulein Rahm (Rebel Wilson), who claims to have given birth to eighteen blond-haired blue-eyed _übermenschen_ who are now fighting on the front. When Jojo is told by some older boys that to prove he has what it takes to be a soldier, he has to kill a rabbit, he refuses to do so, earning the moniker Jojo Rabbit. However, determined to show his fellow students what he's made of, he barges into a _Stielhandgranate_ exercise, tossing a grenade against a tree, which then explodes a few feet away from him, leaving him with a limp and a scarred face, and forcing him to return home in disgrace. As Jojo recovers, Rosie persuades Klenzendorf, who was demoted after the incident, to give him some work, and so he's employed to distribute propaganda around town. Life is dull but straightforward. That is until he learns his mother has been hiding a young Jewish girl, Elsa Korr (a nuanced performance from Thomasin McKenzie), in a crawlspace behind the wall of Inge's room. However, as every German youth knows, Jews are mind-reading demons who must be exterminated. So why would his mother be harbouring one, and, more importantly, what does Jojo do now that he knows?\r\n\r\nPerhaps _Jojo Rabbit_'s most laudable component is how well Waititi balances the disparate tones, which is a hell of a lot better than Benigni did. The film mixes slapstick humour, caricature, satire, dramatic irony, and hope, but never does it seem like its ignoring or trivialising real suffering. When the comedy is dropped and Waititi gets serious, the tonal shifts pack a shocking punch, and it's _because_ they're so well integrated into the overarching comic structure – if you take away the humour and the satirical edge, the film's darker elements simply don't work as well – it's the contrast that makes each element all the more powerful. Waititi's tonal intentions are indicated right from the beginning, as stock footage of German children performing 'Heil Hitlers' is scored (unashamedly anachronistically) by the German version of The Beatles' \"I Want to Hold Your Hand\" (1963). Also crucially important to the film's tonal qualities are the bright, colourful palette employed by director of photography Mihai Mălaimare, Jr. (_The Master_; _A Walk Among the Tombstones_; _The Hate U Give_) and the whimsical production design by Waititi's regular designer, Ra Vincent. Together, they speak to the fact that this is Jojo's worldview rather than objective reality, with the look of the film reminding me a great deal of Wes Anderson's _The Grand Budapest Hotel_ (2014). It sure doesn't look like any World War II movie you're ever likely to have seen.\r\n\r\nThematically, the film examines multiple issues; the devotion of motherhood, the importance of kindness in defeating indoctrination, the disconnect between an unchallenged and rigidly reinforced ideology and a far more nuanced and complex reality, the predetermined attitudinal stance towards the Other, the clash between doing what one knows to be right and what one is expected to do, the fact that good people can be found even in the worst of circumstances. Klenzendorf's arc is especially telling in this respect. Introduced as a hyperbolic caricature, the source of some of the film's biggest early laughs, as things progress, we realise there's considerably more to his character than initially thought, and he commands what's easily the most moving scene in the whole film. This is Jojo's story, however, with much of the runtime concerned with his attempts to rationalise the cognitive dissonance between what he's been taught and what he can see with his own eyes. Rosie is rightly worried that the indoctrination Jojo has known his entire life has effectively brainwashed him – he's so passionately loyal to Nazi ideology, when he found out his grandfather didn't have blond hair, it took him three weeks to get over it.\r\n\r\nOf course, as mentioned, although set in 1945, _Jojo Rabbit_ is really about the here and now, although it's more than a little upsetting that its depiction of illogical hate is so timely. Essentially, the film mocks extremism, people who hate based on ethnicity or religion, with Jojo's belief that Jews are demonic figures capable of powerful magic standing in for people who believe all Muslims are terrorists or all Mexicans are rapists. In this sense, the film isn't about Nazis at all; their role is more allegorical. Rather it's partly about the role adults play in inculcating children into hate and partly about exposing the power of propaganda to subvert truth. But so too is it about rising above such ideology, no matter how ingrained it might be, a path that values personal relationships with persecuted minorities, which in turn reveal the individualistic humanity behind the political cliché. And although all of this is presented humorously, it never becomes didactic or monolithically preachy – Waititi balances his tones so well, the political undercurrent remains always subtle.\r\n\r\nIf I were to criticise any element of the film, it would be that Waititi undeniably glosses over some of the more horrific atrocities carried out during the War. The Nazis in the film are, by design, cartoonish, but that is done so as to render them as easily dismissed figures to be scorned. The reality, of course, was far, far darker. I've seen some critics point to this as evidence that the film is crass and manipulative, and although I disagree with that assessment, it certainly wouldn't have hurt to have at least one fully indoctrinated Nazi who isn't a figure of fun – even the Gestapo is exposed to ridicule, with the character of Deertz (an admittedly hilarious Stephen Merchant cameo) presented as more concerned with empty pop-cultural signifiers than carrying out the actions of the real Gestapo. In this sense, the film doesn't represent the awful truth, but it never claims to; this isn't a reality-based examination of Nazism, nor does it try to be.\r\n\r\nOnly two weeks into 2020, and I already have a possible film of the year. _Jojo Rabbit_ is beautiful, emotional, heartfelt, and devastating, but mostly hilarious and always hopeful. It's an extraordinarily sweet film without ever becoming saccharine, as Waititi strikes a perfect balance between comedy, tragedy, and drama. It's a very funny World War II film which imparts a vital message for our confused and divided world of today – if we let them, love will always trump hate, hope will always light a way through the darkness.", "created_at": "2020-01-17T04:09:02.585Z"}, {"movie_id": 515001, "review_id": "5e2f2887ac8e6b0011bcc3e9", "rating": 7.0, "review_text": "\"Your mother took me in. She's kind. She treats me like a person.\"\r\n\r\nTaika Waititi is on a roll recently and rightfully so, because he's got a great comedic vision.\r\n\r\n'Jojo Rabbit' is a World War II satire that's both hilarious and surprisingly tragic. Joy, terror, love, hate all in one movie. Waititi knows how far to take a joke and how humor can put on light on ugly issues. While absurd looking on the surface, but on a deeper look it's something unique. \r\n\r\nNewcomers Roman Griffin Davis and Thomasin McKenzie take center stage upon the big cast. Their comedic timing, emotional range and overall performances are nothing short than impressive. Also Archie Yates is like the adorable child version of Nick Frost.\r\n\r\nSpeaking of big name stars. Scarlett Johansson is having a fantastic year and she once again delivers a wonderful performance. Sam Rockwell is amazing in pretty much anything he's in and here is no different. Rockwell playing a closeted homosexual Nazi is hysterical, and yet meaningful when you look at it more thoughtfully. \r\n\r\nThe weakest actor upon the cast has to be Rebel Wilson. I really didn't buy her as this character. I thought she's just doing her usual comedic traits like in every other movie, which I'm not a fan of. \r\n\r\nNot only is Taika Waititi directing and writing, but also starring as Jojo's imaginary friend of his very own idol... Adolf Hitler. Apparently Waititi didn't have to research playing Hitler, because he thought Adolf was 'a f**ing c***'. Anywhere, the concept itself is really bizarre and really fascinating. While silly and entertaining, but could've been left out, in my opinion. There was a point where he completely disappears from the movie to later reappear during the finale.\r\n\r\nAt times I feel like it tries hard to be like a Wes Anderson movie, in terms of staging, quirky humor, and overall setting. Influence is one thing, but it came a point when it wasn't being it's own thing.\r\n\r\nOverall rating: Criticisms aside, I had an absolute blast. Endearing and highly vocal. I'm glad a movie like this exist.", "created_at": "2020-01-27T18:14:31.792Z"}, {"movie_id": 515001, "review_id": "5e3aad5543250f0015c7091b", "rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nTaika Waititi delivers one of those films I absolutely love for the exact same reasons some people deeply hate it. His seamless balance between comedy and war drama makes Jojo Rabbit a thought-provoking yet hilarious depiction of how ridiculous Hitler’s followers were. Roman Griffin Davis offers one of the best young performances of the millenium, and the rest of the cast is pitch-perfect. There’s a lot of laughs, but also a lot of heart. Still, be warned: if you’re easily offended, this movie isn’t suited for you. Either go in with an open mind or don’t go in.\r\n\r\nRating: A-", "created_at": "2020-02-05T11:56:05.997Z"}, {"movie_id": 515001, "review_id": "5e55b83a35811d00195d2fac", "rating": 7.0, "review_text": "Thought the first 35-40 minutes to be rather dull and unfunny, however the rest really brought the film together and made the first part make more sense what Waititi was doing. Some nice moments with Davis and McKenzie although can't say I fell in love with this, but still glad I watched. **3.5/5**", "created_at": "2020-02-26T00:13:46.543Z"}, {"movie_id": 515001, "review_id": "5e805468a4f03c0012b67f70", "rating": 7.0, "review_text": "Where this film may have missed the mark for some people is in its comedy, insofar as audiences expect a certain depth of humour from Waititi's films. Nevertheless, _Jojo Rabbit_ is tremendously endearing, especially through the titular character's innocent portrayal by actor Roman Griffin Davis.\r\n\r\nIts poignant ending—the last scene of which I'd rewinded about 5 times—brought a smile to my face. Likewise, the appended Rilke quote seals the film as a tremendous work of art.", "created_at": "2020-03-29T07:55:20.327Z"}, {"movie_id": 515001, "review_id": "5e8ff784197de400150679b4", "rating": 9.0, "review_text": "**Jojo Rabbit** is wild. Heart-warming yet heart-breaking. Laugh-out-loud funny yet nerve-racking. This film is crazy good and offensively amazing. Please don't feel guilty for laughing, just enjoy the show.", "created_at": "2020-04-10T04:35:16.498Z"}, {"movie_id": 515001, "review_id": "5f238d995b2f4700365e9805", "rating": 8.0, "review_text": "I almost feel bad for not liking this more.", "created_at": "2020-07-31T03:18:49.369Z"}, {"movie_id": 515001, "review_id": "6571c1c990fca3012d12f374", "rating": 8.0, "review_text": "Now I am not a fan of children in films so approached this with more than a soupçon of trepidation. Well you can shoot me down in flames - Roman Griffin Davis is superb, simply superb. Can an 11 year old get an Oscar nomination? The story is quite surreal; a young Hitlerjugend (Nazi youth) discovers that his mother is harbouring a young Jewish girl under the eaves of their roof. What should he do? He's got Taika Waititi (aka Hitler) in his head preaching Nazi Arian philosophy at him whilst his own humanity (and curiosity) is guiding him elsewhere. Scarlett Johansson and the slightly sexually ambiguous pairing of Sam Rockwell and Alfie Allen are great at keeping the whole thing going and it's funny and inventive from start to finish. Special mentions for Archie Yates as his pal \"Yorki\" and Davis' acting coach Rachel House who has done a splendid job.", "created_at": "2023-12-07T12:59:53.272Z"}]