[{"movie_id": 2662, "review_id": "5b2159eb0e0a264d8d00fa3b", "rating": 6.0, "review_text": "Rob Zombie’s comic book non-horror take on “The Texas Chainsaw Massacre” \r\n\r\nRELEASED IN 2003 (but shot in 2000) and written/directed by Rob Zombie, \"House of 1000 Corpses” is a horror/black comedy about two young couples who inadvertently visit a house of demented serial killers in backwoods Texas.\r\n\r\nA critic summed the movie up as “a ridiculous horror comedy, but with extremely annoying villains.” It was inspired by (or rips off) “The Texas Chainsaw Massacre” (1974) and combines it with the cartoonish horror comedy of “Evil Dead II” (1987) while throwing in a little “The Funhouse” (1981).\r\n\r\nThe entire first act, including the amusing prologue that introduces Captain Spaulding (Sid Haig), is very entertaining, but the over-the-top approach starts to get dull by the middle of the picture with the overdone events at the demented Firefly abode. The last act gets so cartoonish that I thought maybe the main protagonist (Erin Daniels) was experiencing a nightmare. The fantastical elements strip away any vestige of horror that was hardly there in the first two acts, which were too zany to take as serious horror. As such, I can’t see anyone older than 7 finding this movie “disturbing.” Still, the film pulsates with colorful pizazz and characters, not to mention a quality score/soundtrack.\r\n\r\nSheri Moon Zombie is effective in her role as Baby Firefly. I liked her voice and didn’t mind her laugh (which many criticize), but she’s a little too thin for my tastes. Daniels works pretty well as the main protagonist. But, considering Zombie’s resources (e.g. the five captive cheerleaders), the flick sorta drops the ball in the female department.\r\n\r\nThe film sat on the shelf so long because Universal feared a NC-17 rating. Lions Gate eventually picked it up, but it was cut & edited in an attempt to achieve an R-rating. The original version was 16 minutes longer.\r\n\r\nTHE MOVIE RUNS 1 hour, 29 minutes and was shot in Southern Cal (Chicken Ranch Backlot, Universal Studios; Palmdale; Santa Clarita; and Saugus).\r\n\r\nGRADE: B-/C+", "created_at": "2018-06-13T17:52:43.059Z"}, {"movie_id": 2662, "review_id": "5e072328eda4b700172b6b6f", "rating": 6.0, "review_text": "Heavy throwback elements make up most of _House of 1000 Corpses_' runtime, from an era when Zombie was still finding his footing. It maybe leans too heavily on a nostalgia that I simply don't have, but personally I found this to be one of Zombie's weaker entries. Great song! But I don't totally love the movie. I like it. I wish that some of the parts I found more interesting, like Doctor Satan, got a bit more play, and both the acting and video quality often leave something to be desired, but still, I like it. \r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-12-28T09:40:56.967Z"}, {"movie_id": 2662, "review_id": "6410e163b4224200b9737229", "rating": 2.0, "review_text": "**Style, blood, guts and hard rock, without any decent script to back it up.**\r\n\r\nRob Zombie has devoted his life to music and horror movies, but so far I haven't seen a single movie of his that's really worthwhile. The director's style is that very low-budget and low-quality horror that made school in the 70s and 80s. In truth, I must say that there is some coherence here, if we consider the musical style of Zombie's projects. However, it is a film that disgusts us, and that causes more strangeness and repudiation than fear.\r\n\r\nIn this film, we follow four teenagers who accidentally stumble into a village of abnormal people and end up intrigued by a local legend about a mad doctor who cut people up, was executed and disappeared, leaving in doubt whether he had really died. Of course, they end up in an even crazier, morbid and dysfunctional house of people, who are behind an endless series of crimes.\r\n\r\nBy my standards, this movie is so bad that it doesn't even work as a comedy. There is not a scary moment, based on a strangely bizarre script, without content. The film shows the influences of slash horror, with lots of gore, blood running everywhere and bodies torn to pieces. Cannibalism, necrophilia, sadism, if we think of depravity this film will probably have some scene associated with what we think. That, on the one hand, has a vantage point: the film is gritty enough to pull it off, in an era when horror movies are so bland that even underage kids can see them.\r\n\r\nThe cast brings together a series of actors who have become famous precisely in slash cinema: Sid Haig, Bill Moseley, Karen Black, Tom Towles, Dennis Fimple. Each one of them did their job well, they are the right actors for this type of material, they are perfectly comfortable doing this. However, Haig and Moseley are particularly effective and work very well, stealing the audience's attention whenever they appear. Sheri Moon, an actress who has a certain relevance in the film, is however an amateur, Rob Zombie's girlfriend, who entered the film at his request. Love has these things, it makes us do crazy things. Unfortunately, and as it is routine in these films, the teenage victims of the carnage are simply talking meat that we can't care less about for a minute.\r\n\r\nThe film does some pretty competent visual effects work, with gallons of fake blood and other effects designed to make the killing realistic and \"fun\" enough. The sets and costumes were also very well thought out and create a decadent environment, in which rurality is distorted and transformed into the perfect environment for a Halloween massacre. That is, the film has style, it has an extremely worked and complex look, but that's about it. It does not present us with content, substance that makes the film worthwhile.", "created_at": "2023-03-14T21:04:35.384Z"}]