[{"movie_id": 12767, "review_id": "619018d388634800437ad225", "rating": 6.0, "review_text": "_**Manor-in-the-woods thriller/horror**_\r\n\r\nA troubled New York City couple (Dennis Quaid & Sharon Stone) move to the country after purchasing a dilapidated estate at a can’t-refuse price. Unfortunately, the manor’s past interrupts their enjoyment of their new home. The cast is rounded out by Stephen Dorff, Juliette Lewis, Dana Eskelson, Christopher Plummer and Kristen Stewart (who was 12 years-old during shooting).\r\n\r\n“Cold Creek Manor” (2003) is a drama/thriller with a bit o’ horror that mixes “What Lies Beneath” (2000) and “The Messengers” (2007) with “Undertow” (2004). Instead of cabin-in-the-woods, it’s a manor-in-the-woods flick, but don’t expect over-the-top slasher antics (e.g. silent masked killer with a machete), as this one’s more low-key and realistic, albeit saddled with eye-rolling thriller/horror clichés.\r\n\r\nIf you can roll with that flaw and a laughably executed snake sequence, this is pretty much on par with “What Lies Beneath” and “The Messengers” although it lacks the artistry of “Undertow.” Stephen Dorff is outstanding and the movie brings to life the small town/rural area with the residents thereof. People criticize the casting of gruff Dennis Quaid as a “wuss,” but he’s not a wuss; he’s just not rash because he knows a reckless social mistake can bring life-changing tragedy in seconds. Most other nitpicks can be just as easily explained. For instance, a person can’t very well push someone into a well if they’re no longer in the area.\r\n\r\nThe film runs 1 hour, 58 minutes, and was shot at Cruickston Park, Cambridge, Ontario, and places nearby in the Kitchener/Cambridge region with studio stuff done in Toronto, which is just an hour’s drive east.\r\n\r\nGRADE: B-", "created_at": "2021-11-13T19:58:11.034Z"}, {"movie_id": 12767, "review_id": "62653c98713ed400aa1e66d0", "rating": 5.0, "review_text": "I always had a bit of a crush on Stephen Dorff, and his topless torso helps this start off quite promisingly. Sadly, that is the undoubted highlight in this otherwise really poor horror mystery. \"Cooper\" (Dennis Quaid) and his wife \"Leah\" (Sharon Stone) take their kids from the city to live in an old rural manor house. It needs a bit of work, and they hire in the son of the former owner \"Dale\" (Dorff) to help out. That's mistake number one as we quickly discover that this house might not be the family's most shrewd purchase. Mike Figgis tries quite hard to build and sustain a sense of menace here, but he is completely let down by a storyline that is far too thinly stretched and by a really lacklustre effort from both Stone and the really weak Quaid. It doesn't so much end, as just peter out - I couldn't have cared less about any of them and once Dorff put his shirt on, my interest waned completely. An early outing for Kristen Stewart and a pointless one for Christopher Plummer (who didn't even have to get out of bed) add quite literally nothing to this mundane thriller that is really light on thrill.", "created_at": "2022-04-24T12:03:36.023Z"}]