[{"movie_id": 336808, "review_id": "562a2699925141284c001fe8", "rating": 8.0, "review_text": "Good and complete movie touching several topics at the same time; the destruction through the conquest of the native cultures and knowlege in America and the vital path of 4 different human beings.\r\n\r\nCiro Guerra es smart to use black and white and the landscapes of the Amazonas to fill all the silences of the movie.\r\n\r\nThe cast is quite good, specially the 2 actors performing Karamakate; Nibio Torres and Antonio Bolivar.", "created_at": "2015-10-23T12:22:49.776Z"}, {"movie_id": 336808, "review_id": "577ab4039251410581001069", "rating": 8.0, "review_text": "> In any world, the history keeps repeating itself.\r\n\r\nIt is one of the last films to I watch from the 2016 Oscars nominees. It was a Colombian production that represented the country in the 88th American Academy Awards. It had all the qualities to win that major international award, but lost the bet to 'Son of Saul'. In my perspective, after seeing all the five, no doubt, but this film's the real winner. The film was loosely based on the real occurrence that was written in the diaries of two scientists on their expedition into the Amazon's deep in search of something what intrigued the conflict between the two worlds.\r\n\r\nIt portrayed the beautiful Amazon in the black and white pictures and I loved it because, it recreated the world that was over 100 years ago. It would have not affected the viewers same if it was rendered in colour. It is awesome to see a film like this about the Amazon people after a very long time. Because prior to the 80s and 90s, there were plenty of African and South American exploration films made which rapidly reduced its number when comic book films became the frontrunner in the world cinema. So going back to the lost world was really an amazing experience that this film had given to me and you should not miss it as well.\r\n\r\nIt takes place in the first half of the 1900s that breaks into a two part narration. In the first, where a German scientist Theo, looks for a help from the last surviving young man from his tribe, Karamakate, to explore the jungle for the scientific research. In the second, 40 years later, an American scientist, Evans follows a similar kind of quest who once again seeks help from the aged Karamakate. When Karamakate realises their agenda, concerns for the peace and stability in the region, so goes for the measure that has to be taken.\r\n\r\n> \"Ants like money. I do not. The taste is bad.\"\r\n\r\nIt was like lost in translation. During the invasion of the remaining parts of the South America in the Amazon basin on the Colombian side, how the both worlds suffered was the part of this narration and cultural collision was one of the main topics. Most of the film was shot alongside of the rivers Inirida and Varupes, especially the final scene location was so beautiful. The film concept was similar to the 'Anaconda 2', but there's no intense action-thriller, especially there's no fast and aggressive serpents in the act. The scientists are looking for a certain kind of plant which is considered sacred and protected by the Amazon tribes.\r\n\r\nIt was boring in the initial parts, because I did not know what to expect. So I just kept watching as whatever it was focused on. But during the end of the first act, I started to like it. Because it was not as complicated as I thought and it was not the art film like those without the plot and background score. So at the end of my watch, I'm very satisfied. The actors were stunning as the amazing Amazon basin is. Of them all, the 'Borgman' actor was the only familiar face to me.\r\n\r\nIt is a powerful film, with a bit of a documentary style presentation. The main theme was about the history repeating itself. In your lifetime if it repeats means a second chance to divert it from the possible future nuisance. So how the one who cares would reach and solve it is what this film was told. The film characters were brilliant and Karamakate will be remembered. A neatly narrated tale that will remain people's favourite for a very long. One of the films of the 2015 and of the Oscars nominees that nobody must miss it.\r\n\r\n8/10", "created_at": "2016-07-04T19:07:47.156Z"}]