[{"movie_id": 391713, "review_id": "5a24615ac3a3680b9a0d882a", "rating": 5.0, "review_text": "This movie was ok (it wasn't boring nor was it very entertaining). At first I didn't understand the point it was trying to make. Was it you can shortcut your way to your dreams if you lie, cheat, and steal (as that was exactly what she did)? It wasn't about the pressures of class division (as a review I read states), as no one treated her as any differently regardless of her social status and any division she felt was just in her head. Her anxiety against her parents, the school, and the upper class of her school turned out to be non-issues, and when she got to where or what she wants, she just finds that the grass never gets greener for her once she was on the other side. In fact, she just becomes resented by those she abandons to get there and ultimately ends up longing for the side she left. \r\n\r\nIf anything the movie was saying that those who are rich aren't as unexclusive as those without think, and they are just like everyone else. Just as the main protagonist was rebelling against her life to gain acceptance, so were the kids of the rich in that they are also just seeking acceptance. That doing anything to get your dreams won't lead to satisfaction as life on the other side isn't any better, you just end up hurting others by getting there that way, and in hindsight blinded you from what you already had. \r\n\r\nI guess the movie had something to say after all.\r\n\r\n★★½ - Not dull, nor was it very entertaining.", "created_at": "2017-12-03T20:40:58.567Z"}, {"movie_id": 391713, "review_id": "5a46240e9251411fab0942d8", "rating": 3.0, "review_text": "I think _Lady Bird_ is my film for 2017 where me and everyone else on the planet just straight up do not see eye to eye. At no point during _Lady Bird_ did I feel drawn in. I genuinely did not enjoy my time with Greta Gerwig's directorial debut. I haven't come across a single other person who feels the same, but I must be honest to my experience.\r\n\r\nNormally this is where I would say something along the lines of, \"It's just because this isn't my sort of movie\" except that last year _Edge of Seventeen_ dealt with virtually identical subject matter and that was one of my favourite movies of the year.\r\n\r\nSo I'm just wrong I guess?\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2017-12-29T11:16:30.435Z"}, {"movie_id": 391713, "review_id": "5f86c424a275020037c91c57", "rating": 10.0, "review_text": "This is one of my absolute favourite movies of all time. I understand why some might give it low ratings as it is directed at a very specific white female audience but all I have to say to that is \"they didn't understand it\". This is the ultimate comfort movie for me and I will take no criticism.", "created_at": "2020-10-14T09:25:56.880Z"}, {"movie_id": 391713, "review_id": "62b0bda1eb09320063cc33f5", "rating": 10.0, "review_text": "Full review: <a>https://www.tinakakadelis.com/beyond-the-cinerama-dome/2021/12/28/attention-attention-attention-lady-bird-review<a>\r\n\r\nThe opening image of writer/director Greta Gerwig’s impressive debut, _Lady Bird_, is of Marion (Laurie Metcalf) and Christine (Saoirse Ronan) asleep together in a hotel bed. Their faces are close, like mirrored images of each other. Not only do they look alike, they are two sides of the same coin. It’s why they get along so well and why they can wound each other so deeply. This mother-daughter relationship is the crux of the story Lady Bird tells. The movie chronicles Lady Bird’s (as Christine insists on being called) last year of high school in Sacramento. She can’t wait to leave, and is hoping to graduate and attend an East Coast liberal arts school. She’s looking for culture, and Sacramento has probably been in her rearview mirror for as long as she’s been alive.", "created_at": "2022-06-20T18:34:09.227Z"}, {"movie_id": 391713, "review_id": "6349a4d5b04605008166424e", "rating": 9.0, "review_text": "_Lady Bird_ is a fantastic coming of age story that is a lot deeper than its contemporaries in the genre. It deals with more than just boys and self-discovery, but familiar past, the complex relationships between parents, and the deep understanding that home is comfort no matter how terrible it may seem in the moment. It is all crafted so well that the experience is instantly relatable allowing many viewers to resonate with her. Despite this movie being a tad overhyped by many critics, it is still a brilliant film that is easy to watch and can somehow make me laugh and cry at the same time.\r\n\r\n**Score:** _90%_ |\r\n**Verdict:** _Excellent_", "created_at": "2022-10-14T18:05:09.766Z"}, {"movie_id": 391713, "review_id": "64cca70a798e0600ad1831ce", "rating": 10.0, "review_text": "Garden variety coming of age films are so prevalent that it’s all the more refreshing when something truly personal and original like “Lady Bird” comes along. The small scale intimacy of the story about a teenage girl on the cusp of womanhood in Sacramento feels raw and real, its cozy focus creating a universal anecdote that relives (with bittersweet affection) a part of life that’s filled with constantly fluctuating highs and lows. This is exactly the type of indie filmmaking that we need more of, and the awkwardly charming Greta Gerwig has hit a home run with her equally awkwardly charming directorial debut.\r\n\r\nThe film gives an unromantic glimpse into middle class life in 2002, where we meet Lady Bird (Saoirse Ronan), her recently laid off and depressed dad (Tracy Letts), and her hardworking, steadfast mom (Laurie Metcalf). The film is perfectly cast, with Ronan and Metcalf being the real standouts (the two are at their best when pushed into blow-up clashes between mother and daughter, an emotional tug of war between a teen impatient to break away from a hometown that’s beneath her and a mother so desperately hanging on that she’s unable to express her love and disappointment). It’s apparent the actors felt emotionally connected to the material while on set, and their performances bring a biting honesty and empathy to the family dynamics of Gerwig’s screenplay.\r\n\r\nGerwig has said the film is semi-autobiographical and she writes with an authentic voice, taking great care with her story (a story told with the hindsight of being a grown up). She brings a confident wisdom, an earnest insight, and a fresh voice through a witty and bright script that mirrors her true-to-life, free spirited personality. It’s as if the film exists within its own glowing aura. With Gerwig at the helm, the film has a particular hipster quirkiness written all over it, yet its sunny disposition and sharp humor is abundant with sincerity and avoids falling into the trap of being overly cynical or jaded.\r\n\r\nThe film is so observant that I could totally and wholly relate to our adolescent heroine through a realism that instantly transported me to the past. While I grew up in a different decade, some of the situations seemed like actual pages ripped out of my own high school experience. There are plenty of moments in a teenage girl’s life where the trivial becomes momentous and the momentous becomes devastating, and they are presented here with a poignant and compassionate vibrancy that I’ve rarely seen so accurately captured on film.", "created_at": "2023-08-04T07:21:46.425Z"}, {"movie_id": 391713, "review_id": "64ec1fb506f984010c708809", "rating": 6.0, "review_text": "Saoirse Ronan is \"Christine McPherson\" (aka \"LadyBird\"). In the final year of her high school life, she has to deal with all of the conflicting influences as her adulthood - and future - looms. She has a strong relationship with her father; a more torrid one with her mother - and generally resents what she perceives to be her family's rather hand-to-mouth existence in Sacramento. It's a tale of her emotional development, her boyfriends (Lucas Hedges and Timothée Chalamet) and of her journey to adulthood that is at times poignant, at times self-indulgent but unfortunately, for me anyway, pretty disengaging. Her character is selfish and thoughtless - although not unsophisticated. Like many a story of our adolescence, it is fascinating for those it effects but is little more than dreary hormonal stuff for observers. This is the latter, I'm afraid, with plenty of well trodden clichés to make 94 minutes seem quite a lot longer... Not for me, I'm afraid.", "created_at": "2023-08-28T04:16:53.337Z"}]