[{"movie_id": 397422, "review_id": "595e60239251410c5608591f", "rating": 6.0, "review_text": "I went to see this alone lol and I am a straight man and let me tell you I laughed out loud several times the characters were loveable and very welcoming one of the years best comedies ' I know that's not saying much ' but I truly enjoyed it and do recommend you go see it male or female you should enjoy this movie like I said I got a good long laugh try it enjoy,", "created_at": "2017-07-06T16:06:59.035Z"}, {"movie_id": 397422, "review_id": "59c9dadfc3a36803b7003e37", "rating": 3.0, "review_text": "The Australian accent is one that is very hard to nail down, I know that. But getting it wrong is just so bloody aggravating. Simple solutions: \r\nA) If the character doesn't have to be Australian, then just don't make them Australian.\r\nB) Just hire an actual Australian! Hollywood is full of the bastards!\r\nC) Hire one of the like... 3 actors who can actually do the job outside of these two options.\r\nKate McKinnon is not one of those 3 actors.\r\n\r\n...Oh and also _Rough Night_ was not very good.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2017-09-26T04:43:11.710Z"}, {"movie_id": 397422, "review_id": "5a7711a892514105a9043e51", "rating": 6.0, "review_text": "**Bachelorette gone wrong!**\r\n\r\nThis kind of girls night out flicks are not fun anymore. Yet it is hard to ignore them from watching. So I watched it not expecting anything special out of it. And I did not get any. But... it was okayish. Moreover, Scarlett Johansson was the main reason I wanted to watch it. You can't always do superhero, action films. This is something offbeat. Often need to take this path, no to fail miserably, but to relax from the mainstream. So this was enjoyable, but not by all.\r\n\r\nIt is like the female version of 'Hangover'. Five friends go to Miami for one of theirs bachelorette party. It's supposed to be fun without any rules, but a disaster strikes in the early and makes them to cover all the evidence. The night turns their worst nightmare ever. How they manage to come out of it are the remaining film that revealed with a twist at the end.\r\n\r\nThe reception was as expected, but it was not that bad if you are seeking only a timepass. It ended like there could be a sequel, but now it seems very unlikely. One of the issues with the film is it was so traditional narrative. With so many jokes repeated from other flicks. The majority won't approve that. As far as I think it is watch and forget kind of film. An average film. Disliking it does not change what it is!\r\n\r\n_6/10_", "created_at": "2018-02-04T13:59:04.132Z"}]