[{"movie_id": 351819, "review_id": "569afe96c3a36872bb0015fc", "rating": null, "review_text": "The recently released Fifty Shades of Black is a comedy spoofing the romantic drama Fifty Shades of Grey which went on to become a super hit worldwide and collected close to $570 million. Principal photography of the movie started in August 2015 in Los Angeles. The film is financed by Octane which is a division of the larger IM Global production house. Stuart Ford, its CEO serves as the movie’s executive producer. Open Road is distributing the movie in the United States. It is interesting to note that Open Road also distributed Wayan’s 2013 parody “A haunted house 1” and its 2014 sequel “A haunted house 2”, both of which belong to the same genre as this movie. \r\n\r\nMarlon Wayans stars as the mysterious Mr. Black in this outrageous comedy movie. He is also one of the producers and is credited as a writer alongside his long-time producing and writing partner Rick Alvarez. Mike Tiddes who directed both the haunted house parodies is the director of this movie. Kali Hawk, Mike Epps, Affion Crockett, Andrew Bachelor, Jane Seymour, Florence Henderson, Fred Willard and Jenny Zigrino appear in this movie along with Marlon Wayans.\r\n\r\nThe movie’s soundtrack comprises of a combination of hip-hop and R&B songs. There are 10 songs featured in the album and is released by IM Global Music. The music has been curated by Format entertainment and IM Global Music. The soundtrack goes very well with the movie and is being appreciated by all people who love independent music.\r\n\r\nMarlon Wayans plays a secretive black entrepreneur in this erotic spoof comedy. He starts dating an inexperienced college reporter Hannah played by Kali Hawk. His unusual sexual practices shock Hawk’s character and put a strain on their relationship. What happens when Hannah is taken through the maze of rough, hard and premature encounters inside Mr. Christian Black’s playroom forms the crux of the movie. True to the genre, the movie parodies the original by taking into account the basic story premise, its characters and all the important scenes. Sample this. Hannah is bidding farewell to Black as the elevator doors are closing. Only, the doors are closing several times on Hannah’s head.\r\n\r\nTrue to its tagline, the movie is way shadier than grey in its content and its treatment of the original book and its movie adaptation. It is not easy to spoof a popular movie with a great record at the box office. But Fifty Shades of Black lives up to its expectations and delivers on all counts. For a limited time, <a href=\"http://anotherhotmovie.com/50ShadesOfBlack/\">watch the full 50 shades of black movie</a> right here!", "created_at": "2016-01-17T02:38:14.987Z"}]