[{"movie_id": 799876, "review_id": "62575d48b3316b005255b51b", "rating": 9.0, "review_text": "Whatta film!\r\n\r\n<em>'The Outfit'</em> is excellent. Second time in roughly three weeks that I've had the pleasure of seeing a Mark Rylance flick on the big screen and again he delivers - such a reliable actor. The other release was <em>'The Phantom of the Open'</em>, which is very good but both the film and Rylance's performance is bettered here. A thoroughly enjoyable showing from him as Leonard Burling.\r\n\r\nThings start off extremely strongly with a terrific opening scene with Rylance's Burling, so I was praying that it would keep that high level and I'm pleased to say that - in my opinion, of course - it absolutely did. There's a bit at the end that I was initially unsure about, though upon further thought I enjoyed it just as much as the rest.\r\n\r\nOne element of this 2022 production actually stays the same from start-to-finish, I won't say what but early on I thought it may limit proceedings but if anything it just adds to the overall vibe of it all. The support cast, meanwhile, are all faces I didn't know before now, though every one of them give good performances - standouts being Johnny Flynn and Nikki Amuka-Bird.", "created_at": "2022-04-13T23:31:20.898Z"}, {"movie_id": 799876, "review_id": "6269135dea37e01195a7a0bc", "rating": 8.0, "review_text": "I will give any production with Mark Ryland in it a try, ever since I first noticed him in Wolf Hall. I enjoyed this film, with its taut script, realistic dialogue and several plot twists, which I won’t even mention for fear of giving things away.\r\n\r\nThis movie manages to be a noir piece, even though it doesn’t venture out into the dark and moody streets of Chicago. It is a set piece, taking place in one man’s tailor shop. I wonder if a theatrical production on Broadway is inevitable?\r\n\r\nThere are plenty of bad guys to be found here, but with enough shading of humanity as to make us root for a few of them over the others. But the script doesn’t care who you root for — the plot is the plot and it will runs its headlong course and draw us along with it.\r\n\r\nDespite the periodic outbursts of violence, this is more a drama than a thriller. It reminds me of what Hitchcock is supposed to have said. Suspense isn’t a bomb exploding but rather it is wondering if it will go off. Of course, in thrillers, if you have a bomb, it must explode at some point. This movie isn’t that predictable.\r\n\r\nThe Outfit isn’t just a drama; it is a character study, and Ryland’s character bears up well under the plot’s scrutiny.", "created_at": "2022-04-27T09:56:45.927Z"}, {"movie_id": 799876, "review_id": "630017e0bb2602007cee5322", "rating": 7.0, "review_text": "**Overall : a talented cast and smart story craft a clever mystery that is worth a watch.**\r\n\r\nAn unsuspecting tailor attempts to survive a night filled with betrayal and danger as his shop is used as a temporary safe house by mobsters. The Outfit plays out similarly to a game of Clue as the hunt for the mole takes twists and turns in the tiny tailor's shop. As the story unfolds, it's surprising who the true mastermind is being all the bloodshed.", "created_at": "2022-08-19T23:08:16.854Z"}, {"movie_id": 799876, "review_id": "630017f81da7a60085dc6aee", "rating": 7.0, "review_text": "**Overall : a talented cast and smart story craft a clever mystery that is worth a watch.**\r\n\r\nAn unsuspecting tailor attempts to survive a night filled with betrayal and danger as his shop is used as a temporary safe house by mobsters. The Outfit plays out similarly to a game of Clue as the hunt for the mole takes twists and turns in the tiny tailor's shop. As the story unfolds, it's surprising who the true mastermind is being all the bloodshed.", "created_at": "2022-08-19T23:08:40.955Z"}, {"movie_id": 799876, "review_id": "63b8928b73520500a78f1a6e", "rating": 8.0, "review_text": "The Outfit is an isolated who-done it set in the late 1950's as a group of mobsters desperately try to find the rat in their crime organization. The setting was superb and nostalgic, and the set is fixed to one room for the entire film, which really aided in the paranoia of the film.\r\n\r\nThis isolation led to the film primarily being carried by dialogue and exposition, which was superb here. The script and dialogue were complex and clever, and the performances worked great in conjunction with it. Mark Rylance stole the show, he was sweet and calm, but had suspiciousness to him that led the audience to believe he knew more than he was letting on. He outshined everyone in this film. Zoey Deutch was lackluster as she really didn't seem to play a character that was believable. Her delivery was very modern day. Johnny Flynn and Dylan O'Brien were fine, but Simon Russell Beale was a surprise. For the small time he was here, I really enjoyed his menacing presence and his chemistry with Rylance.\r\n\r\nThis film has multiple layers of mystery to it, and it was a joy to watch them unfold on the screen. However, I believe that there was too much towards the end. I was very satisfied with the twists and turns up to the end of the film, but then they just became absurd and over the top. I really did not connect with the final few twists and ultimately it hurts the enjoyment of the film in totality.\r\n\r\nScore: 81%\r\nVerdict: Great", "created_at": "2023-01-06T21:28:43.125Z"}]