[{"movie_id": 6278, "review_id": "5ef78b8513af5f003754601b", "rating": 6.0, "review_text": "_**Grim tale of the dragon apocalypse**_\r\n\r\nDormant fire-breathing dragons are awoken in subterranean chambers and proceed to unleash hell on earth. Almost two decades later a group of survivors led by Quinn (Christian Bale) live underground in England when American militants pay them a visit, led by seeming-psycho Van Zan (Matthew McConaughey). It seems they have a strategy to slay the dragons once-and-for-all.  Izabella Scorupco plays the woman stuck between the two rival leaders.   \r\n\r\n\"Reign of Fire\" (2002) is similar to the Mad Max films, but without the comic book goofiness. This is a solemn, grey tale with a quality cast, convincing sets/costumes and surprisingly effective CGI. I gained greater respect for McConaughey as he is unrecognizable as the bald combative and loses himself in the role. Unfortunately, the storytelling is weak. It’s just not that compelling, which isn’t helped by the mumbled dialogue and ambiguities. Still, if you can adapt to the viewer-unfriendly style, there’s a lot to appreciate here.   \r\n\r\nThe film runs 1 hour, 41 minutes and was shot in Ireland. \r\n\r\nGRADE: B-/C+", "created_at": "2020-06-27T18:10:13.156Z"}, {"movie_id": 6278, "review_id": "63c1737d23be4600b2f16a55", "rating": 8.0, "review_text": "**Reign of Fire might not have a robust deep story, but it’s still a solid post-apocalyptic sci-fi adventure with an impressive cast and great action.**\r\n\r\nReign of Fire collects Batman, Leonidas, a Bond Girl, and a crazed Matthew McConaughey and throws them headlong into a charred, barren post-apocalyptic world covered in the ash of millions of unstoppable hungry dragons. Critics savaged this movie with its harsh reviews, and if you expect an action sci-fi film about fighting dragons to win an Oscar, you will be disappointed. But if you embrace the movie for what it is, a fun action movie with a surprisingly good cast, pretty solid special effects for being 20 years old, and a simple but entertaining plot, then you will be more than satisfied. Christian Bale plays to his strengths as an intense but caring hero, while McConaughey goes full insane soldier dragon slayer in one of his more ridiculous roles but is also one of my favorites. Reign of Fire won no awards, but that doesn’t mean it can’t entertain and warm your heart (ha, get it? 🐉 😉).", "created_at": "2023-01-13T15:06:38.012Z"}]