[{"movie_id": 579583, "review_id": "5eeecac62e2b2c00376bcaab", "rating": 9.0, "review_text": "Pete Davidson has had a rough career and is viewed in a somewhat bad light, mainly due to terrible “cancel culture“ trends. If you go in wanting hate him, you will, but that defeats the heart of the film. 'The King of Staten Island' shines as both as semi-autobiographical film and another fantastic entry in Judd Apatow's ever-growing filmography.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-king-of-staten-island-judd-apatow-and-pete-davidson-team-up-is-a-match-made-in-heaven", "created_at": "2020-06-21T02:49:42.636Z"}, {"movie_id": 579583, "review_id": "5efce382d6d64d0036ce6df9", "rating": 6.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nJudd Apatow has directed/produced some hilarious pieces of cinema: Trainwreck, Bridesmaids, Superbad, Knocked Up, The 40 Year Old Virgin... He's got quite the filmography, there's no way of denying it. Therefore, his name alone is enough to grab my attention when a comedy co-written and directed by him comes along. Add Pete Davidson as a co-writer and the main star, plus a really fascinating cast with Marisa Tomei and Bill Burr, and I'm definitely interested. The King of Staten Island holds a formulaic premise (the whole \"dead parent entails a bad kid who needs to learn how to be a better person\" has been done to exhaustion), but is it able to elevate it in some way?\r\n\r\nFirst of all, the dark humor really works for me. For anyone who doesn't appreciate this type of comedy, Apatow's film might be too excessive. Tons of unrestrained jokes about the most sensitive subjects, and characters with no limits to where they can go with their wicked sense of humor. So, if you're not a fan of dark comedy, this movie might turn out to be a very unpleasant experience. However, if you have no issues with laughing at a \"bad joke\", this comedy might just work well enough for you to have a good time. I had really good laughs.\r\n\r\nScott takes the \"bad kid who does bad stuff\" to a quite terrible (and sometimes illegal) level. He possesses all kinds of psychological issues that you can think of plus some more. He says the most depressing, sad, offensive things to anyone that crosses his path. Pete Davidson absolutely shines in this role, it really feels like he's having an outstanding amount of fun. However, his character goes through such an overlong and exaggerated route that I could neither relate to nor feel sorry for him. This will make or break the film for any viewer: your emotional connection with the protagonist.\r\n\r\nAs I said in the beginning, the narrative follows a pretty cliche story that people have seen thousands of times. So, from the get-go, it's fairly easy to understand where the movie is going, what's going to change within the characters, and how it's going to end. Screenplay surprises don't come often in this genre, and even when they do, very rarely, they're able to impact the audience in a way that completely changes our perspective on the film or its characters. The King of Staten Island is a movie that tells its viewers everything they need to know in the first ten to fifteen minutes, and then there's nothing remotely new throughout.\r\n\r\nIt's just way too long. A bit over two hours seeing someone trying to figure out what he's going to do with his life is not exactly the best entertainment ever. There's more than one way to try to relate to Pete Davidson's character, but I really needed to dig deep to find one. As people probably know, Davidson's father was also a firefighter who died in the 9/11 attacks, and this film clearly takes inspiration from Davidson's life. It's not his biography, but he definitely puts a lot of his own personal issues into Scott's personality. Some people even state that he's just portraying himself, and that's not that far from the truth.\r\n\r\nIn my opinion, the best aspect of the movie is undoubtedly the incredibly realistic dialogues. It genuinely feels like the characters are having real conversations. The editing is so impeccable that I forgot I was watching a film for a couple of moments. The chemistry between every member of the cast is so vibrant that every single dialogue between any two characters always feels extremely lifelike. Marisa Tomei and Bill Burr are astonishing, they truly are. I wish more time was given to develop a bit more of Bel Powley's personal subplot, but I understand that she's far from being one of the most relevant characters.\r\n\r\nIn the end, The King of Staten Island employs a very well-known (and a bit overused) formula that goes on for way too long, but Judd Apatow balances it with a hilariously dark sense of humor, with the help of his co-writers, Pete Davidson and Dave Sirus. Most of the comedy really works, which helped to get through the least entertaining (and predictable) portions of the narrative. Davidson shines in a role that many addressed as \"he's just playing himself\", but I find him incredibly engaging and captivating to watch, even though I can't quite relate to his character. The emotional attachment to the protagonist is the major component that's either going to make you love this flick or spend a couple of hours just watching someone trying to figure out what to do with his life. The realistic dialogues (elevated by perfect editing) and the cast's phenomenal chemistry just tip the scale to the positive side. I definitely recommend it, but with the small warning that if you're not a fan of dark comedy, then it's better to skip this one.\r\n\r\nRating: B-", "created_at": "2020-07-01T19:26:58.802Z"}]