[{"movie_id": 185341, "review_id": "563a4e71925141439c002db8", "rating": 6.0, "review_text": "> When the source followed straight to the isolated lab.\r\n\r\nIt looks like been ages. I know the movies (the previous three), but can't remember the scenes. A quick recap would have been helpful, but I did not do that and went ahead with this. That's the reason I hate to follow television series on the broadcast which drag one season for over 6 months. This was the fourth film in the [Rec] film series and third in the story continuation after first two. The third installment was set in the parallel timeline to that before one, but off the track narration. In this, an old woman character was brought on-board to make sure the third film was not an offbeat from the series.\r\n\r\nExcept the opening few minutes, the rest of the story takes place on a moving ship. Kind of similar to 'Sector 7', though both the flicks are entirely different. The ship is used as a laboratory to develop a vaccine for the deadly disease which turns humans into the flesh eating zombies. It is protected by the armed paramilitary force. Somehow the virus breaks loose, the infection spreads out quickly through the various platforms like lab monkeys and foods. How the survivours fight to remain alive in the nowhere of the ocean is the remaining narrative. If there is a way, how they make it out that comes with the intensified gore battle between the undead and the living.\r\n\r\nI never expected another film in the series, I thought it was a trilogy, but after seeing this I felt the idea was not that bad after all. Just like the 'Jurassic Park' movies, the fourth movie puts the franchise back on the track after the third was derailed. The first film was so good and a bit scary too, followed by another decent movie. Like I mentioned the third flick was different, but a sustainable one to the theme and title.\r\n\r\n> \"I don not know what was going on,\r\n> but luckily I was not there.\"\r\n\r\nThis story starts off with a slow, until the third act where the pace picks up rapidly. Not scary, but towards the final sequences, it was very fast and edgy. The way it concluded, the outro scene was a hint for another film in the franchise. But in my opinion, it should have ended with three films or with this one. Hoping for a better one if there is going to be another [Rec], because my rating in numeral declining by one point following the each sequel.\r\n\r\nI think the suspense should have maintained well. There were some tiny twists and turns on the weak movie plot, but I anticipated the final twist and it did not deliver with that effectively. I know the theme was built on the situation, not depended on prolonged story. Because the action speaks more than any kind of development to give a clean vision on happening. After all, most of the horror movies follow the same sutra, but sometimes the horror-dramas exclude it and this is not one of that.\r\n\r\nIts a collective performance, individually, not noticeable. Because it does not follow any particular character. Though the character Angela, the television reporter was the centre of the attraction as it marks her comeback who was main in the first two films. The filmmaking was compromised, I mean it was not 'found footage' style movie as should have been. Because where this story set in does not demand such kind of cinematographical portrayal. Also avoids the dark atmosphere that used to scare us, especially the night vision screenplay was critical in the earlier two films to creep out the viewers.\r\n\r\nThe title for this installment was 'Apocalypse', but that does not make any sense what they show in the exit scene. Should have called it 'Zombie Ship' like 'Ghost Ship'. I feel it is worth a watch, only to keep updated the [Rec] film series, because if they make a phenomenal 5th movie, we don't have to go back to 4th for continuation.\r\n\r\n6/10", "created_at": "2015-11-04T18:29:05.547Z"}]