[{"movie_id": 64685, "review_id": "632910a1e194b0008360b32d", "rating": 8.0, "review_text": "**The human need to find meaning in the death of a loved one.**\r\n\r\nI confess that I didn't really know what I was going to find when I started watching this movie. I wasn't expecting much, even though I was aware that it was a film about the September 11 attacks, and that it had some actors that I respect, and I like to see. Perhaps on purpose, the film begins in a heavy and slow way, and it is not very easy to go beyond the initial half hour.\r\n\r\nHowever, the film improves a lot as we get to know the main character, a boy whose father died in the attacks and who is trying to deal with this loss in the best way possible. Whatever the age or situation, the loss of a parent is always dramatic. Believe me, dear reader, who is following me so patiently in these lines, I have been feeling it in my skin during the last few months, since I lost my beloved mother recently, and I believe that this personal circumstance had an influence on the way I ended up seeing myself in the boy, and in the emotional and moving way he tries to deal with grief and absence. He believes his father left him one last \"treasure hunt\" around a mysterious key, and he struggles to see meaning in his father's death, and in finding the key. It sounds childish, but allow me to be honest, I confess that I too, in the silence of my suffering and pain, felt and still feel the need to find some reason, some order in the midst of random chaos. Perhaps we, human beings, cannot accept that the people we love so much... simply die. And maybe we're right in not accepting just that...\r\n\r\nBy that, I mean that the horrible tragedy that happened in New York made sense in itself? No... evil is meaningless, but it doesn't need to make sense. What I refuse to think is that all those people died in vain. I believe that the American people, and all of us as a Western society, find meaning in everything that has happened, and we see those people as victims of unspeakable cruelty, which poignantly reminds us how vulnerable we are to the mind of a madman, vile and determined enough. I believe that each family member who lost someone there found a very personal meaning in their loss, and I hope this helped in the task of dealing with what happened.\r\n\r\nDespite being very young, I liked the work developed by Thomas Horn. He did everything well, and he gives his character a naivety that is never childish or lacking in sense and intelligence, quite the opposite. Tom Hanks is, as is almost always the case, impeccable and gives the boy's father an aura of familiarity and sympathy of his own, which the actor knows how to use very well. Likewise, the charismatic and professional Sandra Bullock did a very interesting job in the role of the mother. Despite being nominated for an Oscar, I think Max Von Sydow has done much better and more complete work. Even so, I liked the way he was able to express himself and communicate without using a single word. Zoe Caldwell also did a good job, albeit in a much more restrained register than the others. On the other hand, I thought that John Goodman, Viola Davis and Jeffrey Wright are all very underused.\r\n\r\nThe film covers several places in New York, and it is not necessary to have visited the iconic city to recognize them very easily, and appreciate the friendly way in which the film takes advantage of them and gives them shine and beauty. The cinematography helped a lot at this point, with a very well worked light, color and brightness, and a good post-editing of the images.", "created_at": "2022-09-20T01:00:17.260Z"}]