[{"movie_id": 585083, "review_id": "61ec83c25f622b0069132c12", "rating": 3.0, "review_text": "_Hotel Transylvania: Transformania_ had a lot of obstacles relating to its release and after viewing the film you can understand why. It’s a lukewarm sendoff that mostly feels like a lethargic attempt to recapture its former glory. It’s built around an entertaining concept that it doesn’t fully capitalize on. It ultimately obliterates character traits for trite gags and cliché punch lines.\r\n\r\n**Full review:** https://hubpages.com/entertainment/Hotel-Transylvania-Transformania-2022-Review-A-Monstrous-Monstrosity", "created_at": "2022-01-22T22:22:58.480Z"}, {"movie_id": 585083, "review_id": "659dfd241d356300eee94587", "rating": 6.0, "review_text": "I've been expecting a drop-off from this series and it has finally come. Admittedly, it still isn't all that bad.\r\n\r\n<em>'Hotel Transylvania: Transformania'</em> is basically what I expected its past entries to be like, at least the most recent two. I mentioned in my <em>'<a href=\"https://letterboxd.com/film/hotel-transylvania-3-summer-vacation/\" rel=\"nofollow\">Hotel Transylvania 3: Summer Vacation</a>'</em> review that the watchable plots were the only thing I was enjoying about these flicks (cast/characters being extremely meh, same again here) so one was bound to slip up eventually.\r\n\r\nThis one I found to be quite boring, if not terrible. Focusing heavily on just Dracula and Johnny was a bad call, especially given Adam Sandler's absence as the former. I actually wouldn't have predicted that the film would've missed Sandler (given my aforementioned thoughts), but it's a case of you don't know what you've got until you lose it because Brian Hull is a lame replacement; nothing against him personally, of course!\r\n\r\nThe setting of South America just takes out any <em>'Hotel Transylvania'</em>-y vibes too, so another wrong decision in my opinion. Here, the story isn't interesting enough to, like across 1 to 3, cover for the gaps in location, cast, characters etc. - at least in my eyes.\r\n\r\nStill harmless and all that, just lacking oomph.", "created_at": "2024-01-10T02:12:52.527Z"}]