[{"movie_id": 335977, "review_id": "6473a7fba894d600fc552cec", "rating": 4.0, "review_text": "EXT. INDIANA JONES AND THE TEMPLE OF THE LOST DIALS SKULL – DAY\r\n\r\nIndiana Jones and the Dial of Destiny is more closely related to its recent sequel than its distant cousins of the original trilogy. It attempts to take the franchise's formula and shake it up; it throws in cameos, call-backs and references but suffers the same issue every recent Lucasfilm movie has. \r\n\r\nIt's another modern Disney reboot sequel with legacy characters left in the dirt, and a 'quirky & quippy' new character is presented to us. You know this character type when in the face of fear, they will make fun of the villain's Lactose Intolerance or something random because this character is flawlessly confident. They are knowledgeable on every subject relevant to the plot, smartasses because they are always correct, sassy when held hostage and always have an escape plan. This is Helena (Phoebe Waller-Bridges), and she might be the only consistent character in the film. For the rest of the ensemble, Boyd Holbrooks Klaber speaks once in the movie and then chases after Jones in each scene; Mads Mikkelsens Jürgen Voller is the most forgettable antagonist of the franchise, Antonio Banderas is out of the film faster than he's in it and finally, Harrison Ford as Dr Jones is unfortunately back for what seems like a pretty good paycheck.\r\n\r\nI have nothing against the performances themselves. The cast is incredibly talented, but this skilled team cannot hide the terrible dialogue reinforcing the rather forgettable story. Ultimately, Indiana Jones has one of the greatest trilogies of films with a distance spin-off universe of sequels. Lucasfilm, post-2008, has not been your era.\r\n\r\nFADE OUT.", "created_at": "2023-05-28T19:14:03.595Z"}, {"movie_id": 335977, "review_id": "648c7537263462014e570f72", "rating": null, "review_text": "Legendary archaeologist Indiana Jones (Harrison Ford), has returned to what is the film as his final outing in \"Indiana Jones and the Dial of Destiny\". The film is the first in the series since Disney acquired Lucasfilm and the first not to benefit from involvement by Gorge Lucas or the direction of Steven Spielberg. James Mangold has taken on directing duties and faces the challenge of delivering a satisfying solution to the series and one that atones for the disappointing \"Indiana Jones and the Kingdom of the Crystal Skull\".\r\nThe film opens in the waning days of World War II when the imminent defeat of the Nazis has caused a mass exodus of their plundered archaeological treasures which draws Jones into the mix.\r\n\r\nThe digital de-aging technology is impressive as we get an extended sequence of the younger Jones and his colleague Basil Shaw (Toby Jones), in a frantic and at times humorous segment that evokes memories of some of the finer moments from the series.\r\nFlash forward to 1969 as the world prepares to celebrate the return of the lunar astronauts, Jones is dealing with the pending retirement from teaching as well as issues in his personal life.\r\nWhen a figure from his past named Helena (Phoene Waller-Bridge) who happens to be his Goddaughter evokes memories of a disagreement with her father several years earlier over the fabled Dial of Destiny which Indiana and her father were able to retrieve half of earlier in the film.\r\n\r\nAt the same time former Nazi scientists Jurgen Voller (Mads Mikkelsen), who is receiving his kudos as a key part of sending men to the moon and back, plots to obtain both parts of the Dial and with his legion of deadly assassins in tow, sets his sights on Jones and Shaw.\r\n\r\nThings become even more complicated when Jones is framed for murder and forced to flee in pursuit of Shaw sees archaeological discoveries as nothing more than a financial gain versus their historical significance.\r\nFrom New York to Tangiers, Greece, and other locales, Jones, Shaw, and her sidekick Teddy (Ethan Isidore), this battle against each other as well as the menace that constant Voller presents as they attempt to decipher the clues to combine the Dial and keep it from those who use it evil.\r\n\r\nThe film takes its time getting to the action as it is interspersed throughout the film and while not the FX-laden visual abundance that modern audiences have come to expect, they are generally satisfying and factor in that the title character is a senior citizen pushing 80 and as such does some remarkably impressive action when called upon even though he does in one scene to lying about his various injuries and trials that he has faced over the years and the toll they take it upon his body.\r\n\r\nSome fans may say there was not enough action for the hook was not as compelling as in previous adventures. While this is certainly a valid thought process the film should delight true fans of the series as it is an appropriate look at the aging adventurer as he is pulled back into the field once again.  There is also the matter of the new music from John Williams which sets the tone for the film well.\r\n\r\nFord and Waller-Bridge work well with one another and there are some surprise guests that appear along the way one should delight fans. I found the movie to be more satisfying than the last two films in that the focus was on the character and themes of life, loss, aging, and doing what was right versus an abundance of action around a treasure hunt.\r\n\r\nIt will be different things to different people but for me, \"Indiana Jones and the Dial of Destiny\" is a loving send-off to the beloved character and one that cements the iconic Jones as a true cinematic classic.\r\n\r\n4 stars out of 5", "created_at": "2023-06-16T14:44:07.897Z"}, {"movie_id": 335977, "review_id": "64a22416c390c500aeb1be5b", "rating": 7.0, "review_text": "It seems these days that it’s become all too easy to blast popular, commercial fare simply because it is popular, commercial fare. Granted, some offerings of this type genuinely deserve whatever grief they get, but others, such as the latest installment in this long-running franchise, don’t merit unfair potshots fired at them just for innately being mainstream offerings. In many ways, this is very much cut from the same cloth as its action adventure predecessors, but there are enough distinctions, new developments and lesser-known elements to keep it fresh and interesting throughout. Now, this is not to suggest that this final entry in this action adventure series is without its faults – it’s overlong, some of its action sequences could have been easily pared back (despite generally being as good as they are) and the storyline tends to sag somewhat in the middle. However, Indiana Jones has once again given us a rollicking good time with a captivating narrative, an intriguing assortment of twists and turns, and an array of colorful characters all vying for their piece of the pie (if not the entire pie itself). The film also provides fans of the franchise with deftly handled touches at achieving closure for the series, without dangling obvious or ambiguous carrots of there being more to come or any kind of impending reboot. Director James Mangold successfully puts the series to bed and tucks it in nicely while rounding off any remaining edges, something that it and its fans deserve. So, to all those cynics out there who are shamelessly bashing this release to be fashionable or hip, all I can say is “pipe down and lose the attitude already.”", "created_at": "2023-07-03T01:27:50.251Z"}, {"movie_id": 335977, "review_id": "64a901869c97bd01390bee6a", "rating": 2.0, "review_text": "\r\nI really like the Indie series, so I take no pleasure in saying, I found this unwatchable. \r\n\r\nReally US entertainment industry, when are you going to get the message that a lot of us aren't interested in \"the message\".\r\n\r\nIn summary, great cast, great sets, horrible script, full of the usual lecturing no one asked for. ", "created_at": "2023-07-08T06:26:14.438Z"}, {"movie_id": 335977, "review_id": "64adabd48a0e9b011d8cf79a", "rating": 7.0, "review_text": "When the title card for the latest Indiana Jones movie came on the big screen I was excited to hear the famous score, see Harrison Ford don his famous fedora and intrigued to see how they would handle Indy’s age in this 40-year-old franchise.\r\n\r\nThe opening encounter was very familiar, with Indy fighting Nazis during World War 2. We are introduced to the antiquity and lore that is the basis for this adventure. This start was a little jarring at first, but I was soon enthralled by the action and comedy.\r\n\r\nI enjoyed Toby Jones' brief appearance at the beginning, but the villain played by Mads Mikkelsen was severely underutilised. The runtime was a little long, with the middle feeling rather lethargic. I would have preferred a little more low-key adventuring, similar to the exploration of Archimedes's tomb, than the bigger action sequences.\r\n\r\nThere was a definite nostalgia kick to the entire movie. There was a new young sidekick and old familiar faces. There was the trademark adventure, creepy crawlies and historical riddles. There were Nazis, car chases and fight scenes. There was some fun deadpan comedy. The iconic travel map made an appearance – with a couple in front pointing at the screen in excitement when it appeared. But it was hearing the score throughout that was the biggest endorphin kick. It was definitely an Indiana Jones movie.\r\n\r\nFifteen years after the disappointing Kingdom of the Crystal Skull, this is a satisfying movie that I enjoyed. In the end, it concludes Indy’s story, while potentially passing the adventuring on to another generation.", "created_at": "2023-07-11T19:21:56.704Z"}, {"movie_id": 335977, "review_id": "64b08fc09672ed00c6c902f8", "rating": 1.0, "review_text": "_Indiana Jones and the Dial of Destiny_ feels like the type of sequel that aimed to capture the magic of its predecessors, had worthwhile intentions, and a talented cast, but it just never properly materialized. The film seems to teeter on the sheer annoyance of a main character grappling with the fact that he’s now a crotchety and wrinkly senior citizen and not the young, grizzled, adventurer he used to be.\r\n\r\nWith an ending that leaves the Indiana Jones character in a satisfying bookend for the franchise, hopefully _The Dial of Destiny_ is the final Indy film. Like Roger Murtaugh in _Lethal Weapon_, Harrison Ford is literally too old for this sh*t.\r\n\r\n**Full review:** https://bit.ly/destinysdial", "created_at": "2023-07-13T23:58:56.457Z"}, {"movie_id": 335977, "review_id": "64b163d12cde98012ead2380", "rating": null, "review_text": "I love this movie, it's the best after the first Indy in the franchise. The CGI effects are amazing, the Story is conclusive, and Action and Humor are great. Just ignore those people who post bad comments as they never liked the Series in the first place.", "created_at": "2023-07-14T15:03:45.749Z"}, {"movie_id": 335977, "review_id": "64b71422f6fd1800af5cacbc", "rating": 1.0, "review_text": "It took me a while to work up the courage to see this.  I mean, Indiana Jones was my hero as a child.  When I was sick I used to watch Raiders over and over again and that was a tradition I kept up through high school.\r\n\r\nAnd now... Thank you Doomcock, without your intervention this movie would have been even worse.  It shows, the plot is messy, the re-shoots are a little obvious story-wise as Disney did their best to attempt to avoid the fan backlash promised for when their plans were to kill Indy off and have Phoebe replace him....\r\n\r\n... and then when when they re-shoot it again because the fans didn't want to see Indiana Jones be ridiculed constantly by his female replacement in an effort to make the KK stand-in come across as better in every way... and a lot of that is still there in the final product.\r\n\r\nLike Star Wars did to Skywalker, Indiana Jones is constantly shamed by the younger more diverse version... who can't seem to decide what character she wants to be.  Rogue?  Scholar?  Conman? Her personality changes as the script dictates, but Indiana remains pathetic... so that Strong Female Lead can look better.\r\n\r\nIn the end it's a mess, and the result is that Disney killed another fan favorite Franchise.  Star Wars, Willow, and now Indy.  They paid out the nose for all of them and then made them worthless.\r\n\r\nThere are a lot of conspiracies floating around about it, but it don't attribute to malice what can be explained by stupidity.", "created_at": "2023-07-18T22:37:22.235Z"}, {"movie_id": 335977, "review_id": "64ba57c54d23dd010696e83c", "rating": 6.0, "review_text": "A Nazi colonel is moving some looted artworks towards the end of WWII - amongst which is the legendary lance that supposedly pierced the body of Christ. Luckily - for the colonel, that is - renowned archeologist \"Voller\" (Mads Mikkelsen) is on hand to advise that it's a fake - but by way of compensation, he informs the man that there is a far greater artefact on board their train. The \"Dial of Destiny\" - designed of old by Archimedes and reputed to have the ability to facilitate time travel. Our eponymous and intrepid adventurer is also on the train, with his scholarly pal \"Basil\" (Toby Jones) and together they manage to secure this gadget and flee - only to find that it is but half of the device. Years go by and \"Indy\" (Harrison Ford) is now a soon-to-be divorced, retiring, professor who encounters the daughter of his late friend - \"Helena/Wombat\" (Phoebe Waller-Bridge) and soon the two are engaged as a slightly untrustworthy pairing seeking to retrieve the other half of this dial before the newly empowered \"Voller\" manages to manipulate the CIA into helping him to obtain it and rewrite history. Aside from the fact that the star is still very much a star, and his charisma does lots to keep this going; the film is itself a really rather unremarkable, procedural, adventure story that includes all the staple ingredients of the first three films but without the depth of the supporting characters. Mikkelsen doesn't really cut it as a baddie any more and Waller-Bridge is largely out of her depth and relies rather heavily on her teenage sidekick \"Teddy\" (Ethann Isidore) to be the foil for her rather obvious witticisms and slightly unscrupulous behaviour. It doesn't hang about and the visual effects are pretty standard but the writing is really quite pedestrian and the ending seemed borne more of a need to finish the film rather than complete the really pretty thin story that really does tee up a sequel! It's perfectly watchable, but is a distant cousin of the earlier iterations for this character and is also perfectly forgettable too.", "created_at": "2023-07-21T10:02:45.444Z"}, {"movie_id": 335977, "review_id": "64bd97aa58efd3013953f8ce", "rating": null, "review_text": "This Indiana Jones has a few gems (like Harrison Ford) but the script is a several rewrites away. The production values are top notch, but we never get swept up in the characters or the story. Save this one for a Sunday night rental. I give it a C.", "created_at": "2023-07-23T21:12:10.835Z"}, {"movie_id": 335977, "review_id": "64cca25d764b9900e3ba386c", "rating": 5.0, "review_text": "“Indiana Jones and the Dial of Destiny” is a stale, impotent summer blockbuster that marks another unimaginative entry in the popular adventure franchise. Excessively dull and far too long, director James Mangold‘s movie burns every last drop of goodwill that’s left in the tank. This fifth and final installment in the Indiana Jones saga is a pathetic sendoff to one of the most iconic big screen characters of all time.\r\n\r\nSet in 1969, Daredevil archaeologist Henry “Indiana” Jones (Harrison Ford) is still working as a professor, but today is his retirement day. In his final class, a young woman from his past turns up: his goddaughter Helena (Phoebe Waller-Bridge). She’s in search of a mystical device that her father Basil Shaw (Toby Jones) obsessed over until the day he died, and Indy knows its historical significance all too well. It’s been said that the Antikythera (the Greek name for the Dial of Destiny), can alter the course of history and time, and it would turn any person who held it into a god. Soon Indy and Helena find out that former Nazi and current NASA scientist Jürgen Voller (Mads Mikkelsen) also wants the device for himself so he can change the outcome of World War II, and it becomes a race against time (and a very dangerous enemy) if they want to save history as the world knows it.\r\n\r\nIt’s not a bad story overall, but it certainly is a mess of one. It’s extremely slow, and the most interesting parts happen in the film’s final 45 minutes. That means there’s an abundance of bland filler and tepid action chase scenes that fill screen time before all the good stuff happens. There’s a lot of déjà vu at play here, as Mangold tries to milk fond memories of the earlier (and best) “Raiders” films, and he’s not shy about masking his intentions. The film brings back classic characters like Marion (Karen Allen) and Sallah (John Rhys-Davies), who only briefly appear as a means of tugging on the heartstrings (and reminding audiences of far, far better movies).\r\n\r\nThere are so many missteps in this film that it becomes more of a bore than a fun means of escapism. The opening sequence is a little fun, but it’s too reminiscent of the circus train intro in “Last Crusade.” There’s another tuk tuk chase that’s eerily familiar to the mine cars in “Temple of Doom.” The script (which credits four writers) inserts plenty of winks and nudges as it references the most classic Indiana Jones films. While the crack of Indy’s whip and the moment he dons his famous brown fedora may get those feel-good endorphins flowing, it also makes in painfully clear that a movie can only coast so far on nostalgia.\r\n\r\nA large chunk of the problem is (surprisingly) with the character. An archaeologist outsmarting Nazi villains feels more dated in today’s society than it should, even though the film is set in the late ’60s. Indiana Jones will always be a classic of course, and the studio should be applauded for its decision not to recast Ford in what is in the top two of his most iconic roles. What’s cringey is the use of de-aging software for the scenes that take place in the past, which makes Ford look plastic, fake, and straight out of a Pixar movie. It doesn’t work, it’s distracting, and it arguably was unnecessary within the confines of the story the film is trying to tell.\r\n\r\nOne of the positives is that Ford is clearly still a movie star, and he holds the movie together with what appears to be minimal effort. Yes, it’s easy to tell when a stunt person is standing in and it’s obvious through some clever (and choppy) editing that Ford wasn’t personally able to perform all of the physicality the role demanded, but he still lives and breathes Indiana Jones, so much so that after a little bit of time, you don’t even see him as an old man. The addition of Waller-Bridge adds a refreshing spark to the film, and her character and performance are quite enjoyable.\r\n\r\nI don’t think “Indiana Jones and the Dial of Destiny” will perform well across generations, but Gen Xers and older audiences will be delighted to see one of their favorite characters back in his own action / adventure story. What a pity this is the best sendoff that could be mustered for Indy after all this time.", "created_at": "2023-08-04T07:01:49.582Z"}, {"movie_id": 335977, "review_id": "64f236cf9408ec0100bc548b", "rating": 8.0, "review_text": "\"Indiana Jones and the Dial of Destiny\" delivers exactly what fans of the iconic adventurer have been yearning for—a thrilling, action-packed adventure that pays homage to the franchise's rich history while introducing new and captivating elements.\r\n\r\nHarrison Ford reprises his role as Indiana Jones with the same charm and charisma that has made him a beloved cinematic icon for decades. Ford effortlessly slips back into the fedora and whip, proving that age has only added depth to the character. His portrayal is a masterclass in blending wit, humor, and vulnerability, reminding us why Indiana Jones is an enduring hero.\r\n\r\nThe supporting cast shines as well, with standout performances from newcomers and familiar faces alike. The chemistry between Ford and his co-stars is palpable, adding depth to the relationships at the core of the film. Phoebe Waller-Bridge's character, in particular, brings a refreshing and feisty dynamic to the story.\r\n\r\nThe film's plot is a rollercoaster ride of suspense and intrigue. From the moment the adventure begins, it never lets up, taking us on a globe-trotting quest filled with ancient mysteries, treacherous traps, and high-stakes encounters. \"Indiana Jones and the Dial of Destiny\" skillfully weaves historical and mythological elements into the narrative, providing a satisfying blend of history and fantasy.\r\n\r\nThe action sequences are nothing short of spectacular. The film's use of practical effects and practical stunts harks back to the franchise's roots and sets it apart from modern CGI-laden blockbusters. Each action set piece is meticulously choreographed and filled with heart-pounding moments that will leave you on the edge of your seat.\r\n\r\nJohn Williams' iconic score is the icing on the cake, evoking a sense of nostalgia while adding new layers to the film's atmosphere. The music enhances every scene, amplifying the emotional resonance of key moments.\r\n\r\n\"Indiana Jones and the Dial of Destiny\" also succeeds in exploring the character's personal journey and growth. It delves into Indy's motivations, regrets, and his enduring quest for knowledge and adventure, giving the character a deeper and more relatable dimension.\r\n\r\nIn conclusion, \"Indiana Jones and the Dial of Destiny\" is a triumphant return to the beloved franchise. It manages to capture the essence of what makes Indiana Jones an enduring hero while introducing fresh elements to keep the series exciting and relevant. It's a must-see for fans and a thrilling adventure for newcomers, proving that the magic of Indiana Jones is as strong as ever.", "created_at": "2023-09-01T19:09:03.261Z"}, {"movie_id": 335977, "review_id": "6537bfe494631800e382ce9c", "rating": 7.0, "review_text": "Feels needless, but <em>'Indiana Jones and the Dial of Destiny'</em> still gave me suitable entertainment.\r\n\r\nI'd personally rank it higher than <em>'<a href=\"https://letterboxd.com/film/indiana-jones-and-the-kingdom-of-the-crystal-skull/\" rel=\"nofollow\">Indiana Jones and the Kingdom of the Crystal Skull</a>'</em>, though to be honest I feel similarly about all five films from this franchise - evidently, given I've rated them all 7/10. I wasn't someone who grew up with this series and when I finally did watch it well over three years ago I didn't connect to them massively, so this fifth installment isn't too far adrift from the original trilogy. If this was much shorter, I may have even liked this more if I'm to be truthful.\r\n\r\nSo yeah, I found the run time to be excessive. It's actually paced relatively well, I'm just not convinced the story itself needed to be told over almost two and a half hours. There is good action adventure in this and the music is done nicely, that theme even gives me goosebumps despite my lack of strong affection for the films.\r\n\r\nCast-wise, it's positive. I'm not that much of a fan of Harrison Ford if I'm honest, don't get me wrong I have literally zero against the guy either but from this franchise and that certain other space franchise (I forget the name...) he has never stood out to me strangely. In these and those, I prefer others. Admittedly, I wanna check out his other work away from these sorta flicks. Phoebe Waller-Bridge is very good, as is Mads Mikkelsen. Ethann Isidore and Boyd Holbrook play their parts too.\r\n\r\nOverall, it's worth watching. The opening and closing sequences are my favourite bits.", "created_at": "2023-10-24T13:00:20.582Z"}]