[{"movie_id": 976573, "review_id": "64836616bf31f2505880d52a", "rating": null, "review_text": "Finding your way in the world can be very difficult and even more so when you are a fire element with an explosive temper. In the new Pixar film \"Elemental\" audiences are introduced to Ember (Leah Lewis), a young flame being who lives with her mother and father in their combination home and business that caters to other fire beings. In a city where the various elements live and work can have its challenges, especially to the destructive nature of fire which causes some prejudice against them as well as their natural distrust of water.\r\n\r\nEmber is preparing for the day that she will take over the family business however her inability to deal with customers leads to combustible outrage which in turn results in a flooding incident at their business. Further compounding matters is the fact that a city inspector named Wade (Mamoudou Athie), who is a water element has been sucked into the basement and promptly documents multiple violations that shut down the business.\r\n\r\nDesperate to undo the damage, Ember strikes a deal that she will work with Wade to locate and fix the source of the leak in a few days time which will result in the removal of the infractions against the family home and business.\r\n\r\nAlong the Way, Wade and Ember start to grow close however the incompatibility of their two elements presents an obstacle as does the various elements of their respective societies.\r\n\r\nWhat follows is a charming and visually appealing adventure that tugs at the heartstrings the way that the best Pixar films can.\r\n\r\nThere are multiple thematic elements at play and they're presented in a very matter-of-fact way that doesn't become overly preachy and can appeal to viewers of all age levels. Aside from the obstacles facing a mixed relationship, there are elements of finding your way in the world while trying to appease your parents, dealing with those who place limitations upon you, and finding your voice.\r\n\r\nThe characters are charming and engaging on the visuals of the world comprised of elements is often quite charming and clever. It will be very interesting to see what the future holds for the characters as there are certainly opportunities to revisit them in the future which would be very welcome as \"Elemental\" is a very charming and engaging return to form for Pixar and the perfect summer film for the entire family.", "created_at": "2023-06-09T17:49:10.193Z"}, {"movie_id": 976573, "review_id": "649c4a91c3926601440e2716", "rating": null, "review_text": "This movie it is not intended for kids, it is a nice love story, kind of Romeo and Juliet style, with nice moments, it reminds me of Inside, but without the part that makes it for kids. It is deep, and shows from time to time, inside adult jokes that will need explaining to kids. So I recommend that if kids watch it, **which is ok, nothing weird, it is safe for kids**, an adult will be present to answer questions and explain these jokes.", "created_at": "2023-06-28T14:58:25.947Z"}, {"movie_id": 976573, "review_id": "64b8fbdb3009aa013967a867", "rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.firstshowing.net/2023/review-elemental-is-a-thematically-rich-inter-element-love-story/\r\n\r\n\"Pixar's Elemental may be straightforward and predictable, but it's so thematically rich and features such emotionally relatable characters that, by the end, I found myself fighting back tears. It features a visually stunning inter-element love story mixed with a beautiful journey of self-discovery. The outstanding world-building is once again a highlight, as are the numerous exceptionally enlightening visual details about the interaction between the different elements. Emigration, discrimination, and family ideals are some of the many essential topics addressed.\r\n\r\nI don't understand the criticism surrounding the alleged \"fall of Pixar\" and this latest movie. I will continue to enjoy these stories, and I highly recommend that viewers try to do the same, without worrying about incessantly comparing to what came before.\"\r\n\r\nRating: A-", "created_at": "2023-07-20T09:18:19.199Z"}, {"movie_id": 976573, "review_id": "64ba50614d23dd00ad0da4a7", "rating": 6.0, "review_text": "\"Ember\" and her ailing grandfather arrive in the big city where everyone is personified as one of the four natural elements. Needless to say, fire is not the most popular but they resolve to open their shop selling all things smoked, toasted, burnt, and red hot! It's an old building, though, and when one day the pipes give birth to the local, watery, buildings inspector \"Wade\" she discovers that they have no planning permission for their business and that he is going to have to report them. What now ensues is, sadly, a rather unimaginative series of escapades as she must track him down and stop him - and the authorities - from closing down the family's flaming enterprise. The animation is characterful and top notch - and the story certainly had potential, but somehow the thing just becomes a bit of a cheesy romance all too quickly. A lot more fun could have been had demonstrating just how incompatible the four - air, earth, water and fire - can be when mixed together; or - indeed - how symbiotic they can be, but the emphasis and the dialogue focusses just a bit too much on \"Ember\" and \"Wade\" and I am afraid that I rather lost interest. It's colourful and vibrant, there is some entertaining action with plenty of pyrotechnics and is worth a watch, but it will look just as good on the television and doesn't live up to the hype, sorry", "created_at": "2023-07-21T09:31:13.997Z"}, {"movie_id": 976573, "review_id": "650e10ca26dac100eb190b1e", "rating": 9.0, "review_text": "\"Elemental\" is an outstanding Pixar movie that utilizes the medium of animation to tell a compelling story. It goes beyond being just a rom-com and instead offers a powerful narrative about people, even though the characters represent elements. Pixar effectively uses various elements to convey a captivating human story that resonates with viewers. The film highlights the idea that despite our differences, we can coexist in a society that often tries to separate us. \"Elemental\" stands out as one of the most visually colourful movies with excellent music, including a memorable end credits song. While children may not fully grasp the film's deep concepts, it leaves a lasting impact on their lives, and when they revisit it as adults, they will come to understand its profound message.", "created_at": "2023-09-22T22:10:18.831Z"}]