[{"movie_id": 249070, "review_id": "56619b2d9251417904007212", "rating": 6.0, "review_text": "> A complete action pack, with not so popular actors.\r\n\r\nThis is the second version, or we could say the reboot after the 2007 film did not receive well. This should have been a franchisee with at least 3-4 films by now. It's very clear that something is not working out for it. As for this film, there are several issues. But fairly did at the box office, which is poor for an action film like this. From the director who had never worked on any project before and the writers with good experiences.\r\n\r\nThe money was well spent, the production quality was so good, then what is the trouble? Well, my first point out is the casting. Preferably someone top star who can pull the crowd into the cinema halls. Perhaps Jason Statham would have been a better choice, after Paul Walter's death who was suppose to play the lead. I'm not denying, but Rupert Friend was very good in the replace. But my point is there's no star value in this project, especially for the foreign markets, these lead stars are the strangers.\r\n\r\nThe other drawbacks are, this film rated R, which is utterly pointless. Because there are no kisses, no sexy outfits, or drugs consumption, but only violence and gore which are mostly CGI works. Could you believe what the films are turned out to be nowadays. LOL. Though, I enjoyed the action sequences, so I can't thumb down and it does not enough to me to thumb up as well. Decent story with a speedy narration. Definitely an average film. Never seen Singapore better than in this film before. You could watch it for the time-pass and for the stunts, or in a situation when there are no other options available.\r\n\r\n6/10", "created_at": "2015-12-04T13:54:53.454Z"}, {"movie_id": 249070, "review_id": "592852c89251413b4a03bdd9", "rating": 8.0, "review_text": "I know, I know, this movie is rather superficial and simple. More effort has been spent on cool action than on depth of the story. Well, you know what? I do not care! I quite liked this movie. Agent 47 is cool and kicks ass. The bad guys gets plenty of ass whooping. The action is good. There is quite a lot of high tech and gadgets. What is there not to like?\r\n\r\nThe movie starts of with a quite cool sequence introducing Agent 47. I have to say that I got into quite a bit of “wow” mode right a way there. The movie continues with plenty of action sequences with just a wee bit of slowdown in between. Actually the first-half, at least, of the movie is pretty much one long chase.\r\n\r\nPerhaps I should point out that I have not played Hitman and do not really know what the original story is about. From a lot of the comments I have read it appears That this might be to my advantage when it comes to enjoying the movie.\r\n\r\nSome people are probably complaining about bad acting since Agent 47 do not really show much in terms of facial expressions or emotions. Well, news for you, he is not supposed to! He is supposed to be a cold emotionless killing machine so stop whining. Personally I found Agent 47 to be an excellent character. the re is on scene in particular that I liked where Agent 47 intentionally allows himself to be caught in a embassy. Once inside he, to no one in the audience surprise starts to tear the place apart. You have to see it to know what I mean.\r\n\r\nThe second part, or perhaps just the last third, of the movie turns into more of a search and destroy for Agent 47 and his new “partner”. this part is of course as action filled as the first part of the movie. Naturally it all leads to a big show down between the Agent 47 & Co. The end itself did not really deliver any surprises but was satisfying.\r\n\r\nThe one thing in the movie that annoyed me was this subdermal armor stuff. The idea was not a too bad one but they really overplayed it. Come on! Just shoot him in the head or an eye or some other “sensitive” part for Christ sake. Bulletproof my arse!\r\n\r\nI honestly do not understand the low rating this movie has received. 5.7 at IMDb is really a bit harsh. Rotten Tomatoes rating is, not very surprisingly, abysmal. Rotten Tomatoes and their “critics” ratings must be the worst of any ratings site. When these dickwads rate down a movie, that’s when I start to get interested. First step is to drill down into the real audience ratings which more often that not gives a different picture.\r\n\r\nAny way I digress. Bottom line is that, for me, this is a simple, straightforward, high octane action movie and I quite enjoyed it.", "created_at": "2017-05-26T16:07:36.673Z"}, {"movie_id": 249070, "review_id": "605fc8cbeb14fa0069aa9f49", "rating": 2.0, "review_text": "**This movie makes the 2007 Hitman movie look like a freaking masterpiece**. The source material is thrown completely out of the window. The story is now about super-powered Terminator-like assassins and some woman trying to find her father. The methodical stealth game is turned into a brainless action movie with no originality or stakes. Fans of action movies are going to fall asleep. Fans of the game are going to hate it. **Just watch the 2007 Hitman**. It is a bit more respectful of the source material, it's more fun and it's even somewhat smart in places.", "created_at": "2021-03-28T00:07:39.878Z"}]