[{"movie_id": 262500, "review_id": "55e003efc3a36826a40016c9", "rating": null, "review_text": "As I did in my review of the first instalment, in this movie series I should probably point out that I have not read the books. Some people claim that this movie do not follow the books but, obviously, I cannot comment on that. So my review is based on the movie and the movie alone. I have to confess that I mostly watched this movie because I did watch the first instalment and felt obliged to see where the story went.\r\n\r\nThis movie have quite a few fairly cool special effects, especially the ones when Tris is in the virtual reality world trying to open the cube with the message to the inhabitants in the closed up city. Unfortunately this pretty much sums up the good parts of the movie.\r\n\r\nAs with Divergent I found this movie to be fairly mediocre. One reviewer said that this was a movie dumbed down for the teenage audience. Unfortunately I feel that he was right. Also unfortunately I think many teenagers are a lot smarter than Hollywood believe they are.\r\n\r\nThe plot is, well, mediocre. The acting is fairly meh. The main character, Tris, really lacks any form of charisma and spends most of the movie going around in some state of melancholy feeling sorry for herself and everything that happens around her. Apart from Four most of the people were behaving immaturely, cluelessly, froze up or panicked whenever something nasty happened and switched allegiances back and forth like you changed shirts.\r\n\r\nWhen Tris finally opened the cube I was expecting something cool and unexpected. What we got was a rather dull message about the city and its “purpose”. I complained in my review of divergent that we got absolutely no background information as to how the people had ended up in this ridiculous situation with a closed city and these factions that I still do not understand what they were supposed to solve. The message was supposed to explain this but it explained absolutely nothing except that the divergents were some kind of purpose or solution.\r\n\r\nThe ending? Well again this is a book series so it is not surprising that it ends in somewhat of a cliffhanger but it was really a cheap ending, one that you would expect from a TV series episode.\r\n\r\nSo I cannot say that I liked the movie very much. The virtual reality special effects scenes were fairly cool but that was about it.", "created_at": "2015-08-28T06:47:11.631Z"}, {"movie_id": 262500, "review_id": "5709098b92514147fc000dca", "rating": 4.0, "review_text": "Briefing; this movie is just bad.\r\n\r\nThe first was not good either but this one continues the path open by the first. The special effects are quite noticeably rendered by computers and the actors are uncharismatic, other than that, the plot is just bad.\r\n\r\nAnother movie with quasi-teenager lead roles in a dystopic future in which stupidity is spread all along man-kind.\r\n\r\nWe just witness the struggle of our heroine with her self-imposed guilt with stupid enemies that let her survive at every moment so she can become the messiah she is meant to be.\r\n\r\nI think the only positive part I can get from this movie is the preeminence of strong and important female characters. Other than that, just skip it.", "created_at": "2016-04-09T13:54:19.574Z"}, {"movie_id": 262500, "review_id": "5787bc1792514131c0000c5a", "rating": 6.0, "review_text": "> The mystery box and the power hungry leaders!\r\n\r\nThis is not a bad sequel, I quite enjoyed it, but I think I liked 'Divergent' better. The story continued a very short after where it ended in the first. In this part, it was all about power hungry where many try to get that top post. On the other side, there will be an attempt to open a mystery box that found which might reveal some important detail about them.\r\n\r\nLooked like a very good storyline, unpredictable stuffs, but not utilised to its full potential. Though the actors were good, especially Shailene was sexy in her short hairs. I think she came straight out of 'The Fault in Our Stars' to take up this role where her brother in this film was a boyfriend in that.\r\n\r\nVisually as well very captivating with those great graphics and it is first digital 3D film in the series. It has numerous small twists, especially during decrypting the mystery box. So I felt the middle parts were the best part of the film.\r\n\r\nI thought this film would take place outside the wall, but a new story was developed and still kept the mystery about the rest of the world. I don't know the book, but that's my disappointment. I hope the next film in the series would go beyond the wall and explore some new things. So I'm looking forward for the 'Allegiant'.\r\n\r\n6/10", "created_at": "2016-07-14T16:21:43.695Z"}, {"movie_id": 262500, "review_id": "6499d16cbbd0b000c8a4198d", "rating": 6.0, "review_text": "Fugitives on the run now with really no factions in place any more. The movie was kind of boring but had a decent ending.", "created_at": "2023-06-26T17:57:00.457Z"}]