[{"movie_id": 260513, "review_id": "5f28265bdbbb420034e60f39", "rating": 7.0, "review_text": "A good sequel.\r\n\r\n<em>'Incredibles 2'</em> isn't too far away from the preceding film, which is always a big plus for a follow-up. This one is definitely the more funnier of the two, there are some very amusing moments; especially with Jack-Jack (Eli Fucile/Nick Bird).\r\n\r\nFrom a plot point of view, the antagonists are better though unfortunately they do go down the obvious direction with them. I felt a few pacing issues too, it's a slow burner. The animation is very solid, as are the voice cast.\r\n\r\nSpeaking of the cast, all of the main lot return with the exception of  Spencer Fox (Dash) - whose absence I didn't really notice in truth. Everyone's as good as they are in the original, while the additions of Winston (Bob Odenkirk) and Evelyn (Catherine Keener) are welcomed. There's also a small yet nice role for Odenkirk's <em>'Better Call Saul'</em> co-star Jonathan Banks (Dicker).\r\n\r\nThis does some things greater than <em>'The Incredibles'</em>, but other things less so. Nevertheless, it's a very respectable Disney sequel.", "created_at": "2020-08-03T14:59:39.652Z"}, {"movie_id": 260513, "review_id": "5f338a56ef8b3200371408df", "rating": 6.0, "review_text": "Doesn't hold a candle to the original _Incredibles_, and it's like... **really** on the nose, but _Incredibles 2_ is still a good time. \r\n\r\nFinal rating:★★★ - I liked it. Would personally recommend you give it a go.", "created_at": "2020-08-12T06:21:10.363Z"}, {"movie_id": 260513, "review_id": "63c1f4da17b5ef00820b47ac", "rating": 10.0, "review_text": "Ok, I didn't actually see or even really hear about the first one, and this is despite Sam Jackson's involvement. And I will sit through some horrible movies because he was in them.\r\n\r\nSo there were a few moments where I was a little lost, particularly at the start. Still they were few and far between enough where, like me, you can walk in fresh and it's not really a concern.\r\n\r\nThere is a LOT that is praise worthy here, but what wowed me the most was how well a cartoon movie could be a period piece of pop art.\r\n\r\nIt really fit the era right down to the faces and hair, not to mention all the other tiny little details.\r\n\r\nYeah, yeah, yeah, there was a lot more to it, but in my eyes the era stood out the most and in a pop art way. It made it fun for an old historian like me.\r\n\r\nAnd for the MCU fans....This is what Captain America Civil War should have been about, and likely was until the plot got twisted", "created_at": "2023-01-14T00:18:34.565Z"}, {"movie_id": 260513, "review_id": "6484207ec9dbf9013a06693d", "rating": 6.0, "review_text": "Walt Disney always said he wanted to release his films every seven years, I think, so each time there was a new audience to appreciate them. This one has waited twice that time for a sequel that is perfectly watchable, but boy is it wordy! Dad \"Bob\" swaps roles with wife \"Helen\" (aka \"Elastigirl\") only to find that it's she who falls foul of the latest government anti-superhero regulations. Fortunately, the wealthy \"Deavor\" brother and sister act have a cunning plan to reverse these publicity disasters and restore the public confidence in our lycra-clad citizens. The remainder of this film follows rather procedural lines. Dad has fun managing the increasingly active \"Jack-Jack\" (and his entertaining new powers) whilst mum has to combat the new enemy \"Screenslaver\" who has some fairly formidable mind-control skills which he intends to use for, of course, world domination. As a role reversal comedy, the dad definitely gets the better, and funnier, end of the stick. As an adventure film, though, it's all just a bit 'been there got the T-shirt' and there is nowhere near enough action to sustain the almost two hours of screen time. The animation and score work well, though, and even if it's not really a patch on the first one, it's still an easy watch.", "created_at": "2023-06-10T07:04:30.675Z"}]