[{"movie_id": 76285, "review_id": "5f0b161055bc350035252cd9", "rating": 6.0, "review_text": "Good watch, might watch again, but can't recommend unless you're just a Percy Jackson fan.\r\n\r\nThis movie definitely had a good budget: production quality is high, enough recognizable side characters that clearly have hefty paychecks (well, heftier than the kids),  so much quality cg work that was either unnecessary because it was pointless or overly complicated.\r\n\r\nI understand that this is from a series of books, but it really felt like they lean really heavy on the idea that Percy Jackson was a \"one quest wonder\" to the point where it feels like we're watching a b plot with Jackson and Clarisse is the actual a plot.  Even the end of the movie contributes to the concept.\r\n\r\nBringing Leven Rambin (Sarah Connor Chronicles) on as Clarisse is a refreshing way to breathe life into the sequel, but she's not in the focus of the movie.  Bringing Alexandra Daddario back was a good choice, but she seemed incredibly under utilized, like a worse version of Ron Weasley, just a body there, but maybe they'll kiss.  Brandon T. Jackson is in and out of the movie focus, so he's only able to do so much to help the movie.  Jake Abel (Hunger Games) is back, but as a villain, so while he does a decent job, it's limited.\r\n\r\nI think after the first movie, they impressed upon Logan Lerman to carry more of the weight of the movie, and let him share the load with Douglas Smith, but while they complimented each other, it's bland complimenting bland.  And it's not they the did a bad job, they just didn't do the great job needed for this movie to really stand out.\r\n\r\nWhile I think there is an enjoyable movie here, you're not missing anything by skipping it, or re-watching the original.", "created_at": "2020-07-12T13:54:24.432Z"}, {"movie_id": 76285, "review_id": "60f1f3cc9c97bd002f5de476", "rating": 5.0, "review_text": "Well where to start....\r\nIt is a nice movie for an evening. Nothing special but ok. I saw the first movie a few years ago an really liked it. I know the classical I have read the books and they are much better is not something anyone wants to hear. In my case it was a mistake and it ruined somehow my experience. But let's start from the beginning.\r\nThe movie is proceeding quickly without many parts where you grab your smartphone to do something. But sometimes things happen to fast so they are more on the 'I don't believe that.' side of to quick. \r\nThe effects are ok but not overwhelming. With a good character design and suitable costumes. The music was also supporting the movie. In my case the German synchronisation was also all right. \r\nTo sum up it is a nice film to watch once but I wouldn't pay extra for that movie.", "created_at": "2021-07-16T21:02:04.098Z"}]