[{"movie_id": 629017, "review_id": "600528347d5db5003ed22bc0", "rating": null, "review_text": "There's something disturbingly simplistic about Run Hide Fight. It takes what is actually a complex problem, mired in issues of poverty, inequality, an institutionalised culture of violence and more and reduces it to a basic formula. \r\n\r\nHigh school shooters are presented as violent, immature, sometimes mentally ill, narcissists and little more. Certainly there may be elements of this, in these events but there's a lot more to than that. \r\n\r\nI felt the handling was uncomfortable and somewhat troubling, leaving a tale that not only failed to resonate but to me, felt a little exploitative.  \r\n\r\nActing wise, its on the money. This film is outside my demographic but I'm a big fan of Thomas Jane, so I took a look. Jane does not fail to impress but his is really a peripheral character. The main role falling to Isabel May. \r\n\r\nMay hands in a sardonic, fraught but ultimately hopeful performance as a Rambo/John McClane (Die Hard) style character. \r\n\r\nThe pacing works and there is plenty of action to keep things rolling along.\r\n\r\nThat said, for me this is a sombre subject, that I feel deserves the sort of mature treatment offered up by Michael Moore's insightful documentary, Bowling for Columbine (2002). \r\n\r\n6/10.", "created_at": "2021-01-18T06:18:28.937Z"}, {"movie_id": 629017, "review_id": "6229657b12c604001ce6b43f", "rating": 9.0, "review_text": "Run Hide Fight is a suspenseful thriller that examines the horror of school shootings, a very real problem in our society. The audience is left on the edge of their seat and entertained without being lectured by Hollywood, and American values such as self-reliance, tenacity and bravery are openly celebrated.", "created_at": "2022-03-10T02:42:03.896Z"}, {"movie_id": 629017, "review_id": "63bf571ce16e5a008ac70c95", "rating": 10.0, "review_text": "This is just an action movie.  Legit, the Daily Wire put it out so you aren't supposed to like it and politics and politics and cancel culture and censorship and... crap.\r\n\r\nBut the honest truth is that it is just an action movie.  It's low budget but done well.  It's suspenseful, it has character development, it has an actual story arc...\r\n\r\n... and it's NOT a political lecture, which makes it a cut above almost everything Hollywood is putting out.\r\n\r\nSo if you like politics free entertainment that is just an action movie you can enjoy, you will love this.\r\n\r\nIf you are a goose stepping book burner... you're not going to watch it but you will voice your opinion anyway.", "created_at": "2023-01-12T00:41:00.824Z"}]