[{"movie_id": 579047, "review_id": "616b8ba4158c850042d7f659", "rating": 8.0, "review_text": "An interesting combination of science fiction and film noir. \r\nNot a perfect film - it drags in spots - but it is enjoyable if you're a sci-fi or noir fan. \r\n\r\nThe performances were solid. Rebecca Ferguson pulls off a very good femme fatale but the whole cast deserves a slow clap. \r\n\r\nLisa Joy, director/writer, shows that she certainly has talent even though the movie is not a home run. Call it a solid double. She's definitely worth keeping an eye out for. Don't go in expecting a perfect movie and you will enjoy what it does have to offer as there are some very good scenes, some less so. Overall it's a 3.5 to 4.0 star effort depending on your taste.", "created_at": "2021-10-17T02:34:12.807Z"}, {"movie_id": 579047, "review_id": "61858671d388ae008a118844", "rating": 5.0, "review_text": "Kind of a hollow grounded sci-fi film noir mystery yarn that features decent performances from Hugh Jackman, Rebecca Ferguson and Thandiwe Newton but the story wasn't terribly compelling and never quite believed the relationship between Jackman and Ferguson. Kind of ran out of steam early on and spent the remainder of the time not exactly interested in the mystery elements. I don't know, wanted to like it but highly doubtful I'd ever want to revisit. **2.75/5**", "created_at": "2021-11-05T19:30:57.139Z"}, {"movie_id": 579047, "review_id": "6186bcbba313b8002a8d3c3b", "rating": 6.0, "review_text": "Less than I would have expected from the cast but I don't see it as a failure on their part. I guess I expected something more, although I am not sure what. This is slow entertainment with a few interesting segments but not enough to keep you awake if your only goal was to watch the movie. For me it was the story that failed because it was unbelievable, although I am sure there is an audience that would eat this up.⭐⭐⭐", "created_at": "2021-11-06T17:34:51.707Z"}, {"movie_id": 579047, "review_id": "63142f74d7cd06008b899b0a", "rating": 1.0, "review_text": "Reminiscence is a movie where people buy the cow even though the milk is free. In an indeterminate future where Miami has become a Venice of the New World, Nick Bannister (Hugh Jackman) runs a business that uses technology to access the memories of people who want to relive their past. \r\n\r\nThese people, mind you, do not suffer from amnesia; they're just too lazy and/or stupid to use their own brains — not even to remember something as pedestrian as playing with a dog (here’s an idea: buy another dog). \r\n\r\nWe see the memories of Nick's clients as if they were home movies, which is very convenient but makes zero sense, considering that people don't remember things from a third person perspective; for example, if I wanted to remember watching Reminiscence (fat chance), I wouldn't see myself watching the film. \r\n\r\nWriter/director Lisa Joy tries, and fails miserably, to explain why we don't see her characters' memories from their own point of view with a \"demonstration\" by Nick that proves absolutely nothing except that you can throw as much shit at the wall as you like, but that doesn’t mean it will stick. \r\n\r\nThis is a less than auspicious debut for Joy, who settles for projecting the usual fixations of her husband and his brother, Jonathan and Christopher Nolan. \r\n\r\nAt least in Memento, as the name implies, the hero relied on reminders rather than memories per se, which are subjective and unreliable; in contrast, the memories in Reminiscence are as pristine as the dreams in Inception. Ever hear of photographic memory? This is more like photogenic memory.", "created_at": "2022-09-04T04:54:12.051Z"}]