[{"movie_id": 147441, "review_id": "551ecc229251411d8d00109c", "rating": 7.5, "review_text": "This is a well known story and I have also seen the '56 movie 'The Ten Commandments'. So in this film could not foresee the modification, but it did in a slight manner like the later 'Noah' movie. The best part was the visuals, the graphics were so good, hard to resist the pleasure if you are vfx geek like me. That's the reason I love modern movie, especially remake of a classic like 'King Kong'. The problem in this flick was lie in the story telling.\r\n\r\nAs we know, Ridley Scott is an excellent narrator, but this movie was too short even though it ran 150 minutes. I felt it was just a brief, I mean there were no details or depth in the important scenes. You will know what I'm saying if you had watched '56 movie I mentioned in a above paragraph. That's drawback for the first timers at a same time advantage for not to fall in boredom for those who have already seen other versions. Christian Bale, awesome; Joel Edgerton, good; Ben Kingsley, never required; Aaron Paul, totally waste.\r\n\r\nOverall, not cleverly stablised in the scenes that are very important, especially the final one about ten commandments should have been extended a little bit with a moral message. If it was a Peter Jackson movie, definitely it would have been a trilogy with an aggregated time of over 500 minutes. This movie was an entertainer like I enjoyed it than the message deliverer. Must be watched for the amusement and for the pleasure in updating technical aspect of the narration rather than inspiration.\r\n\r\n7.5/10", "created_at": "2015-04-03T17:21:38.688Z"}, {"movie_id": 147441, "review_id": "55b47321c3a368210a0060cb", "rating": null, "review_text": "This movie was rather disappointing as far as I am concerned. The original story has been rewritten rather drastically. This in itself do not bother me too much. I am not one of those fanatics that get a fart stuck the wrong way if someone messes with the holy bible. However, I really do not think this was a good rewrite. A lot of the magical moments had been removed and that took away a lot from the story.\r\n\r\nThe movie starts off good enough with some nice and fairly impressive battles. Then it slows down a lot and sometimes I got a “get on with it damn it” feeling. When we finally got around to the burning bush part I got rather underwhelmed. God as a vengeful kid? Come on!\r\n\r\nThe disasters and the special effects are not too shabby but the entire bit where Moses confronted Ramses and warned him about the disasters that where to befall Egypt are taken out. They where just thrown on Egypt one after another in ways that could be explained away as natural disasters. From one point of view I can understand the wish to do this but to me it took something away from the movie.\r\n\r\nLater when Ramses decides to go after the Hebrews it continues in the same way with Ridley Scott downplaying the magic in the story. There is no pillar of fire and Moses is not holding out his staff to split the see. The sea just decided to recede and Moses takes advantage of it. Sure the effects when the water returns where quite cool but again, the magic was gone.\r\n\r\nTechnically the movie is quite well done and the acting is quite okay but the biblical grandeur and mythical aspects are no longer there. This grand adventure story is simply reduced to an ordinary, fairly mediocre adventure movie with a high budget. I have to say that I enjoyed Cecil B. DeMille’s The Ten Commandments more even though the special effects in that one is hopelessly outdated and the acting is a bit awkward.", "created_at": "2015-07-26T05:41:53.402Z"}]