[{"movie_id": 594, "review_id": "5ed6226f0398ab0021cfcfb5", "rating": 6.0, "review_text": "Click here for a video version of this review: https://youtu.be/n9WhSQ8mYPI\r\n\r\nTom Hanks is a perennial favourite in our house, and his 2004 movie _The Terminal_ is one that somehow I missed along the way. I’ve now fixed that and it’s time to talk about it. Let’s start with the official description:\r\n\r\n_Victor Navorski is a man without a country; his plane took off just as a coup d’état exploded in his homeland, leaving it in a shambles, and now he’s stranded at Kennedy Airport, where he’s holding a passport that nobody recognises. While quarantined in the transit lounge until authorities can figure out what to do with him, Viktor simply goes on living - and courts romance with a beautiful flight attendant. _\r\n\r\nA man stuck in an airport for months on end, sounds a little far fetched? Not so much - this was actually inspired by the true story of a man named Merhan Nasseri who lived at Charles DeGaulle Airport in France from August 1988 to August 2006, yes, 18 years. He got stuck when his refugee certification documents were stolen from him in France, en route from Belgium to England. It’s an incredible story, and worth reading up on on Wikipedia.\r\n\r\nThe movie is pretty light and fluffy stuff, and Hanks is well cast as the curious and friendly Navorski. He makes the most of his situation and quickly adapts to his circumstances, and makes a number of friends with various airport staff. He also makes an enemy in the character played by Stanley Tucci, the Customs Director at the airport. \r\n\r\nWhile at times it felt a bit like _Product Placement: The Movie_, it’s a charming movie that despite a few unrealistic - things like his rapid progress in a English - takes you along for a good fun ride. Hanks is great, his friends are a suitably quirky bunch, and Tucci plays the bad guy really well too. Catherine Zeta-Jones is in this too, but seems a little shoehorned in. There’s enough to work with with the “stuck in the airport” situation and didn’t really need a romantic plot line, but I guess these are the things that get done to make it appeal to a wider audience. \r\n\r\nIt’s just been removed from the Netflix catalogue here in Australia - which was the reason I finally watched it - but if you happen to come across it, it’s a really nice film that will warm your heart for a couple of hours.", "created_at": "2020-06-02T09:57:03.031Z"}, {"movie_id": 594, "review_id": "60ce54c8a199a600584657d7", "rating": 9.0, "review_text": "Great watch, will likely watch again, and do recommend.\r\n\r\nI should be able to recommend this just based on \"Tom Hanks trapped in an airport\", especially given how popular \"Cast Away\" was.\r\n\r\nI really love what they did with him being foreign and trap in an American airport, but being hard-working and intelligent.  I'm sure there is a \"Larry the Cable Guy\" version of this movie when it's a useless American trapped in another country that would be much funnier, but clearly a worse movie.\r\n\r\nThe progression of Hanks' character is wonderful, and while there are definitely components of this being a romantic movie, it is refreshing to see a movie that can hold the character's romantic motivations in parallel to the story's motivations and allow them to both be and be separate.\r\n\r\nStanley Tucci also does a great job, though its as a very unnecessary villain.  Yes, it's a guy doing his job, but the character is oddly motivated for someone trying to score a promotion: something they specifically point out in the movie.\r\n\r\nMy point is that not only it is a well-made, well-performed movie, but it manages to be something larger and highlights problems with us a humans, society and bureaucracy.", "created_at": "2021-06-19T20:34:16.897Z"}, {"movie_id": 594, "review_id": "6110679315376c0049dfa84b", "rating": 6.0, "review_text": "I may have watched The Terminal a while after it first came out, but I remembered no details, so I took the opportunity o watch it on Netflix recently. Whether or not I watched it before, I may not remember the details very well now either. It is a quiet movie with a slow moving plot. It stands in direct counterpoint to Spielberg’s Schindler’s List, which was slow moving in a way, but it had as a backdrop the murder of millions of people and one man’s character growth towards a time when he would try to save some of those lives. It’s quiet tone is interrupted by spurts of emotional and physical violence. The Terminal does not offer such exclamation points to add to suspense and tension.\r\n\r\nThat is not to say The Terminal is boring, though some may find it so. It is a character study of a man in limbo, neither in the United States nor able to leave it. He has left his country to go to New York City, and there is a coup back home, and since the United States does not recognize the new government, he is stuck in a section of JFK airport. The story is very loosely based on the story of an Iranian man. He was apparently paid to use his story, but they ended up only using the concept behind it.  \r\n\r\nHis situation reminded me of the short story I had to read back in junior high, The Man without a Country, written by Edward Everett Hale. It told the story of a fictional soldier who was charged with treason along with Aaron Burr, and who cursed the United States saying she wished he would never have to hear about the U.S. again. He was sentenced to live out his life on board various ships with nobody ever mentioning his country in his hearing again.\r\n\r\nBut back to the movie. The story is full of small moments showing **** adjusting to his limited new environment: trying to feed himself, helping a few others whether they want help or not, finding ways of amusing himself or keeping busy and, inevitably, slowing becoming involved with a flight attendant he sees often.\r\n\r\nMost movies need a bad guy and, as if his situation wasn’t giving our hero enough headaches, the security head played by Stanley Tucci periodically plots to get our stranded traveler arrested so that huge will be relocated and therefore someone else’s problem. But I will let you discover all of the intricacies of the plot for yourself, as well as learn what is in the can of peanuts he carries around. In total The Terminal is a pleasant enough watch, but one perhaps you will want to watch while doing housework, or multitasking in some other way.", "created_at": "2021-08-08T23:24:03.338Z"}]