[{"movie_id": 487297, "review_id": "5d2ebf99caab6d5d9896b803", "rating": 3.0, "review_text": "I knew there was a What a Women Want reboot in the works, and my interest was **zero**.\r\n\r\nI heard they were flipping the script a la genders, and it was still zee - row.\r\n\r\nCast Taraji P. Henson in the lead and I was like: \"Fuck... I'm gonna have to watch this now aren't I?\"\r\n\r\nAnd so I did. But I probably shouldn't have.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2019-07-17T06:26:33.954Z"}, {"movie_id": 487297, "review_id": "6009f9670cd446003dda9c29", "rating": 6.0, "review_text": "Good watch, could watch again, and can recommend.\r\n\r\nWhile it's potentially problematic for many of the same reasons for the Mel Gibson \"What Women Want\", I think this is a much better version, and a good modernization.  It's also a good way to shift it to a \"black movie\".\r\n\r\nTaraji P. Henson does an excellent job carrying the movie and it is full of good humor, and exciting moments.\r\n\r\nThe movie does send a little bit of a mixed message as it seems to indicate that a woman needs to be a man in order to play in a man's world, but it feels more like its about it not being a man's world.\r\n\r\nThis is a good time, my only concern is that she's not a very likable character at the start of the movie.", "created_at": "2021-01-21T22:00:07.034Z"}, {"movie_id": 487297, "review_id": "63bf8f8905a5330085a43369", "rating": 1.0, "review_text": "Well, it has less that 5 Stars and I think that is a very good thing. Less than a year ago giving a movie like \"What Men Want\" anything less than a perfect score would have created a Ghostbusters style backlash to anyone that even remotely suggested it might not be better than The Godfather.\r\n\r\nAnd then Oceans 8 flopped...and got mainly positive reviews based principally out of fear...and had a cast that mostly seemed disinterested in attacking absolutely everyone that didn't buy a ticket.\r\n\r\nNow it seems that that critics are OK with giving it a low rating, so long as they still only praise it in the prose review...just in case.\r\n\r\nSo, think of it like the Gibson version of \"What Women Want\" and then make it raunchy and vulgar to the point of repulsion with views of the opposite sex that would get a lot of men arrested.\r\n\r\nAnd then think if it as slightly androphobic...and slightly as in the androphobia is racially based which makes it clear that the message of this film is to virtue signal how woke the they are by making it clear that a certain skin color and gender are evil.\r\n\r\nIn other-words, it's kind of like the original \"Birth of a Nation\" with it's propagandist depiction of race...meets a romantic Comedy written and directed by Andrew Dice Clay.", "created_at": "2023-01-12T04:41:45.749Z"}]