[{"movie_id": 276907, "review_id": "58c17107c3a368265b00abda", "rating": 6.0, "review_text": "'Legend' was not a very good film. It was poorly acted and written on the most part. It was predictable and just seemed like a forgettable straight-to-video gangster film. However, the only saving grace (and a really good one) was Tom Hardy.\r\n\r\nHardy was brilliant in the main roles (playing both of the Kray twins). He made the film funny and really tense when it tried to be. The soundtrack was also really good.\r\n\r\n★★★", "created_at": "2017-03-09T15:13:11.651Z"}, {"movie_id": 276907, "review_id": "63aad1dc09dda400ad9d8141", "rating": 6.0, "review_text": "Tom Hardy is quite accomplished here as he portrays both of the legendary London gangster Kray twins. The pair managed to stay one step ahead of the pursuing constabulary (led here by Christopher Ecclestone's ocassional appearances as \"Nipper of there Yard\") for many a year living the life of Riley whilst killing, extorting and running a network of protection rackets in the East of the city through their infamous \"Firm\" gang of henchmen. His persona of Reggie presents us with the more calculating, business-like approach whilst his portrayal of the sometimes gay Ronnie delivers a loose-cannon, violent character - but to be clear, it's pretty safe to say that neither are to be messed with, even by those closest to them. Much of the narrative dwells rather disappointingly on the relationship between Reggie and his first wife Frances (Emily Browning) and actually the rest of this is all rather weak and shallow. Aside from a few flirtations in a seamy gay brothel, the seedier side of Ronnie's life is barely touched upon and the story seems intent more on bringing us the bullet points of their lives rather than trying to develop anything like an insight into their respective (and frequently quite unstable) personalities. It's produced to a very high standard with much attention to the detail of 1960s London, but somehow the whole thing is just a bit too empty. The shell of a story that tries to cram too much into too little screen time. It's watchable, and is certainly better than the 1990 attempt at telling us the story of these brothers - but this is probably a story that can only be told comprehensively in a mini-series that allows the nature of their brutal yet sometimes quite sophisticated personalities to emerge more fully.", "created_at": "2022-12-27T11:07:08.051Z"}]