[{"movie_id": 285, "review_id": "64c136a3ede1b000af4c455e", "rating": 8.0, "review_text": "Part 3 Jack is stuck in Davy Jones locker. While he is stuck, the biggest war is being set to happen. Jack and the others try to free him from Davy Jones locker before the war comes. Very good movie as well. Kind of boring at times though.", "created_at": "2023-07-26T15:07:15.953Z"}, {"movie_id": 285, "review_id": "64f375f15f2b8d00e12ba435", "rating": 6.0, "review_text": "Now this is just far, far too long. At ten minutes shy of three hours the story just isn't substantial enough to sustain it and I must confess to finding my attention dwindling a bit at various stages of the proceedings. Thankfully, Geoffrey Rush has rejoined the cast as the whole ensemble must now risk life and limb - and sail to the very edge of the world - to save \"Jack\" (Johnny Depp) from oblivion and thwart the seemingly unstoppable \"Lord Beckett\" (Tom Hollander). How to do this? Well they must galvanise the entire global pirate community and that means the dreaded \"Sao Feng\" (Chow Yun-Fat), \"Capt. Teague\" (the one and only Keith Richards) and a consortium of the most corrupt, venal and treacherous folks ever put on Earth. This time, though, it is \"Elizabeth\" (Keira Knightley) who steps up to the plate and demonstrates that she has come a long way since she was kidnapped from her father's home just a few short years ago to become a true kick-ass captain in her own right. This has much less of a story than the first two films; it sort of rehashes the tail end of the story from \"Dead Man's Chest\" (2006) just a bit too much and although the visual effects are superb, as usual, the whole thing just looked more like a victory for the marketing executives than the creative ones at Disney. The last half hour is all good fun, though, with a denouement that we could have had half an hour earlier and that would have served as a fitting conclusion to the adventures of this disparate band of pirates, lovers and scaly monsters. It's still watchable, but I fear this is all a bit tired and Verbinski et al are really struggling for that innovation that we have seen before.", "created_at": "2023-09-02T17:50:41.034Z"}]