[{"movie_id": 820446, "review_id": "626fc3196f53e11b4d192ea0", "rating": 7.0, "review_text": "This latest offering from Julian Fellowes presents two stories centred around the landed \"Grantham\" family. The first sees the dashing \"Barker\" (Hugh Dancy) come to Downton to make a film - that will pay for a much needed new roof - and soon makes friends with the absentee-husbanded \"Lady Mary\" (Michelle Dockery). Sadly, though, he soon discovers that silent movies are rapidly losing their charm - and the stars, especially an entertaining \"Myrna\" (Laura Haddock) are facing a challenge that ended the careers of many a silent movie star - a voice that could strip paint. Meantime the grown ups head to the south of France to investigate a beautiful villa that has been bequeathed to the elderly Dowager Countess, and where they must tread a fine line between a generous welcome and open hostility from the erstwhile owners of this lavish property. We flit between the two threads effortlessly, with plenty of grand cinematography at both Highclere Castle and on the Côte D'Azur. The script is frequently quite amusing - with most of the best lines from those \"downstairs\"; there is a soupçon of romance, the odd bit of melodrama and loads for fans of these characters to enjoy. I found the Deborah Mitford-esque ending quite poignant too, with the Dames Maggie Smith and Penelope Wilton alongside a film-stealing scene from the underused Kevin Doyle (\"Moseley\") adding weight and pith to the story. I still struggle with Elizabeth McGovern, Hugh Bonneville is most certainly not at his best here, and the French story seems contrived at times, but essentially this is just another stylish template for some well established acting talent to deliver well established roles in a characterful and engaging fashion. Looks good and is, but I have to say - I do hope it really is the end of an era...", "created_at": "2022-05-02T11:40:09.208Z"}, {"movie_id": 820446, "review_id": "62b0c8a85a5ed00091b3f26f", "rating": 8.0, "review_text": "After all this time, I didn’t expect Julian Fellowes to mess with his formula and start having radical plot twists and unexpected tragedies and mayhem. It is a comfortable family viewing franchise. If anything, except for the same-sex relationship element, it is less adventurous than it used to be. But that is all fine with me. It is like the new All Creatures Great and Small series: I know what to expect, but with an ensemble characters I know and like I don’t care.\r\n\r\nThere were a few incidents that weren’t quite believable, such as a novice writer suddenly becoming a successful playwright, but it suited the plot and helped fill out the feel-good developments for nearly all the characters.\r\n\r\nThere were no thrills chills or spills, but enough gentle humor and plot development to keep me engaged and watching with interest to the end.", "created_at": "2022-06-20T19:21:12.079Z"}, {"movie_id": 820446, "review_id": "6589299fb7b69d09626d8a89", "rating": 10.0, "review_text": "The elegant, grand cinematography seduces your soul and attention throughout the film. The august natural environs and splendid humin environs complement one another. The modest yet haute fashion is desirable. The sailing, soothing, splaying theme song --- which announces, \"Quelque choses de magnifique arrive\" --- returns to us and I am pleased.\r\n\r\nWhat a splendid cinematic jaunt to the British aristocracy of the early 19th century! The soundtrack is an accurate reflection of the uplifting and joyful tone of this film. Love has been gained; births and growths have occurred; understanding has been reached; and those who have sought to settle, have. Now, enters the hectic and intriguing world of early 19th century film. Now, enters a Crawley secret of the past. Now, enters a never anticipated good-bye yet surprise for the future.\r\n\r\nWonderfully acted, the direction could have been better; it was too choppy. I would have hired the team of Merchant Ivory, known to deliver smooth, quietly uplifting, and nostalgic film direction. Also, I would have allowed the film to be two hours, instead one-hour and a half. I would have created a more femel-inclusive film with a femel director (or, at least, a femel director for the film within in the femel); femel composers; and an all-femel big band. But, few have the moxie to go all the way with the nice stuff in Life, like Count Viktoria!", "created_at": "2023-12-25T07:05:03.730Z"}]