[{"movie_id": 1272, "review_id": "5cf0292c92514135b6b99439", "rating": 9.0, "review_text": "Are you an angel? Has the time come? I've been waiting so long.  \r\n\r\nWe are in the not too distant future and the Sun is fading out. After a first mission to reignite it with a nuclear bomb fails, with the ship apparently lost in space, a new team are sent to try again. But it really isn't as simple as that...\r\n\r\nDirector Danny Boyle and writer Alex Garland team up once again for this sci-fi adventure thriller. For as long as I can personally remember, outer space and the planets that dwell within it, have always served us well for cinematic treats. Fears of the unknown and worries over the destruction of Earth, by and large make for great premise's. Not all films realise this potential of course, but it always makes for a great starting point. For his first venture into this realm, Boyle has gone for the Sun as his point of reference, and it makes for a marvellously claustrophobic picture that poses as many questions as it does answers. And even tho ultimately the science fiction aspects of it do not naturally add up, it's dazzling in its visuals and thought provoking into the bargain.\r\n\r\nBoyle has never hid his influences and favourites from the public, and here he homages everything from Alien to Event Horizon, stopping for tea and crumpets at 2001s house along the way. But that is no bad thing, molding elements from great sci-fi past with his own intriguing story has given Sunshine a tremendous heart, to which Boyle then manages to cloak it with high quality drama. The crew are up there and we know that this is a genre piece and things invariably go wrong, this gives the discerning viewer an eager anticipation, a sense that one shouldn't go to the toilet for something will be missed. And Boyle lives up to the promise showed, such a pity then, that Boyle didn't let us get better acquainted with his characters at the start. Because then the impact would surely have doubled as each perilous and wrought scenario unfolded.\r\n\r\nHaving racked up the tension and intrigued us with the premise, expertly fusing CGI with his own craft work along the way, Boyle's Sunshine lives or dies by it's last quarter; depending on your proclivity of course. It has proved to be a most divisive point with critics and fans alike. To say it's a genre shift accompanied with implausibility is being a touch unkind I feel, this is after all a sci-fi picture about a ship going to reignite the Sun! Never the less it doesn't quite close the film triumphantly after the twists that preceded it, turns and explosions have lulled the viewers in, but personally it satisfies this entertained observer. Not in a big bang dynamic way, but in the way that asks me for a further thought process, and that may just be what Boyle and Garland envisaged when they sat down to make the film? Again, depending on your proclivity of course! 8.5/10", "created_at": "2019-05-30T19:04:12.686Z"}, {"movie_id": 1272, "review_id": "623f46a71cfe3a004768b58e", "rating": null, "review_text": "Danny Boyle has assembled a stellar (had to be said) cast for this rather far-fetched story. The crew of the \"Icarus II\" are charged with dragging a massive nuclear bomb towards the sun with a view to giving it a bit of a pick-me-up. It's dying, you see. Needless to say their journey is fraught with danger, made worse when they discover the wreckage of a previous ship sent on a similar mission many years earlier. When they board it, though, all is not as it seems and danger lurks! Alex Garland knows how to write a good story and Cillian Murphy, Rose Byrne and Chris Evans work quite well together as the extra-terrestrial adventure gathers pace. The dialogue is not the best and the score overwhelms at times, but Boyle still manages to create quite a decent degree of peril mixing well the high quality special effects, a bit of sabotage, sexual tension and a good old-fashioned baddie.", "created_at": "2022-03-26T17:00:23.143Z"}]