[{"movie_id": 268238, "review_id": "5ebc52eb4ca676001ed77acd", "rating": 9.0, "review_text": "Just like the first film, this one also takes you to a very special journey you can never forget. The honesty of the characters and how relatable they are is what made the first film so charming and unique applies to this film too.\r\n\r\nThese two films have a very special place in my heart.\r\n\r\nWould I watch it again? Absolutely! Would I make my friends watch it? Definitely.", "created_at": "2020-05-13T20:04:59.709Z"}, {"movie_id": 268238, "review_id": "64d781a1d100b600ada134b5", "rating": 6.0, "review_text": "Well hats off to John Madden for managing to reassemble the cast from the first film from four years earlier, and for securing the sparing services of Richard Gere but I'm afraid the rest of this is all a poor cousin. With the hotel now more successful, \"Sonny\" (Dev Patel) and \"Mrs. Donnelly\" (Dame Maggie Smith) are in the USA trying to seek funding for them to expand, and to buy the former women's palace for their next venture. Returning, and expecting an inspector to come and evaluate their business they greet the arrival of writer \"Chambers\" (Gere) and of new guest \"Lavinia\" (Tamsin Greig) in slightly different manners - and that's the first mistake for \"Sonny\"! The first film had a freshness to it, they (and we) were are all exploring a new life with new opportunities in a new bustling city: this is a much less joyful affair. Everyone appears to be looking towards the end; the characters are much flatter and slightly more depressed. The mischievous characterisations from Ronald Pickup and Celia Imrie have entered a rather uninteresting cul-de-sac. Familial discord between Sonny, his fiancée and his mother is all just a bit too convoluted and the story just, frankly, runs out of steam. Patel exudes charisma, he does way more to carry this than any of others and in the end comes up with quite a decent bit of dancing too. It's colourful and it's doesn't hang about, but Dame Maggie, in particular, has lost much of her curmudgeonly charm and Dame Judi really rather simpers through the film with little of the spark we saw before. To be honest, I'm not really sure the first film really merited a sequel at all. This one is really not very memorable and Richard Gere's character adds very little indeed.", "created_at": "2023-08-12T12:57:05.334Z"}]