[{"movie_id": 11023, "review_id": "5e5ccb0255c9260017530262", "rating": 9.0, "review_text": "This movie is special to me, and it probably always will be. It’s one of the first times I remember feeling “seen” in media as a young person that was starting to struggle with mental illness.\r\n\r\nIt’s not a perfect movie, and I think some of the scenes shouldn’t have really been graphically shown like they were bearing in mind that this is a movie directed at teenagers. However, that is a reality for some people, and I do understand the inclusion.\r\n\r\nOverall though, this movie does a great job at depicting what it’s like to develop a mental illness and troubled family dynamics and how a mental illness can develop in a situation like that. Evan Rachel Wood gives such a fantastic performance as Tracy at such a young age.\r\n\r\nI first saw this movie when I was about twelve or thirteen, and although it doesn’t hold quite the same amount of relatability for me that it did then, it still holds up for me close to ten years later. I’m glad it exists and depicts a painful reality, but being able to find something to relate to in that painful reality and that makes you feel “seen” can be something that’s helpful.", "created_at": "2020-03-02T08:59:46.215Z"}, {"movie_id": 11023, "review_id": "646808ea2bcf67015582574c", "rating": 9.0, "review_text": "Jeez! <em>'Thirteen'</em> gets deep!\r\n\r\nI picked this one out on a whim on Prime Video, having known absolutely zilch about it... even after I checked a few minor things about it (checking to see if it has a sequel or whatever, as I do for any film I watch) I was expecting a simple, cliché teen story. I did catch a glimpse of one of Prime's images for it and it looked dramatic, but I just imagined it was the character's overreaction to getting dumped or something silly like that. It wasn't!\r\n\r\nEven so, across the opening chunk of the movie I was still anticipating the aforementioned. Yet, from just prior to the midway point really, things get deeper by the minute - not long later, I was genuinely hooked. It's a great film. I guess that's why you don't judge a book by its cover and all that, and why I don't read about flicks before watching them - I love being surprised!\r\n\r\nThe performances are truly excellent, none more so than that of Evan Rachel Wood - superb! Nikki Reed (even though I kept seeing Charisma Carpenter...) gives a strong showing too, as does Holly Hunter (even though I kept hearing Mrs. Incredible...). Wood and Hunter particularly earn their stripes across the second half. Credit to the rest of them too, including Jeremy Sisto. Feature debutant Vanessa Hudgens is squeezed in there too.\r\n\r\nIf I hadn't had noticed in my checks beforehand that this shared the same director as <em>'Twilight'</em>, I'm pretty sure I would've known instantly with this - a clear style, notably at the beginning, if a tad questionable in minor moments. I'm clearly not the target of either film, yet enjoyed both - what can I say? Forza, Catherine Hardwicke!", "created_at": "2023-05-19T23:40:26.923Z"}]