[{"movie_id": 614917, "review_id": "619dd29a03bf840089a6e0c2", "rating": 9.0, "review_text": "As to the acting, it was great! The biopic was about the family and the inception of greatness. It took the word \"humble\" to a new level. As i see it, it is a exceptional\r\nperformance by all the actors.  Note: Very little of the film is about the mechanics\r\nof tennis but more about the struggle to envision a  dream and chase it down. \r\nWill Smith (King Ricard) is ready for a nomination.  Hats off to the girls (Singleton) \r\nand (Sidney) for strong performances. I hope the Real World Williams Family enjoyed \r\nthe film. Thanks for all the hard work in and off the courts. Inspired by all.", "created_at": "2021-11-24T05:50:18.098Z"}, {"movie_id": 614917, "review_id": "61cc5cf038520200a20102b4", "rating": 9.0, "review_text": "FULL SPOILERF-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/king-richard-spoiler-free-review\r\n\r\n\"King Richard is not only one of my favorite movies of the year, but it's also one of the best biopics I've ever witnessed.\r\n\r\nThe subject matter may speak more to me than to the average moviegoer due to my emotional connection to the sport, but it's the captivating story about a dedicated, loving father that ultimately grabs the viewers. Will Smith delivers one of the best performances of his career, as do Saniyya Sidney and Demi Singleton.\r\n\r\nThe sport is exceptionally explored, taking the audience through the immense sacrifice a player needs to go through to become one of the very best. Technically, all filmmaking elements work together perfectly to demonstrate the physical and mental effort that tennis requires, dedicating a surprising amount of screentime to practices and matches.\r\n\r\nNevertheless, the thematically rich screenplay surrounding family, self-belief, and parenthood takes the spotlight. I don't have a single bad comment to make about Reinaldo Marcus Green's film.\r\n\r\nDeserves all of the awards buzz it's inevitably going to receive. Don't you dare miss it!\"\r\n\r\nRating: A", "created_at": "2021-12-29T13:04:48.417Z"}, {"movie_id": 614917, "review_id": "61f07d73f794ad00e8c1c1a7", "rating": 6.0, "review_text": "King Richard feels a little too gentle with a favourable look at a key figure in the careers of two of the most significant tennis players the world has seen.\r\n\r\nThe script starts off intending this to be a feel good story though it’s not without some dark moments.\r\n\r\nIt’s immediately a folksy good hearted angle for Wiliams Snr. He’s determined yet kind hearted. It’s a favourable view, but calls critics of that can be told thatAfrican American people could be cut a little slack. There’s no doubting the spirit behind the film.\r\n\r\nSmith’s performance is as sincere as the character is. The rest of the cast as the family and coaching staff are just as good with their performances.\r\n\r\nIt’s a feel good film to be sure, but the thing about feel good films is that they make you feel good.", "created_at": "2022-01-25T22:45:07.631Z"}, {"movie_id": 614917, "review_id": "62195dc28d2f8d0042a40c27", "rating": 9.0, "review_text": "This is a top notch biopic. The acting and the pacing are first-class. Admittedly, being a Florida tennis player puts the film a little closer to my heart, but still, it's a touching look at how much a parent can give so his kids have a better life. Well worth the long running time.", "created_at": "2022-02-25T22:52:50.278Z"}, {"movie_id": 614917, "review_id": "62d6ab0cc92c5d004c2be35e", "rating": 9.0, "review_text": "_King Richard_ is a heartfelt biopic that shows the rise of the triumphant Williams sisters, and the film is triumphant on all fronts.\r\n\r\nI thought it did a great job showing the trials and tribulations of reaching the top of any sport, while also showing the side of a father wanting to protect his black children in a white man's world. It struck a really nice balance that felt genuine.\r\n\r\nWill Smith is excellent in this role, one of his best in years. I can see why he was slam dunk to earn best actor at the Golden Globes. The rest of the cast did excellent as well, I was really impressed with the two girls and Jon Bernthal. Bernthal has such a diverse range for acting, he severely underrated in Hollywood.\r\n\r\nThis film was a joy to watch, and I highly recommend.\r\n\r\n**Score:** _90%_\r\n**Verdict:** _Excellent_", "created_at": "2022-07-19T13:01:00.343Z"}, {"movie_id": 614917, "review_id": "633f8c031a32480090a29d10", "rating": 8.0, "review_text": "Super well-done, didn't realize that the father was *this* involved nor that their family placed such a focus on education. Shame that the film now has a huge asterisk next to it thanks to Will Smith's behavior.", "created_at": "2022-10-07T02:16:35.329Z"}]