[{"movie_id": 443791, "review_id": "5e23dbd91bf2660014f9f6a9", "rating": 6.0, "review_text": "Tense and fun, with cool creatures and jump scares that aren't too obnoxious, 'Underwater' is disposable in the long run. But it's also an entertaining and unpretentious true Hollywood B-movie that is worth a visit to the cinema.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-underwater-a-solid-subaquatic-monster-mash", "created_at": "2020-01-19T04:32:25.694Z"}, {"movie_id": 443791, "review_id": "5e51e118be7f3500117333b5", "rating": 7.0, "review_text": "**_A well-made creature-feature; it may not be original, but it is entertaining_**\r\n\r\n>_I cast indeed my net into their sea, and meant to catch good fish; but always did I draw up the head of some ancient God._\r\n\r\n- Friedrich Nietzsche; _Also sprach Zarathustra: Ein Buch für Alle und Keinen_ (1885)\r\n\r\n>_The most merciful thing in the world, I think, is the inability of the human mind to correlate all its contents. We live on a placid island of ignorance in the midst of black seas of infinity, and it was not meant that we should voyage far. The sciences, each straining in its own direction, hav__e hitherto harmed us little; but some day the piecing together of dissociated knowledge will open up such terrifying vistas of reality, and of our frightful position therein, that we shall either go mad from the revelation or flee from the deadly light into the peace and safety of a new dark age._\r\n\r\n- H.P. Lovecraft; _The Call of Cthulhu_ (1926)\r\n\r\nThe last film distributed by 20th Century Fox before they were rebranded as 20th Century Studios by Disney, _Underwater_ was shot in early 2017 for $50 million and then sat on a shelf for over two years. Now that it's finally seeing the light of day, there's a real sense of Disney just wanting to be rid of Fox's clutter, and they either didn't know how to promote it or didn't want to promote it, as the marketing campaign has been next to invisible (and the bland title certainly doesn't help), with the film grossing a paltry $7 million in its opening weekend. From Disney's perspective, of course, releasing it in the January release window makes sense, as it's a period traditionally dominated by duds and cast-offs – films the studios don't care about for one reason or another. A recent high-profile example is _Blackhat_, Michael Mann's underrated 2015 cyber-terrorism drama, which was released with little to no advertising, grossing only $20 million at the North American box office against a $70 million budget. However, much like _Blackhat_, _Underwater_ is considerably better than most January releases. Sure, it's clichéd and predictable, and it shamelessly borrows from a litany of superior genre films, but it's also a very entertaining and enjoyable aquatic creature-feature.\r\n\r\nAt an unspecified point in the future, Tian Industries, the largest drilling company in the world, are attempting to drill into the ocean floor at the bottom of the Mariana Trench, almost seven miles down, with atmospheric pressure over 1,000 times that at sea-level, strong enough to crush a human body so completely that there aren't even any remains. As the film begins, Kepler Station, the crew quarters of Tian's massive drilling rig, is hit by a series of unexplained vibrations, causing a cascading pressure breach. Norah Price (Kristen Stewart) and Rodrigo Nagenda (Mamoudou Athie) are the only ones to escape, sealing off the area so as to slow, but not prevent the inevitable implosion of the whole rig. Heading first to the escape pod dock, they find no pods left, and in the control base, they're unable to contact the surface. Meanwhile, they encounter some other survivors – Cpt. Lucian (Vincent Cassel), Paul Abel (T.J. Miller), Liam Smith (John Gallagher, Jr.), and Emily Havisham (Jessica Fenwick). With their situation grim, Lucien says the only hope they have is to use pressurised suits to walk the one-mile distance to the Roebuck Drilling Station and use the escape pods located there. And so they descend to the dark ocean floor. However, as if their task wasn't daunting enough, they soon discover that they aren't alone.\r\n\r\nWritten by Brian Duffield (_The Babysitter_; _Jane Got a Gun_) and Adam Cozad (_Jack Ryan: Shadow Recruit;_ _The Legend of Tarzan_), and directed by William Eubank (_Love_; _The Signal_), Underwater walks a very fine line between rip-off and homage. The most obvious touchstones, both narratively and aesthetically, are Ridley Scott's _Alien_ (1979) and James Cameron's _The Abyss_ (1989), but one can also see the influence of films such as George P. Cosmatos's _Leviathan_ (1989), Paul W.S. Anderson's _Event Horizon_ (1997), Barry Levinson's _Sphere_ (1998), and Danny Boyle's _Sunshine_ (2007). I even detected a slight nod to Neil Marshall's _The Descent_ (2005). In short, the set-up is your classic \"group of isolated people getting picked off one by one\". When someone as talented as Boyle turns his hand to this template, the result is a near-masterpiece. And although Eubank is most certainly no Boyle, Underwater is a lot better than its lack of advertising, clichéd premise, bland title, and generic trailer suggest.\r\n\r\nSure, it isn't really _about_ much of anything. There's a vague ecological theme that's brought up a couple of times, with Emily talking about how humans have drilled \"_too deep_\" and are now suffering the consequences, but really, it never amounts to anything even half-way substantial. In all fairness though, who would be expecting thematic complexity anyway? You know what you're getting with a film like this, and the best you can hope for is that it looks good and is entertaining. And _Underwater_ is both.\r\n\r\nKicking into high-gear immediately, the film wastes no time whatsoever in getting to the action. The opening scene is the Kepler implosion, and it's a good five minutes before things calm down. In _Alien_, Scott takes his time getting anywhere, introducing us to the aesthetic of the _Nostromo_, then the characters and their relationships and milieu before it all kicks off. In essence, _Underwater_ is the inverse of that, with all hell breaking loose before we know much of anything about anyone. Indeed, the only character we even see, let alone get to know, before the implosion is Norah. I certainly wouldn't want every film to open this way, but it has an undeniable kineticism and appealing volatility, which Eubank does a decent job of maintaining throughout the next 95 minutes.\r\n\r\nAesthetically, there's a lot to like here. Production design is absolutely paramount in films like this (think of how important design elements are in building tension and establishing tone in _Alien_ or _Event Horizon_), and designer Naaman Marshall (_The Visit_; _Don't Breath_; _Stuber_) does a fine job, with the world feeling lived-in and authentic. Making especially good use of tunnels and low ceilings, there's a real sense of claustrophobia, which only lets up, ironically enough, when the characters are outside the safety of the rig and exposed to multiple dangers. This claustrophobia is aided immensely by Dorotka Sapinska's costume design, with the bulky pressurised suits looking like astronaut rigs or something out of the _Gears of War_ video games. Also vitally important to the claustrophobic tone is the photography by the great Bojan Bazelli (_Mr. & Mrs. Smith_; _Pete's Dragon_; _A Cure for Wellness_). During scenes outside, Bazelli often shoots from within the characters' helmets, and even when the characters are inside, he often shoots in tight close-ups, simultaneously anchoring us to their perspectives and heightening the sense of enclosure and pressure (both literal and figurative). When outside, the film uses the limited visibility to its advantage in establishing a tone of ominous danger. Some will probably find these scenes too dark, but I'd argue that that is precisely the point; the characters can't see much of anything, and neither can we.\r\n\r\nElsewhere, obviously inspired by H.P. Lovecraft, particularly Cthulhu, the creature design by Abner Marín (_The Dark Tower_; _The Predator_) is suitably creepy and grotesque. Even the props are impressive, especially when the crew are forced to arm themselves, à la the Dead Space video games, with non-combat industrial tools such as saws and bolt guns. The aesthetic element that really stood out for me, however, was the sound design by Wayne Lemmer (_Kick Ass 2_; _Deadpool_; _Logan_). The implosion scenes are accompanied with some bone-rattling LFE, whilst the ominous ambient sounds of the Kepler are a constant reminder that the station is on its last legs. The scenes outside are equally as impressive, with some excellent use of directional sound as the action shifts location on screen - it's a film that I would imagine will sound incredible on a 7.1.2 Atmos system, particularly at the crossover frequencies.\r\n\r\nIn terms of problems, there's a rather unjustified use of voiceover to bookend things, explaining the moral of the story; it's wholly unnecessary and has the effect of making the film feel like an episode of _The Outer Limits_. There's also next to no characterisation. We learn bits and pieces about Norah and Lucien's backstories, whilst Emily and Liam are dating, but apart from that, the film is peopled by perfunctory cardboard cut-outs with no sense of interiority. Eubank also seems somewhat confused as to whether he's making a disaster movie or a monster movie, with certain scenes and elements suggesting one or the other. However, he never really finds a middle-ground, giving the film a slightly schizophrenic tone.\r\n\r\nAlthough _Underwater_ never manages to rise anywhere near the heights of films such as _Alien_ and _Sunshine_, it deserved better treatment than it received from Fox and Disney. Given the January release, the clichéd setup, the two-year limbo, and the bland title, I wasn't expecting much from this, but I was pleasantly surprised. It won't change your life, but it's an entertaining and well-made creature-feature.", "created_at": "2020-02-23T02:19:04.667Z"}, {"movie_id": 443791, "review_id": "5e80f12d498ef90017c91433", "rating": 1.0, "review_text": "What a terrible movie, I just gave up halfway through. It might have been OK with a decent script, a competent director, and not having a plank of wood in the lead role, but as that's something very different to what we actually got, we'll never know.", "created_at": "2020-03-29T19:04:13.725Z"}, {"movie_id": 443791, "review_id": "5e972d7530f79c0014d8b68d", "rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nI was surprisingly interested in and even optimistic about this movie. Why \"surprisingly\"? Well, first of all, the cast doesn't really have a big name attached to it even though I actually enjoy some of Kristen Stewart's performances (who, like Robert Pattinson, has a few blind haters that haven't seen anything else other than Twilight), as well as a few other actors (Jessica Henwick, particularly). Then, no director or screenwriter caught my attention. William Eubank hasn't done anything exceptional yet. Brian Duffield co-wrote Insurgent (awful) but delivered a surprisingly fun horror screenplay with The Babysitter. Finally, Adam Cozad helped to create some underwhelming narratives (The Legend of Tarzan, Jack Ryan: Shadow Recruit).\r\n\r\nIn addition to this, I'm not in favor of films written by more than two people since these usually disappoint, and... it's a January movie. So, why was I slightly excited to watch Underwater? For the same reason a lot of people probably avoided it: its formulaic horror-thriller story deep at the bottom of the ocean. If a sci-fi film has a premise based on a team that works on a claustrophobic location and some sort of entity \"disrupts\" their job, I'm instantly drawn into these movies. There's something about them that makes me enjoy them more than most people. Usually, this type of film has a low-budget and really requires a talented director who's able to generate genuine tension and suspense.\r\n\r\nUnderwater is 2020's big surprise. January movies are known to be Hollywood's trash bin, so I'm honestly dumbfounded that this film is far from being bad. It's very, very good! The set and production design are impressive, and they help create that isolated, suspenseful atmosphere. The first few minutes are nail-biting. The next twenty minutes are fantastic. The following twenty minutes continue to be a blast of entertainment. I felt continuously surprised by how good the movie actually is. I still can't believe what I just witnessed!\r\n\r\nDon't twist my words, it's not a masterpiece or even a \"great\" film. It still follows a plot-driven narrative that countless other movies did better. It borrows inspiration from Alien, Cloverfield, 20000 Leagues Under the Sea, and every other film involving an alien-like form threatening a crew. Plus, it lacks characterization of pretty much every character. There's no real attempt at deeply developing a single character to make the audience care about it, but this doesn't mean the movie can't succeed. Like I wrote above, there's a whole lot of plot-driven films that went on to be phenomenal.\r\n\r\nThe difference between those and Underwater is that the latter doesn't truly bring anything new to the genre. It just uses the known cliches and executes them really well, which is itself a massive surprise. I can't deny that I had a lot of fun watching this thriller. I expected messy action with way too dark lighting making it impossible to see anything. I received surprisingly visible, well-filmed sequences, packed with tension, tons of panic, and a palpable sense of urgency. There aren't that many moments to breathe and relax.\r\n\r\nThe VFX team and Bojan Bazelli (cinematographer) deserve a lot of credit because the \"aliens\" not only are visually captivating, but they are shown just in the right spots for the exact right amount of time. Underwater doesn't possess a huge budget, so the creatures need to be shown \"in the shadows\" to make them look and feel \"realistic\". It might seem like an obvious technical decision to be made, but its execution it's far from being an easy task, so kudos to everyone that participated in making the monsters a genuinely menacing threat.\r\n\r\nThe cast is excellent. Kristen Stewart continues to break out of the Twilight shell, proving again and again that she's a wonderful actress. Jessica Henwick is pretty great, as well as Vincent Cassel. Everyone delivers fairly decent performances, even T.J. Miller, who portrays the always divisive comic-relief character that will surely be extremely annoying to some, and quite funny to others (I stand in the middle, I think his character is fine).\r\n\r\nIt's definitely a good sci-fi horror-thriller, way better than most January flicks (Underwater is one of the last 20th Century Fox's movies, which probably means that Disney had no clue what to do with it, hence dumping it in the worst month of the year). I just added William Eubank to my list of directors to follow. His commitment to actually make a good film is demonstrated on screen, so I really hope that his movie gains some sort of following when it reaches people's homes.\r\n\r\nUnderwater is 2020's (first) massively positive surprise. A January film far better than most of the month's competition. William Eubank delivers a remarkably well-filmed sci-fi horror-thriller filled with great tension, surprisingly visible (!) action, fantastic production design, and some really captivating VFX work. It's by no means a brilliant movie! It takes inspiration from better films of the same genre, and it follows a straightforward, plot-driven narrative with close to zero character development. It simply uses the known cliches but executes them really well. An underrated cast led by Kristen Stewart offers some notable performances, but it's the claustrophobic atmosphere surrounded by incredibly well-generated suspense that turns this movie into a success. Technically, I still can't believe how surprised I am. I just wish that it had a little bit of more characterization, so I could recommend it even more. As it stands, do watch it at the highest quality when you get the chance.\r\n\r\nRating: B", "created_at": "2020-04-15T15:51:17.607Z"}, {"movie_id": 443791, "review_id": "5eeb60aeb046050034094a11", "rating": 6.0, "review_text": "Kristen Stewart actually kind of pulls off carrying this thing, which was a surprise to me. I know a lot of people have really enjoyed her post-_Twilight_ career, but I haven't really latched on to anything she's done. It feels pretty short, but not as short as it actually is at 95 minutes. The creatures were cool, I'm pretty sure. It was kind of hard to see. But for all its ups and downs I did basically enjoy _Underwater_, a solid mix of creepy monster, creepy environment, interspersed with tension-relieving dialogue. The only real problem is that it's **very** derivative. Not a massive issue in and of itself, the trouble is that it means every five minutes you think to yourself \"Oh! This is just like X Movie (usually _Alien_)... I kinda wish I was watching that instead\". \r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2020-06-18T12:40:14.673Z"}, {"movie_id": 443791, "review_id": "5f851e472d8ef30037b74ef4", "rating": 10.0, "review_text": "Very fun, tense thriller that doesn't waste any time. If you've seen Leviathan or Event Horizon or Pandorum, you know exactly what this movie is going to be. Appreciated the whole cast, and I wish more serious actors would pick up genre roles like this.", "created_at": "2020-10-13T03:25:59.131Z"}, {"movie_id": 443791, "review_id": "5fef3e96140bad003ca4f9e7", "rating": 8.0, "review_text": "Great watch, will watch again, and do recommend.\r\n\r\nTo be fair, I was sick when I saw this was available and couldn't resist watching it.\r\n\r\nI'm a fan of Kristen Stewart (most of the time), and sure, she runs around in her underwear for a lot of the movie, but that's not a reason to watch the movie, it's a horrible reason for a web search.\r\n\r\nA great reason to watch this is that it is a underwater survival story.  The isolation and technical strategy involved in dealing with this situation makes it gravely atmospheric, without the threat of \"monsters\".  Honestly, that version would have also made a great movie.\r\n\r\nThe movie clearly takes queues from several other great movies, and while it does it very well, the problem there is \"several\".  Had the movie mirrored only \"Alien\", it probably would had been a stronger story.  Clearly the writers wanted the threat to build, similar to video games, or possibly more similar to an alien invasion movie.\r\n\r\nThe cross between a survival / slasher movie and an invasion movie muddles the feel of the movie somewhat.  It downgrades the movie from truly excellent to great, and I don't feel that everyone is going to get the proper experience to recognize all of the great individual parts because the overall pie tastes a little funny.", "created_at": "2021-01-01T15:24:06.175Z"}, {"movie_id": 443791, "review_id": "630015263e6f2b007d2712f3", "rating": 8.0, "review_text": "**Overall : An exhilarating and tense high-stakes survival movie where the creatures are only one of the many horrors to be survived.**\r\n\r\nI can't lie - I LOVED THIS MOVIE! Underwater is the spiritual follow-up to the Alien franchise. The intensity of every claustrophobic second grips the audience as the characters fight to survive overwhelming obstacles to emerge from the ocean's depths alive. The dive suits, narrow corridors, limited visuals, and terrifying creatures add to the suspense throughout the film. The director displays his incredible skill at building tension and anxiety every moment. I don't know why this movie has such low reviews because I was captivated from start to finish.", "created_at": "2022-08-19T22:56:38.034Z"}, {"movie_id": 443791, "review_id": "6471b46ebe2d4900dcda62f5", "rating": 6.0, "review_text": "A somewhat mis-matched crew are working on a base deep underwater when things start to go wrong. An earthquake right at the bottom of the Marianas Trench - or was it? Kristen Stewart (\"Price\") and Vincent Cassel (\"Lucien\") lead a team who have to escape their collapsed facility and make it to a nearby abandoned mine where there might be a route topside. The film features the usual lines of jeopardy - will they drown, is there enough oxygen, etc - but somehow, even when we discover there is much more to the disaster, the menace just floats away. Stewart is really underwhelming, as are the rest of the cast and is the writing. The visual effects are adequate, but that is standard nowadays, it's the story and characterisations that are just flat. It is only 90 minutes long, but it seems longer and somehow the ending was just a bit, well, damp! Can't think this ever got a cinema release - that might have helped, big screen and all that - but otherwise, this is entirely forgettable fishy fayre.", "created_at": "2023-05-27T07:42:38.486Z"}]