[{"movie_id": 524434, "review_id": "6189484266a7c300436aea29", "rating": 7.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/eternals-spoiler-free-review\r\n\r\n\"Eternals boasts evident narrative issues that affect its overall structure and pacing, but Chloé Zhao still manages to deliver a solid MCU installment.\r\n\r\nPacked with outstanding performances from the stellar ensemble cast, Zhao still follows some of Marvel's success formulas, but her unique style brings new attributes to the cinematic universe, such as the distinctly gorgeous cinematography and the profound themes of faith and humanity.\r\n\r\nDespite the exposition-driven screenplay, the admittedly underdeveloped yet inclusive, diverse group of characters hold genuinely compelling relationships. For fans of the mandatory action, the extraordinary entertainment levels are still present, but it's definitely the furthest from the MCU a film has ever been.\r\n\r\nIt's meant to be divisive, but fortunately, I fall on the positive side.\"\r\n\r\nRating: B", "created_at": "2021-11-08T15:54:42.887Z"}, {"movie_id": 524434, "review_id": "61aa8f6ef03174008427f792", "rating": 9.0, "review_text": "**1ST TIME: \"Fun, Albeit A Bit TOO Revisionist.... { & _FANTASTICAL_ }\". 2ND VIEWING: I Was Utterly -{ \" D A Z Z L E D \" }- By Chloé Zhao's VISUAL \"MAGIC\" ....& Her { _ENTIRE_ } Cast & Crew 🌠**\r\n\r\nA **-{ _B I G_ }-** Screen Review ; Film Watched **TWICE** .\r\n\r\n______________________________________________________ \r\n\r\nDruig : \" I've watched humans destroy each other when I could stop it all in a heartbeat. Do you know what that does to someone after centuries...??? Could our mission have been a mistake..?! Are we really helping these people build a better world..?! We're just like the soldiers down there: pawns to their leaders... BLINDED BY LOYALTY!!! \". \r\n\r\n______________________________________________________ \r\n\r\n**A \" HIGH POINTS \" :** 1- Just to \"Keep Things Fresh\", I'm going to shake it up a bit, & start with the Musical side of things, this time around. Ergo : \" So -{ Completely }- Enchanting, Engrossing, & just downright 'On-Point  was the -entire- soundtrack for \"Eternals\" ; with its -Utterly- captivating blend of Soft Rock, Celestial Choirists, 'Heavenly-Ethereal', Soprano Soloists & even a plain good old-fashioned 'silky smooth guitar-synth-vocal ensemble' from Pink Floyd . . . . . that I simply couldn't help but have the -Nagging- feeling that this goliath movie's veteran Music Director, ( Ramin Djawadi ), took an 'Inspirational' page out of Tom Holkenborg's sheerly -Fantastic- 'Musical Playbook' for 'GVK' ( 2021 ), & just ran with it, in the 'best way possible' \". 2- Visually, the picture is nothing short of -{ MESMERIZING 🌌 }- , comfortably living up to the \"Super\"-high standards set by -{ ALL }- of the past 25 MCU ( Marvel Cinematic Universe ) Creations, starting with the \"Fabulous\" And Indeed, -Groundbreaking- 'Ironman', all those years ago in '08 ( with Ramin -Also- doing the whole score for -that- particular Marvel film, incidentally ! ). The Art Direction, Fight Choreography, Stuntwork, Post-Production Digital Effects -and- the Live 'On-Set' - Physical- Special Effects are -all- 'Par Excellence', & well and -{ Truly }- leave little to be desired.\r\n\r\n3- Eternals's cinematography, entirely -Unsurprisingly- , is for the most part 'Lavish, Pristine, & often just outright Gorgeous' ; as is only be -expected- , I suppose, of a movie shot by the likes of -Veteran- lensman Ben Davis . . . . who clearly worked 'Hand-In-Glove' with its \"Frightfully\" Talented Directress, the one & only Chloé Zhao 🔥. At a 'diminutive' 5 feet 4 inches, the ever 'decorous', some might even say 'demure' \"Miz\" Zhao is fast becoming a veritable 'come-from-behind' \" CINEMATIC POWDER KEG\", in the world of all things Hollywood. When Marvel undertook its -{ \"Massive }- gamble by hiring the -Relatively- unknown ( at -that- point ) filmmaker to direct Eternals in Sept.'18 . . . . little did they know that she would not only go on to direct what was to later become the \"Best Picture\" Oscar Winner 2021 ( \"Nomadland\" - 2020 - Indie ) ; but that she would -Also- take home \"Best Director\" ; with the picture having been nominated in -YET ANOTHER FOUR- categories ; and having gone on to -Win- one more Oscar Award -Still- 👏❗ So in a nutshell, if you saw Nomadland and thoroughly appreciated its wide, expansive, & breathtakingly lovely shots, then Eternals -Is- likely to be immensely gratifying to you in -that- respect, without a question . . . with the latter -Not Only- 'generously' providing many, many -{ S P R A W L I N G L Y }- Beautiful Vistas for the eyes to 'feast' on . . . but -Also- giving you a few Mind Numbingly Stellar SPACE shots, as well. \r\n\r\n**B \" DRAW BACKS \" :** 1- I suppose I would be -Well- advised to say, at this point, 'Right-off-the-bat' , that Eternals is well and truly a -Genuinely- difficult film to fully, well . . . . -{ \" U N P A C K \" }- . . . . what with its myriad \"Revisions\" of not only Earth's natural history, but of that of the -Entire- Cosmos 🤷‍♂️❗, as well ; not to mention some -OUTRIGHT- \"Dichotomies\", -{ And }- a truly 'Massive' -Gaping- Hole in the story, towards the end of said movie. The 'gaff' in question is quite -literally- ...{ \"COLOSSAL\" }... as it pertains to a pointedly \"Spatial\" aspect relating to the Celestial 'Tiamut'-s \"Emergence\" ...( hinted at in multiple -Official- previews for the Eternals )... and occurs within the picture's grand finale. I won't reveal any more details about said mistake, because I'm trying very hard to keep this a -NON- spoiler review, ( and what's more, I am confident that if you pay close enough attention to said finale, you are -Very- unlikely, to miss it ). 2- Also, the 'Deviants', ( a.k.a alien ' Apex Predators 👾 ', one of whom is prominently seen fighting Angelina Jolie's 'Thena' on a beach in the aforementioned trailers ), appear a bit too \"Wire Fram-ey\" ....for lack of a better phrase.... for at least the -Entire- first half of the film. In other words: the WIRE-FRAME look that they embody hurts that whole proverbial 'Suspension-Of-Disbelief' thing . . . . to a small, albeit -{ Significant }- . . . . degree. Other than that, as I'm -Immensely- pleased to report, the film boasts nothing less than a -{ \"Stunning\" }- level of CGI prowess, all the way through. \r\n\r\n**C \" FINAL SUMMARY \" :** This is EASILY Marvel s -{ Most }- \"Thought-Provoking\" movie, Although 'Infinity War' and 'Endgame', ( with all of their -Own- varied and multitudinous complexities ), are not necessarily -All- that far behind. The fact is, this veritable cinematic collosus boasts not only -Several- Intensely { HUMAN } moments . . . . but also a level of -Philosophical- , ( and I'm going to be -Very- honest here ), 'straightup', you guessed it, -{ EXISTENTIALIST }- mind fodder, as well . . . which most certainly makes it 'the exception and -Not- the rule', in the world of modern day, massive-scale, 'Contemporary Popular Entertainment'. What's more, the absolute- totality of the -Principal- actresses and actors, bar -NONE- .....( it's a sheer 'Who's Who' ensemble cast of about 13, hence too many to mention here )..... do an undeniably -Wonderful- job bringing these 'super-Exotic' characters to life ( almost ) -directly- out of the late great Jack Kirby's ( Rest In Love ! ) comic-book pages. If I just -Had- to pick the performance that stood out for me though, it would unquestionably be Miz. Chan's ( 'Sersi'-s ) truly august & dignified, um, \" Gemma 💎 👏❗Of A Performance\" ( sorry peeps, -Just- couldn't resist that one ! ) . . . on account of the Deeply Beautiful \"HUMANITY-AND-EMPATHY\" that she so effortlessly appears to bring to her -Leader's- role, in Eternals. **Thus, it's going to be : A \" Solid, Whole Hearted . . . . And Indeed, -{ \"Super\" }- Appreciative 8.75 Marks Out Of 10 Marks \", From Yours Truly.**", "created_at": "2021-12-03T21:43:10.640Z"}, {"movie_id": 524434, "review_id": "61bee9fcf28838001cc58d5f", "rating": 6.0, "review_text": "Large to its own deficit. Enjoyable to its own demise.\r\nEmotion is lost in the density of the film much too much is crammed into the time, the viewer cannot feel 10 different emotion for 10 different people in 2h30 it isnt possible the film is structure well and cinematically (no one doubted) beautiful visuals. For the casual viewer this film is entertaining with no excitment or attachement. The marvel enthusiast will find this film exciting but numb: full but empty.\r\n\r\nOne could say this film is ambitious, it is, but now it is purely a wallpaper cinematic event.", "created_at": "2021-12-19T08:14:52.658Z"}, {"movie_id": 524434, "review_id": "61ebb76c848eb900f038cb4a", "rating": 6.0, "review_text": "I found Eternals to be entertaining in the way I often do with superhero movies: the plot and dialogue were sharp enough to keep me interested enough to watch the whole movie, but it did not hold me in thrall so much that I will be watching it again. Let’s face it: unless we are very intelligent or very beautiful, if a Marvel film actually came to life around us, our roles would be as helpless victims either saved or killed as collateral damage. So we are talking vicarious involvement here. The only Marvel film I would keep watching any time it comes on is Ant Man and the Wasp, as I find its wit and humor irresistible.\r\n\r\nAs I watched Eternals, I absorbed what I felt were a couple of plot holes large enough for an eternal to fly through. And I am not talking about the science; I give a lot of leeway to scence fiction and similar genres in order to serve the plot. I mean, they went to the trouble of explaining why the Eternals weren’t around to help out with our boy Thanos, but considering the origin story of the Eternals, I did wonder why there didn’t all have every superpower rather than one each.\r\n\r\nAnyway, I will not do a deep dive into how this entry serves the overarching Marvel story arc, because I am not a Marvel fan, per se. (After all, I was a DC comic reader as a young lad!) Suffice to say Eternals did not insult my intelligence as a movie viewer but rather, as mentioned at the outset, it held me all the way through it.", "created_at": "2022-01-22T07:51:08.728Z"}, {"movie_id": 524434, "review_id": "61ec6195ce5d82006a61c690", "rating": 10.0, "review_text": "When I started watching this picture, I did not expect anything supernatural or something new, and as usual with films from the Marvel film studio, it turned out to be right.\r\n\r\nthe authors of the script decided not to break the tradition and, as usual, took the path of least resistance, there are heroes, there are villains, they are fighting each other for the fate of all mankind. The plot revolves around the fact that a certain deity sends detachments of superheroes endowed with superpowers to protect intelligent life on different planets from evil predatory creatures remotely resembling ancient lizards, which they almost successfully cope with, but it turns out that the main characters fought absolutely the wrong evil and the main battle they are ahead. The first hour of the film is mostly banal chatter and shots telling about previous events, but towards the end there is an increase in the intensity of events up to an epic massacre of good and evil. The plot does not carry a global mystery and everything is clear from the very beginning, and small plot twists are guessed even before the viewer sees them. And judging by the finale, the audience will be fed one more, and maybe several films on the topic.", "created_at": "2022-01-22T19:57:09.379Z"}, {"movie_id": 524434, "review_id": "61f410fbcedac40ec032bfe0", "rating": 2.0, "review_text": "As Simon Cowell would say:\r\n\r\nThat was the worst we've seen all day\"", "created_at": "2022-01-28T15:51:23.840Z"}, {"movie_id": 524434, "review_id": "62418b887caa47004761b99c", "rating": 6.0, "review_text": "The premiss here is quite fun - 7,000 years ago a diverse race of immortals arrive on Earth to protect the population from a monstrous race of \"Deviants\" who are bent on eating us all up. Their \"Prime Directive\", if you will, is that they must not interfere in human conflict, so once they have cleared away the beasties, they split up and lead separate lives. That is, until \"Sersi\" (Gemma Chan), her pal \"Sprite\" (Lia McHugh) and her beau \"Dane\" (Kit Harrington) are set upon in London by a newly empowered creature only to be rescued by \"Ikaris\" (Richard Madden) - and that incident forces them all to reassemble. Pretty soon they discover the body of their erstwhile leader \"Ajak\" (Selma Hayek) and must now combine their forces to thwart their ever strengthening enemy and learn why they have resurfaced. Unfortunately, what now follows is a stunning looking, but really pretty dull series of set-piece scenarios that rather clunkily combine mythology and melodrama, romance and action. The camera loves Madden, but as an actor - even clad in blue leather - he is little better than a handsome man. Kumail Nanjiani (\"KIngo\") has a soupçon of charisma, but the rest of the cast including the really out of place Angelina Jolie (\"Thena\") and Harish Patel (\"Karun\") who is intent on videoing everthing at considerable risk to himself, really offer little by way of characterisation and the attempts at humour misfire most of the time. The story has some great effects, but so what? That's what we expect from the most mediocre of productions nowadays. What was needed here were far fewer actors and a much more robust story - and, yes, it could probably have lost the half an hour spent justifying the enormous budget in far-lung locations (real and imaginary). There's a final scene midway through the credits that really does not bode well for the sequel either. I was really pretty bored with this film and though undoubtedly a colourful, action-packed big screen experience, it is an entirely forgettable film to watch.", "created_at": "2022-03-28T10:18:48.057Z"}, {"movie_id": 524434, "review_id": "625e803619690c00a7606cdd", "rating": null, "review_text": "Although it was nice to watch a Marvel movie which is not just a rehash of the same old universe and which was reasonably woke-free for once this movie was unfortunately pretty meh. It is not as bad as many of the detractors claim but it is miles away from being as good as some of those who liked it claims. It is actually pretty meh.\r\n\r\nOn the good side there are some decent special effects but that is more or less to be expected. It is the one thing that Marvel movies usually have going for them after all.\r\n\r\nIt is a fairly serious movie that is not so polluted with comic relief as some of the Marvel movies.\r\n\r\nThe story is a interesting one but it is unfortunately a bit wasted by the implementation in this movie. Also, it pretty much screws up evolution from the extinction of the dinosaurs as well as any form of religious theories (not that I am a great believer in those though). But then this is pure superhero fantasy so I’m not too bothered by that.\r\n\r\nMy main gripe with this movie is that it, as is way to often the case with Hollywood, portrays the Eternals more like a bunch of bickering dysfunctional children than the wise thousands of years old beings that they are supposed to be.\r\n\r\nIkarus in particular is a pure Hollywood asshat. He reminds me of that pervert asshole Homelander in the depraved Hollywood creation The Boys. However Druig and Sprite also grated on me in a lot of the scenes. I never like characters that betray people, stick knifes in peoples backs (literally) and so on.\r\n\r\nThe movie also felt a bit slow. There was a lot of rather boring filler material between the actual action or advancement of the story, and a shitload of flashbacks. I hate flashbacks but then that is probably personal. To me they just interrupt the flow.\r\n\r\nThe movie also does not really feel very positive. It ends rather sadly actually. Also, at the end they may have saved Earth but, if the story is to believed, by doing so they prevented billions and billions of beings from ever being created. Not really a win-win is it?\r\n\r\nIt is clear that this movie was setting things up for a continuation and, despite my reservations about this one, I think there is a pretty good oportunity to create something decent from this. It all depends on whether they pick a decent write/director or one of the woke Marvel hacks.", "created_at": "2022-04-19T09:26:14.540Z"}, {"movie_id": 524434, "review_id": "630b9d820398ab007d778898", "rating": 1.0, "review_text": "The Eternals have lived on Earth for 7,000 years. That’s a long time, but their movie somehow manages to feel even longer than that. Now, if the Eternals predate the Avengers by a few millennia, and have been actively and openly involved in various periods of human history, where where they during the events of the last two Avengers movies?\r\n\r\nSince those (mis)adventures had nothing to do with “Deviants”, the Eternals presumably couldn't be bothered to lift a finger. If that’s the case, why did they stay on Earth so long after the Deviants had supposedly been eradicated?\r\n\r\nAnd if the Deviants are at least as old as the Eternals, why are they called after a word in a language that wasn't going to exist until eons later? This question actually has an answer, albeit a nonsensical one: as far as I can discern English is, for some unfathomable reason, the lingua franca of the Universe, which of course includes both the Earth and Olympia.\r\n\r\nOne Eternal even communicates with sign language, which I guess means she invented it. Moreover, several Eternals have an unambiguous ethnicity; are we to understand that they originated these, for lack of a better term, races on our planet?\r\n\r\nOr is it just a big coincidence that Olympia has Mexicans, Irish, Scottish, Pakistanis, and South Koreans? And speaking of inventions, it seems that ancient civilizations were more (or less, as the case may be) technologically advanced than we had previously thought; specifically when it comes to the CGI that they apparently used to build their cities.\r\n\r\nThis imagery that looks straight out of Age of Empires is the reason that Eternals never generates the slightest sense of urgency (and if it did, it could never keep it up for the more than two and a half hours of running time).\r\n\r\nWho cares about the destruction of the world when the world in the first place is plainly phonier than a diploma issued by Megatrend University? Hell, the entire Universe seems to consist almost exclusively of green screens.\r\n\r\nHow much respect or fear can Arishem and the Deviants respectively inspire or instill when they are nothing more than shapeless masses of pixels? All things considered, the only redeeming thing about this film is that it points out (unwittingly, I must assume) the arbitrariness of everything that has to do with the MCU: \"Five years ago, Thanos wiped out half the population of the universe ... But the people of this planet brought them all back with a snap of the fingers.\" Now imagine a 7,000-year long finger-snap.", "created_at": "2022-08-28T16:53:22.636Z"}, {"movie_id": 524434, "review_id": "64625c790f36550153c74080", "rating": 5.0, "review_text": "It was an ok movie. Just hard for me to get into. The movie is just to hard to fathom as a real possibility. With their powers it's dumb they only can fight the machine things.", "created_at": "2023-05-15T16:23:21.041Z"}, {"movie_id": 524434, "review_id": "651116eb344a8e096e6db03d", "rating": null, "review_text": "I just watched this, Sep 24, two years after its release.\r\n\r\nI actually liked it much better than the rest of the woky crap they have been putting out ever since this one.\r\n\r\nI do not known why I keep watching this MCU stuff, I guess I am a worm and I deserve it xD.", "created_at": "2023-09-25T05:13:15.484Z"}]