[{"movie_id": 292280, "review_id": "587e52cf9251414143019ac9", "rating": null, "review_text": "Well, there are a couple of things that one can praise **The Bye Bye Man** for in an attempt to give this incredibly unoriginal teen screen horror showcase some flimsy credit. For starters, **The Bye Bye Man** continues the tradition of being another unforgettable goosebump saga to become meager fodder in the cinematic dumping ground of the new year movie season in January where a majority of flaccid frightening farces go on to linger in obscurity. Secondly, one must admit that the film’s title is somewhat catchy-sounding (okay, most of you may dismiss it as “dumb”). Otherwise, waving off the dullness of **The Bye Bye Man** is the only satisfaction that warrants one’s indifference to this piece of faceless slasher sludge.\r\n\r\nInterestingly, **The Bye Bye Man** is a collaborative effort by the husband-wife team of screenwriter Jonathan Penner and director Stacy Title. Title, a veteran of a few anemic scare tactic features that include 2007’s _Snoop Dogg’s Hood of Horror_ and 1999’s _Let the Devil Wear Black_, shows little imagination here as the direction is woefully stillborn and contributes to the cheaply-made quality of this breathless boofest. Penner, mostly known to American television audiences as a three-time contestant on the long-running reality TV series _Survivor_ (2000-present) as well as a one-time Academy Award nominee, delivers a spotty and mundane script that does not even begin to challenge his intentions on presenting a macabre presentation looking to tackle the meaty psychology of what makes the misguided motivations of man so intriguing. Basically, **The Bye Bye Man** is banal and has no true backbone on which to ride this amateurish thrill-ride to the formulaic gates of gore.\r\n\r\nIn confusing fashion, the film’s opening features a shotgun-wielding man mowing down random folks in cold blood. During his carnage he repeatedly warns his unsuspecting prey (or more so convincing himself as a personal reminder) to “Don’t think of it, don’t say it!”. This repetitive phrase is uttered over and over but it does not stop this mad man from committing his heinous crimes back in the late 1960’s in woodsy Wisconsin.\r\n\r\nThe story skips to modern-day Wisconsin where the setting involves some college kids rejecting their dorms for off-campus living in a decrepit house not far from their university. Sweethearts Elliott and Sasha (Douglas Smith and Cressida Bonas) and athletic buddy John (Lucien Laviscourt) take up residence in the deteriorating place and it does not take long before Elliott discovers the scribbling message “Don’t think it, don’t say it!” on wooden furniture not to mention the creepy cretin whose words he reads with curiosity–The Bye Bye Man. Conveniently, a fourth friend joins in the mix in goth chick Kim (Jenna Kennell) whose expertise in the occult helps bring about what amounts to be the strange haunting of the titular troublemaker outed courtesy of Kim’s impromptu seance.\r\n\r\nNaturally, the inquisitive Elliott wants to research the backstory of The Bye Bye Man and ends up turning to a source that was terrorized by the crazed character–a journalist that luckily survived the confrontation with the murderous misfit in the 60’s. Also, the journalist provides the scoop for Elliott as he explains the eerie legend behind what drives The Bye Bye Man’s sadistic impulses. As long as one does not mention his name or think about him then the curse of his maniacal manner can be eradicated. In other words, refraining from having The Bye Bye Man’s name on your lips can allow you to survive another day but should you defy his wishes then you are toast. Plain and simple. Are you shaking in your boots yet, gang?\r\n\r\nSadly, **The Bye Bye Man** is nothing more than a convoluted creeper that does not have much execution behind its gimmicky, shadowy mask. This hackneyed horror dud wants to build some kind of off-kilter mythology and tries to give the ole college try in soul-searching the warped motivations for thirsty mass murdering mayhem. Unfortunately, this junk-minded jolt session is transparent in thrills while harboring the same old sketchy CGI special effects and tossing around disposable characterizations that we actually do not mind **The Bye Bye Man** terminating just to supply the unintentional chuckles. This lifeless nail-biter is as original as finding plasma bags at your local blood drive. Cinema spouses Title and Penner concoct a feeble frightfest that never resonates beyond the film’s idiotic need to reinforce the caustic catchphrase “Don’t think it, don’t say it!” as if this brings some sort of shady sheen to this dreadfully generic affair.\r\n\r\nThe mystery concerning The Bye Bye Man’s ominous slaughtering certainly does not match the mystery concerning why veteran Academy Award-winning actress Faye Duaway is on board as the widow of the killing name-phobic nemesis as her character cannot explain the troubling proceedings of her ex. Hey, if Dunaway can survive the campy cult classic _Mommie Dearest_ from many moons ago then she can certainly survive the wretched **The Bye Bye Man**. On second thought…perhaps not!\r\n\r\n**The Bye Bye Man** (2017)\r\n\r\nSTX Entertainment\r\n\r\n1 hr. 36 mins.\r\n\r\nStarring: Douglas Smith, Cressida Bonas, Lucien Laviscourt, Jenna Kanell, Doug Jones, Faye Dunaway, Carrie-Anne Moss, Erica Tremblay\r\n\r\nDirected by: Stacy Title\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Horror\r\n\r\nCritic’s rating: * 1/2 stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2017", "created_at": "2017-01-17T17:22:23.828Z"}, {"movie_id": 292280, "review_id": "592ee4bcc3a36860ff00f820", "rating": 4.0, "review_text": "Great movie to watch with your mates and have a good old fashioned \"What the Fuck!?\".\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2017-05-31T15:43:56.150Z"}, {"movie_id": 292280, "review_id": "59cadd959251412b980051c3", "rating": 6.0, "review_text": "**Don't think it! Don't say it! Just watch it!**\r\n\r\nThere's nothing major difference with this and the regular horror flicks, except the internal structure of the tale. For that alone, it is worth a watch. Because they have used it the better way, yet the familiarity gives out everything to its viewers. So sad that you could predict the entire film, despite their best effort to turn it around. The good news is, if you are not a horror film fan, you possibly would enjoy it. But those who love and watch horror films regularly would find it somewhat a waste of time. I was the first one, and I thought it was better than some of the recent big names from the same genre.\r\n\r\nYeah, looks a mix of plenty of films. It was somewhat like 'It Follows', but less complicated. Easy to follow the characters and the story. Though from the beginning itself, it was very intentional. A decent cast and the filmmaking. It could be scary for some viewers, but I found a little edgy and well paced narration. But sadly it did not miss any of the usual horror flick formula. One of the most overused, not just in this film, but any horror films is that those film character interviewing the one of the survivours from the past. So if you don't mind such common usage, it is an acceptable film.\r\n\r\n_6/10_", "created_at": "2017-09-26T23:07:01.661Z"}]