[{"movie_id": 525661, "review_id": "5df5d74626dac10014514a80", "rating": 7.0, "review_text": "The best way to sum up ‘Bombshell’ is that it's a story that needs to be remembered and told, yet the film we got is good but not great. While all the acting is phenomenal - especially the leads - and makeup fantastic, the story, filmmaking and editing are uncreative and thus fail to hit the home run that this should have been. Having said that ‘Bombshell’ is still one to watch, if only to be reminded of what is still happening to women today - not just in Hollywood, but all around the world.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-bombshell-an-important-yet-uninspired-look-at-fox-news-sex-scandal", "created_at": "2019-12-15T06:48:38.465Z"}, {"movie_id": 525661, "review_id": "5e379e840c2710001a72cd98", "rating": 8.0, "review_text": "**_A well-acted film about the human cost of bullying and sexual harassment_**\r\n\r\n>_11.On or about September 3, 2009, Carlson complained to her supervisor that one of her co-hosts on_ Fox & Friends_, Steve Doocy, had created a hostile work environment by regularly treating her in a sexist and condescending way, including by putting his hand on her and pulling down her arm to shush her during a live telecast._\r\n\r\n>_12.Doocy engaged in a pattern and practice of severe and pervasive sexual harassment of Carlson, including, but not limited to, mocking her during commercial breaks, shunning her off_ _air, refusing to engage with her on air, belittling her contributions to the show, and generally attempting to put her in her place by refusing to accept and treat her as an intelligent and insightful female journalist rather than a blond female prop._\r\n\r\n>_13.After learning of Carlson's complaints, Ailes responded by calling Carlson a \"man hater\" and \"killer\" and telling her that she needed to learn to \"get along with the boys.\"_\r\n\r\n>[...]\r\n\r\n>_20.On those occasions when he spoke directly with Carlson, Ailes injected sexual and/or sexist comments and innuendo into their conversations by, among other things:_\r\n\r\n>_a. Claiming that Carlson saw everything as if it \"only rains on women\" and admonishing her to stop worrying about being treated equally and getting \"offended so God damn easy about everything.\"_\r\n\r\n>_b. Describing Carlson as a \"man hater\" and a \"killer\" who tried to \"show up the boys\" on_ Fox & Friends_._\r\n\r\n>_c. Ogling Carlson in his office and asking her to turn around so he could view her posterior._\r\n\r\n>_d. Commenting that certain outfits enhanced Carlson's figure and urging her to wear them every day._\r\n\r\n>_e. Commenting repeatedly about Carlson's legs._\r\n\r\n>_f. Lamenting that marriage was \"boring,\" \"hard\" and \"not much fun.\"_\r\n\r\n>_g. Wondering aloud how anyone could be married to Carlson, while making sexual advances by various means, including by stating that if he could choose one person to be stranded with on a desert island, she would be that person._\r\n\r\n>_h. Stating \"I'm sure you [Carlson] can do sweet nothings when you want to.\"_\r\n\r\n>_i. Asking Carlson how she felt about him, followed by: \"Do you understand what I'm saying to you?\"_\r\n\r\n>_j. Boasting to other attendees (at an event where Carlson walked over to greet him) that he always stays seated when a woman walks over to him so she has to \"bend over\" to say hello._\r\n\r\n>_k. Embarrassing Ms. Carlson by stating to others in her presence that he had \"slept\" with three former Miss Americas but not with her._\r\n\r\n>_l. Telling Carlson that she was \"sexy,\" but \"too much hard work.\"_\r\n\r\n- Extract from Gretchen Carlson's sexual harassment lawsuit against Roger Ailes (July 6, 2016)\r\n\r\n>_Some of the women that are complaining, I know how much he's helped them. And even recently. And when they write books that are fairly recently released, and they say wonderful things about him. Now, all of a sudden, they're saying these horrible things about him. It's very sad. Because he's a very good person. I've always found him to be just a very, very good person._\r\n\r\n- Donald Trump; _Meet the Press_ (July 23, 2016)\r\n\r\n>_Today America lost one of its great patriotic warriors. Roger Ailes. For Decades RA's has impacted American politics and media. He has dramatically and forever changed the political and the media landscape singlehandedly for the better. Neither will ever be the same again as he was a true American original. Few people in this life will ever reach the profound level of impact that Roger Ailes had on the country every single day. As his opponents played checkers in life, Roger was always the strategist, playing Chess 5 steps ahead at a whole other level._\r\n\r\n- Sean Hannity (via Twitter; May 18, 2017)\r\n\r\n>_I was asked to do the spin. God help me, I did it. I know people think it's like, \"Oh, you had to spin around\", but I remember feeling like, \"I put myself through school. I was offered partnership at Jones Day, one of the best law firms in the world. I argued before federal courts of appeal all over the nation. I came here. I'm covering the United States Supreme Court. I graduated with honours from all of my programs and now he wants me to twirl?\" And I did it. If you don't get how demeaning that is, I can't help you._\r\n\r\n- Megyn Kelly; \"Megyn Kelly Presents: A Response to _Bombshell_\" (January 9, 2020)\r\n\r\nI've seen _Bombshell_ described as a docudramedy – a portmanteau if ever there was one, that essentially refers to a true story (docu) that's half drama (dram) and half comedy (edy). It's a relatively new subgenre that a lot of critics seem to be tracing back to Adam McKay's _The Big Short_ (2015) and _Vice_ (2018). And whilst Bombshell definitely takes inspiration from McKay's work, I think the real antecedent is Oliver Stone's 90s films. Granted, Stone never made what could be called a docudramedy – _The Doors_ (1991), _JFK_ (1991), _Heaven & Earth_ (1993) and _Nixon_ (1995) are docudramas, whereas _Natural Born Killers_ (1994) and _U Turn_ (1997) are dramedies. However, what all six films have in common, and this is where they're important to the modern docudramedy subgenre, is stylistic snappiness, unrelenting energy, visual hyperactivity, and editing rhythms that could give you seizures. And so too _Bombshell_. At least initially. And although it shares a lack of subtlety with McKay's _The Big Short_, and a lack of factual insight with _Vice_, _Bombshell_ is entertaining, brilliantly acted, and paints a horrifying picture of workplace bullying and sexual harassment. Sure, it'll be yet more evidence for the right that leftist Hollywood is incapable of partiality, but really, if you're the type of person prone to believing the propaganda machine that is Fox News, what are you even doing watching the movie in the first place?\r\n\r\nThe story begins in August 2015 during the first Republican presidential debate. Co-moderating the debate is Megyn Kelly (Charlize Theron completely disappearing into the role), the host of Fox News's _The Kelly File_, who asks candidate Donald Trump (then considered a highly unlikely winner), about his history of misogynistic comments. Pointing out he has called women whom he dislikes \"_fat pigs_\", \"_dogs_\", \"_slobs_\", and \"_disgusting animals_\", she asks, \"_does that sound to you like the temperament of a man we should elect as president_\". The following day, Trump proves her point during an interview with CNN by throwing a tantrum and claiming, \"_she gets out there and she starts asking me all sorts of ridiculous questions, and, you know, you could see there was blood coming out of her eyes, blood coming out of her wherever_\". And so, much to her chagrin, Kelly finds herself the focus of the headlines. Initially, Fox News president Roger Ailes (a superb John Lithgow), supports her, telling her that the exchange was \"_great TV_\", but as time goes on, and Trump's popularity continues to rise, Ailes's begins to grow concerned about Kelly's attitude. Meanwhile, in June 2016, after saying that she supports the assault rifle ban, Gretchen Carlson (Nicole Kidman), is fired from her show _The Real Story_. Carlson had been a co-host on the highly-rated _Fox & Friends_ until 2013, when she complained about sexist treatment by her co-hosts, and was demoted to a show in a less desirable timeslot. Fully expecting to be fired, she had already contracted a legal team, with the intention of filing a suit not against Fox, but against Ailes personally, who she claims sexually harassed her for years. However, she's told that the suit can only be successful if she can find others willing to corroborate his behaviour. But with the women of Fox urged to support Ailes (including wearing t-shirts proclaiming their loyalty), will anyone stand with Carlson? Elsewhere, the young and idealistic \"_millennial evangelical_\" and \"_Jesus influencer_\" Kayla Pospisil (Margot Robbie playing a composite character) is hired as a research assistant for _The O'Reilly Factor_. Determined to rise through the newsroom, she engineers a private meeting with Ailes, but is horrified when she discovers exactly what he means when he says he will need evidence of her \"_loyalty_\".\r\n\r\nThe film also features Pospisil's (fictional) mentor Jess Carr (Kate McKinnon); Ailes's wife, Beth (Connie Britton); Kelly's husband Douglas Brunt (Mark Duplass); Kelly's (fictional) producer Gil Norman (Rob Delaney); Ailes's lawyers Susan Estrich (Allison Janney) and Rudy Giuliani (Richard Kind); Fox News founder and owner Rupert Murdoch (Malcolm McDowell); Murdoch's sons, Lachlan (Ben Lawson) and James (Josh Lawson); Carlson's lawyer Nancy Smith (Robin Weigert); Kelly's (fictional) research assistants Lily Balin (Liv Hewson) and Julia Clarke (Brigette Lundy-Paine); Fox general counsel Gerson Zweifach (Andy Buckley); former Fox correspondent Rudi Bakhtiar (Nazanin Boniadi), who accused anchor Brian Wilson (Brian d'Arcy James) of sexual harassment in 2007 and was subsequently fired; Ailes's (fictional) secretary Faye (Holland Taylor); and, often in the form of single scene cameos, Fox News employees Bill Shine (Mark Moses), Dianne Brandi, (Amy Landecker), Martha MacCallum (Elisabeth Röhm), Ainsley Earhardt (Alice Eve), Alisyn Camerota (Tricia Helfer), Geraldo Rivera (an unrecognisable Tony Plana), Sean Hannity (Spencer Garrett), Bret Baier (Michael Buie), Neil Cavuto (P.J. Byrne), Kimberly Guilfoyle (Bree Condon), Bill O'Reilly (Kevin Dorff), Abby Huntsman (Ashley Greene), Chris Wallace (Marc Evan Jackson), Juliet Huddy (Jennifer Morrison), Julie Roginsky (Ahna O'Reilly), Harris Faulkner (Lisa Canning), Irena Briganti (Brooke Smith), Jeanine Pirro (Alanna Ubach), and Greta Van Susteren (Anne Ramsay).\r\n\r\nWritten by Charles Randolph (_The Life of David Gale_; _The Interpreter_; _Love & Other Drugs_) and directed by Jay Roach (_Austin Powers: International Man of Mystery_; _Meet the Parents_; _Game Change_), _Bombshell_ is the third major retelling of the Ailes saga in the last couple of years, following Alexis Bloom's documentary, _Divide and Conquer: The Story of Roger Ailes_ (2018) and the Showtime miniseries _The Loudest Voice_ (2019), which might go some way to explaining the film's disappointing box office (although I'm sure some will throw around the ridiculous \"_get woke, go broke_\" phrase). None of the principal characters, including Kelly and Carlson, were involved with the filmmaking at any point, and neither Theron nor Kidman consulted either woman. Carlson has not yet seen the film, and although Kelly originally said she might not watch it, in January 2020, she posted a video to her YouTube channel featuring herself, her husband, Rudi Bakhtiar, Juliet Huddy, and former Fox News producer Julie Zann, recorded immediately after a screening. Kelly praised the film's general accuracy, although she also noted that on occasion, it veered toward victim blaming, suggesting that certain scenes screamed out they were \"_written by a man_\".\r\n\r\nThe fall of Roger Ailes preceded the first accusations against Harvey Weinstein (October 2017) and the birth of the #MeToo movement by over a year. When Carlson first files her suit, not a single woman comes forward to support her (although, ultimately over 20 would), and one imagines that had this happened _after_ Weinstein, the situation would have been markedly different. Indeed, the film shows people such as Jeanine Pirro (perhaps the most militantly insane of Fox's cabal of instability) organising a kind of reverse picket line that seeks to discourage women from accusing Ailes (or Bill O'Reilly) of anything inappropriate, and isolating them if they do so (the \"I stand with Roger\" t-shirts are her idea). This depiction of the nature of sexual harassment in a male-dominated and female-enabled corporate arena is chillingly effective. In one particularly disturbing scene, we see a young female journalist go out for dinner with her male boss, and when he offers her career advancement in return for sex, her reaction is to pretend she doesn't understand what he means, then pretend it's not happening, and finally to apologise to him (\"_I'm sorry if I've given you the impression that our relationship could be anything but professional_\"). In this environment, women are the victims whether they resist or submit – resist, and they risk their job; submit, and they lose their self-respect. A more toxic environment is hard to imagine.\r\n\r\nWith that in mind, _Bombshell_ is certainly not a subtle film, but it doesn't try to be. Roach is not trying to engage in an even-handed examination of partisan politics, nor even look at the monolithic political ideology of Fox News itself. Sure, it features lines such as Ailes claiming, \"_news is like a ship, you take your hands off the wheel and it pulls hard to the left_\", whilst Carr states the main goal of Fox News is to \"_frighten and titillate_\" rather than report facts, but these are the exceptions in a reasonably apolitical film. Roach knows that 99% of his audience will already agree that Fox News is a dangerous, hate-filled, xenophobic, propaganda machine, so he makes little effort to depict the network's political leanings. Instead, the film is about self-loathing, fear, and anxiety – it's about workplace bullying and the human cost of sexual harassment.\r\n\r\nThis is a crucial point, because the three women at the film's centre (Kelly, Carlson, and Pospisil) are not a left-wing sisterhood. They're not even friends (the trio share only a single scene, and it's without dialogue); they're not a rebellious group of bra-burning feminists, they're right-wing conservatives who helped create the toxically boorish system under which they now find themselves oppressed. True, the film is probably a little too silent on their politics, especially Kelly (more on this in a moment), but the point is that politics are fairly irrelevant – sexual harassment is sexual harassment, and your politics, religious beliefs, race, and gender are all beside the point (unless, of course, you're the type of moron who believes a woman who dresses sexy is \"_asking for it_\", in which case you probably feel Carlson and women like her got what they deserved). At the same time, the film doesn't portray Ailes as an irredeemable monster, at least not at first. Indeed, when we meet him, he's commending Kelly for her handling of Trump, and the impression is that the relationship between the two is one of respect and genuine fondness, with Ailes even going as to say, in a fatherly way, \"_I'm proud of you, Megyn_\". The point is, this is not an anti-Republican diatribe. It's the exposé of a man who was a Republican.\r\n\r\nAesthetically, _Bombshell_ is something of a strange creature. The rapidly edited, stylistically hyperactive first half-hour or so is vintage McKay; a deeply self-reflexive almost meta-comedy. For example, one of the earliest scenes sees Theron break the fourth wall and address the audience as she gives us a tour of Fox News. Another moment sees Carr telling Pospisil that some people watch the channel so much, the logo has burnt onto their TV screens, at which point the Fox logo appears in the corner of the screen, remaining there for the rest of the scene. However, once the groundwork has been laid, Roach shifts tones completely and moves into fairly standard factual drama territory, which has the effect of making the first act feel somewhat isolated and incongruous, setting us up for a film which never arrives, particularly concerning the fourth-wall break (the only scene of its kind in the film).\r\n\r\nOn the other hand, the film's triptych narrative structure works very well. It's not an even divide (this is Kelly's film before it is Carlson's or Pospisil's), but it does allow Roach to dramatise just how much Ailes looks on his female staff as commodities. Carlson is the washed-up former beauty queen who no longer holds his interest; Kelly is the current flavour of the month, still beautiful, still popular; Pospisil is the future, young, vital, keen, and in awe of the man himself, as all women should be – for every Carlson, there's a Kelly to replace her, and for every Kelly, there's a Pospisil waiting in the wings, ready for grooming.\r\n\r\nFrom an acting perspective, there's not a weak link, with Theron especially impressive. Normally, she looks nothing like Kelly, but through posture, mannerisms, wardrobe, a scratchy voice, and the subtle prosthetic genius of Kazu Tsuji (who turned Joseph Gordon-Levitt into a young Bruce Willis for Rian Johnson's _Looper_, and Gary Oldman into Winston Churchill for Joe Wright's _Darkest Hour_), the actress disappears into the character, who she plays as steely and often remote, but fiercely passionate and intelligent. Is it as good as her work in Patty Jenkins's _Monster_ (2003)? Not quite. But it's still a deeply impressive performance that transcends mere imitation.\r\n\r\nThe other standout is Lithgow, whose performance is fascinatingly modulated. Introduced in a scene designed to show his fatherly protective side, Lithgow initially portrays Ailes as a flawed human being – all too aware that he's losing a battle with age, but ironically resigned to his physical appearance not being what it once was. It's only later that the actor lets the monster out of the box. One particular scene, which is both his and Robie's best, and the dark heart at the centre of the film, sees him asking an increasingly uncomfortable Pospisil to hike her skirt higher and higher, to the point where her underwear becomes visible, as he becomes increasingly aroused, indicated by nothing but his breathing. It's an exceptionally well-staged and nauseating scene which gets to the film's core – the humiliation aspect of sexual harassment. Like rape, it's not about sex (at least, not entirely), it's about power, dominance, and submission. It's about ego. Ailes knows that if women like Pospisil value their job, they'll submit, just as they have done for men like him throughout history. As he sees it, ambitious women will always need powerful men, and he behaves as he deems appropriate within that paradigm.\r\n\r\nAs for problems, I mentioned earlier that the film might be too silent on some of Kelly's history. I understand where Roach is coming from on this; to feature scenes which seem designed to depict her in a less than favourable light could run perilously close to victim-blaming – kind of a \"_who cares if she was harassed, she's a racist_\" argument. So whilst I agree in principle, I think that in practice, Roach errs in the other direction. If you knew nothing about these events, you'd be forgiven for thinking the only controversy Kelly ever encountered in her time at Fox was asking Trump about misogyny. There's no mention, for example, of her infamous \"_Jesus was a white man_\" comment from 2013. Granted, it doesn't have much to do with the story at hand, but my point is a general one. The film's Kelly is almost virginal, without blemish. Making her character more rounded, more flawed, more (dare I say it) right-wing, would have served both the character and the story, and actually helped rather than hindered Roach's argument that politics don't matter in relation to sexual harassment. On the other hand, the film _does_ address the fact that Kelly knew about Ailes for years before Carlson was fired, and it takes her to task for not doing anything with that knowledge, with one character rightly pointing out that if she had done something earlier, other victims would have been spared. Interestingly enough, this was the scene Kelly herself felt crossed the line into victim-blaming – make of that what you will.\r\n\r\nAnother issue is that the tonal shift at the end of the first act is very strange, as Roach abandons the hyperactivity of the opening and settles into a far more conventional style – a transition he doesn't entirely pull off. He also makes the strange decision to mix archival footage of the real Ailes with Lithgow's performance during this first act, which somewhat shatters the film's performative universe.\r\n\r\nUltimately, _Bombshell_ will probably anger some for its refusal to really comment on how Ailes's accusers were part of the problem for a long time, propping up, excusing, and validating the system behind which he operated. However, to take this route is to suggest that because they elected not to rock the boat earlier in their careers, they don't deserve much sympathy. And anyone who knows anything about feminism or #MeToo will tell you that is absolutely _not_ the case. Certainly, in the case of Kelly, the opportunity for her to explain why she stayed silent for so long is available, but is never availed of. But is that a fault of the filmmakers or a reflection on the actual person's reluctance to take that particular journey inward? Sure, the film is at pains to avoid showing either Carlson or Kelly as in any way complicit in creating the hideously outdated patriarchy at Fox (as opposed to many of the network's other female employees, who seem to be fair game). But this is by design. Were _Bombshell_ a story about Fox News, such things ought to be examined. But it isn't. It's a story about humiliation and bullying, a story that says people do not deserve such treatment, no matter their race, religion, or politics.", "created_at": "2020-02-03T04:16:04.622Z"}, {"movie_id": 525661, "review_id": "5e8549c498f1f10012aa2e19", "rating": 8.0, "review_text": "I was hesitant at first to watch this movie. I couldn't imagine watching anything nearly two hours long about the Fox Network. Plus I saw a lot of negative buzz on the film. I am a progressive and have been glad to see wealthy men being held accountable for sexual harassment finally, but I wasn't anxious to watch a hit job either. I researched the actual story and it seemed to be about two old white guys in a privileged position, and if their conservative wealthy boss fired them, how unfair could it be?\r\n\r\nI found it to be entertaining. I gather one of the main characters isn't a real person, but rather a sort of amalgam of many women who were sexually abused and either left Fox or were disposed of in other ways. I liked the husband who supported his famous wife so loyally, and got a kick out of the shenanigans the lesbian character had to go through to stay hidden in plain sight. I never expect a documentary with these films, so small changes and artistic freedom doesn't bother me.\r\n\r\nif you are conservative and a Fox news devotee, and don't like to see anything negative about it, you might want to give it a miss. But for the rest of you, if you want to see some of the behind the scenes of a part of the Me Too movement, here you go.", "created_at": "2020-04-02T02:11:16.999Z"}, {"movie_id": 525661, "review_id": "5fda3887511d090040604646", "rating": 8.0, "review_text": "Bombshell - The scandal tells the true story of the terror and harassment experienced by several women on FOX NEWS, the story of how the truth was slowly seeking the light of day, of how a group of women got together and tried to overthrow one of the biggest names associated with the FOX brand.\r\n\r\nBefore the explosion of the #metoo movement, the first sign of a paradigm shift in Hollywood began with the fall of TV titan Roger Ailes. The film, by director Jay Roach, follows Ailes' last days as CEO of FOX NEWS, before Gretchen Carlson sued him and Megyn Kelly himself reportedly harassing him.\r\n\r\nThe film is heavy, especially given the type of material it deals with, and maintains a tense atmosphere from start to finish, raising the bar with each passing moment. There is great care in building tension, each scene slowly contributes to an unpleasant feeling in the audience. The truth is that it is sad to understand that this type of deplorable behavior is real, it is horrifying to know that certain men with too much power try to take advantage of it to use people (in the case of this film, and in reality, power is used specifically to harass and molest women).\r\n\r\nThere is a scene, in particular, that depicts the harassment experienced by several women (in this scene a character was created specifically to incorporate all the women who suffered these horrors), a scene so uncomfortably real that it will leave anyone feeling dirty. It is really impressive how the film portrays all this tension, all this horror and all this uncomfortable feeling in such a realistic and frightening way.\r\n\r\nThe performances are also really incredible, Charlize Theron is splendid like Megyn Kelly, in a performance that is so real that we almost forget who interprets it. Margot Robbie and Nicole Kidman also give their all in the film, and this trio really takes this film to a higher level of cinema.\r\n\r\nAlthough not a perfect film (the film tries to imitate the style of “The Big Short”), with some subjects that could have been further developed, I think it is mandatory to view, as it is essential to understand that this type of horrors still happen against women. It is really impressive the realism experienced with this film, the way it dramatizes a real event and still manages to convey the discomfort and terror of the situation. I strongly recommend that you see it.", "created_at": "2020-12-16T16:40:39.280Z"}]