[{"movie_id": 458305, "review_id": "5dd48f3d28723c00124e6c03", "rating": 8.0, "review_text": "‘Vivavirum’ slots in neatly next to Jocelyn DeBoer and Dawn Luebbe’s ‘Greener Grass’ and Richard Stanley’s ‘Color Out of Space’ to form a loose trilogy of deeply surrealist releases in 2019 that skewer our perceptions of suburbia and the family unit. Director Lorcan Finnegan has brought to life a disturbing, thoughtful and bleakly funny mutant of a movie.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-vivarium-what-makes-a-house-a-horrific-home", "created_at": "2019-11-20T00:56:29.184Z"}, {"movie_id": 458305, "review_id": "5e7f0fcea410c80018526bdb", "rating": 4.0, "review_text": "Pretty pointless movie. Signed up to review because I couldn't believe the rating this received. Yes, you get a weird realtor and a creepy kid but other than that you just watch the couple basically repeat each day hating being stuck. You're not going to learn anything more about the weird freaks or why they're doing what they're doing and will end up feeling like you just wasted your time. Yeah, I get it's supposed to be satire but pass.", "created_at": "2020-03-28T08:50:22.687Z"}, {"movie_id": 458305, "review_id": "5e94938e8e87020016ce43d5", "rating": 6.0, "review_text": "> **_Review on Horror Focus_**\r\n\r\nThis indie sci-fi thriller Vivarium from Irish filmmaker Lorcan Finnegan is many things, one definitely being quite the head-scratcher. Not because of it being an intellectually challenging story, or one that is laced with twists and turns to create an unpredictable viewing, but a film that delivers a narratives so peculiar that it is like something you've never seen before. Take this with a pinch of salt, as there's certainly aspects which don't make the landing of such an ambitious plot, but let it also be known that Vivarium contains some impressions visual and narrative storytelling, enough to forgive some of the mid-act waffle that cripples the films momentum.\r\n\r\nFinnegan gets the ball rolling with power, keeping the story taught enough that we are thrown straight into the mystery early doors. This works extremely well as the tension begins to bubble within the first ten minute mark. The performances here from our main cast member already begin to show their brilliance, especially Jonathon Aris who sets a chilling foreshadowing tone with his appropriately eerie character Martin. The small (yet effective) amount of screen time we have with Martin is enough to set the tone, and we, like Tom and Gemma are forced to endure something that is so ominously intense that it leaves a lingering sense of dread.\r\n\r\nUnfortunately, this soon begins to simmer once Finnegan establishes the plot in its whole, and realisation settles on the simple fact that, after the 30 minute mark, there really isn't much else for the story to go. Yes the labyrinth maze of suburbia is strangely terrifying, and the strenuous repetition is effective, but after 15 minutes of having the child introduced, Vivarium begins to fall flat, and grow increasingly more stale up until after the sixty minutes in. The fantastic Poots and Eisenberg, and the deadpan humour do prevent this film from becoming a little too one-note, but this doesn't exuse more than a few scenes that will be a task to sit through, even in these current homebound world we are living in.\r\n\r\n\r\n\r\nThere is a glimmer of brilliance in Finnegan's choice of release here, as what our main couple are enduring is poetically reflective of the life we are living in this mad pandemic virus. I found myself identifying with the irritated attitude our characters develop, and sympathised with them when their child (the boy) was well deserving of a slap. Vivarium is intelligently relative right now, and can definitely be perceived as as Finnegan holding a mirror up to the idealistic yet treacherous concept of what makes the perfect home, and the urge to be the perfect family.\r\n\r\nIn fact, there's so much underlying aspects of Vivarium that are so incredibly reflective of the inevitable repetition that comes once a spunky couple are weighed down by family life, securing their \"ideal\" home and tolerating each others impurities under the same roof constantly. Finnegan exposes the dangers of the nuclear family here, and forces us to endure it too, warts and all. We even get those little moments in which Tom consistently chips away, digging a whole, not to be talked to, helped or interrupted by Gemma, who becomes a slave to ensuring nothing but contentment for their boy. This moment is humourous with a dark sting, and will be reflective of reality to many, but to those inside Vivarium is nothing but a nightmarish loop.\r\n\r\nThis distorted utopia Finnegan creates is what's most effective, orchestrated by a Burton-esque palette that is as gorgeous as it is hauntingly off-kilter. The early 80's, Romero's Day of the \r\n\r\nDead-like synth is undeniably effective, and carries the tension through to the final act, which although doesn't hit a payoff point that excuses the slow middle act, does add to the bankers reality Finnegan has crafted, and highlights the eeriness established from the beginning. While Vivarium does lose a tone of momentum when it hits the mid-way point, by the time it reaches its end, I can't shake the distinct feeling of unease I had to endure for over eighty minutes, and I can't deny that a film like this was an experience I have quite been exposed to before. I have been feeling really under the weather these past few days, and let's just say this only made me feel worse. Great job, I guess?\r\n\r\n\r\nVERDICT \r\nVivarium is a simplistically disturbing suburban nightmare with a captivating story and little room for growth. Enduring its drab middle act may prove tricky, but once Finnegan blows the dust of the eerie intensity established from the beginning, you'll find there is much to be desired with this unsettling little indie-sci-fi thriller.", "created_at": "2020-04-13T16:30:06.521Z"}, {"movie_id": 458305, "review_id": "5f0c78a913a32000347ab639", "rating": 9.0, "review_text": "Amazing watch, will watch again, and can recommend.\r\n\r\nImogen Poots and Jesse Eisenberg (both from \"The Art of Self Defense\") are amazing in their roles as an abducted couple force to raise a child.\r\n\r\nThis is an amazing premise (see \"Solar Opposites\" for something similar), and one that is extremely hard to discuss without spoilers. This is a wonderful mix of tropes. There is a prisoner / abductee trope, there is \"adoption of a strange child\" trope, there is a \"troubled couple\" trope, there is even a mystery trope.\r\n\r\nI'm fully of the opinion that the right thing to do in any abduction situation is to not reward the criminals with what they want because there is no reason that while they have all the power that they're going to do anything to benefit the victims. We get see an exploration of what people do in a dire situation and given a task, similar to a couple different \"Twilight Zone\" episodes.\r\n\r\nThe production value is clearly here, and while they appear to have saved some money on limited locations, it clearly put to good use as the movie delves deeper into its story.\r\n\r\nI can't recommend this enough, please give it a shot all the way through.", "created_at": "2020-07-13T15:07:21.694Z"}, {"movie_id": 458305, "review_id": "5f2b7b5745819900335a9ec1", "rating": 7.0, "review_text": "Sci-fi thriller, just not _\"on the edge of sit\"_ type. Lorcan Finnegan remakes his short film **Foxes** and adds a life message to it.", "created_at": "2020-08-06T03:39:03.074Z"}, {"movie_id": 458305, "review_id": "5f4265b70bb0760032d6d0bc", "rating": 1.0, "review_text": "It's a movie whose premise had promise but was never thoroughly explored.\r\n\r\nI read the generally high praise in the reviews for this movie and admittedly, I was fooled. I'm convinced that at least the individual here who likened part of its premise to the animated series, \"Solar Opposites,\" while not being entirely off the mark, neglected to mention that unlike Solar Opposites, there is no payoff with Vivarium. Unlike Solar Opposites, we don't know why Vivarium exists. We don't know why people are expected to raise these mysterious hominids. We don't know what their purpose is, other than to entrap first home buyers, like some kind of otherworldly predatory lender. Is it a euphemism for unscrupulous property developers? Who knows?\r\n\r\nOnly thing I know is that by the end of it all, I felt totally ripped off. At around 90 minutes, it was 60 minutes too long. It's not even something that I can suggest is open to much interpretation.\r\n\r\nIf you just need something playing in the background while you're performing other work at home, even then it may be a stretch but it certainly doesn't deserve much better.", "created_at": "2020-08-23T12:48:55.040Z"}, {"movie_id": 458305, "review_id": "5f5310f2b234b900371d1da5", "rating": 7.0, "review_text": "Vivarium was eerie and creepy, and definitely a movie that will mess with your head, albeit probably in ways other than you anticipated. You'll be tricked in the beginning into believing this movie is actually a sociological observation of the slow and robotic death of suburban life: you and your nuclear family settle into middle class conformity in a large, seemingly endless design of mazes and hedges, condemned to repeat the endless cycle of home, school (or work), home, sleep, rinse and repeat. And it certainly gives one those unsettling vibes, especially when the creepy box with the build-a-baby arrives at their prison doorsteps.\r\n\r\nRather, this is something else entirely. While it does well maintaining that nearly subtle sense of wrongness, of something being terribly just _off_, in the end, you may find yourself somewhat disappointed, as it is at this precise moment the film becomes like every other movie of its kind out there. Quite possibly, it is the end that is the most disturbing, for it seems to insinuate that humanity is as disposable as livestock.", "created_at": "2020-09-05T04:15:46.379Z"}, {"movie_id": 458305, "review_id": "62418b655a9915005d555fa6", "rating": 5.0, "review_text": "A young couple go to an estate agent to seek out their dream home. They encounter the almost robotic \"Martin\" who offers to show them their ideal residence - and so off go Imogen Poots and Jesse Eisenberg to inspect. They discover a typical detached house in the suburbs, surrounded by identical homes that leave them a bit cold. When their guide disappears, they decide to go home - except; they are caught in a labyrinthine network of streets that always brings them back to \"No. 9\". Soon, a baby in a box arrives and their happiness ought to be complete - except they have no other human contact and so slowly, but surely, start to go a bid mad. The kid has an infuriating habit of screaming loudly when he doesn't get what he wants - and I felt much like screaming myself as the cyclical pointlessness of this really dreary film did start to get on my nerves. Perhaps Lorcan Finnegan intended the potency of the sterility of the whole thing to engender a feeling of irritation from his audience; if he did then top marks. Otherwise, this is a total waste of the talents of two actors who could have found better ways to help us pass 100 minutes.", "created_at": "2022-03-28T10:18:13.285Z"}]