[{"movie_id": 290250, "review_id": "57c8b5f0c3a3685bfc000b1c", "rating": 8.0, "review_text": "> An unexpected and thoroughly entertained retro comedy!\r\n\r\nIt all began from this year's Oscars, I saw this pair for the first time and I knew its their film promotion strategy. So I went to look for the full details and I thought I'll end up as another silly comedy like 'Daddy's Home'. That's why I did not bother to check it out its teaser and trailer, but now I feel terrible for my crappy judgement. Because this was an awesome movie, definitely not just in the comedy category, but overall one of the best films of the year and it should be in everybody's top ten or twenty and nothing less.\r\n\r\nIt is a retro type film that takes place in the late 70s, LA. Where two private investigators unlikely come together to probe a mysteriously reappeared porn star from the dead as what her aunt says. But later that connects with another high profile missing girl case and so with all the leads, these two goes the length risking their lives to solve it. The remaining story reveals whether they succeed or end up as the losers.\r\n\r\nIt was from the director of 'Iron Man 3' who wrote it keeping in mind as a television series, but later turned into this beautiful comedy. The first thing is I loved the Ryan and Russell's performances. They totally nailed it, especially Ryan Gosling in many comedy scenes. I think I laughed a lot and better after a long time. That's a surprise, you know, I did not think they can do comedies, but they're beyond all the praising words.\r\n\r\nIt's not just two of them, there is a mini 'Nancy Drew Reporter' kind of character. A teen girl joins them in the investigation and her part as well had a great impact on the narration. You would think you can predict the story, but it is a well written screenplay with many twists. Everybody did their job so well, even the two hours did not look too long, but went very quick. The cast, crew, production, all must return for a sequel and I hope it will happen very soon. A must see film, but for the grown ups only.\r\n\r\n8/10", "created_at": "2016-09-01T23:12:48.263Z"}, {"movie_id": 290250, "review_id": "57df386992514135dc00a30d", "rating": 7.0, "review_text": "I've never been a Ryan Gosling fan. No movie ever before has come as close to turning me around in that than _The Nice Guys_.\r\n\r\nDirector Shane Black is in top form with broad appeal, terrific performances, and honestly more humour than anything I've seen in years.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2016-09-19T00:59:21.627Z"}, {"movie_id": 290250, "review_id": "5c3b5df9c3a3680866486fca", "rating": 9.0, "review_text": "Waltons, Poronography, Tricky Dicky, Hitler, Equanimity, Bumble Bees ... And Stuff!\r\n\r\nThe Nice Guys is directed by Shane Black and Black co-writes the screenplay with Anthony Bagarozzi. It stars Russell Crowe, Ryan Gosling and Angourie Rice. Music is by John Ottman and David Buckley and cinematography by Philippe Rousselot.\r\n\r\n1977 Los Angeles and a private detective and a muscle for hire enforcer wind up on the same case looking for a missing girl. Can opposites really attract? More importantly, can they survive not just the perils of a case that gets murkier the longer it goes on? But also each other?\r\n\r\nI don't care if Colonel Mustard did it in the study with a candlestick. I just wanna know who he did it with and get the pictures.\r\n\r\nHow wonderful to have had Shane Black back in his comfort zone and producing such a joyful buddy buddy neo-noir of considerable substance. It was eleven years since the superb Kiss Kiss Bang Bang had reminded us that Black had few peers when it came to blending high action macho twosomes who are also armed with sharp tongues to match, this was after all the guy who also penned Lethal Weapon and The Last Boy Scout. The idea for The Nice Guys had sat in gestation for a number of years, finally it was unleashed to reward fans of his work and for those in sync with the style of film making he homages.\r\n\r\nMuch like his other buddy scriptings, we are in the company of two mismatched guys. Gosling's ex-cop Holland March is a bit goofy, afraid of the sight of blood and morally bankrupt. Crowe's muscle for hire Jackson Healy beats people up for money, but he's a stand-up guy, likes his pet fish, even has a hero streak. What binds them together is troubled family baggage, that they are both men in search of a better world, to be better men themselves, and thus Black - to give them a chance of life improvement - pitches them into the seamy underbelly of the L.A. pornography industry - with some corruption elsewhere thrown into the equation.\r\n\r\nAs a coupling March and Healy prove to be a riot. Crowe is menacing and funny with it, Gosling is affably flaky but charm personified, and thankfully both men have a knack for visual comedy (see Gosling's Lou Costello homage and Crowe's reaction to a henchman's act of fish murder). Crucially both actors can deliver killer lines, which is an absolute must for a Shane Black inspired production, for here there is never any let up, zingers are unbound. Then there is Rice (superb and actually the third lead in the play) as March's 13 year old daughter, she's got youthful zest and a killer matter of fact skill in reacting smartly to the two men currently dominating her life.\r\n\r\nThe L.A. of the 70s is expertly designed, all blink blink blinkity blink neon lighting, side-burns and disco music, dubious fashions and protest groups protesting about the most mundane of things. Then you got the pornography angle, the 70s a hot-bed (no pun intended) for the sex sells profiteers, the perfect setting for Black to trawl through it all in noir clobber. As a noir piece it has it all, femme fatales, thugs, conspiracies, voice overs and an array of colourfully odd characters (excitable and troubling henchmen, a porno Pinocchio, a young lad willing to flash the contents of his underpants for cash!). And of course there's mysteries to be solved and rocks to be upturned, all of which is played out in a whirl of stylish violence, situational comedy and fluid camera work.\r\n\r\nBlack kind of wants it all, to stay cool whilst having wry observations on the Americana of the era, and he enjoys going close to the knuckle when he can, which to some (not me) will come off as a shock value humour tactic just to ruffle feathers. It's also a minor itch that he sort of snatches from his previous works in search of reassurance - note for instance the similarities between the opening to Lethal Weapon and here with The Nice Guys. But itches be damned, so much fun and hidden dramatic depth on show here, a real treasure that makes you wish Black would stroll down neo-noir lane a bit more often. Don't believe me? Then may Richard Nixon come after you the next time you go for a swim in the pool! 9/10", "created_at": "2019-01-13T15:49:13.321Z"}]