[{"movie_id": 1726, "review_id": "59cc634fc3a3682aa30065a3", "rating": null, "review_text": "Imaginative illustration of an epic story. It combines the modern background society, e.g. terrorism, with the unconventional high-tech fantasy. Our leading actor Robert Downey Jr. deeply embodies the soul of the Iron Man in himself. We common people never lived this way :P", "created_at": "2017-09-28T02:49:51.429Z"}, {"movie_id": 1726, "review_id": "5b1520a00e0a262df1009196", "rating": 8.0, "review_text": "**A long form review originally posted in 2010:**\r\n\r\nMarking the beginning of the latest Marvel franchise, _The Avengers_, is Jon Favreau's _Iron Man_.\r\n\r\nI'm quite fond of Super Hero movies, I don't love them to the same extent that I do the slasher or psychological thriller genres, but they do hold a small place in my heart all to themselves. I'm pretty pumped for this whole \"Avengers\" thing to come to fruition, 'cause honestly it's all been great so far, starting with Iron Man, whom Robert Downey Jr. (_Natural Born Killers, Gothika, Kiss Kiss Bang Bang, A Scanner Darkly, Zodiac, Sherlock Holmes, Due Date_) portrays, and incredibly so.\r\n\r\nIt's important to set yourself a starting point. More specifically, what I mean is, a reason. Batman's parents were murdered, and his home was destroyedby crime; The Punisher's whole family was murdered in front of him and he big-time snapped; characters like the X-Men and the Fantastic 4 are defending themselves and end up having a penchant for world-saving. Those are all fine, and so long as you have one, I'm happy. But I really kind of like Tony Stark's reason for becoming Iron Man... He's a dick. That's why. He's a dick that supplies the world with the most lethal weapons in existence, and they take lives left, right and centre. Then, he's put through the world where they get used, and finally is told by the person who helped him escape that world, not to waste his life. He believes he is still alive for a reason, he decides that reason is to become a dick that is intent on privatising world peace. Which I think makes perfect sense.\r\n\r\nThat may have come across as sarcasm, but I was deadly serious. Tony Stark becomes Iron man, and that's why. It works fantastically. We then get to see all the incarnations of his suit, how difficult it was to make, what it runs on, the technology, everything. And I'm a huge fan of back story, which Iron Man delivers.\r\n\r\nIt's sort of the antithesis of DC's _Batman Begins_. Though they're both young adults that come from money with no family, a British butler (although Iron man's butler Jarvis was transformed into AI for the film [he was an actual person in the comics]), they have a board of directors take care of their family's billionaire business until they're ready to eventually take the reins, they both become \"____ Man\" and go about saving the innocent, not through superpowers but technology. I'm sure I could go on. But they're also incredibly different. Where Batman is a total bad ass, the gothic unknown defender of the night that uses fear as a weapon to protect his home town, and yet refuses to kill; Iron Man is a bright, shiny, loud attention grabber, who goes all international to fight crime, he wants the world to know he's Iron Man and his enemies are totally lame, so no wonder he has no qualms about killing! Batman's secret identity, Bruce Wayne, is an angsty tosser, that tries way to hard. But Tony Stark, is a witty, brilliant inventor, who has basically harnessed all of Batman's training, strength, weapons, vehicles and flight, improved them, and put them in to a single suit. So though I personally prefer Batman as a hero, I prefer Tony Stark as a character.\r\n\r\nThe interaction between Stark and Pepper Potts, played by Gwyneth Paltrow (_Se7en, The Talented Mr. Ripley, The Royal Tenenbaums, Sky Captain and the World of Tomorrow_) was incredible. It just goes to show what good casting can achieve, even in an action flick, the dialogue is hilarious and clever. Is it possible for a Super Hero movie to be a bad Super Hero film but a great film? I guess it is.\r\n\r\nThe antagonists are lacking to say the least, and their dispatching leaves even more to be desired. Which is normally not too huge when you get the rest so perfect, unfortunately, it's a comic book film, about Super Heroes, and Super Villains. They fight one another over and over, in fact that's pretty much what the comics are about in their entirety, so it's quite a major short coming. That being said, it's really the only one that _Iron Man_ has. In a way though, they're a similar comparison to the latest Batman films again; Iron Monger and Whiplash are flashy, but disappointing, where The Joker, Two-Face, Scarecrow and Ra's al Ghul are top notch as bad guys. Whereas Ironman's Obadiah Stane and Ivan Vanko were great characters, but Batman's The Joker is only seen in his villain persona, and Harvey Dent, Jonathan Crane and Henri Ducard are nothing more than vessels for their alter-egos.\r\n\r\nAll that aside, the film is just plain good, and you don't need to be a fan of Iron Man, Super Heroes or comics in general to enjoy _Iron Man_.\r\n\r\n82%\r\n\r\n-Gimly", "created_at": "2018-06-04T11:21:04.377Z"}, {"movie_id": 1726, "review_id": "5c8427cc0e0a2642fe63694b", "rating": 8.0, "review_text": "Iron Man did a lot more than just launch the Marvel Cinematic Universe. It was the first comic book movie in a long time to integrate the fantastical nature of superheroes and supervillains into a real world setting with consequences. It also showed how great of a filmmaker Jon Favreau is and rebooted the career of Robert Downey Jr.\r\n\r\nFor all this, Iron Man is a fantastic movie, still one of the best MCU films. It's so much fun to watch. Yet it displays a lot of intelligence, exploring the internal dilemma of a man profiteering off war when faced with the harsh reality that he is part of a system that corrupts absolutely.", "created_at": "2019-03-09T20:53:32.540Z"}, {"movie_id": 1726, "review_id": "5e4a051a9b8616001662e541", "rating": 8.0, "review_text": "When director Jon Favreau and Sarah Halley cast Robert Downey Jr, they glimpsed something magnificent: a more-than-skilled actor who faultlessly portrayed the role of Tony Stark. Despite Favreau's initial decision in choosing a fresh face, he ended up delighted due to his charismatic, natural and comfortable attitude. He did not realise it yet, but he was moulding with the right measures a whole superhero cinematic universe which lasted until today and still goes for more.\r\n\r\nThe filmmakers took the proper time to introduce a character whose production was undecided since New Line Pictures argued that the main character [Iron Man] had no potential to be brought up to the theatres. Therefore, planning from scratch a prosperous superhero who was not related to the typical Fantastic Four, X-Men or Spider-Man [famous superhero films of the 2000s] was quite a challenge. However, the director unquestionably demonstrated his skills at the visual effects, the rock metal music, the accurate dialogues for each moment and finally, the remarkable development of each persona. How exactly?\r\n\r\nEstablishing the visual effects of a high-speed-altitude enthusiast was marvellous, considering the time of the creation. The way Favreau adjusted the Iron Man gave numerous innovative perspectives of a superhero while in battle. If we first watched the 'Spidey Sense', then it was time to behold the flying upper and upper. What an achievement ladies and gentleman! Taking into account the sound effect, it was splendid in every single way because it gave decent time to evoke emotions, from sadness to awesomeness, it permitted to feel the sensation of building a strong armour or flying as fast as possible. \r\n\r\nMan! That AC/DC hard rock music was well-defined to this fascinating character. Did I mention that Downey's son is growing on music? He has a band, and it's called \"The Dose Band\". Just watch the School of Rock's report. Probably there is where the influence came by. On the other hand, this film gives such iconic quotes which will live on our memory: \"Is it better to be feared or respected?\", \"Sometimes you gotta run before you can walk\", \"I am Iron Man\". WOW! What potential we have got here! Finally, but not least, the impeccable action scenes and drama ones were the highest achieves Iron Man had got. The sequence in the cavern traped with Dr Yinsen serves to the protagonist time to reflect on himself and the responsibility he has in protecting the world against high-tech diseases.\r\n\r\nPlus, the very unusual but gorgeous chemistry between Tony Stark and his secretary/companion Pepper Potts is another striking feature which is not considered at all was. When Kevin Feige, the current president of Marvel Studios, was asked about his desition about casting Gwyneth Paltrow he confessed the following: \"Gwyneth is the embodiment of a leading lady. She brings intelligence, poise and an incredible range of talent to this role\". Throughout the movie, these two characters happened to be facing their professional and sentimental relationship naturally owing to the Iron Man. The way Pepper Potts clings on to the fact that his beloved boss is in troublesome scenarios, it's just pure tenderness and shows how much potential this couple has.\r\n\r\nThe cast assuredly introduced not only convincing performances but strong characters which will be handy for the following Marvel instalments, just watching Jeff Bridges as the badass Iron Monger is superb! The film producer nailed it! If someone asked me about the flaws it has presented, probably I would say the dark tone, some petit explicit scenes (bearing in mind there are children as spectators) and the lack of sense of humour at times. Still, it is mostly pure perfection.\r\n\r\n[83/100]", "created_at": "2020-02-17T03:14:34.761Z"}, {"movie_id": 1726, "review_id": "5e4a06c32d93750017a9b05b", "rating": 8.0, "review_text": "When director Jon Favreau and Sarah Halley cast Robert Downey Jr, they glimpsed something magnificent: a more-than-skilled actor who faultlessly portrayed the role of Tony Stark. Despite Favreau's initial decision in choosing a fresh face, he ended up delighted due to his charismatic, natural and comfortable attitude. He did not realise it yet, but he was moulding with the right measures a whole superhero cinematic universe which lasted until today and still goes for more.\r\n\r\nThe filmmakers took the proper time to introduce a character whose production was undecided since New Line Pictures argued that the main character [Iron Man] had no potential to be brought up to the theatres. Therefore, planning from scratch a prosperous superhero who was not related to the typical Fantastic Four, X-Men or Spider-Man [famous superhero films of the 2000s] was quite a challenge. However, the director unquestionably demonstrated his skills at the visual effects, the rock metal music, the accurate dialogues for each moment and finally, the remarkable development of each persona. How exactly?\r\n\r\nEstablishing the visual effects of a high-speed-altitude enthusiast was marvellous, considering the time of the creation. The way Favreau adjusted the Iron Man gave numerous innovative perspectives of a superhero while in battle. If we first watched the 'Spidey Sense', then it was time to behold the flying upper and upper. What an achievement ladies and gentleman! Taking into account the sound effect, it was splendid in every single way because it gave decent time to evoke emotions, from sadness to awesomeness, it permitted to feel the sensation of building a strong armour or flying as fast as possible. \r\n\r\nMan! That AC/DC hard rock music was well-defined to this fascinating character. Did I mention that Downey's son is growing on music? He has a band, and it's called \"The Dose Band\". Just watch the School of Rock's report. Probably there is where the influence came by. On the other hand, this film gives such iconic quotes which will live on our memory: \"Is it better to be feared or respected?\", \"Sometimes you gotta run before you can walk\", \"I am Iron Man\". WOW! What potential we have got here! Finally, but not least, the impeccable action scenes and drama ones were the highest achieves Iron Man had got. The sequence in the cavern traped with Dr Yinsen serves to the protagonist time to reflect on himself and the responsibility he has in protecting the world against high-tech diseases.\r\n\r\nPlus, the very unusual but gorgeous chemistry between Tony Stark and his secretary/companion Pepper Potts is another striking feature which is not considered at all was. When Kevin Feige, the current president of Marvel Studios, was asked about his desition about casting Gwyneth Paltrow he confessed the following: \"Gwyneth is the embodiment of a leading lady. She brings intelligence, poise and an incredible range of talent to this role\". Throughout the movie, these two characters happened to be facing their professional and sentimental relationship naturally owing to the Iron Man. The way Pepper Potts clings on to the fact that his beloved boss is in troublesome scenarios, it's just pure tenderness and shows how much potential this couple has.\r\n\r\nThe cast assuredly introduced not only convincing performances but strong characters which will be handy for the following Marvel instalments, just watching Jeff Bridges as the badass Iron Monger is superb! The film producer nailed it! If someone asked me about the flaws it has presented, probably I would say the dark tone, some petit explicit scenes (bearing in mind there are children as spectators) and the lack of sense of humour at times. Still, it is mostly pure perfection.\r\n\r\n[83/100]", "created_at": "2020-02-17T03:21:39.884Z"}, {"movie_id": 1726, "review_id": "5fff7be5678259003f9c26bd", "rating": 9.0, "review_text": "My first taste of the Marvel Cinematic Universe. A great start!\r\n\r\nI absolutely enjoyed seeing <em>'Iron Man'</em>. Robert Downey Jr. is terrific as the titular character, who is a blast to watch throughout - love the design! The plot is very entertaining, I like how it tells the story; simply, but very effectively. Terrence Howard, Jeff Bridges and Gwyneth Paltrow, meanwhile, all add to the film with good performances.\r\n\r\nThe special effects are very neat, as are all the action sequences. I will say the score isn't the strongest, at least in terms of what I'd expect from this sorta film. I wouldn't say it's bad per se, just not as spectacular as it could've (should've?) been; especially with someone like Ramin Djawadi composing. I love a film with great music, so hopefully that improves as I watch the MCU expand.\r\n\r\nI know, I'm extremely late to this particularly party but happy to finally begin watching.", "created_at": "2021-01-13T23:01:57.379Z"}, {"movie_id": 1726, "review_id": "62b2f1cdc2bcc60064d23b74", "rating": 9.0, "review_text": "**An excellent film, which only loses a little in some details related to the writing of the script and the conception of some characters.**\r\n\r\nI'm not a fan of superhero movies, but like any movie fan in general, I've seen a good handful of them. This was the first film made by Marvel and financed by the company itself, and it brings us one of its most acclaimed heroes. The film shows how a young playboy millionaire named Tony Stark, with a fortune inherited from his father and largely made from the production and sale of weapons, becomes a vigilante determined not to allow the misuse of the weapons he sells. I don't know much about comics, but I believe that the film was limited to adapting to the cinema a story already written on paper about the origins of the character, giving it, perhaps, a touch of the present.\r\n\r\nThe plot is one of the strongest points of the film, not only for the way it introduces the character in the context of the current geopolitical conflicts (with the Middle East issue very present), but mainly for the way it transforms Tony Stark into a deeper character, who lives a catharsis that opens his conscience to questions that he was not sensitive enough to understand. Put more simply, if initially Stark was a rich and spoiled idiot, he ends the movie with another awareness of what he should do and how his attitudes influence the world around him. However, I also felt that once Stark realizes what he has to do, and it becomes clear who the enemy is to defeat, the script quickly loses quality and becomes much more basic and underdeveloped.\r\n\r\nWith a skillful direction provided by Jon Favreau, the cast gave us a very good performance. Of course, the public's attention is focused on Robert Downey Jr., an actor who started working in the 80s, but only began to emerge at the turn of the millennium, with some productions (*Gothika*, *Good Night and Good Luck*, *Zodiac*) that he entered before accepting Marvel's proposal. He is perfect in character and gives us his life's work as an actor. Beside him, we can still admire Gwynneth Paltrow, in a more discreet but competent role. The villain was secured by Jeff Bridges, but his work is not so well executed and the actor sometimes doesn't seem to know exactly how to behave in the character.\r\n\r\nWhat can we say about the production values ​​and technical quality of a movie with a millionaire budget of 140 million dollars? It is a film determined to be a blockbuster, which fully achieved all its objectives, earning high profits, pleasing the fans and achieving high praise from the general public and the specialized critics. And the money invested is in plain sight, with a declared bet on very high quality CGI, wonderfully well-executed sound and image effects and really good sets and costumes (with great emphasis - obviously - on Iron Man's suit and Stark's mansion). The cinematography is excellent, the filming work was really well done, and the editing was detailed, giving the film a pleasant rhythm that doesn't tire us out. Finally, a note of praise for the excellent and epic soundtrack.", "created_at": "2022-06-22T10:41:17.556Z"}, {"movie_id": 1726, "review_id": "63e70b189512e100cd71482a", "rating": 10.0, "review_text": "**Iron Man had all the class, quirks, genius, and fun to birth one of the greatest film franchises in cinematic history.**\r\n\r\nThe movie that started it all. That created the personality of a multi-billion dollar entertainment behemoth. That introduced the world to the first of many characters that have become household names and cultural icons. Iron Man stormed on the screen with a lead actor that Hollywood had given up on and a small start-up studio without a single movie under its belt backed by Disney, who had little to no live-action comic experience of their own. But director Jon Favreau’s adlibbed approach leveraged the strengths of his cast and created a world that was simultaneously realistic and magical - where a man could build a flying suit of armor, or a Thunder god could fall in love with a quirky mortal. Many forget that Robert Downey Jr’s personal struggles had left him blacklisted by many in Hollywood, making his casting a risky stroke of brilliance. The result of all this was precisely the lightning in a bottle needed to birth the Marvel Cinematic Universe.", "created_at": "2023-02-11T03:27:20.734Z"}, {"movie_id": 1726, "review_id": "64a4ef88158c8500acb3e480", "rating": 6.0, "review_text": "An ok movie. I just wish there was more action. The storyline was great but could have been a lot better with more action.", "created_at": "2023-07-05T04:20:24.957Z"}]