[{"movie_id": 40805, "review_id": "55f541eb9251415cf8000d5d", "rating": 7.5, "review_text": "Disclaimer: This Reviewer Knows Nothing About The Origin Shows Whatsoever!\r\n\r\nYou kinda feel as an amateur reviewer that you need to spell out that you have no affinity with a comic book/TV/film franchise. For the venom and bile that gets spewn by fans of said franchises when filmic adaptations don't meet expectations - can get quite scary at times!\r\n\r\nThe Green Hornet was released in 2011 and I remember how poorly it was received by the fans of the origin productions. Nothing new there in reality, Green Lantern, that was also released this same year, received the same treatment. So how does something like The Green Hornet stack up to someone who's just after a mindless couple of hours of high energy thrills and witty repartee?\r\n\r\nIs it funny? Is it packed with action? Is it showcasing some nifty set pieces, some nifty set design and some bonkers escapism? Well the answer is yes to all of those. The writing away from the gags is nothing to get excited about (Cameron Diaz gets short shrift on the page), while if you have an aversion to Seth Rogen this is a film to make you choke on your own vomit, but to the standard super hero/crime fighting frolics fan, this has it all. Including Christoph Waltz having a great time as the villain and Jay Chou being simply wonderful.\r\n\r\nFart gun and disco santa, bromance and car carnage, delightful. Sorry Hornet purists, it's a riot. To me at least... 7.5/10", "created_at": "2015-09-13T09:29:15.684Z"}, {"movie_id": 40805, "review_id": "5a75ec4e925141059c03394b", "rating": 2.0, "review_text": "My what a disappointment! I was kind of looking forward to this movie. I had read a few of the magazines as a kid and I think I might even have had a Green Hornet toy car. A masked hero with a martial arts expert and mechanical genius as his side kick and a really cool car. Not one of those ridiculous wimpy ones but a real old-fashioned American car having a large V8 engine with the proper sound and everything. So what could go wrong?\r\n\r\nWell a lot! Half way through the movie I was wondering how bloody stupid the producer really thought the audience was. The bad guy was a total joke. Completely wacko in a very stupid way. Not fun at all. But the worst thing was that the hero, played by Seth Rogen, was even more stupid. He was nothing but a dumbass, loudmouthed, idiot throughout the entire movie. Even when he wasn’t directly screwing up just the fact that he was in the scene and opened his mouth was enough to ruin it.\r\n\r\nAnd what about these ridiculous slow motion scenes with the targets flashing red just before some action taking place? The guys where not supposed to have real superpowers so stop making it look like they had for Christ sake! Seth Rogen had a part in writing the script as well and that was probably a huge mistake. Scripts should be left to professionals and not wannabe comedians.", "created_at": "2018-02-03T17:07:26.238Z"}, {"movie_id": 40805, "review_id": "5f19dce4447f9c00373b5d2d", "rating": 6.0, "review_text": "Decent watch, might watch again, but I don't feel it's a confident recommendation.\r\n\r\nI know it's based off a (1936) vigilante hero that actually pre-dates Batman (1939), and that means there is a long, rich history there, but....I don't care.  I'm not sure why it started, and I don't feel like researching it.\r\n\r\nThis movie, looks like it just lifted part of Seth Rogen's life and put a Green Hornet skin on it.  I'm sure he pays some asian guy to perform martial arts for him while he parties.  Jokes aside, it was nice to see Rogen hit his limit on a believable action front: which does involve someone else (in this case, Jay Chou)  doing most of the work.\r\n\r\nRogen fits right into the role of a spoiled, obnoxious party boy, but even though he's supposed to be the funny one, Jay Chou is just as funny with Cameron Diaz putting out some humor as well.\r\n\r\nI'm clearly not a Seth Rogen fan, and I don't think I'm a Green Hornet fan: I'm realizing I'm not even a Batmobile fan just now.  I guess I'm not into cool cars, and a firefight is a firefight, having a gas gun isn't interesting.\r\n\r\nAll said and done, it's a good experience, there are just a lot of other movies, even \"super\" hero movies to watch before this.", "created_at": "2020-07-23T18:54:28.997Z"}]