[{"movie_id": 333371, "review_id": "576d7e939251410af900032b", "rating": 8.0, "review_text": "> Adds a new perspective to the original film yet it retained the mystery.\r\n\r\nInitially it was called 'The Cellar', but later it became spin-off to 'Cloverfield'. It was a regular type screen narration, unlike the first film as a found footage style. But if you the original film fan, especially monster film fan, you might end in a disappointment. Because it was a psychological-thriller-mystery than the sci-fi-action-adventure.\r\n\r\nOnly the final act determines where and how it actually connects to the Cloverfield universe, yet not very evident other than the clue the title had given and the filmmakers insisted that is indeed from the same franchise. Because I felt, it was very close to other alien invasion films like 'Skyline' and 'Battle LA' or even the latest 'The 5th Wave' than the 'Cloverfield'.\r\n\r\nI surely enjoyed this film, like an another crazy bunker hideout theme and something which is quite similar to the recent 'Room'. Since they have revealed its association with the 'Cloverfield', I expected different kind which was actually insanely misled everybody. If there won't be a sequel, then the link between the two films are unnecessary, so I'm waiting for that. But still a very good film without those mix-ups. And I recommend you all to consider it as a one-off film in order to have a great watching experience.\r\n\r\nAnother limited cast film with barely a four characters in it and shot in a single location that cost just $15m, but earned in multiple folds. All the credit goes to the marketing tactics to tie it up with the 2008 blockbuster. It would have also done great independently, in the end everybody, including fans and filmmakers are happy for what it is now.\r\n\r\nThe suspense was so good, but it was carried out for too long. The third act picked up its pace like hell which was obviously anticipated since 'Cloverfield' hooked to it. When everybody was thinking of monsters, it is going to delivers differently and that's how the film fairs.\r\n\r\n7.5/10", "created_at": "2016-06-24T18:40:19.124Z"}, {"movie_id": 333371, "review_id": "57ad1821c3a36820610011f6", "rating": 9.0, "review_text": "Though I tend to go for older science fiction, and, on top of that, from proven directors, two things sold this for me (and I ALMOST ended up seeing this at theatres as a result): John Goodman and J.J. Abrams--the first being solid in everything he does and the second with the Midas touch, especially when it comes to my favourite of genres. I really admired its originality. The cloying nature of the antagonist, the ambiguity of the unique situation and the way everything was tied together quite neatly left me both very satisfied as a cinephile and yearning for hopefully its inevitable sequel.", "created_at": "2016-08-12T00:28:17.974Z"}, {"movie_id": 333371, "review_id": "58812913c3a368145b0020b0", "rating": 9.0, "review_text": "People are strange creatures. You can't always convince them that safety is in their best interest.\r\n\r\n10 Cloverfield Lane is directed by Dan Trachtenberg and collectively written by Josh Campbell, Matthew Stuecken and Damien Chazelle. It stars John Goodman, Mary Elizabeth Winstead and John Gallagher Jr. Music is by Bear McCreary and cinematography by Jeff Cutter.\r\n\r\nMichelle (Winstead) awakes from a car crash to find she is in a locked underground shelter...\r\n\r\nFrom the off it has to be said that to know nothing about this film prior to viewing it will be an absolute bonus. For the rewards are plenty. Trachtenberg and his team have crafted a film that is tense from the get go, a piece that consistently has you wondering just what the hell is going on, not only are we puzzled by the three character dynamic in the shelter, particularly as regards Howard (Goodman), the proprietor of this particular shelter, but also just what has happened in the outside world? If anything? This only helps further the claustrophobic feel that's already brought about by the location setting of the tale.\r\n\r\nA key strength of it, is that it, via Michelle's mindset, coerces us viewers into feeling her unease, and yet conversely we rejoice at her resourcefulness. On the same side of the coin comes her relationship with the third party in the shelter, Emmett (Gallagher Jr), it grows honestly and offers hope in what looks to be a bleak situation. But of course as tale unfolds, things start to come together, edgily so, with little spurts of action, shocks and genuine dread, all building up to the big finale, the reveals. Which will either have you spitting feathers or cursing the makers for the routes taken...\r\n\r\nSuperbly acted by the three principals (it's great that some film makers still realise Goodman is a major talent), and technically impressive for sound and vision, this coiled spring thriller is a winner. 8.5/10", "created_at": "2017-01-19T21:01:07.838Z"}, {"movie_id": 333371, "review_id": "58c172b9925141732f00b4ea", "rating": 5.0, "review_text": "This film started out like Misery and Moon but turned into The Mist. I knew that being a sequel to Cloverfield (which I liked) it might be about aliens but I forgot about this due to how well written it was.\r\n\r\nIt constantly kept giving you questions and contained a lot of tension filled confrontations with John Goodman (thanks to the great screenplay by Damien Chazelle).\r\n\r\nI kind of forgot the direction that the movie would probably go and wasn't too convinced by the ending.\r\n\r\n★★½", "created_at": "2017-03-09T15:20:25.242Z"}, {"movie_id": 333371, "review_id": "640b2e1718b75100e8c1f73c", "rating": 7.0, "review_text": "\"10 Cloverfield Lane\" is a 2016 psychological thriller directed by Dan Trachtenberg and starring John Goodman, Mary Elizabeth Winstead, and John Gallagher Jr. The movie is a standalone story that takes place in the same universe as the 2008 movie \"Cloverfield,\" but it can be enjoyed without any knowledge of the original.\r\n\r\nThe movie's plot revolves around Michelle (Mary Elizabeth Winstead), a young woman who wakes up in an underground bunker after being in a car accident. She soon learns that she is not alone, as the bunker's owner Howard (John Goodman) and another survivor, Emmett (John Gallagher Jr.), are also living there. Howard claims that the world above ground has been destroyed by a chemical attack, and that they are the only survivors. As the days go by, Michelle becomes increasingly suspicious of Howard's story and begins to investigate what is really happening outside of the bunker.\r\n\r\nOne of the strongest aspects of \"10 Cloverfield Lane\" is its cast. John Goodman delivers a stunning performance as Howard, a complex and fascinating character who oscillates between kind and sinister. Mary Elizabeth Winstead also delivers an outstanding performance as Michelle, who is smart, resourceful, and determined. John Gallagher Jr. is also very good as Emmett, providing comic relief and a counterpoint to Howard's eccentricities. The chemistry between the three leads is palpable, and their interactions are the driving force of the movie.\r\n\r\nAnother strength of the movie is its pacing. The movie is well-crafted, with a tightly plotted script that keeps the audience on the edge of their seats. The tension is expertly managed, with moments of respite used to build up suspense even further. The direction and cinematography are also top-notch, with the claustrophobic bunker scenes shot in a way that makes the audience feel as if they are trapped with the characters.\r\n\r\nOne minor flaw of the movie is its ending. Some viewers may find it unsatisfying, while others may find it to be the perfect conclusion to the story. However, it is consistent with the movie's themes and tone, and it ultimately comes down to personal preference.\r\n\r\nIn conclusion, \"10 Cloverfield Lane\" is a remarkable movie that deserves to be seen by anyone who loves psychological thrillers. The strong performances from the cast, taut script, and excellent direction make it a must-watch movie. I would rate it 7 out of 10.\r\n\r\n \r\n\r\nWritten and Reviewed by RSOliveira", "created_at": "2023-03-10T13:18:15.581Z"}]