[{"movie_id": 7326, "review_id": "549e91ac9251413123007ce7", "rating": 9.0, "review_text": "Juno is a girl, a totally cool girl who don't take shit from anyone and do whatever she likes. She is not like disrepectful or anything, she just knows who she is and what she likes, even though she thinks that she haven't figured it out yet. She totally has.\r\n\r\nJuno gets pregnant with Bleeker. She thinks about getting an abortion, as it will be the responsible thing to do, but can't get herself to do it (I mean, the kid already has fingernails!), instead she finds a cool couple to adopt the child (Jennifer Garner and Jason Bateman).\r\n\r\nJuno is a movie about being a kid and growing up, about taking responsibility for your life and doing the right thing, even though it's damn hard. I mean, imagine being a pregnant teen on your school... you think people would talk about you? Well, they do... a lot. Also, imagine how your parents would react and how you would react to giving it up, whether its abortion or adoption.\r\n\r\nAnyways, Juno is cool and takes everything as it comes. She'll figure it out eventually, we know this the minute we see her. Nothing will break Juno.\r\n\r\nEllen Page is amazing as Juno, and the rest of the cast is so carefully casted that it's not even funny. Everyone understands their part and while the dialogue is a little movie-ish all the way through, it is also terrible believeable. These people speak this way because they... know themselves and don't give a damn what anyone else thinks.\r\n\r\n_Last words... if you haven't yet, go watch this movie. You don't even need to be a teenager to get it... this is a movie for everyone, boy or girl, man or woman, age 12 or 68. Don't miss out on Juno, she is worth every minute._", "created_at": "2014-12-27T11:02:04.057Z"}, {"movie_id": 7326, "review_id": "6326a473dbcade008313ec9c", "rating": 7.0, "review_text": "This features a strong and characterful  performance from Elliot Page in the title role. She is a young girl who somehow manages to convince her rather naive and drippy boyfriend \"Bleeker\" (Michael Cara) to have sex. When she becomes pregnant, she decides against an abortion and so offers the baby up for adoption to \"Mark\" (Jason Bateman) and his rather obsessive wife \"Vanessa\" (Jennifer Garner). The remainder of the gently entertaining film follows this young woman as she gradually deals with her pregnancy, her relationship with her parents and starts to bond with \"Mark\". It's this latter storyline that begins to illustrate to her not just the cracks in that marriage, but also her own feelings about herself, her unborn child and it's father. The film offers a witty and sometimes quite emotionally effective observation of how she evolves as a person and though the denouement itself is rather flat, it's still quite a fun outing for all concerned. Allison Janney and JK Simmons work well together as her parents who inject a certain amusing realism to the fact that their daughter is expecting a baby, not doing heroine! The dialogue is well written with an enjoying degree of sarcasm and plausibility to it that quite frequently raises a smile.", "created_at": "2022-09-18T04:54:11.893Z"}]