[{"movie_id": 1954, "review_id": "5ea5794035c30a001dbeda5f", "rating": 8.0, "review_text": "You can't change who people are without destroying who they were. \r\n\r\nThe Butterfly Effect - Directors Cut\r\n\r\nThe Butterfly Effect is directed by Eric Bress and Bress co-writes the screenplay with J. Mackye Gruber. It stars Ashton Kutcher, Melora Walters, Amy Smart, Elden Henson, William Lee Scott, Eric Stoltz and Ethan Suplee. Music is by Michael Suby and cinematography by Matthew F. Leonetti. \r\n\r\n\r\nThe title refers to the butterfly effect, the chaos theory of a popular hypothetical situation that illustrates how small initial differences may lead to large unforeseen consequences over time. The plot pitches Kutcher as Evan Treborn who suffers blackouts during critical mments in his life. When older he finds that through reading the journals he has written since a child, that he can go back in time to the significant events and change what happens. Unfortunately each time he does it comes at a great cost...\r\n\r\nIt was mercilessly kicked by the pro critics upon release, not helped by coming at a time when Kucher was something of a kicking post to critics. To compound the misery for the makers, they released a theatrical cut that featured a quite apalling ending. Inspite of these trevails at the time of release, the pic made a pot load of cash at the box office. Once the Directors Cut surfaced, with a key scene added to cement the different - quality - ending, time has seen the stock of the pic rise considerably. So much so that it currently sits at a 7.6 rating on IMDb and a 75% rating on TMDB, wile there are some critics who have come out and admitted they were too quick to judge the first release back in 2004.\r\n\r\nWhat we have is a time travelling corkscrew narrative that is immensely sombre in telling how ones actions can have far-reaching consequences. It's a compelling and often thrilling picture, one that can spark hearty debate about the thematics at work - notably we the audience being forced to contemplate our own actions in life. The pic demands the utmost attention, switching off for a few minutes is a definite no no. Some scenes linger long in the memory as we trawl through the evil that kids and men do, right up to the unforgettable finale.\r\n\r\nThere's plot and logic holes, that are small irritants, and even though this definitely could have been better cast with more senior actors, none of the youthful cast members hurt the picture. It packs a punch, that is on proviso you only see the directors cut. 7.5/10", "created_at": "2020-04-26T12:06:24.388Z"}]