[{"movie_id": 411728, "review_id": "5dda368712aabc0016933a9e", "rating": 4.0, "review_text": "In all likelihood, you will leave this film with a little more of an understanding of how the dictionary came to be, and a little more resentment for Gibson (one of the producers) for pushing this project to happen, regardless of its lacklustre subject. It's pleasant enough, but it's clear England must produce a certain number of period dramas a year and 2019 was just about to fall under the quota - thank god for the dictionary movie. \r\n\r\nUsually with book-to-film adaptations, there is a spike in sales of said book - I can't imagine anyone rushing out to buy a dictionary after this though.\r\n- Brent Davidson\r\n\r\nRead Brent's full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-professor-and-the-madman-mel-gibsons-dictionary-origin-story-a-dry-read", "created_at": "2019-11-24T07:51:35.356Z"}, {"movie_id": 411728, "review_id": "6094467f255dba0043c7a2d6", "rating": 8.0, "review_text": "I really like it. It had a story within a true Story. Which in my opinion made it a little complex and exciting. Good for young adults and up. Teenagers might not find it so compelling but that's just a short time in their life when they're looking for total entertainment and action. This is not that film but there is a great story to be told with a interesting backdrop of facts. Mel Gibson is excellent!! Be ready to be surprised with a few turns and twists. I really like this movie. I think it was very entertaining and interesting and at times exciting. Get your popcorn ready kick back and enjoy a movie that every other word is not the f word or the GD word. I really enjoyed it and as usual, Mel Gibson always deliver.", "created_at": "2021-05-06T19:41:51.855Z"}, {"movie_id": 411728, "review_id": "624215fbc740d9005d780ff2", "rating": 7.0, "review_text": "This is the best effort I've seen from Sean Penn since \"Milk\" almost twelve years ago. His portrayal of the schizophrenic William Chester Minor who, having spent almost 40 years of his life in Broadmoor psychiatric hospital, became one of the single most significant contributors to the orginal Oxford Dictionary of English is superb. He captures the flaws of this paranoid etymologist warts and all, and gels very well with Mel Gibson who, as the compiler of the tome - Dr. James Murray - also turns in a good, strong and, latterly, sympathetic and understanding performance too. This is essentially a double-hander with Natalie Dormer, Eddie Marsan and Steve Coogan helping to explain the story and releasing some of the emotional steam from time to time. It's a little slow in places, two hours could have done justice to this interesting story which seems overly padded at time. As you'd expect; it looks great with plenty of serious attention to detail and it also shines a little light on Victorian/Edwardian attitudes to mental illness.", "created_at": "2022-03-28T20:09:31.538Z"}]