[{"movie_id": 616820, "review_id": "6349a612b7abb50081e7f296", "rating": 4.0, "review_text": "_Halloween Ends_ is such a weird film, as a standalone movie I enjoyed it but in the trilogies totality it underwhelms and undermines. With each entry in this trilogy, the movies get farther and farther away from what Halloween is. With Ends there is no tension and no horror, there are some good kills but with nothing building up to it they felt stale. This movie also tears down Michael Meyers in a way that felt out of place in the trilogy. Halloween Kills built Michael up to be an indestructible force with the ability to withstand fire or multiple gunshot wounds, but in Ends that is flipped on its head making him weak due to the ending of the predecessor. It left me feeling like the writers had no idea what they were doing in developing this trilogy. The marketing of the movie was a total farce as well. It was building up to a final clash between Laurie and Michael, and while that does happen the majority follows a character that was just introduced (Corey Cunningham). Even though I really like the opening sequence and backstory to Corey, it had no place being centerstage in the final installment. Overall, this movie was slightly better than the sequel but still squanders the potential that Halloween (2018) had for the trilogy. If any more movies or trilogies are made in the future, please for the love of God hire a producer/writer to develop the entire series instead of piecing it together film by film.\r\n\r\n**Score:** _44%_ |\r\n**Verdict:** _Poor_", "created_at": "2022-10-14T18:10:26.609Z"}, {"movie_id": 616820, "review_id": "634aed83c8a2d4007a2fdaee", "rating": 5.0, "review_text": "**Poor writing and a confusing story overshadowed a few shining moments and satisfying conclusions to character stories.**\r\n\r\nIt’s so hard to choose whether I liked or disliked Halloween Ends. I enjoyed the resolution to Laurie Strode’s 40-year story arc and the hopeful journey for her granddaughter, Allyson. Even the final showdown between Jamie Lee Curtis and Michael Myers was satisfying, although the story didn’t build to the climax well. Sadly that is where the pros stop. The story was a convoluted mess that ignored all the build-up of the first two films and focused on a new character that didn’t matter to the overall story and didn’t have much impact on the film. As a result, Halloween Ends forgot what made its two predecessors successful and told a pointless meandering tale that had its moments but ultimately disappointed.", "created_at": "2022-10-15T17:27:31.975Z"}, {"movie_id": 616820, "review_id": "634ba83220e6a5007a6a3943", "rating": 4.0, "review_text": "An unfortunate end, to a horror franchise, that started way back in 1978. \r\n\r\nHalloween Ends, is an inarticulate mess, that fails to build on past films. Instead, it delivers an incomprehensible story, that makes little to no sense, save that it brings the overriding story, to a somewhat confused, conclusion. \r\n\r\nOn the upside solid acting and some tense, jump scare moments but really, its not enough.\r\n\r\nIn summary, a reasonable cast in a poorly scripted film, that add's little to nothing that is meaningful, to the tale of serial killer, Michael Myers.", "created_at": "2022-10-16T06:44:02.095Z"}, {"movie_id": 616820, "review_id": "634bc2ebc175b2007f8119bd", "rating": 8.0, "review_text": "It's a sad state of affairs when HALLOWEEN ENDS (2022) is being classed as a \"bad\", \"terrible\" or \"disgraceful\" motion picture and I worry for cinema as a whole if the only direction the mass want is nothing but cookie-cutter.\r\n\r\nThis film is a straaaaaaange beast and it probably holds the world record for the quickest development of a relationship on screen. Bloody hell, I wanted that relationship to succeed.\r\n\r\nI'm going to be controversial here... did we need Michael Myers at all here? Maybe the 2 or so scenes we get in the sewer early into the film and that's it... maybe pass the evil on and Michael die of his wounds.\r\n\r\nThe evil is contagious element worked for me and Corey (played by Rohan Campbell) was the standout character.\r\n\r\nIssues? Yes, there are some - the narration and memoir aspect weren't needed and Corey's mum... erm, I'll leave it there.\r\nBut I admire this film, oh boy do I. I'd rather the risk be taken than them fall back into the same old routine.\r\n\r\nNow, before I start the Corey Appreciation Society, all I have left to say is... give a new biscuit a try.", "created_at": "2022-10-16T08:38:03.810Z"}, {"movie_id": 616820, "review_id": "634f4e13076ce8007a50f716", "rating": 6.0, "review_text": "_Halloween Ends_ does provide what it promises and that’s a proper end to the Laurie Strode saga. However, the birth of a new rushed, hot-headed, and sloppier version of The Shape seems to take precedence only to be squashed before Laurie and Michael meet one last time. Entertaining at times and frustrating at others, _Halloween Ends_ is a bloody scenic route of a conclusion that is mostly satisfying despite its underappreciated albeit risky detours.\r\n\r\nFull review: https://hubpages.com/entertainment/Halloween-Ends-2022-Review-A-Square-Shape-in-a-Round-Horror", "created_at": "2022-10-19T01:08:35.231Z"}, {"movie_id": 616820, "review_id": "63511d36076ce8007a51b6bf", "rating": 5.0, "review_text": "Well there is a hewn-out pumpkin that looks ever so slightly scary... Otherwise, this is just one \"Halloween\" movie too many and it's only scream yells \"put me out of my misery\" pretty much from the start of this slow and plodding denouement to the franchise. Rohan Campbell (\"Corey\") is bullied by some kids who end up shoving him from a bridge. He is dragged into the storm drains by you know who and emerges a man possessed. He has also attached himself to \"Allyson\" (Andi Matichak) who just happens to be the daughter of long suffering \"Laurie\" (Jamie Lee Curtis) and after a bit of hysteric family melodrama, all of her demons are flee-flowing and we are heading, slowly and ponderously to a conclusion that the best of which has already been seen many times in the trailers. This is far too long, virtually nothing happens until the last fifteen minutes and even then, there isn't even the vaguest hint of menace or jeopardy. The production is adequate, but JLC doesn't really feature often enough - as in \"Halloween Kills\" (2021) to make much impact - and the whole thing is episodic and smacks of made for television. Please let it be the final instalment - this bears no resemblance whatsoever to the original 1978 introduction to \"Myers\" et al.", "created_at": "2022-10-20T10:04:38.144Z"}, {"movie_id": 616820, "review_id": "63560465d6c300007ddb6e2b", "rating": 2.0, "review_text": "Okay, seriously, when is the real \"Halloween Ends\" be released? What I saw for the bulk was some lame CW-like story. I have to think at this point David Gordon Green and the writer crew are just pulling a prank. I half expected a post-credit scene with Impractical Jokers...\r\n\r\nI don't even know what to say. I had low expectations going in given how much I disliked Halloween Kills but Ends didn't even meet the lows of the lows. Really dumb. **1.0/5**", "created_at": "2022-10-24T03:20:05.770Z"}, {"movie_id": 616820, "review_id": "6541afcd9cc67b013a2ecb95", "rating": 7.0, "review_text": "My favourite of the most recent three, if not of them all.\r\n\r\n<em>'Halloween Ends'</em> gave me more than I was expecting, if I'm honest. After the solid if slightly underwhelming <em>'Halloween Kills'</em> I thought this may fall further adrift but, happily, it doesn't. I think that I like this the most of all twelve entries after the original, which is probably still a jot above this one in my mind.\r\n\r\nI won't repeat myself too much as I've summed up my overall thoughts on this franchise in prior reviews of those other flicks, but in short I enjoyed this release more consistently throughout and the characters actually interested me a fair amount.\r\n\r\nJamie Lee Curtis is, obviously, the star of the show, but Rohan Campbell is a great addition and Andi Matichak gives her best showing of these David Gordon Green films. In previous installments the cast behind (or sometimes in place of) Curtis have failed to truly entertain me, perhaps aside from the first one and (minimally) <em>'Halloween H20: 20 Years Later'</em>, but here I was happy to follow the scenes involving those behind Curtis.\r\n\r\nI will say that the third act lost me a little in terms of interest, though that's only ever so slightly as all in all I had a good time with this. Let's hope they end this franchise here but I highly doubt that they will - gotta catch that £!", "created_at": "2023-11-01T01:54:21.827Z"}]