[{"movie_id": 512200, "review_id": "5df784bf69c70f00111b2f70", "rating": 5.0, "review_text": "The film is punchy, landing some great jokes that will make you laugh out loud, with an entertaining, slightly predictable story. It wasn’t as good as the first 'Jumanji', but it is a great quality sequel and is full of family fun!\r\n- Lily Meek\r\n\r\nRead Lily's full article...\r\nhttps://www.maketheswitch.com.au/article/review-jumanji-the-next-level-adventure-sequel-is-serious-family-fun", "created_at": "2019-12-16T13:21:03.062Z"}, {"movie_id": 512200, "review_id": "5e2236748f26bc001374b209", "rating": null, "review_text": "The Movie Was So Cool! I Want To Watch The Again And Again!", "created_at": "2020-01-17T22:34:28.302Z"}, {"movie_id": 512200, "review_id": "5e621d3522af3e001add28e8", "rating": null, "review_text": "Fun and exciting. Highly recommended!", "created_at": "2020-03-06T09:51:49.282Z"}, {"movie_id": 512200, "review_id": "5e7d5ac5ab1bc75874c322f6", "rating": 8.0, "review_text": "When it comes to constructing a successful sequel, sometimes it’s best not to mess with a proven formula. Such is the case with “Jumanji: The Next Level,” an energetic, rollicking, ridiculously amusing part two to the much-loved 2017 reboot (and surprise hit), “Jumanji: Welcome to the Jungle.” The storyline is nearly identical, but with a few twists thrown in for added amusement.\r\n\r\nNow in college, buddies Spencer (Alex Wolff), Martha (Morgan Turner), Fridge (Ser’Darius Blain), and Bethany (Madison Iseman) are home for the holidays and can’t wait to see each other again. Spencer has been feeling a little depressed lately and, longing to feel that unbridled bravery again, decides to jump back into the game. It quickly becomes a rescue mission and the others must follow to get him out. But this time, the game has changed. Not only are the levels more challenging, the gang has unexpectedly picked up a couple of extra players — Spencer’s Grandpa Eddie (Danny DeVito) and his longtime friend Milo (Danny Glover).\r\n\r\nThe film was made for fans of the reboot, and it’s nearly impossible to be disappointed this second time around. It’s a fun reunion with likeable characters that you love spending time with. There are appropriate and enjoyable callback references to previous movie and, something that is rarely true of sequels, the quality stands up to it as well.\r\n\r\nWhen the story adds a fun twist that mixes things up a bit, it allows the actors to really chew the scenery. All of the characters are out of whack, with only Martha going back into the game as her original character, the dance-fighting man-killer known as Ruby Roundhouse (Karen Gillan). Fridge is now the overweight cartographer Professor Shelly Oberon (Jack Black), and Grandpa Eddie has taken over as the hunky and fearless Dr. Smolder Bravestone (Dwayne Johnson). Zoologist Mouse Finbar (Kevin Hart) is now Milo, while Spencer re-enters the story as a brand new character (and one of the film’s best surprises).\r\n\r\nIt’s a given that Black will bring guaranteed laughs, but Hart and Johnson have very funny comedic timing and they play off each other so well. Their banter is consistently hilarious, especially when they are channeling their elderly avatar inhabitants. DeVito and his cantankerous shtick is a huge upgrade, as he delivers some of the biggest chortles in his all-too-brief supporting role.\r\n\r\nThere are plenty of exciting action sequences that complement the fast-paced fantasy adventure. The sense of real peril serves the film well, because it ramps up the emotional factor. So does the idea that friendship can foster a family, and by the end, this one will tug on your heartstrings.\r\n\r\nThe film gets right to the good stuff without a long or boring setup, and the story is roughly the same as its predecessor. There’s not much new plot-wise, but who cares when a movie is this much of a wild, entertaining ride?", "created_at": "2020-03-27T01:45:41.197Z"}, {"movie_id": 512200, "review_id": "64a73aeb957e6d00c5dc8be4", "rating": 8.0, "review_text": "Not as good as the other one. I didn't like the whole switching characters. If they would have left that part out, it would have been way better.", "created_at": "2023-07-06T22:06:35.637Z"}]