[{"movie_id": 619803, "review_id": "62d75678cb71b80071d7153d", "rating": 10.0, "review_text": "Since _The Roundup_ is a South Korean film, it feels like it’s able to break away from whatever expectations you may have for an American made action blockbuster. It may be an action and a crime film, but it also adds elements of drama and is borderline horror at times with how extreme some of the action sequences are. Don Lee has undeniable magnetic charisma and is overflowing with unbelievable talent. He’s a certified, bone-breaking megastar. _The Roundup_ is a savagely captivating action extravaganza with lightning fast action and brilliant performances. \r\n\r\n**Full review:** https://hubpages.com/entertainment/Fantasia-The-Roundup-Review", "created_at": "2022-07-20T01:12:24.294Z"}, {"movie_id": 619803, "review_id": "62f96838a313b80084e72e4d", "rating": 8.0, "review_text": "South Korea is rapidly developing something of a reputation for quality action crime dramas. \r\n\r\nThe Roundup, the latest of a series of gritty crime dramas is yet another success story. Based around a simple formula, they pit the worst of organised criminals against a no nonsense hard man Korean copper and his team. Of course, we know the outcome but the ride is well worth taking, nonetheless. \r\n\r\nI did find this latest film a little slow at first but it picks up pace in the second half, delivering no shortage of thrills and violence with a simple but functional, back story.\r\n\r\nIndeed, these films, seem to have filled the space previously occupied by 80's US franchises like the Lethal Weapon series and Death Wish. They have a similarly violent feel, in fact they are a lot more violent and bloody, which may rule out some viewers. \r\n\r\nThe characters like their earlier western counterparts are well rendered and inherently likeable. Chemistry between the cop team is positive and well round, with a splash of humour to lighten the load. \r\n\r\nSo if you are despairing the loss of the kind of gritty US crime cop action flicks, you recall from \"back in the day\", give South Korean films like this one a go. You wont be disappointed.", "created_at": "2022-08-14T21:25:12.611Z"}]