[{"movie_id": 582014, "review_id": "5fd97e24681888003f9b8dec", "rating": 9.0, "review_text": "'Promising Young Woman' is an uncomfortable watch, but in the best way possible. It is a game-changer in every sense of the word, and I don't use that term lightly. It's an A+ thriller that doesn't shy away from talking about real issues that need to be confronted. Not only does it succeed with its story, acting and technical aspects, but it excels as a piece of social commentary, demanding change without spelling it out. It's not going to be everyone's cup of tea - it's made to ruffle feathers - but that's nothing compared to the way so many women around the globe are abused by men daily - and if you're uncomfortable with that, stand up and speak out. \r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-promising-young-woman-nice-guys-no-more", "created_at": "2020-12-16T03:25:24.451Z"}, {"movie_id": 582014, "review_id": "606ca0901cc4ff00581f5aeb", "rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nSince Sundance 2020, everyone who saw Promising Young Woman never once stopped talking about it. From very early Oscar predictions to a guaranteed spot in numerous Top10 lists, Emerald Fennell's directorial debut of a feature film unquestionably impacted every viewer. As usual, I was able to avoid spoilers and managed to escape images, clips, and trailers. Right before the movie started, the only thing I knew about it was that it had a revenge arc. I didn't know what drove the protagonist to pursue this path or what type of revenge I was going to witness. Therefore, I was baffled by the amount of supposedly spoiler-free synopsis in well-known websites that give away so much of the character's motivations and overall narrative. I'm not going to do the same, but if you haven't seen the film yet, beware of these summaries.\r\n\r\nI needed a good night of sleep to process this movie. Fennell's screenplay carries many undeniably impactful moments that left me confused about what I loved and what I didn't enjoy so much, so I waited for my thoughts to settle before I started writing this review. Fortunately, I stand on the positive side for the majority of the cases, most being related to Carey Mulligan's character, Cassie. Several comparisons have been made with the latest version of Arthur Fleck in Joker. While I understand where these come from, the two characters couldn't be more different. Both character arcs are triggered by our society's despicable behaviors, but the protagonists follow a tremendously distinct path.\r\n\r\nOne of the best examples is the depiction of violence in both films. Viewers will be surprised by the development of this topic throughout Promising Young Woman, contrary to the expectedly explicit murders in the comic-book movie. Fennell's film transmits a persuasive, eye-opening message about society's view of rape accusations and men's ability to somehow escape these troublesome situations partially due to the \"innocent\" compliance from our world. From \"the woman shouldn't have been drinking\" to \"they were young and naive\", these ridiculous excuses - and countless more - are inserted deep down into our society's mentality.\r\n\r\nPeople tend to judge the same situation differently depending on who's involved: men, women, straight, gay, white, black, family members, strangers... Fennell's exceptionally clever script develops this idea in a brilliant fashion that never stops being extraordinarily interesting. The absence of lazy exposition scenes elevates every dialogue, giving these an authentic, realistic setting. Every piece of information regarding a particular character's past or a plot-associated revelation is never filmed with the goal of explaining it in detail to the audience but instead as a natural progression of the story. This method of storytelling proves effectively intriguing throughout the runtime, culminating in a shockingly impactful third act.\r\n\r\nOnce again, without spoiling anything, Promising Young Woman is one of the most unpredictable movies I've seen in the last few years. It hit me with a drastic turn every time I believed to finally figure out where the narrative was headed. Cassie is a fully-developed protagonist who sort of goes through a hero journey but doesn't really hold the characteristics viewers usually associate with that type of character. As I mentioned above, I needed more than twenty-four hours to interpret and decide which character actions I actually stand by and which go beyond the line of reason. Despite Cassie possessing emotionally compelling motives, some of her actions mustn't be taken as something that women should do.\r\n\r\nFennell has tremendous care with the messages she's trying to spread, but the inconsistent tonal balance hurts this specific task. To avoid an eventual misunderstood, this film is genuinely hilarious at points, but the transitions between lighthearted, humorous, even romantic scenes and dramatic, emotionally heavy moments are far from perfect. On par with the extremely divisive last ten minutes of the movie, these are my main issues. I could nitpick a few sequences concerning Cassie's vendetta, but honestly, these are so insignificant and irrelevant that I neither want nor need to. Though, I'd have loved to see one scene where things don't go as planned by the protagonist during her introductory act.\r\n\r\nFrom the use of bright, rainbow colors - these pop off the screen - to the interestingly odd variations of popular pop songs, Cassie's arc is accompanied by an outstanding production design (Michael Perry), exquisite editing (Frédéric Thoraval), and a not-that-subtle soundtrack (score by Anthony Willis). Every technical aspect plays a vital role, including the excellent costume design (Nancy Steiner) and makeup work. Even the casting choices of actors who usually portray \"nice guys\" possess the significant purpose of warning the audience that dangerous people do not always look like dangerous people. However, Fennell and Benjamin Kracun (cinematographer) save the best for last.\r\n\r\nA brutally shocking, unforgettable two-and-a-half-minute take will leave every single viewer stunned and in awe of such a challenging scene to film. I can't express by words how much it impacted my viewing of the time left after this particular moment. It's a beautifully shot movie, no doubt about it. Every camera angle has a purpose, as well as the length of each shot. Fennell delivers one of the most technically impressive directorial debuts I've ever seen. Her fascinating storytelling and clear vision are qualities that I hope she'll never lose. It's an extremely risky story that Fennell never gave up on, and that deserves to be acknowledged and complimented.\r\n\r\nI could be here discussing everything and everyone, but in the end, Carey Mulligan is the most crucial non-technical element of the entire project. There aren't many actresses that could pull off this role as she does. In fact, she might be the only actress able to take Cassie to where Fennell really wanted. From her amusing facial expressions and funny one-liners to the emotionally draining, devastating scenes that Cassie suffers through, Mulligan shows a mind-blowing commitment to one of the best, if not the best performance of her career. If some viewers don't think her display was anything special, recall that two-and-a-half-minute scene I tacked on above? She did all of it, but that is just one of several reasons why she'll get nominated for every ceremony.\r\n\r\nPromising Young Woman holds one of the best directorial debuts I've ever seen. Emerald Fennell delivers a fascinating, unpredictable story that impressively subverts the (rape) revenge subgenre by brilliantly approaching our society's compliant, biased behavior in these sensitive situations. Despite some tonal inconsistencies, the astonishingly captivating storytelling leaves no one indifferent, especially during the ruthlessly shocking third act. From the weirdly unique pop song choices to the colorful look of the film, passing through exquisite editing and powerful cinematography, every technical aspect has an unquestionable impact on the movie's success, including the smart casting choices. Carey Mulligan is able to be extremely menacing but also quite funny, offering a career-best interpretation of a fully-developed protagonist with emotionally resonating motivations, but also with a dangerously elaborated arc that could transmit the wrong message for some viewers. The last ten minutes are... well, you'll have to see it for yourself. A well-earned spot in my Top10.\r\n\r\nRating: A-", "created_at": "2021-04-06T17:55:28.802Z"}, {"movie_id": 582014, "review_id": "607f6c5fc439c0002a38d2bc", "rating": 7.0, "review_text": "not quite sure what to make of this revenge-thriller. A little heavy-handed at times but I liked Carey Mulligan in the lead and some scenes worked, though I saw one of the twists coming pretty early on. The ending is really dark and was at least surprising. Don't think it quite deserves some of the praise (not to mention a Best Picture nomination) but still worthy of a rental. **3.5/5**", "created_at": "2021-04-21T00:05:51.346Z"}, {"movie_id": 582014, "review_id": "6132b32715376c0098fad1a5", "rating": 10.0, "review_text": "ONE OF THE BEST INDIE FILMS OF LAST YEAR.  FRESHMAN DIRECTOR EMERALD FENNELL CREATED THE BEST FEMALE REVENGE FILM OF ALL TIME.  SHE ALSO WROTE THIS WITTY AND BRUTALLY REALISTIC STORY. CAREY MULIGANS MOST COMPLEX ROLE TO DATE. A MUST WATCH.  (SORRY ABOUT ALL CAPS- KEYBOARD IS BROKEN)", "created_at": "2021-09-03T23:43:35.769Z"}, {"movie_id": 582014, "review_id": "620425e57ecd2801101f5d87", "rating": null, "review_text": "The disappointing part is the build up towards the end. I'm also not quite sure who the blame falls to, but the scene where the lead cries in front of the tree, doesn't provide the despair that would have created the tension that the finale needs.\r\n\r\nWhat it very confrontingly succeeds in is the rediculous premisis that being drunk is an invitation for sex. And I can only applaud the movie for that, but the story telling...is lacking. In hindsight, I felt the bond between the two childhood friends didn't come to life, because of the absence of Nina and this also didn't help the finale build up. Some editing goes from a crying Cassy to a fully in control one. No plan forming. No rage. And perhaps not nutty enough.\r\n\r\nIts flaws are not enough to pass this one by though, because it is unique where it succeeds.\r\n\r\nThis is something you should show in high schools and probably throughout college, instead of abstenance or condoms on bananas. ", "created_at": "2022-02-09T20:36:53.685Z"}]