[{"movie_id": 346648, "review_id": "5b0940619251414715002438", "rating": 8.0, "review_text": "**Possibly better than its predecessor, which is no small feat.**\r\n\r\nCharming and hilarious, with more than enough jokes for the young and the old to enjoy.  Hugh Grant is an excellent and highly comical villain, and the rest of the cast is jam packed with cameos from British notables.  A very worthy sequel\r\n\r\n8/10", "created_at": "2018-05-26T11:09:21.324Z"}, {"movie_id": 346648, "review_id": "5e214c87397df00016979442", "rating": 6.0, "review_text": "I was really surprised by how much I enjoyed the first _Paddington_ and almost as surprised again by how much this one lived up to it as a sequel.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2020-01-17T05:56:23.112Z"}, {"movie_id": 346648, "review_id": "6595ad3bd7a70a128f694fd2", "rating": 7.0, "review_text": "With aunt \"Lucy\" about to celebrate her 100th birthday, \"Paddington\" has been taking odd-jobs so he can earn enough money to get her a gift. He alights on a special pop-up book from an antique shop but when it gets stolen, he finds himself in court accused of it's theft! It's the evidence of local Thespian \"Phoenix Buchanan\" (Hugh Grant) that sends him to prison. He's not exactly an instant hit when he arrives - a red sock in the laundry turns all the uniforms pink! His life becomes even more perilous when he takes on the cook \"Knuckles McGinty\" (Brendan Gleeson) over his mediocre, tasteless food... Deep intakes of breath all round, but he is saved by the taste of his marmalade! Now he has a protector and must get out of jail and find out who framed him for this most heinous of crimes and hopefully still get the book in time for a birthday present. There are some great characterisations here as the bear's friends gather round to help him thwart the plans of the thief. Dames Eileen Atkins and Julie Walters both contribute well as do the assembled \"Brown\" family who never lose faith in their recent family addition. The writing is amiable and quickly paced and the animation is impressively natural - especially as the denouement between speeding trains brings things to a fun, almost music-hall, conclusion. This is just as good possibly better than the original (2014) and well worth a gander.", "created_at": "2024-01-03T18:53:47.331Z"}]