[{"movie_id": 673, "review_id": "5e667d1e459ad600115adee3", "rating": null, "review_text": "I really loved this movie.", "created_at": "2020-03-09T17:30:06.711Z"}, {"movie_id": 673, "review_id": "6381333d514c4a0087894354", "rating": 9.0, "review_text": "_Harry Potter and the Prisoner of Azkaban_ is fantastic! This entry is another drastic step up from the previous film and the tone takes a dramatic shift in terms of seriousness.\r\n\r\nThe quality and cinematography are simply brilliant in this film. There are so many amazing shots and sequences that just had me completely enamored. These films are ahead of their time for sure.\r\n\r\nHarry Potter and the Prisoner of Azkaban has the best plot of the series so far. There is a constant threat looming in the background throughout the entire film that is known from the opening minutes. Sirius Black's menacing posters and headlines create a real sense of danger, and he truly seems mad. The dementors also deliver a serious threat on screen. Their introduction is terrifying, and their presence is felt in every scene.\r\n\r\nOne of my favorite things about this film is the conclusion, the time traveling elements are perfect and answer so many questions that I had when running through the finale the first time. My fiancé and I were very confused at how things were happening, and I was having a hard time believing it. But it was brilliant the way it looped around, and the audience was given more background information that made those scenes complete.\r\n\r\nThe trio of Daniel Radcliffe, Emma Watson, and Rupert Grint elevate their performances once again. Their chemistry is amazing, and I have a feeling this complement will be handed out during every film until the conclusion. Gary Oldman was fantastic as Sirius Black and one of the more compelling \"villains\" of the series so far. Michael Gambon does an excellent job filling in for the late Richard Harris, it was really difficult to even tell that it was a different actor.\r\n\r\nMy only complaint about this film was the beginning of the movie was slightly rushed. I felt like from when Harry left the Dursley's to when he arrived at Hogwarts the audience was whipped around from location to location, and it was hard to keep track of why. But the plot settles in and finds it's groove after that and delivers a near perfect conclusion.\r\n\r\n**Score:** _87%_ |\r\n**Verdict:** _Excellent_", "created_at": "2022-11-25T21:27:25.123Z"}, {"movie_id": 673, "review_id": "64f56a6597a4e6259e19d1f9", "rating": 8.0, "review_text": "I recall the controversy as this was released. Alfonso Cuarón consciously decided to darken this film, and the light-hearted stories of the first two are replaced by an edgier approach to this tale for our wizarding trio. The world's most wanted wizard \"Sirius Black\" (Gary Oldman) escapes from \"Azkaban\" allegedly bent on the destruction of \"Harry\". The script has more by way of addition to the original book, but in a complementary - not detracting way. As the children grow into young adults, we are exposed to a scarier side of their existence - the \"Dementors\" that are supposed to protect the innocent and the \"Boggart\" all serve to introduce a physical fluidity to this shape-shifting environment of peril in which they now exist. The presence of \"Valdemort\" becomes more omnipresent and there is so much more substance to the stories now. Sir Michael Gambon takes over the role of \"Dumbledore\" without quite the presence of Richard Harris, but we can tell now that this series is heading for murky, dangerous, waters...", "created_at": "2023-09-04T05:25:57.611Z"}]