[{"movie_id": 10375, "review_id": "55abf36cc3a3682d6300522b", "rating": 5.0, "review_text": "You're real good at kicking them when they're down, aren't you?\r\n\r\nSly Stallone stars as an FBI Agent who turns to drink when the love of his life becomes the victim of a crazed serial killer who has been targeting cops for death. So struck by the tragedy, he is coerced into signing up for a rehab programme at a remote asylum facility, but soon it becomes clear that the serial killer is still in his midst.\r\n\r\nFamously delayed from being released for quite some time, D-Tox is like an itch on Stallone's CV that he will never be able to scratch. In truth it's quite serviceable as a formulaic thriller, but it's so derivative and, yes, dumb, it's hard to recommend with any sort of confidence.\r\n\r\nAny number of thriller films you have probably seen will spring to mind when viewing this, but in short it's like a \"10 Little Indians\" meets \"The Thing\", with a side order of \"Seven\" thrown in for good measure. The first half is actually well built by the makers, establishing Stallone's emotional chaos, his dive into the bottle, and then setting him up in an institution that is frighteningly monolithic in a grey and steely way. His co-patients are all troubled coppers in search of a dry run, and this also sets things up neatly for some rich characterisations, unfortunately it all descends into cliché hell and wastes what is a rather superb cast - while Stallone unfortunately shifts from a believable tortured soul into a muscle head with a gun. Cest la vie!\r\n\r\nGood moody atmosphere and some heart jolting deaths keeps the pic on the boil, but ultimately the pandering of the norm renders a promising thriller to being distinctly average. 5/10", "created_at": "2015-07-19T18:58:52.918Z"}, {"movie_id": 10375, "review_id": "64f428097d41aa0138478b33", "rating": 5.0, "review_text": "An FBI agent \"Molloy\" (Sylvester Stallone) has been on the trail of a serial cop-killer for two years and nine murders later, still can't pin him down. The murderer decides to turn the tables on his pursuer by killing not only his close colleague but also his fiancée - and this drives \"Molloy\" to hit the bottle big style. A fellow detective enrols him in a detox programme in a very remote centre that specialises in dealing with alcoholic cops but before he gets much chance to get better, he discovers that his nemesis has also managed to check-in and we've got a menacing cat and mouse game that sees carnage ensue... It's all a bit predictable, though perhaps Stallone has a bit more depth to his character than in many of his more testosterone driven efforts. There are a few brief scenes with Kris Kristofferson as the head of the facility trying to assist; and quite a decent cast of likely culprits all keep the pace moving along, but the dialogue is dreadful and it's very formulaic in terms of story progression - it's quite easy to guess who the criminal actually is... It's an OK watch, nowhere near as bad as many of Sly's other outings but probably deserved it's straight to video release.", "created_at": "2023-09-03T06:30:33.567Z"}]