[{"movie_id": 6282, "review_id": "589d75319251412cd2005462", "rating": 7.0, "review_text": "I managed to see this movie on it's first day of screening in New York, back in 2000, just before I went back to Europe.\r\n\r\n'Coyote Ugly' is a nice romantic comedy, perfectly fit for the generation who didn't grow up with 'Flashdance', Saturday Night Fever etc.\r\n\r\nPiper Perado plays the young aspiring song-writer who wants to get a major record-deal, write songs and then safely watch others perform her music. But then there's this little snag, called reality. Although the story is not very surprising it is solid and consistent told. We understand why she ends up on the bar dancing (no spoiler here). And at the same time we understand why her father is disappointed. A fine part played by John Goodman. At times their relationship reminded me of the one Madonna and Danny Aiello had in the 'Father Don't Preach' music-video. Father reluctantly sees his daughter grow up. And she only wants him to be proud of her.\r\n\r\nAfter I saw the trailer on television I immediately went to the REAL Coyote Ugly Saloon on 1st Avenue on which this film was based (unless there's another one, of course). The real bar is not nearly as flashy as it's celluloid counterpart. But they DO hose down annoying customers with beer and there IS dancing on the bar. However by the female customers, rather than the waitresses. But they do get fresh with you if you happen to order something they don't serve. (anything besides beer and Jack Daniels) And they do drink shots with the costumers. Funny detail is that in the movie is explained why they don't get drunk.\r\n\r\nI know, I know, we already have Flashdance. (Also from Bruckheimer) but I don't mind if this type of story is being updated now and then, right? Although the soundtrack could sound a bit more contemporary.", "created_at": "2017-02-10T08:09:21.658Z"}, {"movie_id": 6282, "review_id": "654b042c1ac2927b2ebddc17", "rating": 3.0, "review_text": "**An excuse to make a film full of women swaying seductively without a hint of softcore.**\r\n\r\nWhat can we say about a romantic film, with light touches of comedy, that spends most of its time showing us very attractive women in tight, short clothes, and bouncing around sensually in an atmosphere of mockery and debauchery worthy of a university graduation party? A lot of things. What leaves us no doubt? It is a film made with an openly and openly heterosexual audience in mind. Released in 2000, I don't know if the film would be possible today without being immediately accused of sexism and giving a stereotypical and sexualized image of women.\r\n\r\nLet's start by talking about the good things. One of them, perhaps the best, is the extraordinary soundtrack, which compiles excellent songs into one of the best non-original soundtracks of the decade: “The Right Kind of Wrong” and “Can't Fight the Moonlight” are so good that the entire we know them. The music is so important here that, in a sense, it is more of a music video than a film: the protagonist is an aspiring songwriter who tries to make it in the music market without much success, but who discovers that she sings well and becomes one of the main attractions. of a nightclub.\r\n\r\nThe scenarios are convincing enough for us to believe them, especially if it is known that there really is a bar of this type in New York (in fact, it seems that others in the same franchise have already opened). Even so, there is so much exaggeration at parties that it is, in my eyes, difficult to believe in a certified and legal commercial space. Minimally decent editing, but sometimes lax, and cinematography that relies too heavily on red tones complete, on a less positive note, the more technical aspects of this film.\r\n\r\nIn addition to the good songs, we have the beauty of the cast, with young and slender actresses, who make up for their inexperience with fantastic bodies and good dancing skills: Piper Perabo, Maria Bello, Tyra Banks, Izabella Miko, Bridget Moynahan and Adam Garcia. It's a shame that physical beauty doesn't translate into talent: as the cast wasn't chosen based on the actors' abilities, none of them offer an inspired performance. They are a bunch of complete scoundrels and the film, at this point, is very weak. In the interest of justice, it is imperative to save the renowned John Goodman, the only good actor here, who shows us what it is like to act in a character full of grace and quite comical.\r\n\r\nAll of these, however, are mere stumbling blocks on the long road of a production that could, even so, be frankly good if it told us a good story. It is in the script and the story told that the film falls to the ground like an aspiring model who breaks both heels while parading. When watching the film, I asked myself over and over again where the hell the script was, because all that, that whole trip to the city, to a future in show business, is so absolutely cliché and has already been repeated so much that it is unacceptable. There is no substance. Then, all that sugary romance, without any chemistry, without any logic... it's too stupid, with stupid and unacceptably poorly written dialogues.", "created_at": "2023-11-08T03:44:44.373Z"}]