[{"movie_id": 2055, "review_id": "59579332c3a368265d0096e0", "rating": 10.0, "review_text": "I ain't going to meet my maker without knowing your real name.\r\n\r\nIt's purely my own opinion of course, but Open Range is a modern day genre classic that stands up to repeat viewings. It's not a flawless Western the Western historians will tell you, and some will pick out the hats or the impact of a rifle to mark the film down, but really we should be embracing a genre piece in the modern age that is clearly being directed with love and respect by the director.\r\n\r\nIt's story is of course a simply structured tale of the underdog rising up against the fat cats who want it all in the name of tyranny. But on its side is the fact that its characters are so interestingly engaging. Within a short time frame I feel that Kevin Costner manages to put us in the saddle with the main protagonists, we understand these guys without actually knowing them, and that is quite an achievement I feel. The film does flesh them out to enhance the film without boring the pants off the viewer, and it's only come the final reel that you realise you have been engaged in a very human and honest Western film.\r\n\r\nMost of the cast do great here, both Robert Duvall & Kevin Costner bounce of each other with moody and world wise aplomb as the two main leads, while in the sole female role of note, Annette Bening is gusto beautiful personified. Sadly it's hard for me to write that Michael Gambon as the villain of the piece is not only underused, but also something of a let down. Such an accomplished actor should know better than to overdo it in the context of this particular story. Yes we get the need for villainy, but gurning and frothing doesn't quite make the grade here. It's a little surprising that director Costner didn't utilise Gambon more wisely.\r\n\r\nStill, I say the film is a wondrous experience because it is, a film to have you cheering and booing in equal measure, and in the main the work on it is top dollar. Some of the shots are gorgeous, the framing that Costner uses in close ups is excellent, and the final reel shoot out ranks as one of the best in Western genre history. So all in all it's a modern day genre piece that actually sits nicely with the best from the golden era. 9/10", "created_at": "2017-07-01T12:18:58.757Z"}, {"movie_id": 2055, "review_id": "5958e0a2c3a368253c01e464", "rating": 10.0, "review_text": "I ain't going to meet my maker without knowing your real name.\r\n\r\nIt's purely my own opinion of course, but Open Range is a modern day genre classic that stands up to repeat viewings. It's not a flawless Western the Western historians will tell you, and some will pick out the hats or the impact of a rifle to mark the film down, but really we should be embracing a genre piece in the modern age that is clearly being directed with love and respect by the director.\r\n\r\nIt's story is of course a simply structured tale of the underdog rising up against the fat cats who want it all in the name of tyranny. But on its side is the fact that its characters are so interestingly engaging. Within a short time frame I feel that Kevin Costner manages to put us in the saddle with the main protagonists, we understand these guys without actually knowing them, and that is quite an achievement I feel. The film does flesh them out to enhance the film without boring the pants off the viewer, and it's only come the final reel that you realise you have been engaged in a very human and honest Western film.\r\n\r\nMost of the cast do great here, both Robert Duvall & Kevin Costner bounce of each other with moody and world wise aplomb as the two main leads, while in the sole female role of note, Annette Bening is gusto beautiful personified. Sadly it's hard for me to write that Michael Gambon as the villain of the piece is not only underused, but also something of a let down. Such an accomplished actor should know better than to overdo it in the context of this particular story. Yes we get the need for villainy, but gurning and frothing doesn't quite make the grade here. It's a little surprising that director Costner didn't utilise Gambon more wisely.\r\n\r\nStill, I say the film is a wondrous experience because it is, a film to have you cheering and booing in equal measure, and in the main the work on it is top dollar. Some of the shots are gorgeous, the framing that Costner uses in close ups is excellent, and the final reel shoot-out ranks as one of the best in Western genre history. So all in all it's a modern day genre piece that actually sits nicely with the best from the golden era. 9/10", "created_at": "2017-07-02T12:01:38.905Z"}, {"movie_id": 2055, "review_id": "604da1617314a100782010de", "rating": 8.0, "review_text": "**_Now THIS is a Western_**\r\n\r\nFour cowboys & their cattle are traveling through the Hammondville, Montana, region in 1882 when they discover that the leaders of the town don’t like free grazers. It escalates into a life or death situation. Robert Duvall and Kevin Costner play the two main cowboys while Annette Bening appears as a doctor and Michael Gambon a land baron.\r\n\r\n“Open Range” (2003) automatically brings to mind “Dances With Wolves” (1990) because they’re the only two Westerns Costner has both starred in and directed. While not quite as good, this one is still a great modern Western and nigh epic. The theme revolves around how noble Westerners like the protagonists don't seek violence, but it's sometimes necessary to make a stand for justice, even if the local law is bought and corrupt.\r\n\r\nI like the way the movie confidently takes its time and fleshes out the characters with insightful bits here and there. It feels like the way it was in the Old West and the characters speak the way you know they spoke back then. The mood is increasingly tense, but most of the action is saved for the last act when everything explodes, reminiscent of the real-life gunfight at the O.K. Corral, just longer. As such, viewers who need quick-editing and constant thrills to be entertained will likely find it boring. Mature-minded viewers, however, will appreciate the realism and the slowly developed characters, as well as the well-done romance angle.\r\n\r\nThe big rancher is pompous because his arrogance has built up over the course of decades and he thinks he owns the town. But does he? In his own mind he’s King Sheet because he’s gotten away with injustice due to his power and influence. But what happens when noble citizens say “Enough”?\r\n\r\nWhile “Open Range” deals with dark, challenging things, it has a warm, redeemable heart, unlike “Unforgiven” (1992), which wallows in ugliness (although it’s still a worthy Western, as long as you can stomach the ugliness).          \r\n\r\nThe film runs 2 hours, 19 minutes, and was shot at Stoney Indian Reserve in Alberta, Canada. \r\n\r\nGRADE: A-", "created_at": "2021-03-14T05:38:41.503Z"}]