[{"movie_id": 619264, "review_id": "5e7d4f81ab1bc75874c3169b", "rating": 3.0, "review_text": "*don't waste your time*. Most of the movie happens in a sort of multi-floor prison where the top levels can control the food that goes to the bottom floors. This created a sort of class structure where top-levelers had pleasure on denying food to the bottom levels, although the floors were sorted periodically. The protagonist started to question this structure and tried to change it. Although starting well, the movie lost its track trying to be too much symbolic and enigmatic. The ending was very disappointing leaving too many loose ends that should have been closed.", "created_at": "2020-03-27T00:57:37.242Z"}, {"movie_id": 619264, "review_id": "5e7dbc02fea0d772afc9c9b5", "rating": 8.0, "review_text": "A violent form of demonstration of the problems of capitalist society. Despite the fact that the level of violence is too much for me, I understand purpose of it for narration. Actually I find this film quite spiritual. The parallel between Jesus and Christian values is quite obvious.", "created_at": "2020-03-27T08:40:34.045Z"}, {"movie_id": 619264, "review_id": "5e80cd7c4e67420014d96b26", "rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nNetflix has been supporting small, independent filmmaking for a while now. In 2018, Roma (re)opened a Best Picture nomination path to foreign films. Last year, Martin Scorsese's epic The Irishman could only come to life via streaming since no major studio wanted a three-and-a-half-hour runtime for a theater release. Between these two, dozens of other indie flicks got Netflix's (or other streaming networks) support. 2020 brings us a Spanish horror-thriller from a first-time director (Galder Gaztelu-Urrutia): The Platform (or El Hoyo).\r\n\r\nSince its showing at TIFF, this movie has been receiving overwhelmingly positive feedback. So, obviously, I needed to add it to my list. I watched it a couple of days ago, and I wanted to take time to think about it because it's definitely going to become a divisive film, especially among general audiences. The Platform carries an extremely abstract narrative, filled with symbolism, metaphors, analogies, and allegories to our political-social-economic situation. It's not a straightforward thriller at all.\r\n\r\nIt's a tremendously intriguing concept, developed through captivating storytelling and a very dark tone. It's a prison that resembles our society of today. Filled with hypocrisy and selfishness. One month, you're the king of the world on a level where food comes in excess, but you still want it all for yourself, ignoring desperate requests from down below. As soon as in the next day, you're a miserable human being, fighting for scraps with your \"cellmate\", and on the exact same position those desperate people were before... And now you want their help?!\r\n\r\nThat last narrative analogy to the real world is undoubtedly my favorite. I was never a fan of politics (who is?), so analogies and symbolism regarding that part of our life don't really impact me. However, it's clear that the screenwriters put a lot of effort into making such a meaningful story. If the ambiguousness is removed from the screenplay, there's still plenty to enjoy. Goreng's arc goes from just trying to get a diploma to actually save the people from lower levels. His story takes the viewer through tons of violence, blood, gore, and genuinely disgusting sequences.\r\n\r\nTherefore, people who want straight-up popcorn-action instead of a more philosophical take as the filmmakers intended, there's a lot to be entertained by. The Platform is also another proof that you don't need a massive budget to build an immersive atmosphere. The set and production design are as simple as they could be, but it's especially due to that simplicity that the claustrophobic prison works so well. For a directorial debut, Galder Gaztelu-Urrutia does an excellent job of controlling the pacing and applying the right shots to each situation.\r\n\r\nUnfortunately, my main issue is the same as most people: the ending. I will restrain myself from giving away any minor spoilers, so I'll just write that it doesn't work at all levels, at least not for me. As expected, it's as ambiguous as the rest of the movie. As soon as I finished the film, I was frustrated by so many unanswered (logical) questions, and after a couple of days of thinking about it, these questions still exist. You'll never find an answer to everything, but that was never the main goal. There has to be a balance between reality and fiction. Between what's real and what's just a metaphoric symbol. No one can justify *everything* with \"oh, it's just a representation of something else\".\r\n\r\nFor me, there are two ways of interpreting the ending: I could either take everything literally, which would raise tons of questions without an answer, or I could try and solely look at the story through Goreng's perspective. I do believe the latter approach is the best one, even if it still carries other issues regarding secondary characters. It doesn't answer everything, but it's the perspective I find to make more sense with the movie. It makes the screenplay more cohesive and congruent.\r\n\r\nNevertheless, the problem I can't seem to avoid is the abrupt break in tone. For such a brutal, raw, bloody display of human behavior in a situation of survival (the way colors are used is very clever), the climax feels detached from everything that comes before. The underlying themes are there from the get-go, but these are precisely what they are: secondary messages lying under a pretty real story. Going from horrible murders, sacrifices, and God knows what else, to such a philosophical, soulful ending in the way the film does... it's far from a seamless transition.\r\n\r\nBasically, if you go in expecting definite answers about whatever this prison is, who controls it, and how it truly works, you'll probably leave disappointed and frustrated. It's one of those movies that heavily relies on how people perceive its ending and how much impact does it cause on an overall opinion. Looking at the conclusion solely from Goreng's perspective works the best for me, even if some unanswered (logical) questions still exist. The abrupt break in tone transitioning to the film's climax is my main problem, but The Platform has plenty of positives. An extremely intriguing premise is developed through remarkably captivating storytelling, and an exceptional cast elevates the well-written screenplay. First-time director Galder Gaztelu-Urrutia and his team do an excellent job. Set and production design prove how a small budget can still create an immersive, claustrophobic atmosphere. Even if the ending only works partially, the symbolism and allegories of our world's politics and social-economic situation are a brilliant, thought-provoking piece of a screenplay. I like more it the more I think about it.\r\n\r\nRating: B+", "created_at": "2020-03-29T16:31:56.713Z"}, {"movie_id": 619264, "review_id": "5f1845e751e6ab0038d221e2", "rating": 9.0, "review_text": "A fantastic watch, will watch again, and can recommend.\r\n\r\nThis is a survivalist movie, heavy with philosophy of morality.  A lot of the time when I get to say anything close to that, I get to say, \"but there is humor too\", there is not: not traditional humor anyways.\r\n\r\nThis is a dark movie filled with metaphor and cruel reality.  Now while I am usually offended by reality encroaching on my escapism, that is normally when I'm trying to watch dirt humor.  When to take a concept like this, the relation to reality only strengthens the movie.\r\n\r\n\"Those above, and those below\" is something to think about, and if that intrigues you or you're already onboard for a philosophical discussion of anti-hierarchical class society structure, or intrigue by the idea that it doesn't matter who or when someone is in the class structure: it defeats the society just by being.\r\n\r\nThe production value is minimal but sufficient, and I think that is by design.  It does live in the land of bad dubs, but not enough for me to fault it.\r\n\r\nGive this a shot: you might be surprised at yourself or your company.", "created_at": "2020-07-22T13:57:59.870Z"}, {"movie_id": 619264, "review_id": "5fe76a77e74146003d36fcb2", "rating": null, "review_text": "Rate: zero\r\n\r\nThis is what happens when we build a house for a door (instead of building a house and then put doors in it); An exotic, dirty and cluttered movie. Dirty but not necessarily in the visual meaning but in the cinematic meant. The director does not know what he wants to do at all, the camera angles, the frames, the compositions and everything are completely in the air, he just knows he wants to beat capitalism but he does not know how and for this purpose, which is what He does not do well, he comes to the great art of cinema and insults it with this film. A film must first become a cinematic work and then speak, first a house must be built and then several doors must be left for it, it is not possible to throw an ideology in the middle and make a film around it, of course, if it is possible to call this film, a film! Symbolism and the use of symbols are correct when the director does not shout with every dialogue and every scene that this object is a symbol! The symbol should not be completely revealed to be a symbol. If he is going to make a symbolic film, he must first know how, then put signs in his symbols, not to turn the whole film into a bunch of ridiculous symbols. From one place, the director does not even remember what his goal was and enters another phase, which he thinks is a revolution. Not only he does not understand and show the revolution, but he forces his two main characters, who are not characters at all, to beat everyone so that they can only get food to the final stage! you are kidding! How do these movements represent revolution, leftism, and helping others? They go downstairs and beat everyone, and finally they feed their ridiculous symbol (the dessert) to the child and send him down to, for example, when she returns to the top floor, the tyrants become surprised! So what? what will happen! Did the film become a leftist film? Did it promote revolution and resistance? Did it help everyone and save them? Never. In general, it can be said that \"Platform\" is a disgusting, ridiculous and shameless film that insults both the cinema and its audience, and there is no cinematic or ideal value in it, and in the humblest case, even a slogan.", "created_at": "2020-12-26T16:53:11.843Z"}, {"movie_id": 619264, "review_id": "621a8eb119ab59001c73c34e", "rating": 7.0, "review_text": "An extremely cruel and disturbing psychological dystopian thriller.\r\n\r\n7/10", "created_at": "2022-02-26T20:33:53.454Z"}, {"movie_id": 619264, "review_id": "63899bed3f8ede00ab93f589", "rating": 5.0, "review_text": "**The Platform is a unique story that asks some deep questions but ultimately left me disappointed.**\r\n\r\nThe Platform has such an intriguing concept that raises a variety of potent philosophical and moral questions and dilemmas. The film begs the question, “What if?” How would I respond in such dire and impossible circumstances? What would I do? As characters grapple with their desperate circumstances, a hero attempts to find hope by devising a plan to send a message to their captors and possibly save lives. Unfortunately, the movie doesn’t really provide any answers or assure any resolution or salvation. It just kind of ends after an hour and forty minutes of disturbing hopelessness. It probably has some deeper meaning that I missed but definitely not my kind of movie.", "created_at": "2022-12-02T06:32:13.441Z"}]