[{"movie_id": 529485, "review_id": "5e836d5d04b5960017935cae", "rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nI’m not the greatest fan of inspirational sports dramas, but I also never disliked one. They all follow this storytelling formula that everyone recognizes, but it’s always successful. The protagonist is a miserable human being due to some tragic past. He gets another shot at life, usually an underdog situation, and he ultimately overcomes whatever challenge is thrown at him, including his addictions if he has any. Everyone lives “happily ever after”, and the viewer leaves the theater with a smile because that’s how it makes us feel.\r\n\r\nIt’s incredibly easy to root for an underdog trying to raise its level and to reach something it never believed in. In The Way Back, the basketball team is awful, but Jack teaches them not only how to play better, but how to be a better *team*. Then, it’s just like the synopsis: a win here and there gets everyone back on track, and it’s very entertaining to watch these young kids “grow up” in every possible way. As a sportsman myself, several little details help me enjoy this type of movies even more.\r\n\r\nHowever, it’s a straightforward variation of the same cliche, predictable story… until one point. There’s one genuinely surprising development I didn’t see coming. I don’t know if it was due to my “defenses being down” or if Gavin O’Connor and Brad Ingelsby really did a great job at hiding it until the right moment, but it definitely worked.\r\n\r\nThe lack of character-building regarding the secondary ones is probably my biggest issue aside from the formulaic screenplay. There’s one young kid that still has some sort of an arc, but it never gets the deserved consideration. It’s a very protagonist-centered film, and there’s nothing truly wrong with that, especially when Ben Affleck delivers one of his career-best performances. I left him for last because I do believe the whole movie succeeds due to his impressively captivating display.\r\n\r\nA lot of people talk about how Affleck’s own life and his past struggles with addiction make this a personal interpretation in the sense that he’s just portraying himself. Some people even diminished his performance by saying that “it’s easier to represent ourselves than a fictional character”, which I couldn’t disagree more. It’s an arduous task interpreting a version of our personality, let alone a very somber, sad part of it. It’s not only an enormous acting challenge but also a terrifying personal test.\r\n\r\nI digress. Honestly, I couldn’t care less about Affleck’s personal life, or anyone’s for that matter. People should stop trying to bring external themes to reviews, it’s one of the first principles film critics learn (but have unfortunately forgotten with time). I don’t know if his experience with addiction helped him with his performance or not, but he looks incredibly committed to his role. He elevates his character, and he carries the whole movie on his shoulders. Brilliant, emotional, and very realistic interpretation of someone dealing with depression, frustration, anger, and an addiction issue.\r\n\r\nAll in all, The Way Back is an inspirational sports drama that follows the genre’s stereotypes and formulaic storytelling, but it’s still very successful in its execution. The secondary characters lack development, but there’s nothing wrong with a protagonist-centered story as long as the main actor delivers an exceptional display. Something Ben Affleck does in an emotionally powerful manner, delivering a genuine portrayal of someone with a tragic past and lots of personal issues. I believe it’s one of his career-best performances. Jack might follow every storyline that ever existed in this genre, but Ben Affleck is reason enough to give Gavin O’Connor’s flick a go.\r\n\r\nRating: B", "created_at": "2020-03-31T16:18:37.850Z"}, {"movie_id": 529485, "review_id": "630ad627ede1b0007ed4bd84", "rating": 7.0, "review_text": "The Way Back (2020) is a return to form for Ben Affleck following an aimless second half of the previous decade – specifically his ill-advised stint in the DC Universe. In this drama directed by Gavin O'Connor and written by Brad Ingelsby (co-writer of the excellent Out of the Furnace), Affleck plays Jack Cunningham, a former high school star basketball player turned alcoholic construction worker who reluctantly accepts a coaching job at his alma mater.\r\n\r\nHow do we know he's an alcoholic? Well, drinking beer in the shower is certainly not a good sign (and there are many others), but it’s mostly Affleck, who not only looks and sounds but for all intents and purposes is the part, turning in a cathartic, demon-exorcising performance.\r\n\r\nThe central portion of the film is by design an abridged version of every high school basketball movie ever made. It’s done competently, with a knowledge of and appreciation for the game of hoops, as well as a sense of humor, but it’s nevertheless an afterthought; it would also be a foregone conclusion, if the script had actually been leading up all along to that buzzer-beating, game-winning, hail Mary shot that shortly segues into a freeze frame of Jack’s triumphantly grinning mug.\r\n\r\nIts Cinderella story – minus the fairytale happy ending – seems taken right out of many a Hollywood melodrama (because it actually is), but TWB is not – regardless of what All Movie or IMDb may tell you – a sports movie, nor is it about basketball like Hoosiers, or about inner city kids like Coach Carter; its scenes of on-court action and sideline banter, deftly choreographed and zestfully written and delivered but offering little new (other than comically pairing the Foulmouthed Coach with the catholic high school’s “team chaplain”), exist solely to make a point – and a very well made and well taken point it is.\r\n\r\nThis narrative shorthand serves an overarching character study into which the filmmakers have put quite a lot more thought and work, revolving around a man who seemingly drinks just for the sake of getting drunk, and then gradually pulling back to reveal the underlying causes for, and consequences of, his alcoholism. It is said that hitting rock bottom is the beginning of the road to recovery, and the film uses basketball to pull Jack up, push him farther down, and ultimately pull him back up again.", "created_at": "2022-08-28T02:42:47.396Z"}]