[{"movie_id": 8869, "review_id": "55f8f97792514108120015eb", "rating": 7.0, "review_text": "Arach Attack!\r\n\r\nSpiders escape from a spider farm in Prosperity, Arizona, and become giant man eating beasts on account of toxic waste carelessly dumped in a near by river. Can the odd ball inhabitants of this Arizona town escape with their lives? Or will spiders rule the earth and lay waste to man kind?\r\n\r\nEight Legged Freaks is unashamedly homaging B movie creature features from the 1950s. The likes of Tarantula and Them! have their Pedipalps well and truly watered, in what is possibly the most undervalued of all the modern day creature feature homages. Having no pretensions what so ever, the only real thing not in \"Freaks\" favour is the usage of CGI, but even that doesn't hurt the film, if anything it adds to the obvious preposterous nature of the genre. I mean how else are we to get 20 foot jumping spiders chowing down on some annoying teenager?\r\n\r\nPerhaps \"Freaks\" is viewed harsh because the cast is relatively C list? Again that is a genre staple, surely? For what it's worth I think they do real fine, David Arquette has oodles of goofy charisma, Kari Wuher makes a fine female ass kicker, and the kids (one a young Scarlett Johansen) are really rather cool. Director Ellory Elkayem, who after doing They Nest in 2000 clearly has bug issues, adheres to genre staples. Kooky western town out in the desert, the inhabitants of which range from near loonies to dopey politicians, and the plot follows the traditional sense of impending doom played for laughs. Listen out for the score from John Ottman, which plays on variants of \"Itsy Bitsy Spider\", whilst cast a keen eye on John S. Bartley's Arizona camera work.\r\n\r\nWhilst not having the savvy scripting of homage daddy, Tremors, or the star appeal of 1990's Arachnophobia, Eight Legged Freaks deserves its place amongst such fun and creepy company. As the tag line says, \"Do you hate spiders? Do you really hate spiders? Well they don't like you either\". With that, I think it's web well and truly spun, don't you? 7/10", "created_at": "2015-09-16T05:09:11.764Z"}]