[{"movie_id": 17431, "review_id": "5c24f4630e0a264ddbf36c6b", "rating": 9.0, "review_text": "Gerty, we're not programmed. We're people, do you understand?\r\n\r\nDirected by Duncan Jones and starring Sam Rockwell, Moon finds Rockwell as Sam Bell who is coming to the end of his three year contract on a lunar station working for Lunar Industries. His only companion is an intelligent computer named GERTY (voiced by Kevin Spacey). When Sam has an accident he awakens to find he is now not alone and all he thought and believed in is just not as it seems.\r\n\r\nForget any fears about a low budget and any plot similarity to 2001: A Space Odyssey, for this is a cracker jack of a science fiction picture. Film quickly fills us in on Sam Bell the man and his function up there on the lunar station. His relationship with GERTY the computer grabs our interest whilst the production design has a sort of medicinal sheen to it. Once Sam's solitude is established, the minimal contact with Earth explained, the pic then spins into another dimension, dragging both Sam and us viewers into the vortex.\r\n\r\nTo say more would be churlish, but this is adult science fiction, clever in existential whiles and scathing with observations on corporate shenanigans. Narratively it's evocative in its telling, even haunting and philosophical, where a brilliant Rockwell nails every inch of Bell's search for being, and crucially, the truth. It's all building towards a finale of some devilish substance, no cop outs or easy fed answers, just a pertinent question asked of the viewers. Moon comes highly recommended to sci-fi fans who are after a bit more than mere sparkly fluff and robotic chaos. 9/10", "created_at": "2018-12-27T15:48:51.147Z"}, {"movie_id": 17431, "review_id": "5f45368acee4810036a6ea50", "rating": 8.0, "review_text": "Great watch, would watch again, and do recommend.\r\n\r\nSam Rockwell no only carries the movie, but he's literally the only person in the movie that isn't on a screen.\r\n\r\nHe plays off himself amazingly well and really balances the struggles of both the individual and the clone to clone interaction.  The struggle feels like how someone would react to the situation, and Rockwell adds his own special flair to it.\r\n\r\nThe setting of Luna is amazing, granted it's mostly in the small station, but it makes me jealous that we haven't established moon colonies.  Space madness might be a real thing, but it is because someone is alone and not part of a group.\r\n\r\nI want more movies like this for every reason: more Sam Rockwell, more Luna settings, more clone movies, more isolation theory, more, \"OMG, MY ENTIRE LIFE IS A LIE, WHAT IS HAPPENING!\".", "created_at": "2020-08-25T16:04:26.016Z"}, {"movie_id": 17431, "review_id": "61e32836db8a0000934ad0e3", "rating": 9.0, "review_text": "A quiet, psychological sci-fi thriller with a grim atmosphere, ‘Moon’ is carried by a greatly nuanced performance by Rockwell.\r\n\r\n8/10", "created_at": "2022-01-15T20:01:58.104Z"}]