[{"movie_id": 949423, "review_id": "6349a382b0460500791b0443", "rating": 8.0, "review_text": "_Pearl_ is a great character study that dives deeper in the stakes that an individual will go to attain success. It is unquestionable that the main question people will ask is, does it live up to X? While I do think it is a good film that I thoroughly enjoyed, it does not overtake its predecessor and that is completely okay. They are two entirely different movies but achieve their goals brilliantly.\r\n\r\nThis film is the textbook definition of a slow burn. The movie drags on and continues to provide this eerie tension as the viewer knows what the end result of this tragic film will be, but still remains locked in to see how it will unfold. I really enjoyed the first act, the character introductions were fantastic, and the audience has an instant connection with Pearl. But the second act drags a little more than I would have liked, but by the minute it is getting stale the third comes to pick up the pace and deliver a satisfying conclusion.\r\n\r\nMia Goth is utterly fantastic in this film. There is a solid six-minute monologue of just her acting her ass off. One take, one angle, and somehow, she was able to lock me in completely. She has burst on to the scene with X and Pearl, and I cannot wait to see where her career goes from here.\r\n\r\nOverall, this film is great, but expectations should be had going into it. It is not going to be an action-packed slasher like its predecessor, but those elements are sprinkled in and work well with the overall film. If you enjoyed X, you should definitely watch this.\r\n\r\n**Score:** _81%_ |\r\n**Verdict:** _Great_", "created_at": "2022-10-14T17:59:30.923Z"}, {"movie_id": 949423, "review_id": "637cacfcb2e074018e216d4a", "rating": 7.0, "review_text": "MORE SPOILER-FREE MINI-REVIEWS @ https://www.msbreviews.com/movie-reviews/mini-reviews-2022-edition/\r\n\r\n\"Pearl may be a prequel to X, but Ti West turns this slasher into an incredibly complex character study represented - and co-written (!) - by Mia Goth.\r\n\r\nThe new star of the horror genre deepens the protagonist Pearl, exploring her tremendous desire to fulfill her dream of wanting to become something more than a mere farm girl, including a mesmerizing monologue of nearly ten uninterrupted minutes, where raw, insane, wholly genuine emotion of the character comes across in a fascinating manner. Extra appreciation for the practical effects and the fact that basically the entire movie is shot during broad daylight.\r\n\r\nGore sequences become somewhat repetitive, and the narrative doesn't escape its predictability, being an overall less captivating film than its predecessor.\"\r\n\r\nRating: B", "created_at": "2022-11-22T11:05:32.389Z"}, {"movie_id": 949423, "review_id": "641c7166d75bd6245aa7fc7a", "rating": 6.0, "review_text": "Despite quite a characterful effort from Mia Goth as the title character here, I wasn't really very impressed with this film. She lives on a farm whilst her young husband is off fighting on the Somme. She shares her life with her Germanic, rather authoritarian, mother \"Ruth\" (Tandi Wright) and her profoundly disabled father who cannot speak and who is entirely dependent on these two women. \"Pearl\" longs to escape. On one of her occasional visits to town to collect her father's laudanum, she encounters the local projectionist (David Corenswet) who shows her a (quite racy) film and suggests that maybe a new life could be her's. Meantime, her life at the farm is becoming unbearable and her options for escape lead her to realise that drastic action may be needed - a plan that is accidentally put into play after an altercation with her mother. It's perfectly watchable, this, but it's also perfectly forgettable. The story is weak and thin, and though the photography is attractive, the whole thing just doesn't catch fire for me. There's no menace. It's not an horror film - it's a film about a mentally ill girl that offers us a few mildly entertaining scenarios that peter out as quickly as the plot does before an ending that screams sequel loudly and defiantly. It certainly does not need to be seen on a cinema screen.", "created_at": "2023-03-23T15:33:58.944Z"}, {"movie_id": 949423, "review_id": "6444cf5e05822404bf331f70", "rating": 7.0, "review_text": "**By: Louisa Moore / www.ScreenZealots.com**\r\n\r\nThe strange and unusual “Pearl,” a prequel to writer / director Ti West‘s “X”, is a different kind of slasher film. Creating an origin story for the title villain, the film tells the history of a farm girl dreamer with a serious mean streak. It’s a horror movie that’s unlike any other, a candy-colored, nightmarish dream world of lofty ambitions, brutal violence, and bloody murder.\r\n\r\nPearl (Mia Goth) is trapped on her family’s isolated farm. She dutifully performs her barn chores and tends to her ailing, wheelchair-bound father (Matthew Sunderland), all under the stern eye of her overbearing mother (Tandi Wright). Pearl wants nothing more in the world than to live the glamorous life of “the girls in the pictures” that she sees on the big screen at the movies. With her husband Howard off to fight World War I, Pearl finds her ambitions at odds with the reality of the life she’s been dealt. It’s clear something isn’t right with the young woman, and her violent tendencies begin to bubble to the surface.\r\n\r\nThings weren’t great for women in 1918, and the world certainly wasn’t a place for a fiery feminist. The film is an intriguing character study of a thoroughly disturbed woman who is a victim of her own gender. Goth is asked to do the film’s heavy lifting, and she gives a wonderfully unhinged lead performance. She screams a lot but displays an impressive range, especially as she is thrust into episodes of psychopathic ire. Her calm demeanor is frightening, and almost as disturbing as her precise, unique kills. Using farm tools, Pearl becomes a skilled murderer as she gives herself over to her homicidal desires.\r\n\r\nThe story is simple but engaging, and West creates an old-timey mood with a vintage score that fits the tone beautifully. The Technicolor aesthetic harkens back to Hollywood’s Golden Age, a time of traditional glitz and glamour. It’s a great looking film that feels fresh and different, and West directs with an assured eye. His long, unbroken takes are showy but executed with purpose, and the film features a powerful monologue that’s unforgettable.\r\n\r\nOne of my favorite parts about the movie is the chilling ending, an extended scene of a true demented breakdown that still haunts me. There’s so much that makes this film so memorable, and “Pearl” is a special kind of horror film with a refreshing style and killer instinct.", "created_at": "2023-04-23T06:25:34.989Z"}]