[{"movie_id": 1008392, "review_id": "64cca2172f266b09ed6019fe", "rating": 6.0, "review_text": "Director Tim Story‘s “The Blackening” isn’t your typical genre film; it’s a horror spoof with an edge. The perceptive and clever story from co-writers Tracy Oliver and Dewayne Perkins is packed with timely social commentary about stereotypes and “blackness,” which gives this sophisticated satire a fresh and unexpected twist. It’s uncomfortable, it’s whip-smart, and it’s a whole lot of fun.\r\n\r\nA group of friends (Perkins, Antoinette Robertson, Grace Byers, X Mayo, Jermaine Fowler, Yvonne Orji, Jay Pharoah, Melvin Gregg, Sinqua Walls) plan a reunion at a remote cabin in the woods over the Juneteenth holiday weekend, but there’s a danger lurking nearby. They discover that they are being stalked by a masked killer who plans to murder all of them, starting with the person they deem the “blackest.” The killer works through a very racist looking board game that supposedly tests their “blackness” by asking a series of racially-specific questions. This tests the limits of the group’s friendships as they fight to survive the night.\r\n\r\nIt’s a funny and clever premise for a movie, and the mostly all-black cast really pulls it off. Perfectly cast, the actors are appealing and have terrific comedic timing. The character development is substantial, which makes this one of the more thoughtful horror films in years.\r\n\r\nThe overall vibe is a bit of “Scary Movie” mixed with “Get Out,” but merged together in an original way. It’s really not very scary and isn’t as funny as it probably could’ve been, but the minor stumbles (and predictability) is outweighed by the insightful script. While Story doesn’t quite nail the two genres, there’s still a lot to like.\r\n\r\n“The Blackening” is a movie that pushes boundaries, challenges audiences, and will inspire many deep discussions. Even better is that it’s also an enjoyable ride.", "created_at": "2023-08-04T07:00:39.105Z"}, {"movie_id": 1008392, "review_id": "64e72f97c3c89100e35f9f9f", "rating": 5.0, "review_text": "So a group of friends with the usual collection of personal relationship baggage arrive at a rural cabin after ten years of not meeting. After a brief exploration of the place, they find themselves at the mercy of a board game that requires their undivided attention else a crossbow will put paid to each of them. Initially they are all petrified - especially as two of their number take fairly early exits (perhaps they'd read the whole script?) - but gradually they realise that team work might be their only hope of salvation. What now ensues is just a mess. It contrives to include just about every stereotypical character known to man in what seems like an overlong hundred minutes of attitude that really just fell flat. After about twenty minutes I was merrily supporting the would be killer who just couldn't mow down this lot fast enough. There's a bit of a twist at the end which might have worked better had I cared in the slightest about their survival, but even that seemed engineered only to create something that, horrifyingly, suggested that a sequel might be in the back of someone's mind! Sorry, it's neither funny nor frightening and I was glad when the credits started to roll.", "created_at": "2023-08-24T10:23:19.042Z"}, {"movie_id": 1008392, "review_id": "64f48fbf7d41aa00ac65ca06", "rating": 1.0, "review_text": "A group of insufferable, KKK-tier racists with little to no redeeming qualities go on a trip, pretending to be friends.\r\n\r\nMurder and hilarity ensues. No, wait, I misspelled that last one: bigotry. Murder and bigotry ensues.\r\n\r\nAvoid.", "created_at": "2023-09-03T13:53:03.252Z"}]