[{"movie_id": 739405, "review_id": "6404baec021cee00b4feb013", "rating": null, "review_text": "International intrigue is the name of the game in the latest Action-Caper\r\nfilm from Guy Ritchie and he has delivered a winning mix of action and\r\ncomedy with” Operation Fortune: Ruse de guerre”.\r\n\r\nWhen a secret device known as “The Handle” is taken from a lab by a\r\nprecision combat team, the U.K. government calls in Nathan (Cary Elwes),\r\nto gather a team and retrieve the item even though there is little known\r\nabout what it is and what it can do. The simple fact that it was taken by\r\nforce and is supposedly on the market for Ten Billion dollars makes this\r\nan item of high value.\r\n\r\nNathan quickly recruits Orson (Jason Statham), away from his vacation and\r\ndespite his quirks and laundry list of items required for his\r\nparticipation due to said quirks; he is soon brought into the group.\r\n\r\nThe team is rounded out by young agent JJ (Bugzy Malone), and American\r\ncomputer expert Sarah (Aubrey Plaza), which irritates Orson to no end as\r\nhe liked the tech he had become used to working with and the fact that\r\nthey were hired away by a rival firm and Sarah’s give as good as she takes\r\nattitude causes him stress.\r\n\r\nIt is learned that noted arms dealer Greg (Hugh Grant), appears to be\r\nbrokering the deal and the crew travels from one part of the world to\r\nanother with a rival team and all manner of dangers around them.\r\n\r\nIn a race against time, the team brings actor Danny Francesco (Josh\r\nHartnett), into the mix as he is a favorite of Greg’s and the hope is that\r\nthis will provide the team an introduction and access by having Sarah pose\r\nas Danny’s new lady.\r\n\r\nWhat follows is a madcap and comedic adventure with loads of enjoyable\r\ncharacters and situations and enough action to keep things moving and\r\nenough laughs to keep audiences smiling.\r\n\r\nThe cast is great and works very well with one another and it would be\r\ngreat to see them do further adventures with one another as their shared\r\ndysfunctions, attitudes, and quirks make them realistic and engaging and\r\na nice change from the indestructible Teflon agents we are so used to\r\nseeing in films of this type.\r\n\r\n4 stars out of 5", "created_at": "2023-03-05T15:53:16.342Z"}, {"movie_id": 739405, "review_id": "6405f5ee67dcc900d4829cc3", "rating": 3.0, "review_text": "**_Operation Fortune's_ convoluted plot and terrible pacing result in a viewing experience that leaves a lot to be desired.**\r\n\r\nOperation Fortune was a terrible movie from start to finish. The plot was incredibly generic, filled with a bunch of cool spy jargon that made the agents sound really cool. The pace is way too fast, with jump cuts from scene to scene that attempt to be quick and seamless but just left me lost. I spent more time trying to figure out what was going on, where we were, and why we were here than I did enjoying the actual movie. The action was average at best, filled with cuts that tried to mask the poor choreography. When we were not spending time on lackluster action set pieces, it was used to deliver exposition dumps to help the audience attempt to understand what was going on. I have a hard time coming up with anything positive about my experience with the film.\r\n\r\nThe performances left a lot to be desired. I think Jason Statham and Josh Hartnett did a decent job, but they did not blow me away. None of the main cast had any amount of chemistry, particularly Statham and Plaza. The latter quite disappointed me in this film. None of her comedic timing worked, and I found her performance to be rather flat. With how stacked the cast was, I am leaning toward believing that the script was so horrid that it was limiting the actors abilities to put on a good performance.\r\n\r\nOverall, I had a pretty terrible time watching this in theaters. I kept checking the time, waiting for the credits to finally roll. If you like Guy Ritchie, check this film out; otherwise, skip it because you will avoid wasting two hours of your life.\r\n\r\n**Score:** _26%_\r\n**Verdict:** _Bad_", "created_at": "2023-03-06T14:17:19.016Z"}, {"movie_id": 739405, "review_id": "640bb998c2679600e750c156", "rating": 5.0, "review_text": "**Operation Fortune had all the appearances of a movie heavily altered on the cutting room floor… and not for the better.**\r\n\r\nI’m not quite sure what happened to this movie. It had hints and moments of something much more Guy Ritchie but instead was slower-paced and confused. I almost felt like an hour of screen time was cut from the film because many characters and plot points seemed incomplete. The entire movie was disjointed. The action was mediocre. The writing was so bad. There were so many great qualities this movie had going for it. The great cast and veteran director had me excited to see this film, but what I saw felt like the studio had pulled a Justice League on this movie, hacking and slashing it into something with shades of something else potentially entertaining but leaving a mess behind.", "created_at": "2023-03-10T23:13:28.352Z"}, {"movie_id": 739405, "review_id": "641a11af1c635b00790c0f16", "rating": 7.0, "review_text": "In spite of a rather convoluted plot, fall flat comedy and a very minor dash of woke nonsense, I mostly liked Operation Fortune: Ruse De Guerre. \r\n\r\nDon't let the dash of French pretension in the title fool you, there's nothing remotely clever or sophisticated, about this flick.  \r\n\r\nAt heart, this is stripped down, nuts and bolts, action fare. Its pacing is decent and it has enough going on, exposition  wise, to keep the viewer entertained. Exotic locations, gun fights, fist fights, car chases, pyrotechnics, it has it all, in abundance.\r\n\r\nActing is generally reasonable. Hugh Grant does a great Michael Caine(??) impression.\r\n\r\nIn summary, diverting, simple action fare, with a little unconvincing window dressing, in the form of tired comedy and a nod to a more sophisticated story line, that never arrives. Still worth a look, if taken on its true merits, as opposed to those it aspires to.", "created_at": "2023-03-21T20:21:03.379Z"}, {"movie_id": 739405, "review_id": "6439552f37b3a90078458cf6", "rating": 6.0, "review_text": "I was quite disappointed that despite months of cinema trailers, this went straight to the television. Why? Well I reckon that's because if I had seen it on a big screen I would have struggled my way through it in one go. As it is, I've taken about three days to get to the end of this stylish looking but really insubstantial crime caper. The story centres around the dodgy antics of \"Greg\" (Hugh Grant) who is looking to facilitate a $10 billion arms deal that just about nobody wants to happen. It falls to \"Orson\" (Jason Statham) and his team of crack operatives to come up with a plan to thwart the deal and apprehend the bidders! The only chink in the armour of our \"Greg\" is his idolisation of the American film star \"Danny\" (Josh Hartnett) and so they recruit him to come and partake in a bit of real life fan-doration (obviously without explaining just quite what is going on, or how perilous it might be) and off they travel to beautiful Antalya in Turkey where they must use all their guile, wit and technical savvy - largely down to \"Sarah\" (Aubrey Plaza) - before someone smells a rat. The problem here is that the story is just all too old hat. We've seen it all once too often and so when we have to rely on the characterisations to enliven the thing we are presented with an overly hammy Grant; a Statham who really is reusing an old - and well wrinkly - skin and Plaza who is really rather a lacklustre personality on screen. The jokes are all a bit predictable, as are the 007-light action scenes, car chases and - indeed - the whole thing just lacks for any sense of originality. It's not the worst film I've seen lately, but I wonder if maybe Guy Ritchie is just spent now? Perhaps it is time for him to take a few years off and try to work on something that can capitalise on his undoubtedly creative quirkiness without offering the same old sandwich just on a different shiny plate.", "created_at": "2023-04-14T13:29:19.314Z"}]