[{"movie_id": 652004, "review_id": "61880381d388ae0061304336", "rating": 7.0, "review_text": "I don’t watch many horror films at all. It just isn’t a genre I care for. The one exception I tend to make is if a horror flick is laced with humor. The Wolf of Snow Hollow has humor, some of it subtle and situational.\r\n\r\nBut as it happens, there was a second reason I wanted to watch this movie, and that is Robert Forster. I have always liked his work, and this is his last film, I believe, and it is dedicated to him in the credits. Without him in it, I would still have watched it. It kept me just interested and entertained enough to stick with it. The ensemble cast does a pretty good job wiyh a reasonable intelligent plot and script. I don’t imagine I will feel compelled to watch it again, but I don’t regret the time it took to watch it once.", "created_at": "2021-11-07T16:49:05.781Z"}, {"movie_id": 652004, "review_id": "62782063aa659e009b826035", "rating": 6.0, "review_text": "_**Grisly slayings in a winter hamlet in Utah**_\r\n\r\nAn up-and-coming Sheriff (Jim Cummings) wants to prove himself when horrific murders suddenly grip his remote town near Christmas time. Is it an animal, a human or something… else? Robert Forster plays the soon-to-retire dad and Riki Lindhome a subordinate officer. Manly Jimmy Tatro is also on hand.\r\n\r\n“The Wolf of Snow Hollow” (2020) is a mystery/thriller with horror elements and a zippy sense of black humor. It has the setting of “Donner Pass” (2011), “Snowbeast” (2011) and “Silent Night” (2012), but a different threat mixed with clever amusement.  \r\n\r\nThis is a solid piece of full moon entertainment by writer/director/star Jim Cummings. I loved the snowy locations and Chloe East is a highlight on the feminine front, along with Amanda Brown in a small role. Meanwhile the humor is amusing. Yet the flick’s a little too frenetic for its own good. Cummings coulda reigned things in for some more mood, but it’s his movie, not mine.\r\n\r\nThe film runs 1 hour, 25 minutes, and was shot in Kamas, Utah, which is a about 25 miles east of Salt Lake City, on the other side of the mountain range.\r\n\r\nGRADE: B-/B", "created_at": "2022-05-08T19:56:19.646Z"}]