[{"movie_id": 86834, "review_id": "543111310e0a265915001518", "rating": 4.0, "review_text": "Let me make it clear from the beginning, I do not care if a movie like this is 100% true to the bible and I could not care less about the creationist fanatics moaning about how this and that movie is telling the wrong story or is distorting their religion. But this attempt to re-tell the story is just bad.\r\n\r\nThe first half of the movie is not all bad. It is actually somewhat enjoyable. The dark scenery is sometimes depressing and beautiful at the same time. I did like the watchers. It added a bit of extra to the movie and the fight when Tubal-Cain tried to capture the ark was not bad at all.\r\n\r\nHowever, then it went downhill quickly with Noah going more and more nuts and Tubal-Cain, having survived, is subverting Noah’s son Ham. Not that Noah did not really bring that upon himself to some extent though. The parts where Noah want to kill his grandchildren and stops in the last minute is just Hollywood soap-opera bullshit. Also, do not get me started about the ridiculous scene where Anthony Hopkins goes berry hunting like some mental retard.\r\n\r\nUp until about half the movie I did not really understand all the very negative reviews but after having watched through the miserable last half I have to say that I do understand them more. I think the one-star ones are a bit harsh since the movie is often quite beautiful and the acting, despite the crappy script, is quite good, but the lousy script is just destroying the movie.\r\n\r\nDefinitely a disappointment.", "created_at": "2014-10-05T09:36:49.911Z"}, {"movie_id": 86834, "review_id": "54590f9f0e0a26115800215f", "rating": null, "review_text": "This is a hard movie to watch and rate.\r\n\r\nThe Good:  The images of the flood coming from both above and below the earth were spectacular. The trauma that Noah deals with during the flood and post-flood is beautifully depicted.  I loved the image of Noah realizing that the ‘sickness’ is in him as well as the others. The story-telling of creation to fall to the flood was beautifully done. I also liked the tension of Noah and the family on the ark as they wrestle with the possibility that the Creator has forgotten them. \r\n\r\nSo with all that good, what ruins the movie?\r\n\r\nI do think a director/writer has an obligation to the source material.  Subtract the religious aspect of this movie and imagine the outrage if someone changed the story of Harry Potter or Thor.  (Oh wait…they are doing that.)  \r\n\r\nPoint is: if you have source material, use it.  Go ahead and be creative when there are blanks to fill in but why have source material if you're not going to use it?  The director did merge two ancient flood stories – the Bible and the Babylonian Enuma Elish.  In the end – neither tradition gets a clear telling of their story.\r\n\r\nOther issues?  The role of Methusala was a complete waste of the talented Anthony Hopkins.  And I still have no idea as to why he was even in the film.\r\n\r\nThe conclusion felt hollow and rushed.  Noah at the beginning of the film leads an isolationist lifestyle focused on raising his children to be good stewards of the earth.  How is this different at the end of the film?  It's not.  Their understanding of life, the Creator, the world isn't any different than the beginning.  There really isn't a pay off to the story...at all.\r\n\r\nIt's just an average film and I expected more with this cast.", "created_at": "2014-11-04T17:40:47.761Z"}, {"movie_id": 86834, "review_id": "6317cac98ac3d000808f8a81", "rating": 2.0, "review_text": "Watching Noah, it occurs to me that it must have been made by atheists. After all, they are treating the Word of God  as little more than a first draft. \r\n\r\nOn the other hand, though, co-writer/director Darren Aronofsky isn’t fucking around with the old \"thou shalt not take the name of the Lord your God in vain,\" making sure to substitute the G word with the epithet \"the Creator.\" \r\n\r\nThus, Noah (Russell Crowe) tells his wife Naamah (Jennifer Connelly) that “[the Creator] is going to destroy the world” (after which he will presumably be known as “the Destroyer”) by way of a flood, which may have given rise to the expression 'when it rains it pours;' I mean, the characters are already living in a post-apocalyptic wasteland; destroying it would certainly qualify as overkill.\r\n\r\nNoah turns to his grandfather Methuselah (Anthony Hopkins) for advice — by the way, according to the Bible, Noah invented wine, but what the Good Book doesn’t say is that Methuselah invented tea; the latter is a miracle in itself, since water and leaves, the two essential ingredients to prepare this beverage (not to mention the fuel needed to start a fire and the kindle to keep it burning), are entirely conspicuous by their absence. \r\n\r\nLuckily, Methuselah has a magical seed that can grow an entire forest overnight, but which he had apparently been saving to give to Noah. Noah uses the wood from the trees in this forest to build the Ark, which follows the Field of Dreams Principle; i.e., 'If you build it, they will come' — 'they' being two of each animal, all of which without exception clearly belong to the computatrum generatae genus, but then the visual effects are one of the few pleasures to be had here; in particular the “Watchers” (fallen angels turned into semi-anthropomorphic rock formations voiced by Frank Langella and Nick Nolte, among others), as well as the montage that accompanies Noah's narration of Genesis.\r\n\r\nAdditionally, the Ark itself and the accompanying flood are not unimpressive, and I like how Aronofsky has Noah's sons succumb to Rapid Aging Syndrome to indicate the passage of the many years it would take to complete such a gargantuan project.\r\n\r\nThe problem with this is that they grow up to be Emma Watson, Logan Lerman, Douglas Booth, etc., all of them with impossibly perfect hair, skin, and teeth (unless, of course, Methuselah also invented shampoo and toothpaste, in addition to tea).\r\n\r\nAll things considered, however, the real highlight of the film is Ray Winstone's performance as Tubalcaín. Winstone is nominally the villain, but his character is really the most sensible of all (and Winstone’s delivery lends eve more weight to his convictions), correctly pointing out that both the Creator and the proto-David Koresh that Crowe plays Noah as — although his madness is justifiable; \"if the noise of all those animals didn't drive Noah insane (not to mention the insect bites), the smell should have killed him\" (The Skeptic’s Dictionary) — have become drunk with power.", "created_at": "2022-09-06T22:33:45.731Z"}, {"movie_id": 86834, "review_id": "63c2c4f005a53300aed04296", "rating": 6.0, "review_text": "I feel obligated to watch and review movies like this. I am just happy as a clam that they make movies based on real life or mythological things simply because it gets people interested in it.\r\n\r\nI mean, I'm a historian...one that has spent his life walking that fine line between history, geology, and a Catholic faith...\r\n\r\nThey never agree.\r\n\r\nDon't worry, I don't care about how historically accurate movies are and being a historian I play lip service to the presumed accuracy of my religion.\r\n\r\n...And as someone with a deep understanding of geology, when it comes to even 5,000 years ago I play lip service to my own profession.\r\n\r\nI think it's hysterical that people are hating on this film for religious reasons. \"Noah\" is largely Biblically inaccurate, which is even funnier than usual given that every Priest I've ever had recognizes Noah as Gilgamesh.\r\n\r\nSo to hate it on a religious stance is idiotic to begin with...and to hate a totally religiously inaccurate film simply because it's based on a tale from the Abrahamic Holy books is as idiotic because, well, it's not even accurate to those.\r\n\r\nSo we'll erase all the Religious and history crap now and just look at the movie.\r\n\r\nIf you didn't see this in the theater and if you don't have a, well, an Ark sized TV...it might not be worth it.\r\n\r\nThe main selling point is really watching the Great Flood, the Deluge is sort of why people like me want to see it...and we want to see it BIG. HUGE. ENORMOUS.\r\n\r\nSo...a small screen and you might as well be watching abrupt History Channel \"The Bible\" miniseries...and just leave it at that.\r\n\r\nIn fact, you may be better off passing if you don't watch it big...because without the enormity of the flood on the enormous screen you are left with Russell Crowe and that just hurts.\r\n\r\nYup...Russell Crowe. What you have here, minus the flood (which is the star of the show) is Crowe, a man that is so convinced that he is God's gift to acting that he totally forgot how to do it.\r\n\r\nI don't care how you feel about religion (as long as you tolerate all of them) and I don't care how you feel about accuracy in film...no matter your feelings you have to endure Crowe.\r\n\r\nIf you can do that more power to you.\r\n\r\nBut then you have Jennifer Connelly and yeah, you may think she's still eye candy--and you would be right--but that doesn't change the fact that she still can't emote.\r\n\r\nThankfully you have Watson, who manages to out act both of them...and Hopkins if he really had a role in all of this worth his skills.\r\n\r\nSo if you have the means to watch it big...the flood is worth the price of admission...if you don't beware of the Crowe.", "created_at": "2023-01-14T15:06:24.387Z"}]