[{"movie_id": 82654, "review_id": "544e12160e0a2608cd004227", "rating": 7.0, "review_text": "If you like zombie's gener you will love this movie ... or not!\r\n\r\nIt cheats in a cheap way through creating 2 level of zombies: the good ones and the bad ones. Also, it breaks tons of zombies stereotypes to be able to build the story, that's why you may end hating it if you are a \"purist\".\r\n\r\nAs this is not my case, I really enjoyed this movie. Fun script, good casting and great performances by Hoult and Palmer. Also, always a pleasure to watch a movie with John Malkovich.", "created_at": "2014-10-27T09:36:22.239Z"}, {"movie_id": 82654, "review_id": "5a9b9d2b0e0a2605c602b82e", "rating": 7.0, "review_text": "This is a quite different zombie movie. I think it can best be described as a romantic zombie movie with a humorous touch and some action thrown in for good measure. It is not at all a bad movie. I do prefer the “shot everything that moves and when it doesn’t move anymore shot some more just to be sure” type of zombie movies but I still quite enjoyed this one. The words “romantic” and “zombie” is of course two words that you really would never expect to see in the same sentence. Surprisingly enough it does indeed work in this movie.\n\nI think my main enjoyment of this movie was the voice-over with R’s thoughts though. At times it is incredibly funny. The actual story, that the zombies’ magically starts to heal themselves is of course pretty nonsensical but you do not really watch zombie movies for their elaborate plot anyway. I have seen worse and this was not really supposed to be a horror-zombie movie anyway so I can live with that.\n\nThis is the first zombie-movie that I have watched where you actually see the story from the zombies perspective. Another thing that, surprisingly enough, worked quite well. The voice-overs helped a lot to make that happen.\n\nThe special effects are fairly low key for being a zombie movie but I would say that they are just about right for this movie. The “bonies” are the most monster-like ones in the movie and their make-up is quite cool. Unfortunately their movements are quite stiff and look decidedly computer generated. That is a shame and pretty much the only complaint I have concerning the actual implementation of this movie.\n\nUnless you are totally allergic to zombies I would recommend watching this movie. I would especially recommend it if you are not normally into zombie movies. You are likely to be surprised.", "created_at": "2018-03-04T07:15:55.455Z"}]