[{"movie_id": 8681, "review_id": "50ea1e1619c2954378544100", "rating": 9.5, "review_text": "One of my best films of all time. Apart from they made a second one, this a great movie! Liam Neeson trying to save this daughter, in France, from being sold to the highest bidder. An action packed film with good acting and great fight scenes.", "created_at": "2013-01-07T01:00:06.490Z"}, {"movie_id": 8681, "review_id": "513ae6be760ee3231702b18c", "rating": 8.0, "review_text": "This is a very good action/thriller flick. It currently holds a 7.9 rating at IMDb which it certainly deserves. The few people giving this a 1 or 2 star rating must be disgruntled French people who do not like to see the French government officials portrayed as corrupt bastards (which they often are anyway).\r\n\r\nI generally like Liam Neeson so the fact that he is in the movie kind of got the movie off to a good start already. In this movie he plays a real badass, I-kick-the-shit-out-of-anyone-standing-in-my-way, former CIA agent hunting down the despicable low-life that kidnapped his daughter. I really, really liked the role he played in this movie. He makes characters like Bourne look like wussy. Even I was surprised when he actually shot the wife of the corrupt French government bastard to get him to talk. That was just awesome.\r\n\r\nThe movie is pretty much action all the way. Well, it starts off laying the groundwork for the story and here Liam Neeson is indeed playing a fairly timid father that seems to be a bit out of his depth. Once he gets thrown into his right element he quickly casts of the sheep's fur and reveals the wolf (sabre-toothed) underneath.\r\n\r\nThis is really a textbook action/thriller movie. A very enjoyable hour and a half indeed.", "created_at": "2013-03-09T07:37:34.676Z"}, {"movie_id": 8681, "review_id": "53a767a3c3a368707a0034f9", "rating": null, "review_text": "Daddy knows best — especially when it comes to a mostly untrustworthy cast of Europeans — in this action film. Liam Neeson's performance elevated this from being forgettable. Otherwise, I kind of didn't care.", "created_at": "2014-06-22T23:32:51.553Z"}, {"movie_id": 8681, "review_id": "5c8cd9419251410fed9e6e3c", "rating": 6.0, "review_text": "Probably not good enough to have started the Revenge-Renaissance that it somehow did, but still a pretty entertaining time. _Taken_ does hit a lot of clichés though, and I mean, it starts hitting them right away. We're literally only minutes into the film before we find out that Neeson's lead character is divorced, and his wife has re-married to a decent, rich provider, but one who's bookish and could never take him in a fight, and that the present he got for his daughter is for an interest that she no longer has. But once we get into the action proper, it's pretty great.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-03-16T11:08:49.624Z"}, {"movie_id": 8681, "review_id": "5ecb3d47d2147c0021b97209", "rating": 8.0, "review_text": "Random viewing tonight, just wanted a slick and simple action-thriller and this fit the bill. Liam Neeson kicks ass and can see why his career in this genre really took off. The camera work was probably the biggest drawback (shaky cam), likely trying emulate the Bourne franchise or something. But entertaining flick that doesn't overstay its welcome coming in at around 90-minutes. **4.0/5**", "created_at": "2020-05-25T03:36:39.010Z"}, {"movie_id": 8681, "review_id": "5ee1e24b90dde00021aa07d7", "rating": 7.0, "review_text": "Your arrogance offends me.\r\n\r\nIt is proof positive that you can still have a basic and formulaic genre piece and the multiplex crowd will forgive it the sins of film making. For here we have a revenge thriller that is over reliant on a ream of contrivances? The kind that people scoff at when horror pictures not wanting to be serious get screamed down for?. There is also some pretty poor acting performances on show, the usually reliable Famke Jansen looks lost when asked to show emotion, Maggie Grace needs to go back to acting school, whilst some of the French actors on show give French actors a bad name.\r\n\r\nHowever the true saving grace in the movie, outside of some serious revenge fuelled torture sequences, is Liam Neeson in the lead role of Bryan Mills. Charismatic and believable as a father hell bent on finding the one thing worthwhile that he has in his life, it's only here that Luc Besson & Robert Mark Kamen's uneven writing gets any sort of urgency to go with the tidily put together action sequences. Taken is an enjoyable film if taken within the context of its genre, and for sure the subject matter of skin trafficking is a noteworthy plot, but no one can surely deny it doesn't have a shallow core and honestly isn't giving anything new to a pretty stagnated formula... \r\n\r\nBy the by, the thrills ensure popcorn pleasing pleasures and thus it's rated as such. 7/10", "created_at": "2020-06-11T07:50:35.181Z"}, {"movie_id": 8681, "review_id": "63002a2896e30b007fde8c2a", "rating": 10.0, "review_text": "**You will find this movie. You will watch it.**\r\n\r\nThis movie came out of nowhere! The trailer for this film relied on just one short scene of Liam Neeson threatening a kidnapper on the phone... and that was all we needed to be hooked! A basic revenge/rescue movie elevated by fantastic action, stunt directing, and Liam Neeson's delivery, all transporting this thriller into a believable reality. One of the best of the genre that paved the way for John Wick.", "created_at": "2022-08-20T00:26:16.046Z"}]