[{"movie_id": 381283, "review_id": "59bb363dc3a3680efe005032", "rating": 8.0, "review_text": "This film defies being rated on a scale of 1 through 5 - it's truly almost impossible to do so. I want to rate this a 5 and I want to rate this a 3 at the same time. Both would be wrong though so I'll just settle in the middle. Aronofsky has given us many brainsick films in the past, but this is on a whole other level. Remember the batshit crazy climax of _Requiem for a Dream_? Multiply that by 50 and you get the batshit crazy climax of mother! - and that is a *huge* understatement.\r\n\r\nI don't really want to talk too much about the film's plot or the finale as not much about the film is known to the public at this point. It's absolutely worth it to go into this film as blind as possible or maximum effectiveness. All I'll say is that the _Rosemary's Baby_ influenced poster and marketing so far is a big curve ball - it has nothing to do with that film although Polanski horror elements are clearly an inspiration to Aronofsky here.\r\n\r\nI do want to praise three specific elements of this film that worked the best for me: (1) The sound design was absolutely magnificent. There is no score to this film - not quite sure what Jóhann Jóhansson did here - but the sound design is eerie as hell and supremely memorable. (2) The production design is next level. The house in this film is basically the co-lead (you'll see what I mean when you watch it) and it evolves drastically over the course of the film (again, you'll see what I mean when you watch it). Excellent art direction that I haven't stopped thinking about all day. (3) The performance from Jennifer Lawrence is harrowing as she really gave herself to this film and to Aronofksy's vision, but the performance that stuck with me is the one from Michelle Pfeiffer. She really embodied her character and even though she's only in maybe the first 60% of the film, she left a deep impression on the rest of it as well. Her character is crucial to the film and she injected such mystery and gravity to the events that followed her exit.\r\n\r\nWill soon watch this again and hopefully have more meaningful thoughts. It's hard to say too much right now when hardly anyone has seen the film yet, but believe me, there is a lot to be said about _mother!_", "created_at": "2017-09-15T02:09:01.359Z"}, {"movie_id": 381283, "review_id": "5a4efd0d0e0a2657770065be", "rating": 5.0, "review_text": "_mother!_, a movie title with no upper case letters. Well _mother!_, I'm glad you saved those capitals because I have a question which is going to require a lot of them: \"WHO THE FUCK WAS THIS FOR!?\"\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2018-01-05T04:20:29.945Z"}, {"movie_id": 381283, "review_id": "5a566ce90e0a2607e402bc95", "rating": 2.0, "review_text": "I'll start by saying, maybe I'm not the demographic this film was intended for.\r\n\r\nThat said, I spent 95% of the movie with a confused expression on my face, and asking myself \"what the hell is this?\"  I walked into the theater expecting something good--not necessarily great, but enjoyable.  This movie was confusing, inexplicably violent, never got to the point or fleshed out a story/plot, and left me feeling very uncomfortable throughout the film's entirety.\r\n\r\nI really DON'T recommend this movie.  It seemed like a total waste of time.  The plot was non-existent.  Confusing.  Disturbing at times, without any explanation, context or reason.\r\n\r\nI'd give it 1 star, only because the sets were really well done.  Other than that not worth even one watch, I think.", "created_at": "2018-01-10T19:43:37.967Z"}, {"movie_id": 381283, "review_id": "5f9b9c1acb3084003586ba58", "rating": 8.0, "review_text": "Nuts.\r\n\r\n<em>'mother!'</em> is an enjoyable watch, even if I didn't fully understand what was happening - I had a rough guess in my head throughout, but I was off given what I've read elsewhere online since. I'm fine with that though, I felt entertained which is all that truly matters.\r\n\r\nJennifer Lawrence is great, as is Javier Bardem. Those two are very much the stars of the film, though you also have Ed Harris and Michelle Pfeiffer in noteworthy roles. Excellent casting for all four. The film, meanwhile, looks superb, from the effects to the cinematography.\r\n\r\nIt's quite unsettling and wild to watch it all unfold, in a positive way though. One of the weirdest watched no doubt, and I've seen <em>'Rubber' (2010)</em>...", "created_at": "2020-10-30T04:52:42.078Z"}, {"movie_id": 381283, "review_id": "63c212b7e16e5a008192569a", "rating": 1.0, "review_text": "Let's be honest, this is a home invasion movie trying to push itself off as an art house flick with a higher IQ.\r\n\r\nIt kind of lies to you and really hate it when movies try to pass themselves off as more than they actually are.\r\n\r\nYou can't blame the actors here, it's all the director and the studio. They wanted controversy, they wanted drama, they wanted critical praise and the wanted people to talk about it....\r\n\r\n...but in the end, it's a home invasion movie and it wouldn't have had any of what the studio and the director wanted if they just made an honest film.\r\n\r\nBut then, if they were honest about what they were making, it probably would have done better, it would have made more money. People wouldn't have been so confused about it, the critics would have panned the hell out of it and ten years down the line it may have had a cult following.\r\n\r\nInstead, you have a crap movie trying to pass itself off as art house...and all the pretension that comes with that.", "created_at": "2023-01-14T02:25:59.618Z"}, {"movie_id": 381283, "review_id": "651090e2344a8e096f84fce0", "rating": 6.0, "review_text": "**_Looks great, awesome themes, tedious storytelling_**\r\n\r\nA renowned poet and his much younger wife (Jennifer Lawrence and Javier Bardem) live in a huge old house in the sticks. He has writer’s block while she’s restoring the house after a fire. When unannounced strangers show up (including Ed Harris and Michelle Pfeiffer), it naturally has a negative effect on the beautiful woman and her world.    \r\n\r\n“Mother!” (2017) was helmed by Darren Aronofsky, who’s known for artsy stuff like “Requiem for a Dream” and “The Fountain,” but he’s perfectly capable of doing more conventionally entertaining flicks, like “The Wrestler.” This one falls in the former category, although the first act is fairly conventional and compelling in the manner of, say, “What Lies Beneath” or “Cold Creek Manor.” \r\n\r\nYet it gets increasingly incomprehensible and tedious. You could say it starts like a Roman Polanski film, in particular “Cul-de-sac” and “Rosemary’s Baby,” but ends with the surrealism of Luis Buñuel. You’re thinking maybe home invasion à la “Desperate Hours” before the proceedings become unfathomable. Part of the fun of a movie like this is trying to figure out the symbolism and meaning. In this case, you’ll need to be up on biblical material and ecology, otherwise you’ll be lost.\r\n\r\nSo, I’m in the middle on this unique work. It’s professionally made, Jennifer is beautiful in her prime, it begins interesting enough, and the themes are unforgettable but, as a standard viewing experience, it gets dull and annoying. I never want to see it again, yet I’ll probably be pondering the metaphors the rest of my life. I respect it, but can only recommend it to those who are intrigued. It's not for everyone. \r\n\r\nThe movie runs 2 hours, 1 minute, and was shot in Montréal and Québec. \r\n\r\nGRADE: B-", "created_at": "2023-09-24T19:41:22.335Z"}]