[{"movie_id": 11804, "review_id": "5e206bd9f04d0100150fd157", "rating": 3.0, "review_text": "White Noise fizzles out its noisy static by just being plain boring. Watching Keaton as he unconvincingly stares at televised white noise for an hour and a half, which is essentially nothing, perfectly surmises the experience of Sax' supposedly supernatural horror. However, the biggest crime that the studio committed was releasing the feature on the first weekend of the year. Now, it's common knowledge that the initial start to the cinematic year typically begins with a disposable horror. Well, White Noise is to blame. Signalling untapped box office potential, despite the overt opinions of critics. And, as to be expected, matches the quality of a broken tape. A successful architect loses his wife to a drowning accident, to which he then encounters a psychic introducing him to the supernatural phenomenon of EVP.\r\n\r\nElectronic Voice Phenomena. Y'know, recording background noise in a room, playing back the tape and flabbergasted when the ghost of ‪Michael Jackson‬ hauntingly sings \"Thriller\". Except in White Noise the tool that's used is, well, white noise. The annoyingly hypnotising static from televisions when no channel is picked up from the current frequency. Keaton becomes entranced by the ominous voices and high definition faces he sees within the six televisions he owns in his modern apartment. Who is making contact? Is it his wife? Malevolent entities trapped in the cubic prison that is a television? Pretty sure writer Johnson didn't even know himself.\r\n\r\nThe film is a mess. It's muddled, confused and abhorrently remains stagnant throughout. This architect, a father, essentially abandons his son when fixated on saving souls warned by his deceased wife that conveniently match the images in the white noise as soon as he arrives to any given scenario, despite \"Willow Avenue\" being mentioned days before. So think of it as 'Final Destination' meets 'Pulse' (original, obviously...). Except it's neither as entertaining as the former nor as horrifying as the latter.\r\n\r\nKeaton looked bored as hell and overacted in times of emotional distress, although reassured the narrative with control. The jump scares were obnoxiously tame, yet admittedly one of the piercing noises made me twitch my body. The ending is...well, let's just not talk about it. It's terrible, with CGI ghost things swooping in on Batman, and answers no lingering questions that the mystery of EVP conjured up. Heck, the feature begins and concludes with onscreen text about \"existing\" occurrences. \"1 in 12 cases are dangerous\". Yeah. Ok. You know what is dangerous? Ruining Keaton's career. We had to wait a decade later for his rejuvenation!\r\n\r\nWhite Noise admittedly has a decent enough premise, yet Sax' lack of direction accompanied by shoddy writing and lacklustre performances resulted in one film that had the similarities to white noise. Nothingness.", "created_at": "2020-01-16T13:57:45.753Z"}]