[{"movie_id": 640, "review_id": "5800ad579251414014004202", "rating": null, "review_text": "This was an entertaining and fun piece of film making from the ever-reliable Steven Spielberg. It is a bit of a depart from his usual full-blown and hugely epic pictures, yet this does not detract at all from the fascinating story of Frank Abagnale Jr. I was interested in this man before I'd seen the movie, and it only served to increase my interest. Although it is important to remember (as with any such film) that this is only 'inspired' by a true story and not told word for word from one, the plot is fascinating and keeps you laughing, crying and wondering until the end.\r\n\r\nFrank Abagnale Jr. is an astounding and interesting character. The real life Abagnale originally said that he did not believe DiCaprio to be 'suave' enough to play the role, but he certainly does pull it off. DiCaprio's acting is superb, and totally believable as a man who could lie to, deceive, and con everyone he met without once losing any of his charisma or charm. Hanks is also excellent, he plays the role of the obsessed FBI agent well, and also with a likable quality. The interaction between these two characters was great, it was interesting to see a budding relationship slowly build between two characters who were actually positioned against one another.\r\n\r\nI loved the look of the film. It was a refreshing blast to see the 60s portrayed in such a vivid and colorful way. The whole setting and atmosphere of the film gave it a wonderful and almost (I hesitate to use the word) 'magical' sense. This tone appealed to me much more than a darker tone might have.\r\n\r\nHowever, the film is rife with moral ambiguity. As much fun as it is to watch DiCaprio jumping from one place (and identity) to the next, forging checks and spending inordinate amounts of money at a whim, the film never really focuses on the morally bankrupt side of the story. The portion of the film devoted to this at the end still seems to skim over the fact that this man has stolen millions of dollars. It ends on a high note for Frank Abagnale Jr., never fully spelling out the wrongs he committed. Still, this would probably bring the whole film down, and sometimes it's fun just to enjoy a bit of escapism without being told off for desiring such things. I mean, it's hard to be totally strict and upright - you have to love it when DiCaprio's character swindles Jennifer Garner's prostitute for $400!\r\n\r\nOverall, this is a fun film and really enjoyable. Not as much of an epic masterpiece as some of Spielberg's other movies, but still a great film!", "created_at": "2016-10-14T10:03:03.468Z"}, {"movie_id": 640, "review_id": "632630df894ed6007d99867c", "rating": 7.0, "review_text": "**Catch Me If You Can is an entertaining and amusing film full of Spielberg, Hanks, and DiCaprio charm.**\r\n\r\nWith Tom Hanks and Leonardo DiCaprio as leads and Steven Spielberg directing, I don't think it's possible not to enjoy this movie. Everyone loves Hanks and young Leo. Every Spielberg film drips with nostalgia and enthusiasm. Catch Me If You Can is precisely what you would expect from this talented crew. A clever, witty film with growing respect between a con artist and the FBI agent trailing him. Spielberg crafts an excellent, satisfying, and entertaining movie based on the true story of Frank Abagnale Jr. and Carl Hanratty.", "created_at": "2022-09-17T20:41:03.930Z"}, {"movie_id": 640, "review_id": "63ec32231f3e60008593105c", "rating": 9.0, "review_text": "Just as great as expected.\r\n\r\nI'm not quite sure how I've never got around to watching this, for two reasons: Leonardo DiCaprio and Tom Hanks. Literally two of my favourite actors. Well, at least I have now and I can only add to the general vibe around <em>'Catch Me If You Can'</em>. It's very good!\r\n\r\nDiCaprio and Hanks are terrific throughout, the former narrowly outshines the latter but the film is very much greater for having them both onboard. Neat to see the likes of Christopher Walken and Amy Adams behind 'em, too. It's as well cast, and as well made, as you'd anticipate from a Steven Spielberg flick.\r\n\r\nI potentially would've shaved a little bit off the run time, though that's very much a minor, minor 'but' of mine. All things considered, it's entertaining to watch, has some solid amusement and is told in a interesting manner. I'd happily revisit it, certainly.\r\n\r\nA quick look at the real life Frank Abagnale's <a href=\"https://en.wikipedia.org/wiki/Catch_Me_If_You_Can#Cast\">Wikipedia</a> seems to suggest an equally as intriguing story, with many claims of his potentially being debunked in the years since... yet that, given what has followed them, would simply make him even more of a noteworthy con man!", "created_at": "2023-02-15T01:15:15.096Z"}]