[{"movie_id": 590223, "review_id": "5fa5a0991b7294003e8f5602", "rating": 7.0, "review_text": "Harmless, ok for families.", "created_at": "2020-11-06T19:14:33.975Z"}, {"movie_id": 590223, "review_id": "5fa5ba891d820f0042c0d760", "rating": 7.0, "review_text": "\"Love and Monsters\" starts off as a teen romance interrupted by the apocalypse, but thankfully becomes much more than that and ultimately very entertaining. \r\n\r\nThere is a welcome trend recently in apocalyptic movies (possibly due to the ongoing pandemic) of finding originality vs. defaulting to a zombie plague. \r\n\r\nFormer \"Teen Wolf\" and \"The Maze Runner\" star Dylan O'Brien is an affably geeky guy that stumbles into the hero role. The monster scenes balance decent special effects with fun action. \r\n\r\nI would have liked to see more of the beginning's \"life in the bunker\" setup as it would likely have given the movie more emotional depth. \r\n\r\nBut overall this is a very enjoyable family-friendly adventure.", "created_at": "2020-11-06T21:05:13.845Z"}, {"movie_id": 590223, "review_id": "6072e38aca835400408bc6bb", "rating": 7.0, "review_text": "Yet another victim of the pandemic-mandated cinema-to-VOD shuffle many films have undergone in the last 15 months, it sucks that 'Love and Monsters' won't get a true chance to shine on the big screen in the way few non-franchise films like this get to any more. Should 'Love and Monsters' become beloved enough by audiences to warrant a sequel, there's plenty more in this universe to dive right into (something the film doesn't outrightly aim for but doesn't fully discourage). I know I'd be more than happy to revisit it.\r\n- Ashley Teresa\r\n\r\nRead Ashley's full article...\r\nhttps://www.maketheswitch.com.au/article/review-love-and-monsters-a-fun-freakshow-for-the-whole-family", "created_at": "2021-04-11T11:54:50.426Z"}, {"movie_id": 590223, "review_id": "63e72f98d388ae00d2b20408", "rating": 7.0, "review_text": "**Love and Monsters is so different and lighthearted compared to pretty much any other monster film and makes for a delightfully entertaining movie.**\r\n\r\nLove and Monsters was a big surprise! Based on the trailers and marketing, I expected a mediocre, straight-to-streaming, forgetful film, but Love and Monsters is a charming comedy with some monsters, action, and romance thrown in. The stark contrast between Dylan O’Brien’s plucky good-hearted, optimistic Joel and the hopeless monster-filled wasteland makes for an entertaining and unique juxtaposition. The storytelling and characters are all fun and lovable. Despite the backdrop of such a desperate world, the movie feels lighthearted. The creature designs were all comical but grotesque and interesting, almost like evil Pokémon. My only real complaint is that the CGI was low-budget and mediocre, but it was clearly the best they could do with what they had. I would love to see more from this world and these characters, but I doubt I will see that wish come true.", "created_at": "2023-02-11T06:03:04.220Z"}]