[{"movie_id": 1523, "review_id": "5ca6b2c2925141258ede9685", "rating": 8.0, "review_text": "I am the father of Africa.\r\n\r\nBased on Giles Foden's novel of the same name, this filmic version of a period of Idi Amin's presidency of Uganda is a class act - that is if you can accept it as a loose reworking of events in Amin's life? Thus those who filed in for a bona fide history lesson subsequently either got angry or plain disappointed.\r\n\r\nPropelled by Forest Whitaker's barnstorming Oscar winning perf as Amin, Last King of Scotland is riveting and fascinating from first reel to last. The political upheaval at this time in Uganda's history is presented in delicate strokes of dark depressing realisations, and also that of uneasy humour.\r\n\r\nThe portrayal of Amin is most complex, part man child, part greenhorn political suitor and one heartbeat away from despotic lunacy, with Whitaker nailing every single tick. It's key to note that the film does shed some light on Amin, so as a character study it soars and holds you enthral throughout.\r\n\r\nDirector Kevin Macdonald films in kinetic style, which is perfect for the material to hand, and he also deserves a pat on the back for ensuring the characters around Amin (circle of family/advisors etc) are a constant intrigue as per Amin's agenda machinations. James McAvoy gives sterling support as the key \"fish out of water\" doctor who Amin takes to his bosom, while Kerry Washington as Amin's wife number 3 also strikes the right emotive notes.\r\n\r\nThe finale falters somewhat, where it encompasses the Entebbe Hostage Crisis but fails to do that incident justice - instead using it as a cypher to have us rooting for McAvoy's made up character to get out of harm's way. But this is just a misstep that's not film defining. For this is a fine film, if it's not jolting you with harrowing scenes, or tickling your brain for education purpose, then it's demanding your attention for historical noting. Job done. 8.5/10", "created_at": "2019-04-05T01:43:30.118Z"}, {"movie_id": 1523, "review_id": "630d7be8226c56007edb80df", "rating": 4.0, "review_text": "According to Wikiquote, a “British official” once said that Idi Amin needed “things explained in words of one letter.” It is one of The Last King of Scotland’s few flaws that it assumes we need things seen through the eyes of a white Westerner.\r\n\r\nSure, James McAvoy has some very good scenes with Forest Whitaker, the best of which is arguably the first (though in retrospect it doesn’t quite hold up to scrutiny), which ends with Amin and Dr. Nicholas Garrigan exchanging shirts (so that Amin can give Garrigan’s to his non-existent son Campbell, brother to the epileptic, and most likely also imaginary, Mackenzie) as if they’d just been in opposing sides of a soccer match.\r\n\r\nOther scenes are much less fortunate, especially the one wherein the good doctor assists the dictator in the forced release of a massive flatulence. Good or bad, though, it matters little because none of this happened, and Dr. Garrigan never existed – not that he’s the least bit believable, either; starting with how he decides to go to Uganda (literally spinning a globe, closing his eyes, and pointing), Nicholas invariably behaves more like a character in a movie than an actual human being.\r\n\r\nHe can grab Amin’s sidearm without being instantly gunned down by the sundry nearby soldiers; he can drive, through streets he presumably is unfamiliar with, Amin to safety after the latter has been ambushed; he’s fresh off medical school but has the poise of an expert physician; and he’s so irresistible that one of Amin’s wives is willing to risk life and limb (or rather limbs, as it turns out) to have sexual congress with him (and even if the character were real, we still wouldn't be interested in his sex life).\r\n\r\nWikipedia tells me “the film mixes fiction with real events to give an impression of Amin and Uganda under his rule.” Well, we certainly get an indelible impression of Amin thanks to Whitaker’s haunting performance; on the other hand, wouldn’t we get a clearer impression of Uganda under his rule if the film stuck to the facts?\r\n\r\nWhat’s the point of shooting on location if we only get a perfunctory idea of the effect the dictatorship had on the country and its people? Even the captions before the closing credits are too little too late, especially considering they aren’t much more accurate than anything that has gone on before. Instead, everything is filtered through Garrigan, who cares mostly about saving his own skin and isn’t really all that concerned with the fate of the Ugandan nation.\r\n\r\nIt’s a shame because director Kevin Macdonald’s influences are impeccable; Amin’s “Nothing comes from nothing” echoes Lear’s “Nothing can come of nothing,” and the way he dismisses Garrigan at one point is reminiscent of Rolf Hoppe chewing out Klaus Maria Brandauer in Mephisto. Perhaps Macdonald should have leaned completely towards the fictional approach and made a film à clef (Zangaro, The Dogs of War’s faux African dictatorship, would have been a good template).", "created_at": "2022-08-30T02:54:32.264Z"}]