[{"movie_id": 132363, "review_id": "62594980e0ec51004fedc646", "rating": 7.0, "review_text": "We begin with some brutality at the hands of a character (Alex Pettyfer) who believes that the negroes on their cotton plantation are, quite literally, worthless. He rapes a woman then murders her husband when he raises a very mild objection! His mother (Vanessa Redgrave) takes a liking to their now orphaned boy and promotes him from the fields to be their houseboy. Learning how to keep his head down and to play the game, he quickly succeeds and ends up working in the White House. His period there (ending in the Reagan administration) allows for an interesting conduit to depict the evolution of the American civil rights movement, of changing (and not) attitudes and it gives a little insight into how the Oval Office and it's occupants might work. The supporting cast list is impressive, but with the exception of Oprah Winfrey (his wife \"Gloria\") most have but fleeting appearances as the story moves along. Their own life is not without heartache and troubles - one of their sons is determined to do what he can to fight for their freedom from oppression, an activity done at considerable peril to him and those around him. The narrative also, gently, exposes discrimination across the board - from salaries and promotion opportunities, to segregated seating at a milk bar, as well as nodding, tragically, to the war in Vietnam. Perhaps it is the gentle way in which it illustrates the prevalent racism that is most potent. It allows us to evolve with him, sometimes slowly, sometimes shockingly and that is to the credit of Whitaker who exudes a decency that is hard not to admire. The production is well paced with a complimentary soundtrack that is well worth a look.", "created_at": "2022-04-15T10:31:28.507Z"}, {"movie_id": 132363, "review_id": "6468b422d18572012080ca48", "rating": 10.0, "review_text": "I was in a mood for a Robin Williams movie. I hadn't heard of this one and it was streaming free. While Williams had only a small role as Eisenhower this movie was amazimg: thought provoking and tear jerking. Probably not the best for a 5:30 a.m. Saturday, bu this is going on  my DVD to purchase list. Following a man(Whittaker) from his childhood on a plantation, to running away from home, getting a job as a house boy in a fancy DC hotel, to butlering for seven different presidents, though Carter and Ford don't make an appearance. It's a family tale, falling in love witn a maid from the hotel(Whimphry), raising two boys, onein politics, from MLK to the BPP to congress, all against daddy's wishes, and one \"good boy\" who joins the army for what he believes in. I only heard of Whitaker from Young Rock, but he was great.Makeup was wonderful keeping up with aging. Oprah was a great mama, loving her boys, pleasing her man, and a lonely house wife while he worked long hours at the Whitehouse contributing to struggles with alcohol and adultury. One of the best dramad I have seen in years.", "created_at": "2023-05-20T11:50:58.679Z"}]