[{"movie_id": 11442, "review_id": "5a026c2d92514111da008457", "rating": 4.0, "review_text": "_Michael Myers: The Reality TV Show!_\r\n\r\n...Somehow still less dumb than _Halloween 6_.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2017-11-08T02:30:05.840Z"}, {"movie_id": 11442, "review_id": "613f8cb56af9dd0027bc3b10", "rating": 5.0, "review_text": "_**Serviceable, but pedestrian and comic booky entry**_\r\n\r\nSeveral college youths agree to be part of a reality TV show where they stay in the dilapidated Myers’ residence in Haddonfield, Illinois. Unbeknownst to them, Michael is still alive and has returned to his home town after stopping by the asylum to visit Laurie (Jamie Lee Curtis). \r\n\r\n\"Halloween Resurrection\" (2002) is the seventh installment of the Michael Myers saga (not counting the unrelated “Season of the Witch”) and is the final film in the series until the remakes. It gets a lot of hate because of what happens in the opening act and the inclusion of Busta Rhymes, but it’s serviceable and definitely superior to the lousy “Halloween: The Curse of Michael Myers” (1995). It’s just kinda unimaginative and cartoonish with several bits being hackneyed or predictable by this point.  \r\n\r\nThe feminine department includes Daisy McCrackin (Donna), Katee Sackhoff (Jen), Bianca Kajlich (Sara), and Tyra Banks (Nora). The beautiful women wandering around a rundown domicile and dying one-by-one is reminiscent of “Death Tunnel” (2005) but without the amazing cinematic artistry (even though it cost $11.5 million MORE), not to mention “Death Tunnel” has better women.\r\n\r\n\"Halloween 4\" (1988) is easily the most entertaining of the original series, followed by \"Halloween 5\" (1989) and “H20” (1998).\r\n\r\nThe movie runs 1 hour, 34 minutes and was shot mostly in the Vancouver, British Columbia, area with the Hillcrest Academy sequence done at Silver Lake, Los Angeles. \r\n\r\nGRADE: C", "created_at": "2021-09-13T17:39:01.615Z"}]