[{"movie_id": 353081, "review_id": "5b5b3d24c3a368670c015b12", "rating": 10.0, "review_text": "Some things age like fine wine and in the cinematic world the ‘Mission: Impossible’ franchise is a great example of the adage. Perhaps it has to do with the 56-year-old Tom Cruise who defies age and pushes his physical boundaries for our viewing pleasure? The answer is quite evident in ‘Fallout’ as his Ethan Hunt is as good as a caped superhero in the sixth film of the series. The story isn't all that new with its twists and turns. But ‘Fallout’ manages to build on the previous films in the series by bringing back old friends and foes, besides adding some new ones. Henry Cavill as August Walker fits right into this universe as the hammer to the scalpel that is Ethan Hunt. His presence is looming enough to fill the entire screen whenever he appears. Simon Pegg takes on the status of a series regular alongside Ving Rhames, whose Benji and Luther respectively play more than just mere sidekicks as they add comic levity and heart. Alec Baldwin and Angela Bassett also make a mark in their brief appearances but watch out for impactful turns by Rebecca Ferguson and Michelle Monaghan along the way.\r\n\r\nWriter & Director Christopher McQuarrie allows each character to shine while building on their history with each other, thus making them endearing to the audience. This only serves to up the ante when they’re in danger. McQuarrie also lets the story breathe by bringing some calm before the storm hits. Which leads to the most crucial aspect of the series, and one that McQuarrie clearly excels at in this film – the action sequences. Not only are they meticulously planned; they are executed with precision, even when the fist fights are gritty and gruesome. Rob Hardy beautifully choreographs the camerawork following these intricate set-pieces, either allowing you to take in the expanse or bringing you up close and personal when required. This is paired with a soundtrack by Lorne Balfe that lends to the tension by giving the iconic ‘Mission Impossible’ theme a sinister sense of urgency.\r\n\r\nMcQuarrie has now directed two ‘Mission: Impossible’ films; his understanding of the franchise and its characters proves to be the secret weapon of the series. The fact that the stunts are largely done with practical effects featuring the cast, and most prominently Cruise himself, sets a whole new standard for action films. ‘Mission: Impossible – Fallout’ is a great mix of plot, pacing and performances that is undeniably the best entry in the franchise, while it re-establishes Cruise’s status as an action superstar.\r\n\r\nReview by Times of India (TOI)\r\nFinal Rating - 4.0/5", "created_at": "2018-07-27T15:41:24.679Z"}, {"movie_id": 353081, "review_id": "5b5bb15dc3a368421b00811d", "rating": 6.0, "review_text": "Mission Impossible - Fallout is a continuation of Mission Impossible - Rogue Nation. It is directed by Christopher McQuarrie who also directed Rogue Nation and also has the return of the psycho villain Solomon Lane (Sean Harris) who the bad guys want to set free.\r\n\r\nEthan Hunt (Tom Cruise) is after the mysterious John Lark and a terrorist group called the Apostles who have stolen three plutonium grade devices and plan to set them off.\r\n\r\nHunt has to reluctantly accept a new team member. CIA operative August Walker (Henry Cavill) because the IMF team were responsible for losing the plutonium in Berlin.\r\n\r\nAs a spy thriller there is enough tension, thrills and a serpentine story with several twists.\r\n\r\nHowever the film is overlong and I felt that some of the action scenes consisted of myriad chase scenes that were stylishly done but nothing really memorable liked the Burj Khalifa climbing scene.", "created_at": "2018-07-27T23:57:17.197Z"}, {"movie_id": 353081, "review_id": "5b74cdbb9251411d9100612a", "rating": 10.0, "review_text": "Excellent story line with tremendous stunts by Tom Cruise himself. This movie is worth every penny that you spend.", "created_at": "2018-08-16T01:04:59.964Z"}, {"movie_id": 353081, "review_id": "5c21fb5ac3a3686ff9ecd6f3", "rating": 7.0, "review_text": "I have to say I have not been a great fan of the Mission Impossible movies. Sure, there’s plenty of action and cool stunts but I do not feel they follow the spirit of the TV-show. In the TV-show they got their mission and then they completed it, tricking the bad guys, with the full backing of the IMF team. No political bullshit, betrayal of the team and such like nonsense.\r\n\r\nHowever, in pretty much every movie Ethan or the entire IMF team was betrayed or set up and he had to, not only complete his mission but, clear IMF from whatever shenanigans the story writers had dreamed up. The movies have been Mission Impossible in name only. I wonder if the moron script writers has ever watched the show.\r\n\r\nIn this movie too there is indeed a bunch of political nonsense and betrayal. Shit that I could be without. But at least IMF and Ethan’s team are on his side throughout the movie. There are also a few clever parts where they trick the bad guys in a good old fashioned Mission Impossible style.\r\n\r\nOtherwise the movie is mostly a classical Hollywood action adventure/thriller movie. Plenty of, more or less, non stop action. There are a few of the usual WTF story holes and defiance of physics when it comes to the stunts of course. The dumbass CIA director was a completely unnecessary element though.\r\n\r\nStill, overall I found this installment in the franchise to be one of the better ones. Maybe even the best one yet.", "created_at": "2018-12-25T09:41:46.533Z"}, {"movie_id": 353081, "review_id": "5c3426b8c3a3685202b521d2", "rating": 10.0, "review_text": "Movie was good but its not better than ghost protocol.", "created_at": "2019-01-08T04:27:36.859Z"}, {"movie_id": 353081, "review_id": "5c44854bc3a3681a0924f88f", "rating": 5.0, "review_text": "They just keep getting better, but they never get good.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-01-20T14:27:23.154Z"}, {"movie_id": 353081, "review_id": "62bf552728723c007c126283", "rating": 7.0, "review_text": "Now this is a much better outing for our IMF pals - much sharper pace and direction than the meandering \"Ghost Protocol\". This one sees \"Ethan\" (Tom Cruise) with \"Luther\" (Ving Rhames) and the still frequently irritating Simon Pegg (\"Benji\") having to track down some plutonium balls after an earlier mission went a bit awry, and before lunatic ecologist Sean Harris (\"Solomon Lane\") commits an atrocity to end all atrocities in the name of creating a new world order! The first twenty minutes are poor; predictable and formulaic and I will admit to having started to write it off, Once Henry Cavill (\"August Walker\") joins the gang, however, and they start to search for the missing cores it becomes fast-moving, action-packed and enjoyable - with plenty of crosses and double-crosses. Rebecca Ferguson still always comes across the same, whomever she plays, but that works for this one and the team spirit really comes across. Sure, it isn't going to win a Booker for the writing, but it travels the world showing off some fine locations (many of which are actually left intact, afterwards!!) before heading to an exciting denouement with helicopters and Cruise's favourite mountain-top pinnacle combat. All good stuff.", "created_at": "2022-07-01T20:12:23.165Z"}]