[{"movie_id": 10665, "review_id": "5bb3284b0e0a263df2007829", "rating": 7.0, "review_text": "Upon first viewing, _The Strangers_ was one of only two films I'd seen that actually ever frightened me as an adult (well, a seventeen year-old, but close enough). To be fair, both films I'd seen in the same setting - alone, the middle of the night, in the aptly named \"Suicide Flats\", and what's more, I've since re-watched _The Strangers_ a couple of times and realised that both my fear, and my enjoyment, were perhaps a bit overstated on that first viewing. Even taking that into account though, and seeing it again almost a decade after that first time, I still honestly believe that _The Strangers_ is a good movie, with some pretty genuinely creepy elements.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2018-10-02T08:11:55.825Z"}, {"movie_id": 10665, "review_id": "5d6162697f6c8d0019ecfddc", "rating": 7.0, "review_text": "I know this movie gets hyped without end, and I think, that has mainly to do with Liv Tyler playing the lead. I remember seeing this, as it first came out, and even though I enjoyed it, it didn't really stick with me. Nothing overwhelming, but a nice watch. Liv Tyler does a fine job here, but for most of the time she is alone in the house, and the movie becomes quite repetitive after a while. Once we get to the killers, most people were so excited about the reason, they did all this. Because 'Kristen' was home! Seriously? Who would have thought? Isn't that the same reason, why 'Jason Voorhees' kills people all around 'Camp Crystal Lake'? Because they are there? But I get it. The point is, that the killers have no other motivation than just to attack random people. There is no desire for money or jewelery... just the pure lust to take lives. But that is a motivation, most serial killers have, and therefore it doesn't seem all that special. When the movie becomes bloody towards the end, I really loved it though. It is nice, to see a movie like this acted by someone, who is as well known as Liv Tyler, and also Scott Speedman was totally fine. \"The Strangers\" is a fine little home invasion movie, but most certainly it doesn't deserve this extreme hype.", "created_at": "2019-08-24T16:14:33.368Z"}]