[{"movie_id": 615904, "review_id": "621a78da79a1c30043ff4017", "rating": 7.0, "review_text": "MORE REVIEWS @ https://www.msbreviews.com/\r\n\r\n\"Marry Me is far from being a groundbreaking rom-com, but the lead actors, compelling character work, and excellent original music make for genuine entertainment.\r\n\r\nJennifer Lopez (Hustlers) and Owen Wilson (Loki) surprisingly share amazing chemistry, in addition to delivering absolutely fantastic performances, constantly pulling viewers back to the screen when the narrative becomes repetitive and generic. John Bradley (Game of Thrones) and Sarah Silverman (Ralph Breaks the Internet) also contribute to the light and fun environment of the film.\r\n\r\nThe balance between the life of a celebrity and the \"common citizen\" is quite well explored, and the vision of how much fame limits a normal life is the most interesting storyline of the entire narrative.\r\n\r\nFor fans of the genre, it's strongly recommended.\"\r\n\r\nRating: B", "created_at": "2022-02-26T19:00:42.474Z"}, {"movie_id": 615904, "review_id": "630b0b53ca7ec6007bcd2558", "rating": 1.0, "review_text": "Owen Wilson better be careful lest he becomes the go-to for aging Latino MILFs. Last year he managed to save Bliss from Salma Hayek’s strident overacting, but he has no such luck with Jennifer Lopez in Marry Me. \r\n\r\nNow, to be fair, the movie’s failure is not her fault, and she acquits herself a lot better than Hayek did; it also helps that Lopez is essentially playing herself – a mega popstar with a string of failed marriages. And whereas she isn’t an acting prodigy, nor is, for that matter, Maluma, who plays her temporary fiancee, they are nevertheless performers who know their way around a stage and are extremely comfortable in front of an audience.\r\n\r\nIt’s no surprise then that the only genuine moments in Marry Me take place during a sold-out show – that is, of course, until Kat Valdez (Lopez), having discovered, right before they are supposed to tie the knot in between musical numbers that Bastian (Maluma) has been unfaithful, has what can only be termed as a psychotic break and decides to pick out a random dude from the audience and marry him on the spot instead. Let’s put it like this: this plot is too outlandish even for Wilson, and he has been in several Wes Anderson films.\r\n\r\nThe reason that Charlie (Wilson) is at the concert is pretty random itself; Parker (Sarah Silverman), her friend and colleague – they are both teachers, or at least he is a math teacher that, as it often occurs in the movies, has only a handful of students in his charge; she on the other hand mostly appears to just hang around the school –, planned to attend the show with her girlfriend, but her girlfriend broke up with her, so she asks Charlie to come and bring her daughter along. \r\n\r\nOk, so this is the hottest show in town – sold out, as I mentioned above –, but Parker just happens to conveniently have a third ticket available; still harder to believe is that her girlfriend didn't wait until after the concert to break up with her.\r\n\r\nAnyway, that very same night Kat is already the butt of Jimmy Fallon’s jokes on The Tonight Show – which is obviously impossible because The Tonight Show doesn’t air live; in fact, it is taped in the afternoon and broadcast hours later. \r\n\r\nBut who knows? Maybe Jimmy is clairvoyant and, having seen the whole thing coming, pre-taped a few pertinent jokes. All things considered, you know you’re in big trouble when your movie makes less overall sense than Notting Hill.", "created_at": "2022-08-28T06:29:39.022Z"}, {"movie_id": 615904, "review_id": "631fa7a57fcab30082ed6885", "rating": null, "review_text": "Cute screenplay and fun performances! Wish some of its other elements were a bit stronger so I could say it was great, but it was still pretty fun. Really could’ve used a stronger sense of rhythm, both in its editing and pacing.", "created_at": "2022-09-12T21:41:57.270Z"}, {"movie_id": 615904, "review_id": "6340c4e6e4b576007bfcb6f9", "rating": 6.0, "review_text": "**Marry Me relies on its strong leads to make this average rom-com worth at least one watch.**\r\n\r\nMarry Me doesn't do anything new, but Jennifer Lopez's class and Owen Wilson's lovable everyman charm make an average rom-com a decent watch. The outlandish concept of a pop star spontaneously marrying a random fan in the crowd, feeding the media circus, and then accidentally falling in love might seem far-fetched, but in today's world not completely impossible. Marry Me tries to tell the story Notting Hill for a new audience but falls short by rushing the story and forgetting to make the romance believable. It all just happens without convincing or satisfying its audience. Lopez and Wilson's awkward escapades are still enjoyable to watch but not enjoyable enough for a second viewing.", "created_at": "2022-10-08T00:31:34.894Z"}]