[{"movie_id": 157841, "review_id": "5787dd0992514131c40016d3", "rating": 8.0, "review_text": "> Sure, everyone finds their pine tree.\r\n\r\nThe film was produced by three countries from three different continents, carved by one of my favoutire French directors that talks of a prodigy child. An English language film set in the American soil. If you had liked his films, then you would like this one as well. Like all his films, it was visually fantastic and it was his first digital 3D project. One of the underrated film of the recent time. A road adventure and a coming-of-age film that neatly rendered especially for the family and children film fans.\r\n\r\nMore like it was a kid version of 'Amelie' and now I realise why the author picked this particular foreign filmmaker for the cinematic translation. This is not some kid's summer vacation tale or the school related stuff, but a rural kid and his weird family. They're united by family, but divided by their field of interest. Born in such family, the film focused his life and mostly the fighting of his loneliness.\r\n\r\nIt was based on the book about a 12 year old boy T.S. Spivet who lives on a ranch in the Rockies with his family. He's a scientific research enthusiastic and so one day he receives an unusual call from the Washington DC that he had won a prestigious award for his invention. After a sudden tragedy in the house he set to travel by his own to the other side of the country. The adventure begins as he hitchhike to his destination where he learns many things.\r\n\r\n> \"The amazing thing about water drops, is that they always take the path of least resistance. For humans, it's exactly the opposite.\"\r\n\r\nThe kid was brilliant, it was his perspective story. In one of the scenes when he gets hurt, that felt like it was real. His co-stars supported him all the way, but not as a game changer. You might agree with me that it is not a great story, somewhat familiar too, but the film topic is inspiring like how an atypical family cooperates during the bad times that compared with their negligence to each other at one point before. There are a few fun moments, but also gets emotional at the final part.\r\n\r\nThe train journey had lots of effects on the narration, because I'd seen a road movie, but this is a very rare, especially it gives us some glimpse over awesome landscapes of different part of the country. Like I said, the cinematography was the best part of the film followed by many others. In the end, I was very satisfied for it is being somewhat simple with having an extraordinary boy character. Because, you know, genius boy means usually the writers goes for an extra mile to make him shine with his brain powers to perhaps face the bad guys or the bad situations for which the audience sets to go awe.\r\n\r\nReally very sad that it was not as popular as 'Hugo' where everyone who saw it comparing with, especially for the digital 3D visuals. That tells how much the people are addicted to Hollywood and of course marketing was not upto the standards as against the film's standard. In fact, it took me two years to learn such film is exist. So I definitely recommend it to all. If you have not seen it yet, just do it, you might like it, surely you would enjoy it.\r\n\r\n8/10", "created_at": "2016-07-14T18:42:17.772Z"}]