[{"movie_id": 270010, "review_id": "57d306fbc3a3682000000762", "rating": 4.0, "review_text": "**About a salesman who went to sell his product sold himself.**\r\n\r\nI like this director, one of his film was in my all time favourite list. But I'm not sure what happened to him lately, he's not the same as what he was a decade ago. This is his worse to far I've seen. He's better than this, but he chose a wrong book. It was based on the book of the same name that tells the story of an American salesman whose last chance to get back on the track goes to saudiarabia to sell his product to the king. But the king's unexpected last minute reschedules avoids his meeting and so it continues like that for some time. In his those spare time, how he explores the desert country and its culture, including an unexpected feeling for a local lady doctor was told.\r\n\r\nSeems a fine material for the reading, the cinematically it did not have the same appeal. I haven't read the book, but it is short and lacks in detail it deals. The main character remains a mystery for not properly revealing his history, especially for the no flashback, which would have put him is a good position. That's why it looks just a mid story, that begins in a mid way of someone's life. Though Tom Hanks was good, like usual in another unique role.\r\n\r\nThe film is about arebia, but it was shot in Morocco and Egypt. There's no big contribution from the supporting characters, except two. Sarita Choudury, especially Alexander Black transformed completely to a real areb and they both put a good show as well. The film was below average. Since it was a Hanks' film I anticipated something strong. It was something, but not the something I was looking for. Watchable film, but skipping it won't make any regret if you're okay with skipping an Hanks film. All the above his fans are very disappointed, so I hope his next film 'The Circle' would make us this one to forget.\r\n\r\n4/10", "created_at": "2016-09-09T19:01:15.287Z"}]