[{"movie_id": 420817, "review_id": "5ce6be5f0e0a26522acf29b6", "rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nWhat a wonderful surprise! I didn’t watch any trailers or clips, I completely stayed away from any sort of marketing, but I couldn’t hide from the negative feedback that social media was presenting. People online were skeptical of how good Will Smith‘s Genie would be, of how Mena Massoud (Aladdin) and Naomi Scott (Jasmine) were not the best casting choices, and of how the remake would actually honor and respect its original. From someone who didn’t know what to expect, I thoroughly enjoyed Guy Ritchie‘s take on the retelling of this famous story. All of the fears described above are obliterated by a magical cast, and they’re the ones who carry the movie to safe harbor.\r\n\r\nI’ll start with one out of two standout performances: Will Smith as the Genie. He delivers an indisputably unique and entertaining display as the blue entity. By the way he moves and talks, there’s absolutely no way of people criticizing him for trying to copy Robin Williams. Smith does his own thing, and it works superbly. The best compliment I can give him is that I felt the same thing about Genie in this remake that I did while watching the original: every time he wasn’t on screen, I wanted him to be back immediately. In the original, I thought that the Genie appeared in the right moments every single time, which was when the pacing started to drop too much.\r\n\r\nIn this remake, the periods without Genie are more extended, and the first act suffers a bit from its slow pace, and lack of truly fun sequences. Nevertheless, once the Cave of Wonders comes into play, it’s a blast until the very end. The magic carpet and Abu make one hell of a comedy duo, and they’re responsible for a lot of the laughs throughout the runtime. Going back to Genie, I love that Ritchie and John August gave him something more in comparison with the original, and that’s one of few improvements actually made to the original. I wrote on that review that I was hoping that they gave more time for the core relationship of the film to develop and that Jafar (Marwan Kenzari) was more than just a paper-thin villain…\r\n\r\nWell, Jafar keeps being an evil sorcerer that only desires power to rule everything and everyone. Unfortunately, he has more screentime than its predecessor, which means more over-the-top monologues of Kenzari, and sillier sequences with the whole hypnosis trick. On the other hand, Jasmine and Aladdin have a fully-developed script, which is by far the best improvement on the original. Their relationship grows naturally, and each character gets a lot of moments to express their feelings and show who they truly are, especially Jasmine. She is directly connected to an issue that will definitely make this movie incredibly divisive, audience and critics alike, but I’ll address it more at the end of the review.\r\n\r\nIndependently of the characters, Mena Massoud and Naomi Scott deliver breakthrough performances. Massoud is funny and quite likable as Aladdin, but Naomi is an absolute standout. Now, we look at this film as just another Disney remake. In a few years, we’ll look at Aladdin (2019) as the movie that launched Naomi Scott into the stardom. She is astonishingly outstanding as Jasmine. Not only her voice is pretty amazing, but her acting is unbelievably seamless. Regarding singing, Will Smith and Mena Massoud are also pretty good, and the musical numbers are another aspect that I surprisingly loved. Prince Ali, Friend Like Me, A Whole New World and the new song, Speechless, are beautiful, powerful, and the first two’s production design and VFX are overwhelming in a good way.\r\n\r\nGuy Ritchie is known for his very fluid chasing sequences, and Aladdin running through Agrabah is very well filmed as expected. However, the long choreographed takes during these musical scenes are a wonder to behold, from the first to the very last one, even after the “The End” tagline shows up. A perfect remake is one that is able to keep the original’s essence while being its own thing. Ritchie does an impressive job balancing these pillars. For anyone who loves the original and wanted the remake to be a shot-by-shot retell of the story, every single little detail (from key words to important character moments) is present in this film. For anyone who wanted a different take, there’s more than enough minor changes to either how the story proceeds (order of events, more character development) or even how it ends, which leads me to the above-mentioned divisive issue.\r\n\r\nEvery time a political or social agenda is inserted in a movie, people don’t care if it’s well-written or not. They just don’t want any of those things on any film, and I support that. Hollywood needs to stop trying to put something politically or socially correct in a movie, just for the sake of it. Aladdin (2019) has a clear social message, and it uses one of the main characters to state that message clearly. Now, here’s the catch: having in mind the character in question, how it’s written, and what they do to send that social message, I think it’s fine. Yes, I know that a lot of people will think the complete opposite and crucify the film for it. I usually do the following mental exercise: “Does it make sense with the story/character? Is it just a single moment during the movie (proving that it might be too forced) or do they develop the idea? If it was an original film, would I even be thinking about this?”\r\n\r\nYes. They develop the idea. Probably not. Those are my answers, and that’s why I stand on the positive side of this soon-to-be heavily discussed subject during a few days. People need to start opening their minds to these modern takes on pre-21st-century classics. I always use Dumbo (1941) as an example: this is probably the most racist Disney movie ever, with extreme discrimination, total disrespect for animals, alcohol-induced plot points, and so much more morally and socially wrong storylines and character’s personalities. There’s no way that a film like that can be released today! So, obviously, Dumbo (2019) had to be extremely different from that one-hour racism show.\r\n\r\nAladdin (1992) also has a particular aspect about it that it doesn’t quite fit nowadays’ culture. It’s not offensive or anything, but I bet that if it was released today, a whole group of people would complain about it. Aladdin (2019) tries to adapt, and while it might have tried too hard, I still appreciate the effort, and at least it makes sense. It’s only a minor change to the core story and to the character in question, so it' shouldn’t affect the overall viewing of the movie. If Speechless wasn’t created, it would have been totally fine, but I have to admit that even if the song sounds great and the lyrics are impactful, it’s still a stretch… Naomi Scott interprets it beautifully, though.\r\n\r\nVisually, the film is stunning. Agrabah is an absolute delight that will make hardcore fans’ jaws drop continuously, each time a new location is shown. I love how Ritchie strolls the camera around to show-off his production crew beautiful work, most of the times through long and fluid takes. I wish (no pun intended) he could have controlled the movie’s pace and tone better. Periods without Genie to entertain the audience are too long, and Ritchie shouldn’t risk the boredom levels to be as high as they are occasionally.\r\n\r\nAll in all, Aladdin (2019) succeeds in balancing the two pillars of any remake: it keeps the original’s true essence while standing on its own. Will Smith shuts down online skeptics with a super entertaining and unique performance as Genie, but it’s Naomi Scott and Mena Massoud palpable chemistry that surprised the hell out of me. The latter is perfect as Aladdin, but Naomi has her breakthrough display, which is definitely going to take her to even bigger stages. Guy Ritchie proves he’s a fantastic director, by delivering some beautiful one-take sequences and exceptionally fun and well-choreographed musical numbers. Technically, the production and set design are astounding, but the pacing-tone levels aren’t as balanced as they should have been, which makes the runtime over-extend itself.\r\n\r\nStory-wise, people will feel incredibly divisive. Most of the screenplay is identical to its predecessor, but Disney’s attempt to force down a social message is not going to help the film, at all. Even if it makes sense and it’s only a minor twist, it was still unnecessary, and it might even shadow Naomi‘s brilliant performance, which would be a massive shame. Jafar bothers me a lot more than any of this stuff. However, Ritchie and John August deserve nothing but compliments for trying so hard to adapt such a risky original and mostly succeed doing it. I genuinely hope it crushes in the box office. It’s really a diamond (in the rough). Go watch it and make your own opinion!\r\n\r\nRating: B+", "created_at": "2019-05-23T15:38:07.396Z"}, {"movie_id": 420817, "review_id": "5ce7fef09251417a3fb9078b", "rating": 10.0, "review_text": "Saw this one last night and I must say I wasn't sure what to expect but I was extremely impressed by what I saw the movie made me laugh and smile theres plenty of action for Young boys and alot of music costumes and romance for young girls the only problem I see is there are shots of swinging breasts due to the wardrobe back then also the action may be a bit much for the youngest of kids but it's pure edge of the seat adventure that you absolutely must see best Disney movie of the year so far", "created_at": "2019-05-24T14:25:52.676Z"}, {"movie_id": 420817, "review_id": "5d6e3f6aa284eb473233f9de", "rating": 4.0, "review_text": "While I am fully prepared to admit that I hated this slightly less than I expected to, I also officially give up on Guy Ritchie. Disney's original _Aladdin_ is not one of my favourite Disney flicks, but I do like it. And although I'm sure there are people out there who will appreciate this live action do-over more than me, I do find it difficult to believe anyone would think this one is the better of the two versions.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2019-09-03T10:24:42.522Z"}, {"movie_id": 420817, "review_id": "62dfa772e18e3f006d00cdf2", "rating": 7.0, "review_text": "Why do people hate this movie????\r\nIf you do a live action THIS was as cloae to perfection as you could get. True to every aspect of the caryoon and honoring the memory of Robin Williams without Will 's Genie trampling on the iconic cartoon portrayal. Visually stunning. Music was spot on.", "created_at": "2022-07-26T08:36:02.880Z"}, {"movie_id": 420817, "review_id": "643b747146aed404c84f5b16", "rating": 5.0, "review_text": "I was kind of disappointed in this movie. I was expecting it to be a lot better then it was. It's not bad or a good movie.", "created_at": "2023-04-16T04:07:13.454Z"}]