[{"movie_id": 458156, "review_id": "5cde21bb9251413a77cd843d", "rating": 4.0, "review_text": "Just like the Matrix series, the John Wick series is the child of; interesting concepts, mediocre direction, bad writing, bad dialogue, fine (ok) acting and good to great fight choreography... \r\n\r\nJohn Wick 3 outstays its welcome and becomes tedious with all the boring twists and uninspired resolutions.\r\n\r\nyou'll watch it once, forget it ever existed and then never watch it again.", "created_at": "2019-05-17T02:51:39.095Z"}, {"movie_id": 458156, "review_id": "5cde6ca40e0a261dd5cb27df", "rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nI don’t have a written review for each of the previous films, but I did watch both and thoroughly enjoyed them! John Wick (2014) is one of the best movies of that year and one of the best action films ever. However, John Wick: Chapter 2 (2017) is a bit more convoluted and messy regarding its story and how it brings our protagonist back into the game, but the franchise’s outstandingly choreographed fight sequences still make it tremendously entertaining.\r\n\r\nAnd it’s precisely the mind-blowing, bone-crushing, jaw-dropping, extraordinarily long and brutally choreographed action scenes that make John Wick one of the most badass characters in the history of cinema! The Academy has been looking for something new to make the Oscars more popular, and the creation of new categories has been their number one idea. Well, nothing fits the show better than Best Stunt Work. Obviously, franchises like this one or Mission: Impossible would become major successes at this award show. These two sagas are undeniably the most important and crucial for the survival of truly real action. What you see, it’s what you get.\r\n\r\nNowadays, viewers already have their eyes set to acknowledge everything as CGI or some sort of visual effect. I’ll never forget when I left my Mission: Impossible - Fallout screening and while getting out of the theater, a group of friends was laughing around saying something along the lines of “of course that scene is fake and this moment is CGI, how can you believe that?! You’re such a moron!” They were roasting one of their friends, thinking he was the dumb one when he was probably the one who was laughing the hardest. This definitely leaves me sad. Sad that people won’t realize how incredible movies like these are. How they genuinely work like crazy to provide the audience with real and authentic stunts.\r\n\r\nYes, it’s over-the-top. Yes, CGI and visual effects are still applied, but just to little details like bullets, blood, falls or knife throwing, which never distract you. And yes, it requires the audience to suspend their knowledge of physics in a few particular moments. But that’s the thing: if you’re pumped to watch a third film of a franchise, you’re a fan. You know what it’s about and what’s its tone. John Wick established itself in 2014 as a pure revenge story and an unbelievably realistic action movie, the closest we will ever get to an assassin origin tale. John Wick: Chapter Two deeply explored the institution that governs these assassins and all of the rules that they are bound by. It’s a bit messier than the first one, but it’s still a blast of entertainment.\r\n\r\nParabellum has the best of both installments. It has the best-choreographed action ever seen on a big screen and some of the most impressive camera work I’ve ever witnessed. In addition to this, the narrative makes more sense, and the characters decisions are logically or emotionally justifiable, contrary to the second film. The sound design is powerful, and the cinematography plus the set design look stunning. I would still argue that the pacing could have been better controlled. The transitions between long action sequences and the respective pauses to move the plot forward aren’t always smooth. Some comedy bits that I don’t think they really belong in this saga were added, and while some work just fine, others really don’t fit this world.\r\n\r\nBesides that, I don’t really have much to complain about. The cast is absolutely impeccable. Keanu Reeves is battling with Tom Cruise for the biggest action movie star alive. While Cruise puts his life more in risk by performing especially dangerous stunts, Keanu has the resiliency and agility of a beast, providing us with high-speed and hard-to-do fight sequences. Halle Berry (Sofia) is one hell of a surprise! I had no idea she was (still) capable of moving as she does in this film. The stunts that she performs are crazily good! Laurence Fishburne (Bowery King), Ian McShane (Winston) and Lance Reddick (Charon) also have their own shining moments, but Sofia‘s dogs are deadly cute, and they steal the show.\r\n\r\nRegarding the action stunts, they’re all pretty memorable. From a throwback to Chapter Two‘s mirror room to an astonishingly riveting chasing scene through the streets of New York, everything Chad Stahelski and his talented crew throw at the audience is absolutely perfect. I also love how the final act resembles the experience of playing a videogame. You know when you have several levels, each of them with their respective boss, but the final boss is at the top of them all? It’s kind of like Legend of Zelda: Ocarina of Time when Link has to eliminate an enemy in each floor in order to move up to the next one until he reaches Ganondorf. It might be the must nonsensical analogy that I have, but it’s what my memory triggered. In the end, there are tons of set pieces for everyone to enjoy.\r\n\r\nAll in all, John Wick: Chapter 3 - Parabellum is everything fans of this franchise desired: brutal, bloody, long, loud and beautifully-choreographed fight sequences, accompanied by a decent story that explored even more the assassins’ world. Chad Stahelski is a master filmmaker, who knows how an action movie should be filmed. There are no sloppy editing or quick cuts here. Only extensive one-take scenes, filled with outstanding stunt work from a phenomenal cast. Keanu Reeves is one of the most incredible action film stars ever and Halle Berry surprises with her physical abilities. With better control of its pacing and tone (and a bit less defiance of physics), this could have easily been the best action movie of the century. “One of the best” it’s still one hell of a tagline.\r\n\r\nRating: A-", "created_at": "2019-05-17T08:11:16.499Z"}, {"movie_id": 458156, "review_id": "5d10b43d0e0a2602a1cfefc6", "rating": 8.0, "review_text": "Strong contender for best John Wick movie to date. And that ain't faint praise. I've been strong invested in the franchise ever since it was first announced John Wick would be a playable character in _Payday 2_. Then when I actually watched that first movie? Forget about it. I fuckin' love this guy. And now, here we are with a trilogy cappin' _Parabellum_. Strength to strength to goddamn strength.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2019-06-24T11:30:05.467Z"}, {"movie_id": 458156, "review_id": "5d35722f2f8d095259e1591b", "rating": 7.5, "review_text": "John wich Chapter Three,  Is the best action shooting movie in 2019", "created_at": "2019-07-22T08:22:07.288Z"}, {"movie_id": 458156, "review_id": "5d6c2a22efcea900109a85e6", "rating": 8.0, "review_text": "Not the best of the three movies (so far), but still one hell of a ride and excellent fight sequences. Keanu Reeves once again is in his element, though emotionally not much is asked of him from his character.", "created_at": "2019-09-01T20:29:22.882Z"}, {"movie_id": 458156, "review_id": "5d782767069f0e113431acf2", "rating": 8.0, "review_text": "**_The franchise keeps getting better_**\r\n\r\n>_Igitur qui desiderat pacem, praeparet bellum._\r\n\r\n- Publius Flavius Vegetius Renatus; _De re militari_ (4th or 5th century AD)\r\n\r\n>_It wasn't just a puppy._\r\n\r\n- John Wick (21st century AD)\r\n\r\nDirected by stuntmen turned directors Chad Stahelski and David Leitch, and written by Derek Kolstad, the original _John Wick_ (2014) was something of a sleeper hit, earning almost $90 million against a $20 million budget. The 2017 sequel, however, was a bona fide blockbuster, earning $171 million against a $40 million budget. And now we have _John Wick: Chapt__er 3 - Parabellum_, which has maintained the franchise's monetary trajectory, earning $230 million against a $75 million budget. Indeed, _Parabellum_ earned more in its opening weekend in North America ($57 million) than the original did in its entire North American theatrical run ($43 million). The three films were also critical successes, and have come to form the basis for the \"Wickiverse\"; an expanded universe that includes the forthcoming _Chapter 4_, a spin-off prequel film (_Ballerina_), a TV show (_The Continental_), and two video games (_John Wick Chronicles_ and _John Wick Hex_).\r\n\r\nNot bad for a franchise that began life as a story about a guy getting revenge on the thugs who killed his puppy.\r\n\r\nExcept, of course, it wasn't just a puppy.\r\n\r\nWith Stahelski back in the director's chair for the third time, and with a script by Kolstad, Shay Hatten, Chris Collins, and Marc Abrams, as with the previous films, _Parabellum_ is built on the foundation of Sir Keanu of Reeves's zen-like stoicism, a quality he can deploy to make a violent swordfight look about as stressful as sleeping on silk linen with \"Fur Elise\" playing in the background and a cat gently purring on the pillow beside you. And although this third entry in the franchise does flirt with a few themes amidst the mayhem (honour, fealty, destiny), it's not trying to be something it isn't, well aware of its own identity as a completely over-the-top orgy of violence. This is a world wherein even the most innocuous of items can be rendered lethal, and where the endless deaths by gun, knife, fist, dog, horse, motorbike, sword, pencil, and book of 18th century Russian folklore, are so excessive as to transcend any possible accusations of irresponsibility or glorification of violence. In short, the film leans into its status as basically a live-action episode of _Itchy and Scratchy_. Sure, it can become a little repetitive at times, and there's next to no plot or character development, so if you want to be reductionist, you could argue that it essentially gives us more of the same, except bigger, louder, and more elaborate. But that's to ignore how aesthetically accomplished it is, how funny it is, how compelling it is, and how unapologetically entertaining it is.\r\n\r\nBeginning only moments after _Chapter 2_ and about a week after _Chapter 1_ (it's easy to overlook the fact that the three _John Wick_ films span two or three weeks at most), _Parabellum_ opens with legendary assassin John Wick (Reeves) attempting to flee New York. Although known as the only assassin ever to have successfully retired from the Assassins' Guild, Wick was pulled back in when the puppy his dead wife Helen (Bridget Moynahan) left him was killed by Iosef Tarasov (Alfie Allen), son of powerful Bratva mobster Viggo Tarasov (the late great Michael Nyqvist). Having killed both Tarasovs, Wick's mission of vengeance ultimately led him to kill Santino D'Antonio (Riccardo Scamarcio), the Camorra crimelord who helped Wick retire several years prior. D'Antonio was a newly elected member of the High Table (the ruling body of the Guild, the members of which are considered off limits), and to make matters worse, Wick killed him on the grounds of the Continental Hotel (an assassins' hub in which violence is strictly prohibited). Declared \"excommunicado\" by the Table, and with a $14 million bounty on his head, Wick's friend and Continental manager Winston (Ian McShane) gives him one hour's grace before the contract goes live.\r\n\r\nMeanwhile, the High Table dispatch an Adjudicator (an eerily calm Asia Kate Dillon) to look into the unsanctioned help given to Wick by Winston, Continental concierge Charon (Lance Reddick), and the Bowery King (Laurence Fishburne), the leader of a group of vagrant assassins. Chiding them for helping Wick, the Adjudicator gives them seven days to either resign their positions or face the consequences. To lead the pursuit of Wick, she hires Zero (a scene-stealing Mark Dacascos), a highly-skilled assassin (and part-time sushi chef), who hates guns and is a huge fanboy of Wick. With every assassin on the planet hunting him, Wick's travels bring him into contact with a litany of underworld characters - there's The Director (Angelica Huston), a former assassin who trained Wick and who currently runs a ballet academy; Sofia (Halle Berry), the manager of the Casablanca Continental, and an old friend who owes Wick a marker after he successfully hid her daughter away from the Guild; Berrada (Jerome Flynn), the assassins' Master of Coin and a member of the High Table; The Elder (Saïd Taghmaoui), the only person above the Table, and who Wick hopes may be able to clear the bounty; the Tick Tock Man (Jason Mantzoukas), an associate of the Bowery King; two of Zero's pupils (Cecep Arif Rahman and Yayan Ruhian), who insist on fighting with honour at all times; and Ernest (Boban Marjanović), a towering assassin and Dante Alighieri aficionado.\r\n\r\nOkay, first things first, _Parabellum_ looks absolutely gorgeous. I mean really, really gorgeous. _Chapter 1_ and _Chapter 2_ both looked great, but _Parabellum_ is in another class altogether and is genuinely one of the best looking films I've seen all year. Part of the reason the film looks so good is the symbiosis between the various component parts of the aesthetic - the lush cinematography by Dan Laustsen (_Le pacte des loups_; _The League of Extraordinary Gentlemen_; _The Shape of Water_); the busy production design and complementary art direction by Kevin Kavanaugh (_The Dark Knight Rises_; _Nightcrawler_; _Only the Brave_) and Chris Shriver (_The Lovely Bones_; _The Wolf of Wall Street_; _Ocean's Eight_), respectively; the relatively slow editing by Evan Schiff (_Everly_; _Revolt_; _Proud Mary_); and the complex sound design by Martyn Zub (_Ghost in the Shell_; _Deadpool 2_; _Velvet Buzzsaw_). Everything looks and sounds amazing, working in immersive harmony to ensure the action grabs the viewer's attention and doesn't let go. The first half of the film, which takes place at night in New York, and is essentially one long almost real-time scene, is rain-soaked and bathed in glorious neon (mainly blues, greens, and reds), which reflect off the wetness on the road and bounce back towards their source, creating a dazzling display of light. When Wick nips inside a store, the vibrant colours are pulled out completely, with the brown of the store's walls and cabinets coming to dominate, so when he heads back outside, the richness of the palette really pops. The Moroccan section of the film is predominately gold, brown, and yellow, creating a sense of serenity that contrasts nicely with the hyperactive tone of the New York scenes which surround it.\r\n\r\nIn terms of the action, the film's opening scene sets the bar insanely high – a deadly fight in a library. The visceral brutality of this scene is emphasised both visually and aurally; when someone gets slammed against a wall or has a hardback book driven into their skull, you really feel the thump on the soundtrack, whilst the close-quarters nature of the combat makes for interesting shot compositions and editing rhythms (as does the fact that Wick is fighting someone over a foot taller than himself). The nature of the fight also leads to some inventive uses of the _mise en scène_, as the combatants are forced to improvise.\r\n\r\nIn this sense, I was reminded very much of Gareth Evans's _The Raid_ and _The Raid 2_, (the presence of Rahman and Ruhian, who played villains in the first _Raid_ film, cannot be a coincidence). These two films effectively redefined action cinema by shunning the frenetic editing that had become the norm over the previous decade, instead employing longer takes that showcased the performers' physicality. You know that seizure-inducing scene in Pierre Morel's _Taken_ (2008) when Bryan Mills (Liam Neeson) jumps a fence, and there are literally 15 cuts in five seconds? There's none of that in _Parabellum_, with the editing altogether calmer, allowing the audience to focus on the organic progression of the ballet-like hand-to-hand combat, creating what can only be described as a symphony of excessive violence. With Jonathan Eusebio's magnificent choreography paying homage to everyone from Harold Lloyd to Buster Keaton to Andrei Tarkovsky (seriously), _Parabellum_ doesn't just give us rote action scenes, it gives us immersive works of performance art.\r\n\r\nHowever, to say that the editing is rhythmic and slower than most action movies is not to say that the film is laid back. It isn't, and it includes any number of scenes that really shouldn't work, so batshit insane are they. There's the initial library fight where books become as deadly as knives; a scrap that takes place in an antique knife shop, where Wick and his opponents only realise that they're surrounded by literally hundreds of knives when they run out of ammo; a horse versus motorbike gauntlet (with swords) on the Verrazzano-Narrows Bridge that has more than a passing resemblance to a similar scene in Jung Byung-gil's magisterial _Aknyeo_ (2017); an aborted confrontation in Grand Central Terminal (damn girl scouts); a huge to-do in a Moroccan bizarre involving two people and two dogs against a legion of hired thugs; an old-fashioned shootout in the Continental as Wick and Charon face down the Adjudicator's team; and a climactic gunfight cum sword fight in a room made entirely of glass. Subtle it isn't. Entertaining it most certainly is. And the fact that the film can pull off such ludicrous scenes without becoming a parody of itself is as good a testament to the craft on display as anything could be.\r\n\r\nBoth previous _Wick_ films have been said to resemble video games in their visual design, although Stahelski has stated that this wasn't a conscious decision, as he has never played a video game. Conscious or not, _Parabellum_ is even more indebted to video games than the previous films, not just in its aesthetic, but in some of its narrative beats. For example, each fight is harder than the last (i.e., the difficulty level is increasing), with a few boss fights thrown in for good measure. A scene in a stable where Wick uses a horse to take out two thugs is essentially an environmental assassination straight out of the _Hitman_ franchise (and Wick dresses a lot like Agent 47 too). There's a single driving level (there's always a single driving level), and a non-combat level where Wick must reach his destination before dehydrating. To make it to the final battle, Wick must face down a platoon of heavily armoured soldiers, each of whom requires multiple hits before going down, whilst Wick himself has to pause at one point for a weapon upgrade. Then we have a mini-boss fight, followed by the real boss fight against Zero. The narrative is literally structured like a video game, and has a similarly insane kill ratio to the previous films (he killed around 80 in _Chapter 1_, about 130 in _Chapter 2_, and 94 in _Parabellum_). And this is not a criticism. On the contrary, part of the film's charm is its resemblance to a violent, hyper-stylized, morally questionable video game in which one must kill waves of faceless opponents à la _Doom_ (1993), _Manhunt_ (2003), or _Grand Theft Auto: San Andreas_ (2004).\r\n\r\nIn terms of the acting, a good way to approach it is to ask, who looks at a library book and thinks, \"_I could kill someone with this_\"? The answer, of course, is John Wick. And the fact that we go along with such insanity is a testament to both the film itself and Reeves's performance, which grounds even the most ridiculous of scenes, taking everything in his stride as if it's the most normal thing in the world. His serene monotone delivery is also responsible for easily the funniest moment of the franchise thus far. When a thug shoots one of Sofia's dogs (don't worry, it's a non-fatal hit), she goes ballistic, laying waste to everyone around her, despite knowing that there could be serious consequences. Looking at Wick, she points out, by way of explanation/apology, \"_he shot my dog_.\" To which Wick replies, in that half-asleep and still stoned from the night before surfer-dude voice of Keanu Reeves, \"_I get it_\". That line prompted a few people to applaud at the screening I attended. Of course he gets it. And so do we.\r\n\r\nOne of the reasons the original film stood out so much was the subtle brilliance of Kolstad's world-building. It wasn't just a movie about a former assassin being pulled back into the trade. Instead, Kolstad created a fascinating underworld featuring an international Assassin's Guild, a hotel for assassins in which violence is prohibited, and even an assassins' currency. In _Chapter 2_, he expanded this further, introducing the person who helped Wick retire, the High Table as the governing body of the Guild, blood markers, and the Bowery King, who seems to operate slightly outside the purview of the Table. _Parabellum_ continues the expansion, introducing the person who trained Wick, the ballet school, the master of coin, the Elder, the adjudication process, excommunication, and deconsecration (when a hub such as the Continental is declared no longer a safe space and no longer protected by the Table). The mythology has deepened with each film, and the fact that it has so many religious overtones drives home the sense of old-world ideologies being applied to people who must be ultra-modern in how they conduct themselves.\r\n\r\nAre there some problems? Well, any film this violent is going to have immediate detractors, who will oftentimes speak out against the film without actually seeing it, and of course, there will be cries of \"_Hollywood preaches against the 2nd Amendment but then makes movies celebrating the destructive power of guns_.\" Fair point. But the thing is, the movie doesn't take itself too seriously, nor does it expect the audience to, so the question of its irresponsibility when it comes to violence is kind of a moot point. Of course it's irresponsibly violent. It's supposed to be irresponsibly violent. Does it treat guns and knives fetishistically? Yes, to a certain extent it does. But is it celebrating guns and violence in a realistic socio-political manner? No, not in the slightest.\r\n\r\nHaving said that, there is a sense in which the violence in the film does come across as meaningless, insofar as it doesn't seem to have any practical ramifications for any of the main characters. John Wick has literally killed over 300 people in the course of a few weeks, but there's not a hint of any kind of psychological consequence. Related to the disassociation that presenting violence like this can have, there's the problem that simply by virtue of logistics, almost all of Wick's opponents are nameless and faceless extras, anonymous hordes there to be killed. Indeed, at one point, Wick is literally pursued by two busloads of such villains (a bit of meta-commentary on the genre, which I personally thought was hilarious). The one criticism that I would definitely echo is that the structure of the narrative is a little awkward, and on several occasions, actions and decisions reached over the course of multiple scenes are simply undone just a couple of scenes later. However, this is a _John Wick_ film, not a Marcel Proust novel. The narrative structure is not really where your attention is supposed to be.\r\n\r\nGenerally speaking, I don't do blockbusters. I just don't like them, and can rarely get anything from them. I consider the medium of film to be an art form before it is entertainment, and I approach every film from that perspective. But attempting to parse a summer blockbuster in this manner doesn't tend to yield much in the way of interesting analysis. Nevertheless, every year, there are one or two blockbusters that I will go to see. The first such example this year is _John Wick: Chapter 3 – Parabellum_. And I absolutely loved it. Easily the best in the franchise thus far, it's more ambitious, more ridiculous, more violent, and more entertaining than its predecessors. It's also funnier, and the Wickiverse continues to provide a fascinating _milieu_. Sure, themes such as fealty, honour, fate, and religion come and go without much engagement. But, as I've said, that's not what the film is about. It simply doesn't follow the rubric to which others must try to adhere - character development and motivation, a well-structured plot, insightful dialogue, and thematic undercurrents. Instead, Stahelski has crafted an action film that features extraordinary aesthetic elements and a wonderfully vibrant visual design. _Parabellum_ doesn't just unapologetically revel in its excessive violence. It makes art out of its excessive violence.", "created_at": "2019-09-10T22:44:55.823Z"}, {"movie_id": 458156, "review_id": "5d871477336e010029163b2d", "rating": 9.0, "review_text": "Let’s make one thing perfectly clear. This is a movie you watch for the action and not much less. But then, that not really a surprise is it?\r\n\r\nThe movie takes off literally minutes after the last one ended. John Wick is on the run and that’s the story for most of the movie. Well, not entirely. He does have a plan but first he has to escape the many assassins trying to cash in the 14 million dollar bounty on his head.\r\n\r\nThis movie is all about action. The movie is R-rated although I honestly do not understand why. Sure there’s lot of action and a lot of killing but still, I wouldn’t say it merits an R-rating and apparently the French ratings organisation didn’t either since here in France it France it got a 12+ rating. That is, it is only restricted for those younger than 12 years.\r\n\r\nAnyway, as I wrote above, this movie is all about Keanu Reeves and action. Lots and lots of action which usually ends up in one or more persons getting killed by John or some of his remaining friends.\r\n\r\nIs the story and the action realistic? Hell no! But it is fun to watch even though most of the bad guys shoots as accurately as imperial storm troopers. Most of the time at least.\r\n\r\nTowards the end I did think it got a bit silly. The fight against Zero and his last two students was pretty rubbish. It was kind of kick, hack and slash for a few minutes and then stand of and wait until the other guy got up again. Then rinse and repeat. Silly indeed.\r\n\r\nAlso, they could really tone down on the ludicrous survivability of John Wick. I mean, come on! He gets hit by cars and walks away. Not to mention the final scene were he falls something like six seven floors, bounces (and I mean bounces!) off a fire escape and a trash container and apparently survives.\r\n\r\nI probably should rate the movie a star less for that kind of stuff but I wont. This is something as refreshing as a Hollywood movie apparently meant to entertain and nothing else. There’s really no political or social preaching or any other such nonsense which is really rare today. That alone gives it a few extra stars in my book.\r\n\r\nThe movie has a 7.7 rating on IMDb at the time of writing this which is well deserved, even a bit low. Even the rubbish SJW site Rotten Tomatoes claims the movie is “fresh” which is surprising given what I wrote above.\r\n\r\nOf course there is a whole bunch of “reviews” that claims it is so bad and so on and so forth. Some of these reviews are actually repeated several times. That really pisses me off since these people seem to write reviews just to complain. It’s the third movie in the Franchise for Christ sake! You knew what you were getting yourself into. Don’t watch the movie if you do not like these kind of movies. Claiming there is no story is bullshit since the first one didn’t really have much more story but then the concept was bit more new of course. Some “reviewer” claimed it was the worst movie he had ever seen. He cannot have seen many movies then. What a load och bollocks!\r\n\r\nBottom line, this was two hours of great entertainment.", "created_at": "2019-09-22T06:28:07.659Z"}, {"movie_id": 458156, "review_id": "6240b1d045765d0047d5db87", "rating": 5.0, "review_text": "It's got the curse of the third movie, this - the script has been almost totally sacrificed for the imagery (which for the first 20 minutes is actually quite stunning). The fight scenes seem to go on and on well beyond the point where even Arnie would have been killed. Ian McShane is as wooden as usual; though this time we had (and missed) the chance to lock him in a huge safe. Laurence Fishburne brings a little gravitas to this, but otherwise it's just well beyond the pale, sorry.", "created_at": "2022-03-27T18:49:52.718Z"}, {"movie_id": 458156, "review_id": "63bf64728efe730087a7d0d1", "rating": 10.0, "review_text": "Part of me wants to pretend that I couldn't find the paper thin plot of the film and rag on it for a complete and total lack of story... but I could follow what little of a plot there was so that would be kind of disingenuous.\r\n\r\nNot only that, but it would also be pretending that I didn't know what kind of movie this was when I sat down with my wife to watch it. And, honestly, I can't stand the reviews that take a John Wick film and pretend that they expected something like Chinatown walking in.\r\n\r\nYou know the ones I'm talking about, those reviews that lament the fact that they got a brainless action movie when they sat down to watch a brainless action movie.\r\n\r\nIf I said \"I'm not that deep\" I'd be giving them too much credit. So rather than saying that, I'm going to say that, when I sat down to watch it, I didn't lie to myself and pretend it was going to be anything more than a John Wick film.\r\n\r\nWhat you have is sleek, beautifully choreographed action brought to you in the most brutal of ways and delivered in a form that requires you to suspend your disbelief because it is just the right amount of totally unrealistic.\r\n\r\nDoes it have a plot? Yeah, but not really. It has just enough of a plot to make a loose story and not so much that it would get in the way of what was promised to be carnage candy.\r\n\r\nAnd, honestly, carnage candy is the promise that the John Wick people gave us and nothing more... and each installment of the franchise delivers on that promise. It never, ever, claims that it is anything more than an action film, and it never, ever pretends to be anything deeper.\r\n\r\nIt isn't a great film. It never claims to be. But it is a great action film, so you have to take it for what it is.", "created_at": "2023-01-12T01:37:55.084Z"}, {"movie_id": 458156, "review_id": "63daadd43dc31300864cf763", "rating": 9.0, "review_text": "John Wick: Chapter 3 - Parabellum picks up right where the sequel left off, with Wick being excommunicated from the assassin underworld. The bounty is set at $14 million and Wick has an hour to escape the city before his former associates come to collect.\r\n\r\nWhile the plot might not be as strong as the sequel, it continues the same story points seamlessly. This film feels more like a continuation of larger narrative spanning across franchise, rather than separate semi-connected story like the first two. This film is bigger than the last, with vast and diverse landscapes for Wick to create havoc in. The lore of world is expanded showing us more of the assassin leadership and how the chain of command works. All of the new additional characters worked well and were integrated into the story perfectly.\r\n\r\nThe action is picked up a notch, creating some of the craziest sequences I have ever seen on the screen. The fight inside of the knife shop was insane, it left me with my mouth literally dropping to the floor. It is one of my favorite action sequences in any film. One thing I particularly liked is the sense of desperation and isolation that surrounds our main character. We see John Wick tested to the extremes, pushing the boundaries resulting in creative stunts and tactics to fight off multiple assassins at a time. It was really fantastic. The cinematography was incredible here as well. This film shows that with good choreography and a wide shot, you can create gripping scenes that do not require fifteen different jump cuts. The motorcycle chase has got to be one of the most breathtaking and seamless action sequences I have ever seen.\r\n\r\nThe acting quality sees a significant increase in quality when compared to the first two entries. Keanu Reeves is still Keanu Reeves, delivering a fairly cheesy and awkward performance, but that is what you come to expect and cherish about this franchise. The addition of Halle Berry and Asia Dillon were fantastic as the both added some serious dramatic acting beats that raised the quality of the film immensely. Berry and Wick had some great chemistry together.\r\n\r\nOverall, this film is excellent and if each entry can build upon the last like history has shown, the sky is the limit for this franchise.\r\n\r\nScore: 87%\r\nVerdict: Excellent", "created_at": "2023-02-01T18:22:12.604Z"}, {"movie_id": 458156, "review_id": "63f174fc524978008efd4849", "rating": 9.0, "review_text": "How much smashed glass is too much smashed glass? Asking for a friend...\r\n\r\n<em>'John Wick: Chapter 3 - Parabellum'</em> is my favourite of the three films from the franchise thus far. It's longer than any of the preceding two, yet I found the pacing in this one to be absolutely spot on. Apart from that, and one or two other things, it is similar to its two predecessors - and that's most definitely a major positive. The look of the films are stunning.\r\n\r\nThe manic fight scenes remain just as entertaining as before, though I feel like here there's more creativity in using the enviroment around the characters - e.g. with the dogs. It felt like more of the fights had a start/end, whereas before it seemed all rolled into one - to me, anyway. Not that the latter is a bad thing, mind.\r\n\r\nThis entry I think has my favourite scene of the entire franchise, and it's the near the beginning with Reeves' John and Randall Duk Kim's Doctor. So well shot and edited, made me laugh too! There are many good moments in these films, but that's the standout for me.\r\n\r\nClass again is Keanu Reeves, I have nothing more to add to what I've said previously - perfect actor for the role. Elsewhere, cool to have Ian McShane and Laurence Fishburne again, while newcomers Halle Berry, Mark Dacascos and Asia Kate Dillon are all pleasing additions to the series.\r\n\r\nThere isn't a major gap in-between these films in my mind. I gave the other two 8/10 ratings, but this 2019 release is only narrowly ahead of the flicks from 2014 and 2017. More importantly, though, the franchise as a whole is great fun. Bring on 4 & 5 - and that Berry spin-off, heck gimme the <em>'<a href=\"https://letterboxd.com/film/nobody-2021/\">Nobody</a>'</em> <a href=\"https://comicbookmovie.com/action/nobody-writer-derek-kolstad-on-scripting-the-best-action-movie-of-the-year-sequel-hopes-more-exclusive-a186023#gs.qfpxyg:~:text=ROHAN%3A%20You%20created%20both%20characters%2C%20but%20have%20you%20ever%20had%20any%20serious%20discussions%20with%20David%20Leitch%C2%A0or%20Chad%20Stahelski%20about%20merging%20the%20worlds%20of%20John%20Wick%20and%20Nobody%3F\">crossover</a>!", "created_at": "2023-02-19T01:01:48.789Z"}, {"movie_id": 458156, "review_id": "645a96516aa8e000ff5be4af", "rating": 5.0, "review_text": "Ummmm, wait a minute, what just happened? Where's the cool? Why are all the bad guys comical and unthreatening? What happened to the addictive world-building nuance? Nonstop action isn't a story, it's just a long scene. You need lulls in the action for it to have impact and interest. Driving at two hundred miles an hour along a never-ending straight road is just boring. Please let chapter four revert back to what we love about this world.", "created_at": "2023-05-09T18:52:01.998Z"}, {"movie_id": 458156, "review_id": "64a6c913cae63200e5a466a6", "rating": 8.0, "review_text": "Another action packed movie. He's kicking a lot of butte and getting his butte kicked a lot too. Good movie.", "created_at": "2023-07-06T14:00:51.177Z"}, {"movie_id": 458156, "review_id": "64c1d162097c49011d8310a8", "rating": 8.0, "review_text": "**John Wick has everything an action movie needs.**\r\n\r\nThe combat scenes are masterfully choreographed, without those shaky camera moves that most films of the genre love to do. We also have glorious kills, without having to appeal to unnecessary gore.\r\n\r\nThe plot of this one is a direct sequel to the previous movie - which, eventually, is important to the development of this trama. The characters are great and well-made, mainly Sofia, whom I particularly loved - the movie not only emphasizes her, but her dogs either. And we cannot forget Keanu Reeves, that lives the protagonist and make the scenes in such an organic way - capitally at his age. Dude was just born to this role.\r\n\r\n_Originally reviewed on Aug 23, 2019._", "created_at": "2023-07-27T02:07:30.336Z"}]