[{"movie_id": 315162, "review_id": "63daacf2a9117f009da4d879", "rating": 9.0, "review_text": "Puss in Boots: The Last Wish had a lot to live up to as most of my critic and casual friends have been praising the film, and for the most part the film delivers.\r\n\r\nFrom the opening frames, the unique art style fills the screen and is incredibly captivating. There is some excellent combination of 3D animation with 2D styles that I have not seen before. The combat frame rate shift was also a nice touch that worked better than I was expecting. Action was top notch with some incredible set pieces and superb choreography.\r\n\r\nThe Last Wish deals with some pretty heavy themes for an animated children's movie. Death is something that all humans will have to face which was handled in such a nuanced and mature way here. From panic attacks to haunting imagery, death looms large throughout the entire film and serves as a menacing villain. The journey our heroes take to confront this fear is very heartwarming and will resonant with most audience members.\r\n\r\nWith most DreamWorks pictures, the comedy is targeted at both children and adults. I did find myself laughing out loud at plenty of jokes, but just as many landed flat for me. This would be more of an issue, but this is an incredibly balanced film with great action and dramatic moments that leave little room for a few flat jokes to make a large impact on my experience.\r\n\r\nI genuinely believe that this movie has restored the Shrek universe and can propel the future projects upward. Hype has officially been restored for Shrek 5!\r\n\r\nScore: 86%\r\nVerdict: Great", "created_at": "2023-02-01T18:18:26.854Z"}, {"movie_id": 315162, "review_id": "63dfb269373ac2007f01c6c4", "rating": 10.0, "review_text": "I did not expect the sequel to a decent spin-off Dreamworks film from over a decade ago to be one of the most poignant, introspective, genuinely hilarious, and heartwarming films of the year. But here we are.\r\n\r\nAfter an overly cheesy, somewhat clunky opening sequence, The Last Wish very quickly begins developing its zany assortment of characters into distinct quirky personalities with sympathetic desires and clear goals. The film juggles several character arcs and it's almost miraculous how it successfully handled all of them with proper set up and satisfying, emotionally weighty payoffs.\r\n\r\nThe screenplay is wacky, witty, and also bursting with heart as it deals with weighty themes of trusting others and finding purpose in any circumstances. And it tackles these themes in ways that are always understandable to all ages but never insultingly oversimplified.\r\n\r\nWhat I also didn't expect was that the action sequences would be so well-choreographed and beautifully animated, and that the movie would often be terrifying and violent at times.\r\n\r\nI adored this film. I think it's Dreamworks' best film since Megamind and it's easily the best true family film of the year.", "created_at": "2023-02-05T13:43:05.151Z"}, {"movie_id": 315162, "review_id": "63e4b50990fca3008eb96a46", "rating": 7.0, "review_text": "I can't think for a minute that this would have worked at all, had it not for been for the entertainingly over-the-top voice talents of Antonio Banderas in the title roll. His cat is a sort of combination of Cyrano de Bergerac and Casanova - full of flair, dashing and adept with his flourishing blade. Until, that is, he has a run-in with a church bell that brings him face to face with his mortality. He has only one of his nine lives left, and death is poised to come claim him! Shattered, he seeks refuge in a home for cats where he encounters \"Perrito\" - a small, naive and lost little dog who is determined to befriend him. Meantime, the not so little \"Jack Horner\" and \"Goldilocks\" and her three bears are looking for a map that will guide them to a wishing star that, well, it does what it says on the tin. The bears decide to track down our eponymous hero to help them procure it, but he and his feline rival \"Kitty\" (and their new doggy pal) decide to join forces and must face a series of tortuous escapades in the race to succeed in their quest. It must be 45 years since I last read the \"Goldilocks\" story and try as I might, I just couldn't remember it as it gradually evolves as one of the threads of this enjoyably crafted montage of fable and charisma. It's pretty action packed with Banderas proving his singing hasn't really improved much since \"Evita\" (1996). It's a family movie for sure with messages of loyalty, affection, determination etc.; but there is still enough in the dialogue for those older folks in the auditorium to raise a smile and keep it interesting for 100 minutes. The animation is super and this character driven adventure is well worth seeing on a big screen if you can. Maybe not one for tiny kids - but for us bigger ones, this is fun.", "created_at": "2023-02-09T08:55:38.012Z"}, {"movie_id": 315162, "review_id": "640cdcaf01432500e39b32a4", "rating": 10.0, "review_text": "This one sort of slipped through the cracks didn't it?  I mean, it has a very good, very heartwarming story that helps define a character's growth over the length of the plot.  It has a story about hope and sacrifice and struggle.\r\n\r\nIt is a good movie.\r\n\r\nHow does a movie this good get made today?  Isn't this sort of the opposite of everything that current Hollywood stands for?\r\n\r\nWhere is the strong female lead replacing Puss in Boots as the hero?  Where are the identity politics?  Where is the nonstop shaming of Straight White Men?  Where is the depiction of half the country as absolute evil?  \r\n\r\nHow can they make a western movie that doesn't shame the west at every possible turn?\r\n\r\nI have absolutely no idea how this could have been made, but what I can say is that it is fantastic, it is moving, it is fun for the whole family and it has a decent nonpolitical message.  The main character is heroic.  This is just... well, this is a movie that doesn't seem like it could possibly be made in today's Hollywood.", "created_at": "2023-03-11T19:55:27.673Z"}, {"movie_id": 315162, "review_id": "64cbfdb7e1faed00e411052a", "rating": 8.0, "review_text": "Really good movie better then the first. I loved the beard it was pretty funny looking. The storyline was way better then part one.", "created_at": "2023-08-03T19:19:19.984Z"}]