[{"movie_id": 87496, "review_id": "58f22a55c3a3682ede009f13", "rating": null, "review_text": "Just found this in the bargain bin for $3.  What a cast! Shia had such potential, very intense, perfect for this role. Maybe he can find his way out of wherever he is now and become the great actor he was on the brink of being.  In general, the cast just looked old and tired for the activities they had to perform.  I found that took away from what was a very interesting and varied plot line with enough  twists to keep me interested for the whole 2 hours plus.  I do recommend this film and it will go on my 'keepers' shelf for future viewing.", "created_at": "2017-04-15T14:12:37.162Z"}, {"movie_id": 87496, "review_id": "631386dd0d29440081d962cc", "rating": 2.0, "review_text": "The Company You Keep keeps excellent company; Robert Redford, Chris Cooper, Susan Sarandon, Nick Nolte, Terrence Howard, Sam Elliott, Stephen Root, Julie Christie, Richard Jenkins. I would usually say that no movie can be bad that includes these people (even Stanley Tucci and Shia LaBeouf; Anna Kendrick as an FBI agent, on the other hand — that dog will not hunt, Monsignor), but the movie turns out to be too much of a good thing; these actors are capable of generating such a massive amount of gravitas that Redford, who also directs, ends up losing control and the film falls under its own weight.\r\n\r\nAll those names in the credits make TCYK seem deeper than it really is, until we discover that screenwriter Lem Dobbs didn't bother to give them anything to do or say; as good as this cast is, they’re not miracle workers — in Lear’s words, “nothing will come of nothing.”\r\n\r\nThus, many of them are reduced to glorified cameos, which tends to be counterproductive. What's the point of a Richard Jenkins cameo when nine out of 10 people in the audience have not the slightest idea who Richard Jenkins is?\r\n\r\nOr, if they recognize Root, it’s in a Troy McClure sort of way; i.e., \"you may remember me from Office Space or Dodgeball.\" Redford, doing a The Fugitive routine as a former member of the Weather Underground, briefly insinuates himself, only to depart as abruptly as he appeared, into the lives of these individuals, none of whom we ever see again. You don't need Nick Nolte for this; for this you get Gary Busey (the poor man's Nick Nolte) and move on.\r\n\r\nCuriously, the real-life Weather Underground had strong Black Power ties, but all the ex-members we see in the film could very well pass for WASPs. At the same time, the only black character, federal agent Cornelius (Howard) is a representative of law and order — but no more of an 'Uncle Tom' than hippies playing revolution turned middle-class bourgeois three decades later.", "created_at": "2022-09-03T16:54:53.278Z"}]