[{"movie_id": 313922, "review_id": "5787cdabc3a3683932001341", "rating": 7.0, "review_text": "> There's only one way out and it is to fight back!\r\n\r\nFrom the director of 'Blue Ruin', yet another crime-thriller. This time it revolves around a rock band who trapped in the neo-nazi enclosure on the outskirt of the city. So how do they plan to get away from the green room they're locked in, and armed men are outside waiting for them to take down. The film filled with lots of tense moments and mostly unpredictable stuffs which is a one day event.\r\n\r\nI was not surprised, I just expected something as smart as the director's previous film. He retained his favourite actor, Macon Blair to play an important role as their third collaboration in this multistarrer and he once again did well. This theme is not the first time explored, it is a well known, but the setting was very unique. All the actors were amazing, but truly very sad to hear the news about Anton Yelchin. He was a young and a wonderful actor and his '5 to 7' was my favourite.\r\n\r\nAt first, I thought the plot was so silly. I wondered why they did not use the excessive force as they're capable to tackle such situation. But that's the best part, because they threw away the cliché and approached for something new way to deal it. So the writer, I mean the director did great to carve a rare and thrilling film of the year.\r\n\r\nThere's no martial arts, criminal gang's collision or the cops fighting the bad guys; it was about how the normal people confront during a hostile situation in the real world. Blue and Green are done, now I'm waiting for the director to announce his next colour project.\r\n\r\n7/10", "created_at": "2016-07-14T17:36:43.808Z"}, {"movie_id": 313922, "review_id": "606d02a112c604006eb200af", "rating": 8.0, "review_text": "I found myself curiously drawn into the plot and unable to turn away. Patrick Stewart was cool. Kinda disgusting and traumatizing though.", "created_at": "2021-04-07T00:53:53.836Z"}]