[{"movie_id": 266647, "review_id": "561b0975c3a3685101002082", "rating": null, "review_text": "As likened to an innocuous fairy tale rash, the movie mythology surrounding J.M. Barrie’s classical kiddie character “Peter Pan” comes and goes when it pleases. Naturally there have been several big screen interpretations to outlast one’s reserved stash of pixie dust to fling around. From perhaps the best known animated film adaptation of Walt Disney’s nostalgically revered version to the surprisingly big-budgeted Steven Spielberg-directed spectacle dud Hook with a high-caliber cast the legend of “The Boy That Never Grew Up” seems to spark the challenge of presenting yet another spin on Barrie’s iconic treasured tyke.\r\n\r\nIn director Joe Wright’s sci-fi fantasy action-adventure Pan the familiar factors of Barrie’s magical Boy Wonder are evident and should serve as a mild and manufactured revisit to the “Peter Pan” folklore for children of all ages. However, the whimsical aspect of Pan was dubiously overshadowed, overproduced yet curiously understated in its ability to convey a storytelling moment that did not seem laborious. Consequently, Pan feels mechanical and never quite settles in with any sense of breezy charm or youthful balance of wonderment. Instead, the audience is left wondering about the uniqueness and distinctive approach to an already ubiquitous serving of Barrie’s celebrated literary lad. Despite the vibrant visuals and the given big screen blueprint for “Peter Pan’s” endearing legacy Wright’s toothless tale of flashy action and adventure may just prove to be another proverbial flash in the Pan. \r\n\r\nClearly, there is no rhyme or rhythm to tamper with the built-in concept of what the majestic make-up for “Peter Pan” should be conceived in the minds of generations that were subjected to Barrie’s boundless boy. Still, Wright and Jason Fuchs fail to capture any fresh imagination or intrigue about the puppy dog-eyed youngster’s on-screen by-the-dots adventures. This pumped-up project is pedestrian at best and nothing more than another sparkled rung in the “Peter Pan” ladder of box office hits-and-misses. The casting for Pan is decent enough but the shoddy material they are left to elevate with their included presence is wasted in a stillborn fantasy odyssey that cannot overcome its own creative indifference.\r\n\r\nPan seeks to start out with its own embedded twist by delivering this narrative as a prequel set in 1940’s London. Here, we are introduced to 12-year old Peter (Levi Miller) whose disillusionment continues to spiral while staying at the chaotic Catholic orphanage he was unceremoniously dumped off courtesy of his desperate mother (Amanda Seyfried). Nevertheless, Peter maintains some semblance of hope that his mother will soon return to fetch him and all should solve whatever abandonment issues he has at hand.\r\n\r\nSoon, Peter and his fellow orphanage buddies will succumb to the clutches of Blackbeard the Pirate (Hugh Jackman). Evidently bad boy Blackbeard had been a notorious busy beaver by sadistically kidnapping working class children and shipping them off to his Neverland mines to toil there. However, Blackbeard and his bunch cannot be too bad to tolerate since they welcome out-of-the-blue snappy sing-a-longs to such noteworthy tunes as Nirvana’s “Smells Like Teen Spirit” and the Romones’ “Biltzkrieg Bop”. Huh? Of course this impromptu musical sequence is not the only thing that seems curiously out of place in the disjointed Pan. \r\n\r\nOkay...so Hugh Jackman has both a black beard and a black heart in PAN. How about a blackboard to erase this ill-conceived ode to the J.M. Barrie treasured tyke?\r\nOkay…so Hugh Jackman has both a black beard and a black heart in PAN. How about a blackboard to erase this ill-conceived ode to the J.M. Barrie treasured tyke?\r\nIt is not long before the plagued Peter meets and becomes attached to a hustling drifter named James Hook (Garrett Hedlund). Yes folks…it appears that Star Wars comparisons are in order here as Peter’s Luke Skywalker teams with shifty Hook’s Han Solo to defeat the devilish Blackbeard’s Darth Vader. And you might want to ask who is the Princess Leia in this disguised Star Wars premise amid the mines and high seas? Well, in this case Princess Leia is in the form of Pan’s Tiger Lily (Rooney Mara). Thus, the gang assembles together in an attempt to thwart the iron fist of Darth Vader…er, the diabolical Blackbeard. The excitable exploits of the crew coming together to defeat the pesky pirate is meshed together with the flashy flourishes of random 3-D special effects, the vitality of color and scope and playful variations of well-known “Peter Pan” personalities. Hence, all the festive and feisty flexing that Pan demonstrates still cannot compensate for a lackluster execution of Wright’s anemic installment that botches a ready-made backstory for “Peter Pan” enthusiasts.\r\n\r\nAs Peter, Miller shows some solid and impish promise as the boy searching for self-discovery in a bizarre surrounding of despair and disappointment. Jackman’s over-the-top villainous Blackbeard is simply passable but nothing really worth hanging your hat on. Jackman’s plotting pirate will not make anyone dismiss Johnny Depp’s Captain Jack Sparrow from the Pirates of the Caribbean movies anytime soon. The added elements in supporting players such as Hedlund’s Hook and Mara’s Tiger Lily (not to mention the Lost Boys) feel synthetic and arbitrary–something not very encouraging as these characterizations are essential to the whole “Peter Pan” universe.\r\n\r\nUnfortunately for Pan one might end up saying never mind to the boisterous yet aimless shenanigans situated in Neverland.\r\n\r\nPan (2015)\r\n\r\nWarner Bros.\r\n\r\n1 hr. 51 mins.\r\n\r\nStarring: Levi Miller, Hugh Jackman, Garrett Hedlund, Rooney Mara, Amanda Seyfried\r\n\r\nDirected by: Joe Wright\r\n\r\nMPAA Rating: PG\r\n\r\nGenre: Sci-Fi Fantasy and Adventure\r\n\r\nCritic’s rating: ** stars (out of 4 stars)\r\n\r\n\r\n", "created_at": "2015-10-12T01:14:29.147Z"}, {"movie_id": 266647, "review_id": "5697a80f92514154c90023ee", "rating": 6.0, "review_text": "> Its when Peter stepped into the Neverland for the first time.\r\n\r\nUsually everyone loved growing up watching the various film adaptations of original work by JM Barrie's a century old creation, 'Peter Pan'. There are plenty of unofficial prequels and sequels were also made and met success. Yet this prequel with high budget and modern technology, but not a Disney film, generated some expectations with stars like Hugh Jackman and Rooney Mara in it.\r\n\r\nThe box office was not as expected, and the movie was also just above average, but I liked the performances and visuals. The story is about an orphan Peter who becomes a Pan, a leader to 'the lost boys'. The opening line goes like this: 'Sometimes friends begin as enemies and enemies as friends' and that's what the rest of the movie evolves.\r\n\r\nI don't think I liked this story. In all the prequels, I loved the Nick Willing's 'Neverland' who is a master of prequels to all the greatest fairytales. I disappointed with this only because of lack of the depth in narration, short storyline and quick scenes, other than that it was not a bad flick to me. The main relief was, it was not like the recent 'Alice in Wonderland' style movie with the weird costumes, makeups and the character physiques.\r\n\r\nDespite all the negative feedback for this flick, I feel it won't hurt for a one time watch. My eye is now on its sequel, because before the Wendy's introduction there's another story is to be told and that is between Peter and Hook. But now it's on doubt over the result of this movie. Anyway, I'm on for it and hope it only gets better than the original.\r\n\r\n6/10", "created_at": "2016-01-14T13:52:15.545Z"}, {"movie_id": 266647, "review_id": "58bfc3f3c3a368695900478a", "rating": 7.0, "review_text": "I found this to be a quite enjoyable family movie derived from the Peter Pan story we all love. I am not really sure why it holds a fairly mediocre rating on most rating sites. It is undeserved as far as I am concerned.\r\n\r\nThe movie is a prequel which tells the story of how Peter became Peter Pan. I think the story is fairly well done and allows for both adventure and humor.\r\n\r\nThe characters are pretty good although I found Peter Pan to actually be the weakest of them. Hook and Tiger Lily not to mention Blackbeard stole quite a lot of my attention. Peter Pan is not bad just a little…bland.\r\n\r\nThe movie is darker and more real than other Peter Pan movies. Blackbeard is a rather nasty villain and there are certainly more danger for the good guys in this movie. People do not just get nocked down and come back, they really die.\r\n\r\nThe special effects are not bad. I quite liked the pixie swarms at the end of the movie. Also, unlike what some reviewers state Peter Pan does fly in the movie. I can only assume that those who state that he does not never bothered to see the movie to the end. Do not review a movie if you cannot be bothered to finish it for Christ sake!\r\n\r\nThe movie leaves a bit of a whole between the end of this story and the beginning of the traditional Peter Pan story. What happened to make Peter and Hook become enemies and what is the story between Hook and the crocodile for instance? I certainly would not mind a second movie about that.", "created_at": "2017-03-08T08:42:27.835Z"}]