[{"movie_id": 468224, "review_id": "5cf62e749251416737b8aad4", "rating": 4.0, "review_text": "For the literary fans of JRR Tolkien, this film will serve as a very exciting chapter of your fandom; when you get to see a character called Sam you'll be sure to gasp with glee - and let me assure you they really emphasise his name, along with a myriad of other moments just like it. You can’t miss them. They know who this movie is for, because it sure as hell won't be appealing to anyone else.\r\n- Jess Fenton\r\n\r\nRead Jess' full article...\r\nhttps://www.maketheswitch.com.au/article/review-tolkien-lord-of-the-rings-and-hobbit-fans-this-ones-for-you", "created_at": "2019-06-04T08:40:20.666Z"}, {"movie_id": 468224, "review_id": "5e09a7182d1e40001266f7c5", "rating": 4.0, "review_text": "I'll admit I had some interest when I heard that a Tolkien biopic was in the works, but now that I've actually seen it, I'm very unsure about who was supposed to want this movie? It's just an unbearably clichéd biopic that makes sure it ticks all the boxes a biopic for some reason must. I don't understand how this formula gets forced in to the real-life story of every person who has ever lived a time that was put to screenplay. It's so boring, and it's so **done**. Who was crying out for a movie that examined famed author J. R. R. Tolkien when he... went from mildly unpopular at fancy pants school, to mildly popular at fancy pants school? Not when he was writing the most famous fantasy series of all time. Not when he was at war (or at least not more than about a cumulative 6 minutes of flashforwards at war). Not his relationship with C. S. Lewis. Not even about going to codebreaking school. Nope, a young Tolkien whose not very likeable and rather lofty for someone who supposedly comes from such a poor background. It does touch on some references to his future writing, adding a little bit of a fantastical element, but it's **so** afraid of this, its best element, that really only seems to imply that old mate Jirt wouldn't have come up with a single idea for Lord of the Rings unless some sort of external stimulus for it fell in his lap. Another biopic cliché.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2019-12-30T07:28:24.010Z"}]