[{"movie_id": 52449, "review_id": "5f6094ee706b9f003707fb71", "rating": 7.0, "review_text": "Cameron Diaz has made a lot of crappy movies in her career, to the point that I would not consider myself a fan at all (sit through \"The Other Woman\" sometime, and then argue its merits- there aren't any). Here, Diaz finds a meaty, funny role and gives it her all.\r\n\r\nElizabeth Halsey (Cameron Diaz) is a gold-digging teacher leaving her middle school after a year to marry Mark (Nat Faxon). She is dumped, and realizes the only way to score a rich guy is through ginormous breasts. She returns to teach at the middle school, determined to score the ten grand needed to get her boob job, and another rich guy in the form of long-term substitute teacher Scott (Justin Timberlake), who is eyeing goody-goody teaching vet Amy (a hysterical Lucy Punch). Elizabeth is also deflecting the passes of the nice guy gym teacher Russell (Jason Segel), and begins a campaign of dishonesty in order to reach her goals.\r\n\r\nWhile the script does go off the rails once in a while, Elizabeth thankfully doesn't lose her crudeness due to any life lessons learned throughout the story. She's not a lot of fun to be around, treating her coworkers and students with equal disdain, but the viewer somehow finds themselves riding this out just to see what she is going to do next. Diaz wouldn't have been my first choice for this (Melissa McCarthy would have nailed this), but she surprised me with how funny she was in an unglamourous role. The supporting cast are hot and cold, I didn't get a lot of chemistry with Diaz from either Segel or Timberlake, but the most fun was watching Elizabeth square off against Amy. Lucy Punch never takes a false step in her performance, and watching Elizabeth blithely deal with her is fantastic. The supporting student actors are also good, Elizabeth's withering honesty about their lives is almost refreshing in this day and age.\r\n\r\nJake Kasdan directs with his usual confidence, getting laughs in almost every scene. The screenplay spins its wheels in the midsection. Once we set up that Elizabeth is a bad teacher, we sit through a lot of unnecessary scenes that feel the need to drive the point home again and again (the Christmas dinner at one student's home).\r\n\r\nAll in all, \"Bad Teacher\" is a pleasant surprise, and it's too bad Diaz couldn't give us more Elizabeth Halsey thanks to a closing scene that could have generated a funny sequel. A brief television series emerged from this but way too much was changed to make it successful. A definite (* * * 1/2) out of five stars.\r\n\r\nThe Unrated version contains some physical violence, strong profanity, sexual content, some female nudity, brief male nudity, adult situations, alcohol and tobacco use, drug abuse", "created_at": "2020-09-15T10:18:22.328Z"}]