[{"movie_id": 285923, "review_id": "5bc39a0a0e0a266e5904e316", "rating": 5.0, "review_text": "***Zombies, dancing skanks, rednecks and killer stunt cars***\r\n\r\n“Grindhouse” (2007) features two separate movies: “Planet Terror” by Robert Rodriguez and “Death Proof” by Quentin Tarantino. Together, they’re called “Grindhouse” because they’re a deliberate attempt to recreate the experience of a double feature at a B movie house in the mid/late 60s-70s with the prints intentionally marred by scratches and blemishes or, in one case, a whole reel supposedly missing. Trailers for fake movies, like “Machete,” are also part of the package.\r\n\r\n“Planet Terror” involves a biochemical outbreak in central Texas that (big surprise) turns people into zombies and the ragtag group that teams-up to fight ’em, led by Freddy Rodríguez and Michael Biehn, the latter a sheriff. Hotties Rose McGowan and Marley Shelton are on hand, the former acquiring a machine gun implant in replace of her amputated leg. (How exactly she pulls the trigger to massacre zombies is anyone’s guess).\r\n\r\nThe movie comes across as a melding of “Faster, Pussycat! Kill! Kill!” (1965), “Night of the Living Dead” (1968) and “Dawn of the Dead” (1978), but with the modern tone of “Slither” (2006) with its gross, deliberately offensive black humor. McGowan is a highlight throughout, especially her opening go-go sequence whereas Freddy Rodriguez is surprisingly formidable. Their romantic arc is kind of touching. Another point of interest is the quality cast, rounded out by the likes of Bruce Willis, Josh Brolin, Naveen Andrews and Fergie. \r\n\r\nAt the end of the day, though, “Planet Terror” fails to rise above the low-budget sorta-genius of Syfy schlock like “Flu Bird Horror” (2008), “Wyvern” (2009) and “Sasquatch Mountain” (2006) even though it cost literally twelve times as much. GRADE: C\r\n\r\n“Death Proof” involves an embittered stuntman (Kurt Russell) and his psycho obsession with murdering young women of dubious character with his death proof stunt car (but only the driver’s side). The first half is very good, hindered only by the inane chatter of the girls. This kind of dull drivel goes into overdrive in the second half, particularly involving  Zoe Bell, Tracie Thoms and Rosario Dawson, but is rewarded by a thrilling car chase in the country that’s supposedly Tennessee, but obviously Southern Cal.\r\n\r\nRussell’s character is perversely charismatic and the movie perks up whenever he’s on screen. There are no less than eight female co-stars playing mostly classless types (but not all of them) and, depending on your tastes, four of them are quite alluring,: Mary Elizabeth Winstead, Rose McGowan, Vanessa Ferlito and Sydney Tamiia Poitier (yes, Sidney’s daughter). GRADE: C+/B-\r\n\r\nThe two movies and additional trailers run 3 hours, 11 minutes. Unless you have that kind of time to blow, I suggest watching the movies singularly.\r\n\r\nOVERALL GRADE: C+", "created_at": "2018-10-14T19:33:30.129Z"}, {"movie_id": 285923, "review_id": "5e20656be004a6001398f066", "rating": 6.0, "review_text": "Grindhouse exploits its modern B-movie experience through a bloody expressionistic tribute. Two feature films. Four fictional trailers (five if you’re lucky...). And an authentic conceptual presentation of the 70s exploitation genre, missing reels and all. Rodriguez/Tarantino’s admiration for cinema in general is tangible. Both a credible experiment in genre resurrection and a fetish for babes, blood and bolted machine gun legs. It is, at its core, a retrospective piece of entertainment. But does the double feature presentation, trailers included, work as a solid film in itself? Yes. Just about.\r\n\r\nTwo of the four fictitious trailers worked. Wright’s ‘Don’t’ replicated the essence of Hammer Film Productions perfectly with a quintessential amount of British campiness to illustrate the ghoulish plot. Not to mention the laugh out loud vagueness of the title. Roth’s (yes, this is surprising...) was another hilarious trailer with ‘Thanksgiving’, a holiday-themed slasher. Imitating existing features, such as ‘Halloween’, to deliver a barrage of nudity and decapitations. Absurd, yet sadistically amusing. These two especially suited the overall aesthetic of Grindhouse, particularly with ‘Planet Terror’. Rodriguez’ ‘Machete’, which later became a feature film’, summoned the desolate heat of the Mexploitation sub-genre. It’s fine. Occasionally becomes lost in itself when Trejo is randomly throwing machetes everywhere. Zombie’s efforts in ‘Werewolf Women of the SS’ (I know...) didn’t work for me. The concept felt like he was trying way too hard in being over-the-top and radical by merging a bunch of sets together. Intentional or not, it juxtaposed the other trailers. Cage as Fu Manchu though, I want more! Although varying in quality, these trailers do provide impressive contributions to the overall presentation and are embedded intricately before each feature film.\r\n\r\nSpeaking of features, do both ‘Planet Terror’ and ‘Death Proof’ work as a project of duality? No. The former is an absurdist’s perspective of the zombie genre, whereas the latter just resembled an ordinary Tarantino flick without the excessive exploitation. The two, together, have different paces, styles and tones which exhume varying levels of contrast, diminishing the whole feature’s flow.\r\n\r\nThere’s plenty of passion and heart being injected into this project, ultimately resulting in an enjoyable cinematic experience. Yet a prevention exists that disallows me from fully connecting to the concept. A myriad of pastiches, with varying levels of quality, as opposed to an actual presentation. I’d watch it again just for ‘Death Proof’...", "created_at": "2020-01-16T13:30:19.987Z"}]