[{"movie_id": 621587, "review_id": "65581eb50816c7011a0d2c65", "rating": 5.0, "review_text": "A story with all the proper beats lives here, even if the film rambles and tampers off into ridiculousness when it has no reason to. But even with its flaws and redundant humor fatigue, _Next Goal Wins_ stands out as Taika Waititi’s most coherent film since Hunt for the Wilderpeople.\r\n\r\n**Full review:** https://bit.ly/dontpassgoal", "created_at": "2023-11-18T02:17:25.833Z"}, {"movie_id": 621587, "review_id": "658fd2d851a64e03b5f4132e", "rating": 6.0, "review_text": "If you've seen \"12 Mighty Orphans\" (2021) or \"The Shiny Shrimps\" (2019) then you'll know what to expect as Taika Waititi takes the same template and applies it to football. Here it's the adequate Michael Fassbender who gets to portray the down on his luck coach (Thomas Rongen) in this factually based story. He's not much good at his job and is temperamentally a bit unreliable, so is dispatched to coach what is officially the world's worst team. American Samoa, still smarting from a 31-0 thumping at the hands of the ever so slightly more populated Australia, has a team whose viability is under scrutiny by the parent American Federation. Can Rongen turn things around? His team are the traditionally disparate group of well-meaning, distinctly amateur, enthusiasts. Unused to any concept of team playing, co-ordination and/or training - and their new boss's predilection for a bottle or two doesn't suggest change is going to come anytime soon. Local federation boss Tavita (Oscar Kightley) manages to inspire though - and what happens now is all rather predictable, but engagingly portrayed, as the team start to realise that defeat each time is not as inevitable as they might expect. It does present us with quite an interesting look at Polynesian attitudes - ones of compassion, fairness and tolerance. Winning is important, but it's not the be all and end all; and the eventual make up of their team - and it's constituent parts - is testament to a society that has way more right than it has wrong in the way it thinks and behaves. There's loads of humour - most of which comes from an on-form Kightley, but I found that a bit weak and just a little too stereotypical (albeit from their perspective rather than the American's). The best bits are probably in the trailers, but it's still just about worth a watch - but the television will be fine.", "created_at": "2023-12-30T08:20:40.163Z"}, {"movie_id": 621587, "review_id": "65a08280db4ed6012c5f5e44", "rating": 6.0, "review_text": "The last chunk of the film saves it somewhat, prior to that <em>'Next Goal Wins'</em> is quite poor.\r\n\r\nI like Taika Waititi and usually dig his humour a lot, but here his comedy put into the flick just isn't all that amusing annoyingly. I'm a big football fan so knew of the real life story that this is based upon, though even as such it kinda sits in the middle of being for sports fans and being for the average moviegoer... without really committing to either, at least that's how it felt to me; it's not comedic enough or sporty enough.\r\n\r\nI found everything until the scene with a smiley face on the whiteboard to be real lame, like nothing I was watching was entertaining me... kinda cringey, if anything. A lot of the humour up to that moment felt forced, in fact the only parts that got a chuckle out of me were the white guy jokes. Michael Fassbender isn't any good up to that point, either.\r\n\r\nThankfully, the conclusion is fairly feel-good and does wrap things up well - to the point it gets an extra notch up with my rating. As noted I found Fassbender average, at best... Liam Neeson might've been a better cast, especially given they allude to a past role of the Northern Irishman's at one moment. Away from the lead, other cast members do do decent - namely Oscar Kightley, Kaimana and David Fane.\r\n\r\nIt feels a touch like the filmmakers were aiming to retread the path that opened via <em>'<a href=\"https://en.wikipedia.org/wiki/Ted_Lasso\" rel=\"nofollow\">Ted Lasso</a>'</em>. I'm not into that television show, though safe to say it does a better job... if the similarity is a fair one on my part. <em>'<a href=\"https://letterboxd.com/film/bend-it-like-beckham/\" rel=\"nofollow\">Bend It Like Beckham</a>'</em> is a shout also, but that comparison is probably me reaching in fairness.", "created_at": "2024-01-12T00:06:24.658Z"}]