[{"movie_id": 290764, "review_id": "561a1b33c3a3681ead00178f", "rating": null, "review_text": "Okay, so maybe cinema life has not been so kind to hunky hotshot Taylor Lautner in the aftermath of the phenomenon ‘Twilight’ film series that had a majority of hysterical young female admirers drooling over their bags of stale movie house popcorn. The good news for the youthful muscled Romeo is that there will be ‘Twilight’ tarts lining up just to see Lautner read the middle section of your Aunt Mabel’s phonebook. In the derivative and disjointed street thriller ‘Tracers’, the chiseled Lautner will certainly be a draw for the hormonal honeys out there looking for an excuse to scream at the top of their hysterical lungs. As a vanity vehicle for the ex-Twilight lothario the underwhelming ‘Tracers’ may very well take a backseat to the option of watching the film’s star recite the aforementioned phonebook.\r\n\r\nThe best sell in ‘Tracers’ is indeed Lautner’s kinetic physicality for athletically bouncing around in a synthetic, boneless urban suspense piece. The doubts are not questioned in Lautner’s labeling as being an impressive physical specimen. After all, the performer certainly gives it his all in assuring that his fitness and finesse are on display to charge ‘Tracers’ with a sense of fueled urgency. It is too bad that director Daniel Benmayor oversees a fast-paced but flaccid actioner that offers a skimpy story in between the impressive gymnastic gestures of Lautner’s harried character.\r\n\r\nSo what is the fundamental foundation that feeds the relevance of ‘Tracers’ existence? Well, in addition to showing off the streetwise marvelous moves as demonstrated by the movie’s lead star, the gimmick involves acrobatic movements known as parkour. Hey, ‘Tracers’…the mid-80s called and it wants its outdated fad back! Sure, the art of parkour was indeed an instrumental wonderment that gave distinction to the awe-dropping French import ‘District B13′ but, in the case of ‘Tracers’, the stunts looks woefully repetitive and never really gives any considerable flavor to the strained action or transparent storyline.\r\n\r\nNew York-based bike messenger Cam (Lautner) zips through the streets much like an errand bullet from a shaky gun. The cluttered and busy streets of the Big Apple does not stop Cam from doing what he does best on bicycle wheels in terms of darting to his assigned destinations. However, the crafty Cam receives some considerable heat when he is targeted by tough Chinese gangsters to whom he owes some big time money. Cam’s antagonistic street thugs are not too patient with the beleaguered biker to grant them an expected payback. Bottom line: Cam needs to pay up or he and his loved ones will pay the ultimate price by being snuffed out from the street-minded riff raff.\r\n\r\nThings start to look up for the compromised Cam when his accidental bike crash results in his meeting (and inevitable attraction) to the fetching bad girl Nikki (Maria Avgeropoulos). The ‘parkour princess’ was ducking and dodging the cops prior to her rimmed run-in with Cam. Nikki, both sensual and sinister, triggers Cam’s imagination and spoils him instantly with a new bike, not to mention his introduction to her parkour partners-in-crime, a bunch of high-flying, graffiti-loving street renegades that spend the majority of the time leaping and flipping on the city’s concrete surfaces. Nikki’s clique seem to hop and bop more convincingly than a twitchy kangaroo with a hot foot. Alas, Cam has a new crew and has adapted to the physical philosophies of parkour where he predictably excels at without question. Even the hyperactive group’s leader Miller (Adam Raynor) is tickled by Cam’s ability to soar in the air and make the hardened urban streets his personalized pouncing playground.\r\n\r\nIn its own clumsy way, ‘Tracers’ is well-intentioned because it strives to promote the art of parkour in the spirit of all those conveyor belt break-dancing movies that the studios kept churning out in the mid-1980s. There are some spunky and well shot scenes with New York’s edgy landscape as the convenient backdrop for action-packed mischievousness. Plus ‘Tracers’  is…um…Taylor-made for the fit-looking Lautner to showcase his inherent athleticism on full display for the masses (read: the ladies) to be awed over with wonderment. Nevertheless, ‘Tracers’ never taps into anything innovative or creative to go along with the aerobatic awareness that the movie pushes so eagerly.  The flat and thinly-veiled story, patched-together montages of parkour-inspired pluckiness, the toothless tease of an eye-rolling love triangle among Lautner’s Cam, Avgeropoulos’s Nikki and Raynor’s Miller and the ambivalence of Lautner’s Cam to stroll in the garden of trouble-making tendencies all renders ‘Tracers’ as a weak-kneed crime caper that ironically lacks any genuine animated bounce-and-pounce.\r\n\r\nGranted this flimsy, frenetic vehicle is structured for Lautner’s on-screen fitness skill set but the spotty material never quite capitalizes on the star’s charisma or potential to enhance the skimpy plot with some meaty revelation. The stunning Avgeropoulos serves as automatic eye candy but her Nikki never manages to muster up any mysteriousness or cunning curiosity pertaining to her ‘dangerous diva’ persona.\r\n\r\nIndeed, the pulsating platitudes in Benmayor’s impish but incomplete tumble-and-rumble tale is without a noticeable trace.\r\n\r\nTracers (2015)\r\n\r\nSaban Films\r\n\r\n1 hr  34 mins.\r\n\r\ncast: Taylor Lautner, Maria Avgeropoulos, Adam Raynor, Rafi Gavron, Sam Medina, Luciano Acuna Jr., Josh Yadon and Johnny M. Wu\r\n\r\nDirected by: Daniel Benmayor\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Action and Adventure, Crime Caper, Intrigue and Suspense\r\n\r\nCritic’s rating: * 1/2 stars (out of 4 stars)", "created_at": "2015-10-11T08:17:55.453Z"}, {"movie_id": 290764, "review_id": "5697a69ac3a3683aec002170", "rating": 6.0, "review_text": "> Recycled theme with the bike and Parkour stunts.\r\n\r\nI think the first time I saw a movie that had Parkour in it was the 'District B13'. After that plenty of flicks came, among them this one as well. The movie was about a struggling young bike messenger who meets a girl belong to Parkour gang. Later he joins them that changes his fate, but whether he gets the girl or not, that tells with the thrilling story development and some amazing stunts.\r\n\r\nEver since the 'Twilight' series, I wanted Taylor Lautner to make his foot steady in his acting career. Because I was rooting his werewolves gang in that movie. His last movie I saw was three years ago, 'Abducted' that did not go well. At least this one looked much better, but not enough. Like always I hope he comes back stronger.\r\n\r\nConsidering this film, the story was as old as the cinemas. A reused plot, there's nothing new. More like another version of 'Point Break', but everything was under a limit. Adding the Parkour and bike stunts to it, gives somewhat a new flavour. The young actors and fresh faces were highlights. From coming under the B movie category, it is simply a nice entertainer, but appraising from the out of that, definitely a disappointment. In the end everything is how you look it and what you get from it.\r\n\r\n6/10", "created_at": "2016-01-14T13:46:02.786Z"}]