[{"movie_id": 71469, "review_id": "5887da4ac3a36859f300490f", "rating": 4.0, "review_text": "**When the electric mist from the sky struck down.**\r\n\r\nThis film came five years ago, but I watched it now. A US-Russian collaboration product that's entirely takes place in Moscow. This is an alien invasion theme, but slightly different than those similar films. It never gives the reason, just the destructions like apocalypse on its way. That means it is about the survival. A group of Americans who are in the Moscow for different reasons joins the hands after people started to turn into ashes with the contact of the strange electric mist that came from the sky. So what's their plan now and whether they get out of it safely or not focused on the remaining film.\r\n\r\nSurely some people would enjoy it. It's not all bad if you are not expecting a masterpiece. I should have seen it in digital 3D for a better experience, even the normal watch is not that bad. The turns in the story were unpredictable, particularly the film characters, but the twist wasn't. They kept the open ending, and you know why is that. I liked the performances, not individually, but the overall everyone, including the Russians.\r\n\r\nThe film was also shorter, which means fast moving tale. The graphics were okay, especially those electric mist thing, but disappointed for not show the aliens other than for fractions of seconds during the fightbacks. Despite enjoyed watching it, I'm not in favour of it, because it's just one of those films that falls in the average category where the majority of those who watched it not happy for not detailing everything in the film.\r\n\r\n_4/10_", "created_at": "2017-01-24T22:50:50.709Z"}, {"movie_id": 71469, "review_id": "65609fc92b113d010cc0d8c4", "rating": 3.0, "review_text": "**Good CGI, good action scenes, good sound, Moscow is an interesting place, but everything else is so weak and stupid that it's not worth watching this movie twice.**\r\n\r\nI decided to watch this film yesterday, when it was shown on TV, but curiously I was waiting to see another film with a similar title made in 2017. Even so, I didn't give up my time: even though I didn't have much predilection for alien invasion films, the film is quite dynamic, has good action scenes and a good amount of high quality CGI, and so it is, at least, a piece of entertainment that we don't regret watching... once. Just once.\r\n\r\nLet's start with the good stuff: the scenes take place in Moscow, the Russian megalopolis, long before we ostracized the country due to aggression against neighboring Ukraine, when Russians seemed to want to have more contact with Westerners. This was a real breath of fresh air because in sci-fi films we almost only see US cities. I also believe that filming in Russia was a strategic option for the production to be able to film at lower costs. In addition to the clever use of the filming locations (which include Red Square and the GUM Shopping Center), the film offers us a massive dose of high-quality CGI, which we see in greater glory when the aliens appear. But the whole film is a feast of CGI and visual effects. The sound effects are also very good, and the action and running scenes are fun enough to keep the film moving.\r\n\r\nAnd unfortunately, good things end here. Everything else is so full of flaws and problems that make the film unworthy of a second chance. This is just my opinion, but I think we can all agree on one point: there are a lot of films about alien invasions, and it doesn't take much thinking to remember two or three that make this film a total joke.\r\n\r\nThe film is directed by Chris Gorak, but it seems like he was more fascinated with CGI and action than trying to direct. Thus, we have a very young cast who are left to their own devices and who interpret the characters according to what seems most appropriate to them. Emile Hirsch did an excellent work in “Into the Wild” just before this, but he had a solid character and was well directed. Here, he has none: the result is a tepid, vague, lifeless interpretation without any personality. His partner Max Minghella, who had just done “The Social Network”, was not a good choice for his character. He is one of those actors who is “always the bridesmaid and never the bride”, so to speak: his lack of presence and charisma put him far from the main roles, although he is an option for supporting cast. Joel Kinnaman is stupidly weak as the villain: he behaves like a high school bully, and his character is as thin as paper. Olivia Thirlby also does little for the film, with a character who merely looks sexy, and who we expect to see kissing one of the boys at some point. Worse luck was Rachael Taylor, who is irritating to the point that we say hallelujah when her character finally dies. And the Russian cast? I don't know any of the actors, but I even liked Veronika Vernadskaya a little. Unfortunately, the Russian cast seems to be there only for us to see the Russians as perpetual badasses, a \"Rambo nation\" on horseback with machine guns. Putin certainly enjoyed seeing this in a Western film.\r\n\r\nAs bad as the cast and their performance, the script copies moments and elements from several sci-fi films (“Cloverfield”, for example) to create a story where there is no logical sense or real threat. It's truly unfortunate that, with such good CGI and such well-chosen filming locations, the film is unable to cause a single shiver of tension in the audience. In addition to a rather weak story, there are several moments in which the film seems to be mocking our intelligence: Moscow is one of the most densely populated places in the world: it makes sense that, even after the city is devastated in the first attack, there are only five or six people wandering the streets? Seeing a commercial plane crashed in a shopping center is sensational, but where did its wings end up? And why is there no fire, debris or explosions resulting from the collision? The film ends with a nuclear submarine setting sail from the Moscow River. However, you don't need to be a Muscovite or even a Russian to see that this watercourse doesn't have the depth or width to maneuver such a big thing! To think that the public will believe this things is insulting.", "created_at": "2023-11-24T13:06:17.039Z"}]