[{"movie_id": 10679, "review_id": "5128750619c2951d6308dfec", "rating": 5.0, "review_text": "This is a difficult movie to rate, at least for me. It certainly had its funny, even hilarious, moments but at the same time it was incredibly stupid and silly at times.\r\n\r\nThe idea of the Nazi’s having fled to the moon and built a secret moon-base there was a rather original I think. On could of course wonder why, if they had that technological advantage already 1945, everything is still looking like 1945 now, why they did not have computers, even why they lost the war in the first place? But let us not get picky now…it is a comedy movie after all.\r\n\r\nThere are quite a few funny moments. Most of them involving their stupor when seeing a black American astronaut and their subsequent dealing with him. Unfortunately there are also quite a few incredibly stupid and silly moments. Their depiction of the American present, her PR-people and most things revolving around here was not really very funny, just stupid. I do not mind a movie that makes fun of the American president but in this movie it was not very intelligently done, just silly. Also, using a Sarah Palin look-alike was just cheap not to mention that such a joke is lost only a few years later when no one has a clue who Sarah Palin was.\r\n\r\nThe special effects where quite cool, at least when considering that it was “only” a comedy movie after all and even more so considering the movies minimal budget. The Nazi’s steampunk-like contraptions where rather fun to watch. \r\n\r\nIn all I would say that the movie managed to place itself in the enjoyable range, barely, but I cannot bring myself to give it a more than fairly average rating.", "created_at": "2013-02-23T07:51:34.268Z"}, {"movie_id": 10679, "review_id": "63bf8357df857c00bc20da14", "rating": 10.0, "review_text": "Well I can't call it different. I've never actually seen a movie with a plot like this, but it did feel exactly like a low budget cheap drive in comedy/sci-fi show and...kudos.\r\n\r\nThe best part about this is that, at no point in time, does it take itself seriously. It knows exactly what kind of movie it is and delivers the goods without any pretense, without any attempt to be a better film.\r\n\r\nIt seems like everyone involved knew the score and did their parts to sell the movie for what it is, and not what they think it could be.\r\n\r\nSo, what you have is a comedy that is ferociously entertaining. It's a stupid plot with a cheesy script and equally inane characters and it pulls it off brilliantly.\r\n\r\nThe end result is, when you sit down to watch it, you're going to laugh and be entertained and the time is going to fly by.\r\n\r\nBut, you are going to hate it if you walk in expecting 2001, an enormous budget, or a deeply profound political lecture...but then, if you walk in expecting any of those things why are you watching a movie about Nazis on the moon?", "created_at": "2023-01-12T03:49:44.004Z"}]