[{"movie_id": 396535, "review_id": "5887dddbc3a36859ec004937", "rating": 8.0, "review_text": "**Horror express.**\r\n\r\nA week ago I saw a zombie film from Japan called 'I Am a Hero' and now this Korean. I have not seen a quality zombie film at the recent time. The second tier films like 'Cooties', 'Freaks of Nature', 'Scouts Guide...', all these were comedies. Probably 'World War Z' was the last decent zombie film I have seen and after that this is the one. So the timing of the film was another advantage. Since there's no competition, this zombie film rules. And not to forget the Korean style, they are among the best thriller film makers today.\r\n\r\nDirected by an Anime filmmaker, this is his first live-action film. When I decided to watch it, I thought it would be another Korean film, which rely on father-daughter sentiments. You know I kind of tired of that Korean cliché where at the final stage they let the kid sob and call it a twist. Initially I enjoyed those and later on getting bored of that. With that kind of reasons, I would have missed it. Being a film fanatic, I won't mind to risk a watch, except give up writing a review for it.\r\n\r\nBut in this case, it was completely different. Even the characters, any characters in the film, either in the lead or the supporting ones, all are unpredictable. That's the biggest plus point of the film. At the end you won't be sure, who you were rooting for. You know in those edgy scenes, we blindly back the one we like. You will think you can guess the upcoming scenes, but the writing was very smartly done. Feels like they did not care about a sequel, if this meets a greater success. But who knows, this is a cinema and there were many mysteries kept unsolved, so they can pick up from one of those loops.\r\n\r\n> \"Whatever you do, you must finish what you start. It's worse than not doing it at all.\"\r\n\r\nThis is the story of a divorced, workaholic father and his young daughter. After the progress, many others join them. On her birthday, they decide to visit her mother in Busan. On their train, soon after it took off, they come to know that something is wrong around. With all the chaos unrolling rapidly, a group of survivours gathers in a car since there's no escape as they are trapped in a moving train. How their journey ends, whether they reach a safe place with the fight against the living dead, the narration comes to halt.\r\n\r\nIn the contest of good versus evil, there's no place for sentiments. But at one stage, near the end they cleared the place to attach one. In that final scene you can't resist, even if you are not an emotional person when it comes to the film. As I mentioned earlier that is the part I feared the most would come, but i did not hate it in the context of story development. Because that was a perfect setting to take the story to the next level.\r\n\r\nThere are several twists. Those are from the film characters' perspective than the story wise. They did not bother to tell about the cause of the epidemic. Instead, this film was focused on the train passengers and their fight for survival when the defending options are limited. Just imagine it is a zombie version of another Korean film 'Snowpiercer' or like 'Snakes on a Plane'.\r\n\r\nI have heard there's another film, an animation which is also directed by the same filmmaker and said to be a prequel to this one. If you had liked it, you would be itching to watch that one as well. Hope I would watch it as soon as I get an opportunity. So, my view on it, the film is very good. It was close to two hours long, but once the train journey begins, you won't going to notice the time. I am saying the pace of the film, as well as the events make you dissolve in it completely and forget everything else. This is the best zombie film right now and you should not miss it, especially if you like this theme. Recommended!\r\n\r\n_8/10_", "created_at": "2017-01-24T23:06:03.384Z"}, {"movie_id": 396535, "review_id": "5bbb4f9d9251410a21043b6e", "rating": 7.0, "review_text": "With a couple of the zombie movies I've watched recently, I've found myself able to go so far in my reviews as to credit the films for some modicum of surprise originality, alongside a rating of four of five out of ten. But it has been **years** since I've been able to say that I saw a zombie movie I genuinely and wholeheartedly **enjoyed**. Or I should say, it **had** been years, right up until last night when I saw _Train to Busan_.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2018-10-08T12:37:49.802Z"}, {"movie_id": 396535, "review_id": "5f1e386366a7c300380db8e0", "rating": 9.0, "review_text": "Fantastic watch, will watch again, and can definitely recommend for those looking for a new zombie movie to watch.\r\n\r\nThis one really had me yelling at the screen: I was heavily invested....until I was basically emotionally exhausted.  I don't think I reacted quite how the director wanted me to react during that last act.\r\n\r\nThis is a fascinating premise.  A zombie outbreak that leaks onto a train (with just one infected), and these are \"World War Z\" running, 15 seconds to turn (usually) zombies.  I'm staunchly against running zombies, but when you do something well, it is really hard to discredit you for it.\r\n\r\nThere is one aspect that is truly odd for zombies, but it would be quite the spoiler, it's basically the 3rd act (out of 4).  The writing structure feels very different, it doesn't seem to adhere to a 3 act staple: it really feels like 4 acts broken into chapters (or levels similar to a video game) and as whichever characters survive the transfer from chapter to chapter, the story progresses.  There is clearly though pre-infection establishing act, post infection establishing act, confrontation act, and resolution act.  Once you get past the first act, it's pretty much non-stop action, by the by.\r\n\r\nThe one frustrating part about this movie is that most of the characters seem to have a death wish: despite trying to stay alive, they all seem to want to die.  I understand that a story can't happen without flawed characters, but the things these people do are so remarkably stupid sometimes that the zombies become more believable at times.  It does allow for some of the more amazing scenes though, so it might be somewhat forgiveable.\r\n\r\nThis movie is honestly so good, I really feel like I'm reaching on any of the complaints.", "created_at": "2020-07-27T02:13:55.618Z"}, {"movie_id": 396535, "review_id": "5f985c5a77d23b0038f7b4f9", "rating": 10.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nZombie apocalypse is far from being a groundbreaking subgenre. The Walking Dead franchise is arguably the most popular show on Earth when it comes to portraying this supernatural future. World War Z and the Zombieland duology play that role in the movies' realm. However, all of these works fail to reach the always high expectations that come with a story set in a time like this. When people ask, \"what's the best zombie apocalypse film ever?\", one doesn't have a clear answer simply because there isn't an outstanding, mind-blowing, near-perfect flick. Well, at least not until 2016, the year of release of the best movie in the genre, Train to Busan.\r\n\r\nI genuinely feel sorry for everyone who refuses to watch foreign films for whatever reason. A different language and/or the display of subtitles shouldn't be enough to convince viewers to ignore so many unique works from all around the world. If someone dares to call themselves a \"zombies fan\" and has not watched Train to Busan yet, then \"fan\" is far from being the right description. This is South Korean cinema at its best. Everyone is 200% committed to their role, whether that is a stunt man or one of the protagonists. Yeon Sang-ho delivers a powerfully suspenseful, intense, epic, and most of all, heartbreaking story with the help of a phenomenal screenplay written by Park Joo-suk.\r\n\r\nWhen the only \"negative\" aspect that I can find is related to \"maybe not-that-logical\" specific actions performed by some characters, I know that I'm nitpicking a near-perfect movie. I struggle to find a single real issue with the entire film. In my opinion, the reason why the latter works so well is largely due to Park Joo-suk's script. Usually, people always think about the zombies first: how do they look? How do they act? Do they run wildly or stroll? Which new attributes or skills do these zombies have different from what we've seen until now? How did it all begin? Is there a cure? Granted, the zombies look cool, and Yeon Sang-ho is able to create impressive action sequences filled with maximum intensity and extreme tension. Entertainment-wise: top-notch.\r\n\r\nHowever, the action only works as well as it does due to the emotional bond that the viewer shares with the (non-infected) human characters. These are beautifully treated and developed in such a remarkable manner. There are easily five to six characters that the viewer ends up caring deeply about. Typically, at least half of this group is expendable in this type of film because some characters show no signs of intelligence or are just douchebags. In Train to Busan, every single character possesses likable traits, besides being directly connected to each other (father-daughter, young couple pregnant). The action scenes are filmed in incredible fashion, but it's the encompassing emotional aura that ultimately elevates them.\r\n\r\nIt's really an emotionally devastating story. The viewer is placed in dozens of situations that require the hardest of choices from the main characters. The generic dilemma \"do I save the person I care about or everyone else?\" is taken to a whole other level with exceptional dialogues, filled with an excruciating amount of suspense, leaving me about to tear up on more than just a couple of times. Every character has a terrific, compelling arc. The main protagonist, Seok-woo (Gong Yoo), goes from being a despicable character, one that I wouldn't mind seeing killed in the first fifteen to twenty minutes, to a lovable father that only wants what's best for her daughter, protecting her at all costs during the apocalypse.\r\n\r\nThis movie is packed with clever social commentary, relatable to this day (and even more during the current global pandemic). Yon-suk (Kim Eui-sung) represents everything that's wrong with our society. A selfish man who thinks he's more important than everyone else due to his class and whose job is more significant than his own family or friends, let alone strangers on a train. He also works as a \"wake-up call\" to our protagonist, as a \"what if\" version of Seok-woo's future if he continues to only focus on his job. Another character of great relevance is Sang-hwa (Ma Dong-seok), a father-to-be who ends up protecting Seok-woo's daughter when her father can't. His bravery and selflessness make him an instant audience favorite.\r\n\r\nTechnically, it's genuinely a flawless film. From the outstanding zombie makeup to the mind-blowing stunt work, everything action-related serves as evidence to prove that South Korean cinema does action a thousand times better than conventional Hollywood. The level of intensity is ridiculous. Lee Hyung-deok's camera work is absolutely brilliant, moving through the train seamlessly, letting the viewer see and understand everything. Aided by excellent editing (Yang Jin-mo) and a phenomenal score (Jang Young-gyu), Yeon Sang-ho generates tension and suspense in a way that makes every single action sequence feel overwhelming, powerful, and even epic.\r\n\r\nA runtime close to the two-hour mark that flies by. The first act perfectly sets up the apocalypse to come with a surprisingly subtle build-up of the exponentially growing chaos. Then, the outbreak in the train which occupies most of the movie's duration. During this period, everything happens. From the nail-biting action sequences to the emotionally powerful moments of character decisions that make this film so shocking. Finally, a third act that left me floored, completely drained of emotions, not knowing exactly how to feel after it all ended. Despite a couple of sequences that I believe were exclusively executed in the way they were to offer an emotionally climactic moment, everything else feels impressively realistic.\r\n\r\nAll in all, Train to Busan is arguably the best zombie apocalypse movie of all-time, at least, until the date of this review. The subgenre finds in Yeon Sang-ho's mind-blowing flick the masterpiece it deserves. From the exceptionally subtle build-up to the emotionally devastating final act, passing through the most vivid, suspenseful, tense depiction of a zombie outbreak ever put to screen, Park Joo-suk's screenplay is the reason why this film succeeds so well. A heartbreaking story featuring astonishingly well-developed characters, surrounded by a powerfully resonant social commentary, even more in the current days. Action-wise, it's South Korean cinema at its best: maximum intensity, phenomenal camera work, seamless editing, chill-inducing score, outstanding commitment from everyone involved, and a fantastic stunt team. Hollywood should learn from movies like this. I can't find a single flaw. It left me emotionally drained. If you're a fan of cinema, no matter the genre, this *must* be on your watchlist!\r\n\r\nRating: A+", "created_at": "2020-10-27T17:43:54.679Z"}]