[{"movie_id": 845111, "review_id": "6585a98343cd54552a3c1567", "rating": 7.0, "review_text": "I can't say that I enjoyed this as much as the first outing for this new breed of musketeers, but it's still an enjoyable and authentic looking adaptation of these timeless and honourable Dumas characters. We know that \"Constance\" (Lyna Khoudri) has been kidnapped and that the enamoured \"D'Artagnan\" (François Civil) is determined to get her back - but how? Well the almost fatal attack on the king (Louis Garrel) has galvanised everyone - friend and foe, and the musketeers determine that they must get to the ringleader of that plot before it is eventually accomplished and the kingdom is plunged into chaotic warfare. Now everyone suspects the malevolent Cardinal Richelieu (Eric Ruf) but surely it's not in his interests to kill Louis XIII? The Queen (Vicky Krieps) and her not-so-secret English lover Buckingham (Jacob Fortune-Lloyd) might be in the mix, or maybe just a disgruntled nobleman? \"D'Artagnan\" is first with a clue after he inadvertently rescues \"Milady\" (Eva Green) from a prison (after she fell off a cliff!) armed with a secret, coded letter. What does it mean? Can it help find his love and save the kingdom? Meantime, we start to learn a little more about this enigmatic \"MIlady\" and of her relationship with \"Athos\" (Vincent Cassel) whilst his two pals \"Aramis\" (Romain Duris) and the affable \"Porthos\" (Pio Marmaï) do their bit for the story and the country too. It looks great - the settings, the costumes, the combat scenes all smack of effort having been spent on making the scenarios ring true. I'm still no great fan of Eva Green, but here she starts to exude just the tiniest hint of menace as the story builds to the conclusion of this search for love and traitors. It's a wee bit more earnest, this time around - there's less humour and I missed that. I don't mean laugh out loud stuff, but here we rarely see all the musketeers together; their camaraderie isn't so obvious. This is essentially Civil v Green and that doesn't always work so well. Still, it's a solid and quickly paced adventure story that I found passed two hours effortlessly.", "created_at": "2023-12-22T15:21:39.680Z"}]