[{"movie_id": 585, "review_id": "5f123b47b87aec00331a483a", "rating": 9.0, "review_text": "Always a pleasure to revisit this. <em>'Monsters, Inc.'</em> is one of my favourite Disney animated films.\r\n\r\nThe cast and characters are what sets this above the majority of the studio's other work, with so many memorable ones involved. John Goodman (Sully) and Billy Crystal (Mike) make for an outstanding duo in the lead roles, they are truly perfect for their respective roles.\r\n\r\nElsewhere, you have the excellent Steve Buscemi portraying Randall to terrific effect. There are also memorable roles for James Coburn (Waternoose), Jennifer Tilly (Celia) and Bob Peterson (Roz). You, of course, also have Boo (Mary Gibbs) who is simply adorable.\r\n\r\nEverything else from the plot to the animation is fantastic, too - I have no faults with this film. Funny, wholesome, entertaining and touching. I see they're creating a television series, <em>'Monsters at Work'</em>, which could be good given it will have the same cast.\r\n\r\nA must-watch!", "created_at": "2020-07-17T23:59:03.556Z"}, {"movie_id": 585, "review_id": "6571745fdfe31d00ab6c9fad", "rating": 7.0, "review_text": "Talk about renewable energy! An entire city can be powered by the racket make by children when they scream... To that end an whole industry exists providing scary monsters to get the youngsters to bellow. A security breach sees their factory overrun by toddlers and boss \"Waternoose\" is terrified it will ruin the business. They all have to be rounded up by the pest controllers and returned home. Well, of course one \"Boo\" manages to avoid capture and she is soon befriended by the big wooly \"Sully\". His roar is terrifying, but his bark is certainly worse than his bite and together with his green cyclops pal \"Mike\" they have loads of fun adventures trying to keep the child safe from the hands of the nasty \"Randall\" and get her back to her own bed! This is a very simple story and it works really well. The animation is enjoyable to watch, the writing is quickly-paced and quite wittily observational at times and the characters - especially \"Sully\", are creatively personified and engaging. Luckily, the yelling brats are kept to a minimum and what we end up with is a sort of, well, love story. It has all the usual Pixar/Disney messages of loyalty and teamwork - only this is depicted with much more playfulness and we've even got a yeti with a never-ending supply of snow-cones!", "created_at": "2023-12-07T07:29:35.513Z"}]