[{"movie_id": 37430, "review_id": "55702e139251413217001c1a", "rating": null, "review_text": "Everytime I hear the term \"remake\" I cringe a little... More often than not, the so-called \"remake\" does not do the original movie justice. With that being said however, I was blown away by this revisited title. Although I was not familiar with the actor cast to play Conan, I was quite pleased by his rendition of the role. Excellent action and plenty of adventure, and not too bad in the looks department either! A most enjoyable movie, that I am pleased to have in my collection.", "created_at": "2015-06-04T10:53:07.668Z"}, {"movie_id": 37430, "review_id": "57ef5bd2c3a368766a0037a5", "rating": 4.0, "review_text": "There's some cathartically pleasant violence, particularly in the first half, but ultimately this movie didn't have to be made, and it *definitely* didn't have to be made under the name \"_Conan_\".\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2016-10-01T06:46:42.602Z"}, {"movie_id": 37430, "review_id": "5a583d320e0a2634ef00358f", "rating": 7.0, "review_text": "I quite liked this film, more than I liked Captain America: The First Avenger that we watched a couple of days ago. It has gotten some rather disappointing ratings. I obviously disagree.\r\n\r\nI found the film to be pretty much what I hoped for. I read some reviews on IMDb stating that Conan only said about 40 words, that he wasn’t “barbaric” enough, that the fight scenes where chopped up and that you didn’t get to see much of the fighting.\r\n\r\nIn reality the first statement is a blatant lie and the others simply not true. The film is much bloodier than Schwarzenegger’s version and sometimes in a quite “barbaric” way. I do not know what people really expected from this film but for me it was pretty much what I hoped for. Although the Schwarzenegger films are somewhat out-dated I was still afraid that I would miss good old Schwarzy but I really didn’t (that much at least).\r\n\r\nSpecial effects where quite okay and the 5.1 DTS Master Audio soundtrack was done well enough. It get’s a 7 out of 10 from me.", "created_at": "2018-01-12T04:44:34.420Z"}, {"movie_id": 37430, "review_id": "5b80ce3cc3a368656000549f", "rating": 6.0, "review_text": "_**Looks great, nice action, but needed more depth**_\r\n\r\nAlthough the set-up of “Conan the Barbarian” (2011) is the same as the 1982 version (raiders destroy Conan's village in Cimmeria and thus the barbarian seeks revenge) the story is otherwise completely different. The villains here are Khalar Zym and his witchy daughter, Marique, who seek to resurrect Zym's sorcerous wife, but they need to acquire the pure blood necessary for their Acheron magic.\r\n\r\nWHAT WORKS:\r\n\r\n•Jason Momoa, as Conan, is excellent; far better than Arnie. It's hard to conceive of a better Conan. \r\n\r\n•The Bulgarian locations are outstanding. \r\n\r\n•The Costuming is more convincing than the '82 version. Conan's apparel, for instance, is more faithful to REH than Arnie's fur loincloth. \r\n\r\n•Better acting than the '82 version, excluding James Earl Jones, of course.\r\n\r\n•Brutal, thrilling action throughout with convincing swordplay (unlike the contrived ’82 version). \r\n\r\n•Corsairs, highlighted by Conan's comrade Artus, effectively played by likable Nonso Anozie. \r\n\r\n•Excellent sets/props; it definitely looks like the Hyborian Age. \r\n\r\n•Good serious vibe, despite the cartoony, over-the-top last act. \r\n\r\n•Rose McGowan as the witchy daughter is ee-vil and creepy. \r\n\r\n•Ron Perlman as Conan's father. \r\n\r\n•The whole opening sequence. \r\n\r\n•I liked how the film stressed the closeness and love of Conan and his father. There's a correlation between true greatness and a close relationship with a strong father-figure and his example of excellence. \r\n\r\n•You have to give credit to the filmmakers for effectively illustrating Conan's youthful days and life in a Cimmerian village in general, something Conan's creator never delved into in any detail.\r\n\r\nWHAT DOESN'T WORK:\r\n\r\n•The film deviates from Robert E. Howard, albeit not as much as the '82 version. Regardless, it certainly adhered to REH's overall pulp vibe. I'd prefer to see one of REH's originals put to film, like \"A Witch Shall Be Born\" or \"Beyond the Black River.\" \r\n\r\n•Stephan Lang as Zym makes a worthy enough villain for Conan, but he comes off too clichéd and cartoony, especially in the final act. James Earl Jones' Thulsa Doom worked better, likely because he was so unique. \r\n\r\n•Rachel Nichols' Tamara is solid as the female protagonist, but she doesn't hold a candle to Sandahl Bergman's Valeria. \r\n\r\n•The score is serviceable but pales in comparison with Basil Poledouris' score from the '82 version and \"Conan The Destroyer\" (1984). This score definitely won't be celebrated 30 years later like Basil's. Why didn't they just update Polerdouris' piece? \r\n\r\n•There’s too much \"Modern Blockbuster Syndrome\" that appeals to those with ADHD. \r\n\r\n•Especially the over-the-top final act, which is way too comic booky. It's cartoony overkill, pure and simple. But, then again, it did bring to mind REH's \"Jewels of Gwahlur,\" so maybe it's not so far off the mark. \r\n\r\n•The biggest flaw was that there wasn't enough depth. The film needed more 'downtime' to contrast the wall-to-wall action, like campfire scenes (which would better indicate distances), more camaraderie on the ship, more development of Conan & Tamara's relationship, etc. Although it had some of this, it wasn't enough. Action sequences naturally hold more weight when the audience cares about the characters. As it is, it's clear that the filmmakers wanted to make an action flick above all else and this weakens the film. \r\n\r\n•Along with lack of depth was the lack of epic-ness or moving moments. The '82 film deviated from REH but at least it made up for it with depth and a sense of epic-ness. For instance, when Conan & Subotai make their stand against the riders of doom or Conan's moving victory salute, not to mention the potent love & death/funeral scenes, etc. This 2011 version had glimpses of this, like when Conan is birthed on the battlefield then raised to the sky and when Conan's father expresses his love with his final act, but, again, it needed more.\r\n\r\nCONCLUSION: The filmmakers got a lot of things right, like Momoa as Conan and the authentic look/feel of the Hyborian Age. The film's not bad at all and pulsates with energy, but it needed more depth, epic-ness and uniqueness to pull it out of its \"blockbuster\" mediocrity. It's a case of violence for the sake of violence, which gets dull by the 90-minute mark, plus the last act is just comic booky overload. The focus on wall-to-wall action limits the film's effectiveness. It lacks the confidence to chill and allow the characters to breathe. \r\n\r\nStill, it's a somewhat worthy Conan movie. It's serious and brutal; and, thankfully, lacks \"cute\" characters. It’s arguably on par with \"Conan the Destroyer\" and superior in ways, not to mention leagues better than \"Red Sonja\" (1985).\r\n\r\nThe film runs 1 hour, 53 minutes.\r\n\r\nGRADE: B-/C+", "created_at": "2018-08-25T03:34:20.939Z"}, {"movie_id": 37430, "review_id": "5e128cff8741c400123d1cec", "rating": 2.0, "review_text": "This is terrible, poorly executed, story makes no sense. Costume design is nice but it's not enough to sanction just under 2 hours of my life.  Unless you are a child or an easily impressed adult, Avoid!", "created_at": "2020-01-06T01:27:27.502Z"}]