[{"movie_id": 98566, "review_id": "5a738bda0e0a26642a013a97", "rating": 5.0, "review_text": "I have to say that this was a rather “meh” experience. It certainly was not an improvement over the original. Why try to rewrite a story that was actually not bad when you cannot be bothered to spend some effort on it? The new story is sloppy and it is rather clear that whoever wrote it got only two directives: Make sure that Megan Fox gets a lot of focus and if you do not know what to write then cram in some special effects. There are a lot of special effects in this movie!\r\n\r\nIt is obvious that Megan Fox’s ego have had a lot of influence on the movie. To the extent that you might wonder if this movie is about the turtles or about Megan Fox. She might be the wet dream of some less discerning teenagers but her acting skills leaves somewhat to be desired. Okay, okay she was actually not too bad in this movie but then it was not to difficult to shine in this movie either.\r\n\r\nThere are a few moments when it looks like it is going to turn interesting. For instance when the shredder is first introduced and punishes some of his underlings but rather quickly he is reduced to just another “special effect” when they slap this robotic shredder suit onto him. Come on, he is supposed to be a skilled martial arts combatant, not some freak in a robotic suit.\r\n\r\nSplinter was just sad. Some lab rat that picked up martial arts from a book he found in the sewers! What the f…? That ruined a lot of the movie.\r\n\r\nThe turtles themselves, being already pushed back somewhat into the background by Megan Fox desire to be in front of the cameras most of the time, are bland to say the least. They are immature, even for a movie like this, and the jokes are simply unintelligent and mostly not very funny.\r\n\r\nI was about to write that, if you like special effects and do not care for much of the rest, then you will probably like this movie but when I think back even the special effects where often only mildly interesting. They were perhaps not really bad but not very impressive either. The truck ride down a snowy slope was just silly and some of the scenes where actually rather underwhelming for instance.\r\n\r\nOn the whole, to me, this was a mildly entertaining movie that could have been much better if someone with basic intelligence had been asked to write the script in the first place. There are actually five (!) people credited with writing this movie and maybe that is the problem. Too many cooks!", "created_at": "2018-02-01T21:51:22.322Z"}, {"movie_id": 98566, "review_id": "5ff8eb87021cee003fa6c550", "rating": 5.0, "review_text": "Flat, generic, CGI-filled. <em>'Teenage Mutant Ninja Turtles'</em> bored me, unfortunately.\r\n\r\nI have a slight memory of seeing bits of TMNT when I was younger but never intentionally watched it, though have always been interested in viewing a film with them in. So in that sense, this disappointed. It just has nothing about it, no character or charm whatsoever. No reason to care for any of the onscreen bunch. Very plain.\r\n\r\nNone of the cast stick out, particularly the voices. Megan Fox is probably the best this has to offer, though I didn't mind William Fichtner either... Whoopi Goldberg shows up in an alright minor role too, I guess?\r\n\r\nI found little to zero of the action scenes entertaining, not helped by some questionable editing and music. Another issue I did also notice is the humour, which falls flat at almost every opportunity - especially with the grating Michelangelo (Noel Fisher).\r\n\r\nI'll check out the sequel, because I always going to, but I ain't expecting much! This 2014 film isn't worth seeing.", "created_at": "2021-01-08T23:32:23.128Z"}]