[{"movie_id": 16028, "review_id": "6516b1a8c50ad2014dccc0f7", "rating": 4.0, "review_text": "You have probably seen the plot summary a hundred times before, and if you haven't, then you have seen scenes from this film in other films a hundred times before. Julia (Laura Regan) is a master's degree student in psychology. A troubled childhood friend, Billy (Jon Abrahams), contacts her, meets her, rambles incoherently to her, and then shoots himself in front of her. The viewer has already seen Billy, as a young boy, grabbed by monsters in the night, so he probably had some problems even Julia could not help him with. At Billy's funeral, Julia meets Billy's other friends Sam (Ethan Embry) and Terry (Dagmara Dominczyk). The friends have had night terrors as children, and they now bear strange markings on their bodies that seem to say \"hey, mysterious computer generated creatures, come and get me!\" Julia goes to former childhood psychiatrist Dr. Booth (Jay Brazeau), who does the shrink thing. Julia's boyfriend Paul (Marc Blucas) doesn't really get it all, either. Come to think of it, neither did I.\r\n\r\nThe basic flaw with \"They\" is the lousy execution of the premise. Childhood monsters coming back for adult victims is a good idea, but the script was given the go-ahead without any explanation as to where the creatures come from, why they mark certain victims, etc. This is huge in a film that is otherwise not very compelling. The cast is fine, acting scared at just the right moment. The instrumental score is terrible, it sounds like incidental music for \"The Music Man.\" Director Harmon's talents are wasted on the screenplay. He needs a script that will not fail his eye. The screenplay borrows from tons of other films like \"Jacob's Ladder,\" \"Phantasm,\" the remake of \"The Blob,\" and \"The Sixth Sense,\" to name a few, and thinks nothing of ripping off the pool scene from \"Cat People.\" Sure, the DVD has the alternate ending, which is a ripoff of \"The Cabinet of Dr. Caligari,\" but that ending was better than the one that made the final cut. The special effect monsters are wisely kept out of view through most of the film, they look like giant bats. They do deliver a few scares, but in context with the mindless script, it is not enough. Eventually, you will figure out that most of the special effects here consist of some grip flicking lights on and off. \"They\" had a promising director, nice cast, and a low budget. The script is what never should have seen the light of day.", "created_at": "2023-09-29T11:14:48.274Z"}]