[{"movie_id": 136795, "review_id": "52b7eb5d19c295630d334f1b", "rating": null, "review_text": "Absolutely fascinating interpretation of the good cop bad cop theme.", "created_at": "2013-12-23T07:50:53.322Z"}, {"movie_id": 136795, "review_id": "52dd7bb219c2952f6002cbaf", "rating": 7.5, "review_text": "I honestly can't think of a better movie to replace a mind massage on a hard working Monday's night.", "created_at": "2014-01-20T19:40:34.206Z"}, {"movie_id": 136795, "review_id": "550d7866c3a3684872006029", "rating": 5.5, "review_text": "**Plot: 5/20**\r\nProbably the movie's biggest downfall. The plot is your generic story of two people who don't get along with each other and end up becoming best friends before the movie ends. On top of that, the whole point of the the story is for the characters to catch the \"typical bad guy\" leader of a drug ring. It's really just the garbage rehashed Hollywood cop story told over again, but with tons of hilarious scenes added in throughout. I don't really have any detail to go into with here because there's not much to analyze.\r\n\r\n**Rewatchability: 5/15**\r\nDon't get me wrong, even though the plot is terrible the movie is ridiculously funny. It gives comedies from 2013 a run for their money. As with all movie ratings I give, I watch a movie twice if it has a commentary track. This movie ended up having four or five separate commentaries, but I only watched the one with the director's commentary. I really don't think I can sit through it any longer than I have, because it is a two hour long movie after all. I wouldn't ever watch it again unless it popped up on TV and I was really bored, but I can give this movie a good ol' watch-this recommendation for the comedic aspect alone.\r\n\r\n**Acting: 15/20**\r\nInterestingly enough the acting is superb. With huge celebrity A-list names it's not too surprising. Sandra Bullock absolutely kills every scene she's in. A lot of her shots in the film are improvised. My favorite one being the hospital scene towards the end where she's crawling on the ground and ends up shooting the bad guy twice in the nuts. As much as I can't stand Melissa McCarthy in general, her acting was great as well. She came off as an arrogant, foul mouthed, dirty and annoying police officer better than probably anyone else could have managed to pull off. A YouTube star named Spoken Reasons also makes his acting debut in this film as a perpetrator and is actually quite impressive.\r\n\r\n**Audio Production: 10/20**\r\nI thought that the soundtrack was just your typical Hollywood film soundtrack with nothing but popular music. Most of the songs featured female rap from artists like Angel Haze and Azealia Banks, but there were also some classic pop/rock songs from Ted Nugent, Air Supply, and Boston. What I really got a kick out of was hearing the rapper Kreayshawn's song Left Eye play randomly (or so it seemed). I wasn't really feeling the soundtrack, but the overall sound effects and audio production were done quite well. Nothing spectacular, but good.\r\n\r\n**Visual Production: 15/20**\r\nThe film crew made very good use of different sets throughout the city of Boston. This film has everything from a giant paint warehouse, to a local town pub, to car chases. The amount of stunts performed in the movie is entertaining. Towards the beginning of the movie Melissa McCarthy parks in between two cars, but there's not enough room to open her door. She ends up climbing out the window into another car, and then struggling to make her way out of that car as well. Just the small things that add some good humor to the movie like this really make a difference. There's also some really good special effects in the movie and a scene where they blow up a car.", "created_at": "2015-03-21T13:55:50.863Z"}]