[{"movie_id": 41154, "review_id": "5d2eab7927d9cc00117caedd", "rating": 4.0, "review_text": "Personal low point in the series to me. Brolin does do a commendable job of playing a young Tommy Lee Jones, but the script doesn't deliver. Not only is it not a very good one, it just offers the same story. **Again**. This is three Men in Black movies in a row where the A-plot is totally encapsulated by one sentence: \"Stop the creepy-crawly in a human suit from getting the jewelery.\" There's a supporting role alien that was pretty endearing though.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2019-07-17T05:00:41.303Z"}, {"movie_id": 41154, "review_id": "630c2df4bbcae0007e4906d4", "rating": 6.0, "review_text": "**This film knew how to honor and equal the first film.**\r\n\r\nDespite their popularity, the first two MIB films, from the turn of the century, are films I don't really like to watch. The first movie, from 1997, is still worth it, but the second one was so bad that they had to wait more than ten years for this movie to come out, and even then, we still remember it. Good news: this movie is virtually as good as the first one and knows how to meet the public's expectations.\r\n\r\nThe plot is reasonably simple, but it guarantees entertainment: over the years, the boss of the MIB organization became a woman. Meanwhile, the escape of a dangerous alien from the lunar prison will force J to travel back in time, to the beginning of K's career, to try to prevent planet Earth from being invaded by a destructive galactic force. The script does a reasonably effective job and there is a lot of movement and action.\r\n\r\nWill Smith shows that he has matured as an actor, and he knew how to imprint that maturity on the MIB agent he played: J is no longer a rookie or someone who accepts lessons, he is a senior agent with experience, who knows what he is doing and is sufficiently trained to deal with what you have in hand. Of course, K remains a veteran, and Tommy Lee Jones won't let that go by the wayside: sullen and seemingly unflappable, Jones' character will take particular pleasure in lecturing and lecturing Smith whenever appropriate. And, ultimately, it's the way the two actors interact that makes the movie funnier. The villain is worthy of our dislike and has some good jokes and tongue-in-cheek lines, but Jemaine Clement seems to have sometimes exaggerated things a bit. Michael Stuhlbarg and Josh Brolin do a very honest and committed job, and they help substantially to increase the quality of the film.\r\n\r\nTechnically, there is a serious and substantial bet on CGI, computerization and computer-made effects. It's something almost predictable, nowadays it's a very widespread resource and sci-fi or action movies have learned to master it. However, the authenticity of real scenes always tastes good. So the ending seems to be a bit out of step with the rest of the movie, but that turns out to be a minor problem. The cinematography is quite well executed, the sound and soundtrack are effective, the visuals as well. The sets and wardrobe, as well as the props, are in line with what you would expect to find in a MIB film.", "created_at": "2022-08-29T03:09:40.320Z"}, {"movie_id": 41154, "review_id": "647c265893828e00dcdd1c3c", "rating": 6.0, "review_text": "Well it took ten years to try and recalibrate this franchise after the disappointing sequel, and to be fair - they have at least had a think about the story before rehashing the theme of the detective agency charged with policing the earth of our visiting friends from planets far away. Clearly, \"J\" (Will Smith) has become much more experienced since the days of the talking dog, but suddenly he finds himself ill-equipped for this latest trauma that is gong to need him to engage with his partner \"K\" (Tommy Lee Jones) and even travel through time to work with his younger version (an uncannily similar Josh Brolin). All of this is now under the leadership of new chief \"O\" (Emma Thompson). The plot is all a bit old hat - they have to save mankind from imminent annihilation, but at least this time around there is a bit more humour - usually more effective from Thompson - and a bit less of the constant diatribe from the over-powering Smith. At times it's a bit \"Dr. Who\" and the action scenes recycle themselves as they pursue the eminently un-menacing \"Boris the Animal\" (Jermaine Clement) towards a predicable, but colourful, denouement. Could Andy Warhol have been in on the whole ET-thing? It's better than the second but nowhere hear as much fun as the first one. Maybe we should stop now.", "created_at": "2023-06-04T05:51:20.122Z"}]