[{"movie_id": 10195, "review_id": "589c3e93925141250a00329a", "rating": null, "review_text": "The movie was not great. I don't like action movies that much but I'm expecting some good fighting scenes since this is a Marvel movie. I was disappointed. It was mostly talking and I don't understand half of what the actors were saying. I should watch this with subtitles next time.", "created_at": "2017-02-09T10:04:03.633Z"}, {"movie_id": 10195, "review_id": "59f29d4b9251416aaf0418a8", "rating": 8.0, "review_text": "**A long format review from 2011**\r\n\r\nSo, Thor has only been out for a week and a half, and already it’s grossed $100 million! Pretty fucking good considering it hasn’t even been released in America yet, where like, every movie ever makes most of its money. As you may have guessed, yes, I did finally get around to seeing le Thor, hence the delay in my review of The Incredible Hulk. But know what? Fuck you man! I just watched fucking Thor!!\r\n\r\nSo in case you couldn’t guess, I was rather damn impressed with it all. Why? Well boys and girls, strap your tolerance boots on, this one could get long.\r\n\r\nThe Computer Graphics were some of the best I’ve ever seen. Now I’m not one to believe that CGI is the sort of thing that could make or break a film, but having it be this fantastic goes quite a ways to helping out. I also was unfortunate in my having to watch it in 3D, and yet it was worth it. This is a pretty big statement from me. I despise 3D… I even walked out of the cinema not feeling nauseous. A tad headache-y sure, but that was it. So congrats Thor.\r\n\r\nThe comic relief was powerful. In that “funny but not silly” kind of way. I mean, it’s all a bit silly, but it would have been so easy to fall into the cheesy trap with this film. The writing team and director Kenneth Branagh (The Boat that Rocked, Sleuth, Hamlet) did a fantastic job of keeping the audience engaged  and not descending too far into shameless, lame, self-parody.\r\n\r\nThe characters of the film were written almost as strongly as they were in Iron Man 1 & 2, not quite, but they did have quite a number more to work through, so they couldn’t work with everyone as well as they did with Tony Stark and Pepper Potts. They also managed to totally pull off an American movie with romance and comedy, in a way that totally avoided those awful American Romantic Comedies (my least favourite genre in the history of ever).\r\n\r\nThere’s this whole thing where Thor comes from another world. Which was after all really the only way you could bring a God into the Marvel Cinematic Universe, which has been so grounded in reality. And I’ll tell you, Asgard (Thor’s home planet) was fucking great. They pulled off this crazy similarities in appearance between family members on Asgard, despite the fact that none of the actors are related. You may disagree with me on inspection of posters and whatnot, but after seeing the movie, you’ll get what I mean. Also the actors they got to play the younger Loki and Thor were eerily believable. Like, to an actually kind of scary point. I wonder if any of it was fake… The Frost Giant homeworld of Jotunheim is also visually stunning.\r\n\r\nThe sound effects were very confronting. I couldn’t really figure out if I though this was a good or a bad thing… It’ll be interesting to rewatch on DVD, and see if it was only so crazy because of the speakers in the theatre. Thor may have lacked the wholeness as a film felt by Iron Man 1 & 2, or The Incredible Hulk, but it was perfect as a lead up to The Avengers, which, now that it’s all set in stone, is really kind of needed. With Thor more than the other heroes it’s the most important, because there was really no way to humanise that sort of character, he’s just so outlandish that you really need an entire film just to ground him in this world they’re developing.\r\n\r\nBut all of the things I’ve had to say about the film were basically leading up to this one big thing; the cast! The cast was incredible, not only did they manage to snag a total of THREE of my favourite underrated actors ever, one of them just so happened to my favourite actor in the whole wide world, Ray Stevenson!\r\n\r\nWe have Australian (fuck yes Australia!) Chris Hemsworth (Home and Away [Hey! We all have to start somewhere, right?], A Perfect Getaway, Ca$h, Cabin in the Woods) playing Thor, Natalie Portman (Black Swan, V For Vendetta) playing Thor’s love interest; Jane Foster (lots of people have started having a problem with Natalie Portman nowadays, but I still love her), Anthony Hopkins (The Rite, The Wolfman, Beowulf, Red Dragon, Hannibal, The Silence of the Lambs [Yes, this is the same guy who played Hannibal Lecter. I fucking know, right!?] Bram Stroker’s Dracula) as Thor’s father; Odin, Stellan Skarsgard (King Arthur, Exorcist: The Beginning, Beowulf & Grendel, the Pirates of the Caribbean series, Angels & Demons) as Dr. Erik Selvig; Jane Foster’s mentor, Ray Stevenson (Rome, King Arthur, Outpost, Punisher: War Zone, The Book of Eli) as Thor’s friend, and member of the Warriors Three (above); Volstagg, Jeremy Renner (S.W.A.T., The Assassination of Jesse James by the Coward Robert Ford, 28 Weeks Later, The Hurt Locker, The Town) as Hawkeye; the S.H.I.E.L.D. sharpshooter, and Samuel L. Jackson (The Exorcist III, Jurassic Park, Jackie Brown, Shaft, Pulp Fiction, the Star Wars prequel trilogy, S.W.A.T., Snakes on a Plane, 1408,  Cleaner, The Spirit, Inglourious Basterds) as S.H.I.E.L.D. Director; General Nick Fury… And those are just the actors I already adore.\r\n\r\nI’ve now also grown quite attached to Tom Hiddleston (Wallander) who plays Loki, Thor’s brother, and the main antagonist, as well as Joshua Dallas (Doctor Who and The Descent Part II) who plays another of the Warriors Three (above), and Kat Dennings (Nick and Norah’s Infinite Playlist and Defendor) who plays D’arcy Lewis; Jane Foster’s friend and colleague.\r\n\r\nAs I always like to say, I watched this film in a theatre (Belcompton, shit, uh, Belconnen, Hoyts to be specific). I really think this film has lasting value, but it’s important to note that I almost always feel a film is enhanced when watched on the big screen, especially with Action films, effects films, epic films and franchise films. Thor happens to be all of those things. I was especially excited waiting for the post-credits scene to come up in that huge cinema. So please take into consideration that I reviewed this on the silver screen, if you happen to be watching it on DVD or BluRay or some such. Because you better of not fucking downloaded it!!  Damn scum…\r\n\r\n80%\r\n\r\n-Gimly", "created_at": "2017-10-27T02:43:23.035Z"}, {"movie_id": 10195, "review_id": "5c84276b0e0a2643106328ee", "rating": 7.0, "review_text": "I was surprised to see Kenneth Branagh directing a big budget comic book film, but as the film continued to explore a Shakespearean tale between two brothers feuding, the relationship with their father, and a coming of age love story, I realized this is exactly the kind of movie Kenneth Branagh would make.\r\n\r\nI really enjoyed Thor. It was funny, exciting, and different from the usual superhero ilk. And it definitely got the MCU back on track after the dismal Iron Man 2.", "created_at": "2019-03-09T20:51:55.674Z"}, {"movie_id": 10195, "review_id": "5dc3300199259c00137a14aa", "rating": null, "review_text": "I haven't seen Chris Hemsworth act in any other film and this is the first time I've seen him in action, but I gotta say he really did justice to this role. Big thumbs up to Marvel for doing a great job on this casting!", "created_at": "2019-11-06T20:41:37.057Z"}, {"movie_id": 10195, "review_id": "5dc38a258d22fc00143d1df9", "rating": null, "review_text": "Chris Hemsworth plays a great god of thunder! Much like how Downey has molded into his character, Iron Man, Chris has done the same thing too as Thor.", "created_at": "2019-11-07T03:06:13.505Z"}, {"movie_id": 10195, "review_id": "5dc3937c8d22fc00143d2d08", "rating": null, "review_text": "How Asgard was explained and how Thor came to be was explained really well. One of the better superhero origin stories for sure.", "created_at": "2019-11-07T03:46:04.600Z"}, {"movie_id": 10195, "review_id": "5dc399678d22fc00143d3370", "rating": null, "review_text": "Not a big fan of the action sequences but story-wise, this film did great. It really explains how Thor came to be and why he is the person he is now.", "created_at": "2019-11-07T04:11:19.296Z"}, {"movie_id": 10195, "review_id": "5dc56e8899259c00137da961", "rating": null, "review_text": "It's like Thor was actually made to fit Chris Hemsworth rather than the other way around! Marvel couldn't have done a better job at casting than this!", "created_at": "2019-11-08T13:32:56.959Z"}, {"movie_id": 10195, "review_id": "5dc57a08ab1bc70015ff17d6", "rating": null, "review_text": "One of the most original origin stories out there!", "created_at": "2019-11-08T14:22:00.577Z"}, {"movie_id": 10195, "review_id": "5e00ee8c26dac10017653faa", "rating": null, "review_text": "I didn't expect to like Thor as much as I did. Marvel sure knows their characters and they demonstrated that expertise by creating a superhero film that's a mix of Marvel comics and Norse mythology. Good job!", "created_at": "2019-12-23T16:42:52.770Z"}, {"movie_id": 10195, "review_id": "5e01025dd1a89300198ceee8", "rating": null, "review_text": "Both Chris Hemsworth and Tom Hiddleston showed that they can be among the star players in the film industry worthy to be included in this movie.", "created_at": "2019-12-23T18:07:25.903Z"}, {"movie_id": 10195, "review_id": "5e011b3b26dac10014660877", "rating": null, "review_text": "Tom Hiddleston is such a great actor! Chris is pretty great too but Tom has such a mesmerizing aura whenever you see him on-screen that it's hard not to  be absorbed by the film.", "created_at": "2019-12-23T19:53:31.176Z"}, {"movie_id": 10195, "review_id": "5e028658d1a89300128f674c", "rating": null, "review_text": "Both Loki and Thor make such a huge impression on screen. The two actors who portrayed these gods are surely top-tier!", "created_at": "2019-12-24T21:42:48.219Z"}, {"movie_id": 10195, "review_id": "5e08fe58eda4b70017300f2b", "rating": null, "review_text": "Impressive superhero film that goes well with the Iron Man solo movies that Marvel has released.", "created_at": "2019-12-29T19:28:25.000Z"}, {"movie_id": 10195, "review_id": "5e091f4b26dac1001776f013", "rating": null, "review_text": "I loved how Chris Hemsworth did justice to the Norse God of Thunder. He is truly made for this role as much has Tom is made to be Loki.", "created_at": "2019-12-29T21:48:59.122Z"}, {"movie_id": 10195, "review_id": "5e09b7b16c19ea00117666be", "rating": null, "review_text": "Great storytelling and depiction of how Asgard looks. Additionally, they did an awesome job in setting up Thor's family dynamics.", "created_at": "2019-12-30T08:39:13.807Z"}, {"movie_id": 10195, "review_id": "5e0e0c896dc6c000154cb239", "rating": null, "review_text": "Not a bad movie for the first film in a trilogy.", "created_at": "2020-01-02T15:30:17.018Z"}, {"movie_id": 10195, "review_id": "5e0e169b68b1ea00157f8274", "rating": null, "review_text": "I would give it a 7/10. A good superhero flick but I know they can do better than this.", "created_at": "2020-01-02T16:13:15.856Z"}, {"movie_id": 10195, "review_id": "5e0e20c79974ee0012a6f65c", "rating": null, "review_text": "There's a delicate balance between comic book fantasy and Norse mythology in this film and they were able to lay it all out perfectly.", "created_at": "2020-01-02T16:56:39.578Z"}, {"movie_id": 10195, "review_id": "5e0e2a189974ee0015a67b06", "rating": null, "review_text": "It's immensely enjoyable and goes well with the Iron Man solo films.", "created_at": "2020-01-02T17:36:24.843Z"}, {"movie_id": 10195, "review_id": "5e0e40cf6dc6c000184d4d5e", "rating": null, "review_text": "It's exciting and certainly all-around entertaining for a comic book adaptation.", "created_at": "2020-01-02T19:13:19.903Z"}, {"movie_id": 10195, "review_id": "5e0e52bc12c6040017401e77", "rating": null, "review_text": "The pacing felt too slow for me but storytelling was good.", "created_at": "2020-01-02T20:29:48.410Z"}, {"movie_id": 10195, "review_id": "5e0f08a858361b0010bf7955", "rating": null, "review_text": "Perfect story. Perfect casting. Perfect amount of CGI and SFX. Perfect directing. Perfect writing. Perfect performance 10/10 overall.", "created_at": "2020-01-03T09:26:00.237Z"}, {"movie_id": 10195, "review_id": "5e0f3191681888001659d36c", "rating": null, "review_text": "From start to finish filled with great quality writing. You just get drawn in by the story and the pacing is good.", "created_at": "2020-01-03T12:20:33.332Z"}, {"movie_id": 10195, "review_id": "5e104fa158361b0015c21af7", "rating": null, "review_text": "The story keeps you glued to the screen, the pacing keeps you on your toes, and the acting and writing makes you appreciate the film even more. Good job Marvel!", "created_at": "2020-01-04T08:41:05.809Z"}, {"movie_id": 10195, "review_id": "5e1213875907de0012dd8b0e", "rating": null, "review_text": "I would rate this film a little higher than the Iron Man films just because of the fact that it delivered more than I expected.", "created_at": "2020-01-05T16:49:11.703Z"}, {"movie_id": 10195, "review_id": "5e12493eae26be00144a8b89", "rating": null, "review_text": "Beautiful set design and costumes, great, solid acting all around, and much better action scenes than other superhero movies out there - except maybe Iron Man. Overall a pretty darn good film.", "created_at": "2020-01-05T20:38:22.962Z"}, {"movie_id": 10195, "review_id": "5e125ac9ae26be00144aa4d4", "rating": null, "review_text": "Amazing work on Asgard by the VFX team. Looks absolutely gorgeous without going overboard.", "created_at": "2020-01-05T21:53:13.884Z"}, {"movie_id": 10195, "review_id": "5e12c5e69020120013b74fad", "rating": null, "review_text": "Almost every Marvel film focused on action, but this one was different. It honed in on character development.", "created_at": "2020-01-06T05:30:14.437Z"}, {"movie_id": 10195, "review_id": "5e12c9fdd8af670016be31bb", "rating": null, "review_text": "The fight scenes were boring. I know Marvel is an expert at fight choreography but why did this one play like a video-game ad? No intelligent twists and totally predictable storyline.", "created_at": "2020-01-06T05:47:41.869Z"}, {"movie_id": 10195, "review_id": "5e12cdf08741c400143daf1a", "rating": null, "review_text": "I don't mind cheesy superhero films but this one’s pacing was too slow for me.", "created_at": "2020-01-06T06:04:32.639Z"}, {"movie_id": 10195, "review_id": "5e12d1fdd64ac2001865e9b2", "rating": null, "review_text": "Great superhero flick. I enjoyed it and even though the action scenes weren't on par with the other films, the great story made up for it.", "created_at": "2020-01-06T06:21:49.683Z"}, {"movie_id": 10195, "review_id": "5e20d5bacf4b8b0014ef0098", "rating": null, "review_text": "I appreciate very much how they wrote the script, especially the ones for the denizens of Asgard. Well-spoken without being too clunky as Old English would sound.", "created_at": "2020-01-16T21:29:30.062Z"}, {"movie_id": 10195, "review_id": "5e20df368f26bc001371e379", "rating": null, "review_text": "Just the right combination of guts and spectacle balanced with passion and dynamic for the characters. Though still a popcorn film, Thor still delivers intelligent and thrilling writing.", "created_at": "2020-01-16T22:09:58.532Z"}, {"movie_id": 10195, "review_id": "5edc67ab8d52c90023a4d0a0", "rating": 7.0, "review_text": "Probably the third time I've seen this (and first in 7-8 years) and it's a solid enough origin movie, Chris Hemsworth is a great in the lead and I liked Anthony Hopkins. Wasn't a big fan of Loki and still didn't care much for him, though Tom Hiddleston played him well enough (I liked him more in Ragnarok than in The Dark World and Avengers).\r\n\r\nGenerally I like Natalie Portman but she was a bit of a weak love interest and everything else, was on the blander side. My feelings on this MCU movie pretty much remained the same all these years later. **3.25/5**", "created_at": "2020-06-07T04:06:03.784Z"}, {"movie_id": 10195, "review_id": "600235527f05400040abbe0d", "rating": 7.0, "review_text": "Kinda similar to how I feel about the two films that precede this in the MCU. <em>'Thor'</em> is a good, solid watch.\r\n\r\nIt fails to set the world alight, so to speak, but there's entertainment there. It's my personal standout of the three films since <em>'Iron Man'</em>. I enjoyed seeing the world of Asgard, though the stuff on Earth is a little run-of-the-mill.\r\n\r\nChris Hemsworth is enjoyable and looks the part as Thor, while Tom Hiddleston plays his role more than satisfactorily. Cool to see Idris Elba appear, even if he is underused in the grand scheme of things - as are Stellan Skarsgård and Natalie Portman in truth.", "created_at": "2021-01-16T00:37:38.144Z"}, {"movie_id": 10195, "review_id": "61c5b4a80102c90065a8deed", "rating": null, "review_text": "Wasn’t particularly thrilled with this release! Uninteresting action, lame direction and an unconvincing cast let this down!! Crazy to see where the franchise is now.", "created_at": "2021-12-24T11:53:12.394Z"}]