[{"movie_id": 504608, "review_id": "5cee578a9251410fe2b8d124", "rating": 6.0, "review_text": "There’s so much that works about ‘Rocketman’, so the fact it never fully commits to its musical fantasy conceit is a bit of a disappointment. It ends up aligning most with Julie Taymor’s curious 2007 Beatles musical ‘Across the Universe’ - a really great idea and approach to the work of a musical artist that never finds its feet or the bravery to fully be itself. It’s still a moving and occasionally stirring portrait of Elton John, and while the lack of emotional or narrative detail in the screenplay never allows Taron Egerton to fully unleash his potential, he’s still a terrific Elton John and sings the hell out of these amazing songs. In the end, despite a refreshing honesty and some fascinating choices, ‘Rocketman’ is never as daring as it so desperately wants and needs and deserves to be, a film on the road to somewhere but never quite getting there.\r\n- Daniel Lammin\r\n\r\nRead Daniel's full article...\r\nhttps://www.maketheswitch.com.au/article/review-rocketman-a-fascinating-musical-biopic-that-never-finds-its-feet", "created_at": "2019-05-29T09:57:30.657Z"}, {"movie_id": 504608, "review_id": "5cf1381cc3a368697a1ec6e5", "rating": null, "review_text": "Elton John has had a career that has spanned decades, millions of albums sold, packed venues, awards, and more than a few headlines. In the new film “Rocketman” audiences get a look behind the man thanks to the amazing and Oscar worthy portrayal by Taron Egerton.\r\nThe film opens with a flamboyantly dressed John entering rehab in one of his stage costumes. As he opens up with his group, he shares the story of his childhood as a shy child who is desperate to have his father show him any signs of approval or affection.\r\nWhen it is discovered that he has talent with the piano; his grandmother encourages him and even takes him to apply for a position at the Royal Academy of Music.\r\nHis mother (Bryce Dallas Howard) is moderately supportive but is more focused on her social life brought on by her failing marriage.\r\n\r\nAs the film unfolds; we see Elton working in a backup band and in time answering an ad that puts him with an agent. Paired with the man who would eventually change his life; Bernie Taupin (Jamie Bell), Elton and Bernie combine to write a series of songs which in turn leads him to a series of gigs in Los Angeles. The film shifts into high gear at this point as we see how their music becomes a smash and leads to a series of parties, drugs, and money.\r\n\r\nElton meets Manager John Reid (Richard Madden), who becomes his partner both socially and professionally as Elton embraces his Homosexuality which he has kept largely hidden.\r\n\r\nAs the record sales and hits mount, so does the destructive behaviors which leads Elton down a destructive path that threatens everything he has worked for.\r\nThe movie is a masterpiece of music and story and it cleverly uses musical montages and segments around the performances to outline various segments of his life and his rise to stardom.\r\n\r\nThe performances are amazing and Egerton was simply amazing as he not only captured the complexity of his character but performed all the vocals of the hit songs himself and they were spot on.\r\n\r\nDuring our Press Screening I noticed many people singing along, tapping their feet, or bobbing their heads along with the music which helps to underscore just how timeless and popular his catalog of music has been as the songs have endured the test of time.\r\nThe film also evokes some unexpected emotion as there were more than a few people wiping their eyes during the film which at its core is a store of a young, shy boy desperate to be accepted and loved.\r\n\r\nI truly hope the film is recognized come Awards season as it is a wonderful and memorable cinematic experience.\r\n\r\n5 stars out of 5", "created_at": "2019-05-31T14:20:12.247Z"}, {"movie_id": 504608, "review_id": "5d78e1f5069f0e000d3362f8", "rating": 6.0, "review_text": "_Rocketman_ tries to walk a line between the paint-by-numbers musician biopic bog standard, and epic musical fantasy. A lot of the time when a movie tries to be a blend of two things, it ends up being neither. _Rocketman_, conversely, ends up being both, just never at the same time. It's basically two movies, and that epic musical fantasy movie I was talking about that's in there, that's a **great** movie. Unfortunately, the other one, is not so much. I'm still gonna come away giving it a recommendation, because there is enough in there to mean that I enjoyed it, especially in the core casting, all of which is great, not least Egerton. But I was little disappointed, not because my expectations were too high going in or anything, but because every time Rocketman began to slip into a euphoric high, it was moments later wrenched back to, well... Reality, I guess. Albeit a reality we only see on a movie screen. And we see on **every** movie screen when it's a musician biopic. I mean, this is Elton John we're talking about, if there was ever a moment to reject the mundane and fully embrace the over-the-top flamboyant fantasy it was here. But _Rocketman_ just kind of Awkward Christian Camp Side Hugs the over-the-top flamboyant fantasy.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-09-11T12:00:53.367Z"}, {"movie_id": 504608, "review_id": "63bf51b0e16e5a007ea92861", "rating": 1.0, "review_text": "I am honestly sort of split down the middle here. I mean, I THOUGHT it was going to be about Elton John... and it was...\r\n\r\n...kind of...\r\n\r\n... but it was also a lot more fantasy and fiction than it was a biopic, and had I known that I might not have bothered watching it. I might have braced myself for something that isn't really realistic and more dream-sequence than straight film.\r\n\r\nSo it's not at all what I was hoping for and that did kill it for me. I just wanted to watch a movie about Elton John. Hopefully see a fan movie about Elton John. Especially since I think that Bohemian Rhapsody did Freddy and his story a bit of a disservice.\r\n\r\nAnd instead... I got something a little more... Trippy than expected.\r\n\r\nSo I guess, if you like how stylistic it is, you'll enjoy the movie... I mean, it IS about Elton John, so you have a great soundtrack guaranteed.\r\n\r\nTo me, it just seems a little more music video than movie. And, this was Elton John, dude is interesting enough (especially given that he has been musically relevant for about 50 consecutive years), that they could have made it more... real I guess?\r\n\r\nI don't know.\r\n\r\nI guess in the end I am giving this one star, just because I was expecting more of a movie.", "created_at": "2023-01-12T00:17:52.978Z"}]