[{"movie_id": 58, "review_id": "64c12f1fdf86a801446c1189", "rating": 8.0, "review_text": "Part 2 introduces Davy Jones. Jack Sparrow has owed Davy a debt. Now Davy intends to make Jack make good on that debt. One way or another. Really awesome sequel.", "created_at": "2023-07-26T14:35:11.209Z"}, {"movie_id": 58, "review_id": "64f372d0e0ca7f012eb39ab8", "rating": 7.0, "review_text": "I usually think that a good spell of time between an original and a sequel is a good thing. It gives everyone space to refresh the ideas and develop the characterisations. That's pretty much what Gore Verbinsky has done with this superior follow-up to the 2003 story. This time, we don't really need to spend much time on the who's who bits, so can head straight to the action which for the next 2½ hours follows \"Jack Sparrow\" (Johnny Depp) double-dealing as only he can trying to stay one step ahead of the vengeful \"Davy Jones\" (Bill Nighy) with whom he made a deal that means it's now his turn to enter hell. Meantime, \"Will\" (Orlando Bloom) and \"Elizabeth\" (Keira Knightley) are having problems of their own, and when he has to try to kidnap \"Jack\" with his compass for the dastardly \"Lord Beckett\" (Tom Hollander) in return for her safety he, en route, becomes reunited with his rather curmudgeonly (and barnacled) father (Stellan Skarsgård). It seems that both \"Will\" and \"Jack\" cannot both get what they need - but can they find a solution? It's end-to-end stuff this, with loads of mythical creatures from the depths, a tiny bit of romance and a Johnny Depp very much at the top of his game. The story is solid and entertaining, as is much of the quickly paced dialogue and David Schofield turns in a good effort as the malevolent \"Mercer\". I could have done with Geoffrey Rush but otherwise this is a fun fantasy adventure with some cracking visual effects and Hans Zimmer's music adds richness to the jollity too. A big screen must, really. It's just not so good on the telly.", "created_at": "2023-09-02T17:37:20.754Z"}]