[{"movie_id": 749004, "review_id": "628768701a32481bd76ebbf5", "rating": 7.0, "review_text": "Petite Maman is a movie about a girl (Nelly) who has just lost her grandmother and is helping her parents clean out her mother's childhood home. She explores the house and the surrounding woods. One day she meets a girl (Marion) her same age building a treehouse. They become friends and have all sorts of adventures together.\r\n\r\nAs their relationship develops, Nelly realises that Marion is actually her mother who has travelled from the past to be with her. This is a surprise to both of them and themes of family, loss, and friendship are explored as they play together. The two actors playing the children are twins in real life and they have great chemistry together. They are both very natural and believable in their roles. Their dialogue often feels improvised and their scenes together are some of the best in the movie.\r\n\r\nThe element of time travel is so subtle it’s almost unnoticeable. There are no special effects, no flashy sequences; just a few small, everyday things that seem out of place. This makes the story more believable and allows the focus to remain on the relationship between Nelly and Marion.\r\n\r\nMy biggest problem with the movie is the pacing. It’s a bit slow and meandering in the first half, which made it hard for me to stay interested. However, the second half is much better and the last few scenes are particularly emotional and powerful. Overall, Petite Maman is a moving and thought-provoking film with great performances from its two young leads.", "created_at": "2022-05-20T10:07:44.355Z"}, {"movie_id": 749004, "review_id": "62b0bb88bf0f630055c55032", "rating": 10.0, "review_text": "Full review: <a>https://www.tinakakadelis.com/beyond-the-cinerama-dome/2021/12/28/somewhere-only-we-know-petite-maman-review<a>\r\n\r\nDespite what the name implies, Petite Maman feels just as grand. The story focuses on Nelly (Joséphine Sanz), an eight-year-old who has just lost her grandmother (Margot Abascal). Nelly is our entry point to the story, so we don’t always know what’s going on around her. Her grandmother seems to have passed due to a condition she’s had for most of her life, but it’s not something Nelly has a name for. Along with her mother (Nina Meurisse) and father (Stéphane Varupenne), Nelly goes to her grandmother’s home to pack up what remains of her belongings. They all spend one night in the house, but then Nelly’s mother leaves suddenly while Nelly and her father remain to finish the job. Why Nelly’s mother leaves is never fully explained, but Nelly can tell that her mother has been sad for a long time and that her leaving has something to do with that.", "created_at": "2022-06-20T18:25:12.798Z"}, {"movie_id": 749004, "review_id": "634d566589f749007ae164e3", "rating": 8.0, "review_text": "One might call this a Sci-Fi because it uses time-travel as a plot device, but it's not about that at all. The real themes are truth, and the complex relationship between mother and daughter over three generations. This is a heart-warming, creative story.", "created_at": "2022-10-17T13:19:33.804Z"}]