[{"movie_id": 16072, "review_id": "594b2fb29251413115007d33", "rating": 4.0, "review_text": "It is too afraid of reality to depict truths. Rather it hides behind a facade of being artistically 'old filmy' in styling; as too paint the whole in the romanticised vision (whitewash) held by those that love the idea of the Civil War. It was rather unbearable to say the least.", "created_at": "2017-06-22T02:47:14.294Z"}, {"movie_id": 16072, "review_id": "5d238fa16d4c97273675617a", "rating": 8.0, "review_text": "***Way better than \"Gettysburg\"***\r\n\r\nEven though I love the Civil War I waited a full six and a half years before catching the prequel \"Gods and Generals\" (2003). Why? Because 1993's \"Gettysburg\" was so unimpressive. While \"Gettysburg\" has some worthwhile scenes it was merely okay on a whole, and sometimes downright tedious. How the filmmakers made the Civil War's biggest battle boring (generally speaking) is beyond me.\r\n\r\nGods and Generals\" is the prequel detailing the battles of First Bull Run, Fredericksburg and Chancellorsville, which are largely viewed through the lens of Stonewall Jackson (Stephan Lang) on the Confederate side and the Chamberlain brothers (Jeff Daniels and C. Thomas Howell) of Maine on the Union side. Also on hand is, of course, Robert E. Lee, played by Robert Duvall, who does a more engaging portrayal than Martin Sheen in \"Gettysburg.\" The film starts off slow and builds momentum. By contrast, \"Gettysburg\" started off slower and never became engaging with the exception of Little Round Top and Pickett's Charge. \r\n\r\nWhere \"Gods and Generals\" really pulled me in was the battle scenes of Fredericksburg and the aftermath. It showed how Civil War troops were required to march, shoot & reload in formation while rifles and friggin’ cannons are blasting their way. The Chamberlain brothers had to sleep on the battlefield that night. Imagine sleeping amongst all those dead bodies and dying, moaning soldiers! This was very well done.\r\n\r\nThere are quite a few other great scenes, like the Yankee and Reb soldiers meeting in the middle of the river to exchange coffee for tobacco; the execution of three deserters; and the \"perfect battle\" for the Confederates at Chancellorsville where General Lee, with a much smaller force, takes the risk of dividing his army and executing a surprise attack. Unfortunately for the Confederates they won at a huge cost as General Jackson loses his \"right arm\" to friendly fire.\r\n\r\nThe story ends on a slow, melancholy note.\r\n\r\nI was impressed with the battle in the town scene. The town looked so authentic. Watching the documentary afterward I learned how they accomplished this: they filmed it at Harpers Ferry, WV.\r\n\r\nSome have complained that the Southern viewpoint is shown in a more positive light than the Northern, but I disagree. While it seems more time is spent with Jackson & Lee's story, considerable time is certainly given to the North as well; the film does an excellent job of taking the middle road between the two positions.\r\n\r\nThe film was shot on location in Virginia, Maryland and Harpers Ferry, WV and runs 3 hours and 39 minutes. The Director's Cut (which I haven't seen) runs a full hour longer and features the bloody battle of Antietam and a subplot with John Wilkes Booth.\r\n\r\nFINAL WORD: If you thought \"Gettysburg\" was boring don't let that prevent you from checking out \"Gods and Generals.\" Yes, you have to be ready for a long movie and it does have some slow, dramatic parts but it builds momentum and it's one of best Civil War films in helping the viewer visualize the battles and many other aspects.\r\n\r\nWARNING: Believe it or not, the film shows overt depictions of Bible reading, citation and prayer!! It also dares to show Christianity and marriage (between a man and woman) in a positive light!! Oh my God!!! \r\n\r\nGRADE: B+/A-", "created_at": "2019-07-08T18:46:57.722Z"}]