[{"movie_id": 59859, "review_id": "52190119760ee334573d2a9b", "rating": null, "review_text": "Looks good", "created_at": "2013-08-24T18:53:13.309Z"}, {"movie_id": 59859, "review_id": "58ac495c92514158df0138b4", "rating": 1.0, "review_text": "*** This review contains MAJOR spoilers ***\r\n\r\nThis is actually not so much a review as it is a vehicle for me to express my utter disgust of what was supposed to be a great sequel to what I consider one of the coolest movies ever made. I absolutely loved Kick-Ass. It was fresh, it was original, and in spite of its crude and graphic violence, absolutely hilarious. Its sequel, is nothing short of an abomination.\r\n\r\nFor your convenience, I have comprised a list of Everything Wrong with Kick-Ass 2:\r\n\r\n1. The gore. It's not that it was worse than KA1, it's that it was very different in tone. Whereas in the first movie – where the violence was equally gut-wrenching – the nature of it all was laugh-out-loud hilarious, mostly because it was executed by a foul-mouthed 12-year-old school girl. KA2 on the other hand, feels more like a snuff movie where good guys and innocent bystanders are brutally slaughtered, just for the hell of it. Which leads me to point number two:\r\n\r\n2. The targets. In the first movie, the whole point was easy: killing bad guys. So, no bad feelings and no conflict of interest. For the second installment, it seems the moral compass has taken a 180 degree turn. Here we have to sit and watch the good guys dropping dead one by one, and it isn't the least bit funny. I'd like to give you a heads-up on the brutal murder of Dave's dad, the most innocent good guy of them all. Yeah, I didn't see than one coming either.\r\n\r\n3. The bad guys. Good god. Rarely have I seen such an array of dumb, sickeningly stupid villains. Most of the slaughtering and mayhem is done by one block-of-concrete-with-boobs called Mother Russia (what's in a name?). Everything about her just makes you sick to your stomach, especially the way she offs her victims. She is part of the main villain's gang, and don't even get me started on this guy… Remember Red Mist? He was pretty funny in KA1, wasn't he. Yeah well, those days are over. After accidentally on purpose killing his own mother (!), he proclaims himself the new great villain of New York, henceforth calling himself The Motherf***er (again, what's in a name…). He rallies a group of equally douche baggy cronies. Their mission is to kill Kick-Ass and all who follow him. Their first strike? Killing off the best new character.\r\n\r\n4. Jim Carrey's screen time. The poor guy clocks out at exactly 7 minutes and 45 seconds. He plays Colonel Stars and Stripes, and he is by far the best addition to the cast. What's remarkable about his performance is that he's barely recognizable. His speaking voice is low and brooding, and there's not a funny face in sight. Really cool character all around. After waiting for what feels like forever for him to finally appear, guess what; not ten minutes later – gone. Impaled, slaughtered and decapitated by Mother Russia. I'd like to have a hearty word with the \"screenwriter\" who's responsible for this. He needs to go back to school. Here's my advice anyway – free of charge: YOU DON'T KILL OFF THE BEST CHARACTER HALFWAY THROUGH THE MOVIE. Dumbass.\r\n\r\n5. The \"humour\". In KA1, the humour was cheeky, intelligent, and perfect satire. And where it was crude, it was right up at the top, but never really over it. Second time around, we have to make do with projectile vomiting and violent diarrhoea. Really, poop jokes…? Now this is a perfect example of what 'we' (we meaning – people over 13 with normal intelligence and a healthy sense of humour) call \"rock bottom\". Yes. They go that low. I'm going to stop here before I start remembering all of the other \"jokes\". \r\n\r\n6. Lack of proper Hit-Girl action. Hit-Girl was always the star of the show. In KA2, she is given a dumb sub-plot where she vows to quit her alter-ego job and become a 'normal', prissy little cheerleader, competing with other Barbie girls to become popular. I really, really hated this story line. I don't even care if it was in the original comics, it sucked. The reason why it sucked the most is because effectively, this means that the essence of Hit-Girl is completely vacant for about 60% of the movie! And that's WAY too much time for the most beloved character to mope around apologetically before she finally gets her s**t together roughly 10 minutes before the end of the movie.\r\n\r\n7. Mister Kick-Ass himself. Something went wrong here. I don't know if it was the character that was poorly written or Aaron Taylor-Johnson that came up short, but he was very different from the first movie, in which he had a really cute, geeky charm about him. Here, he was inconspicuous and dull, like a bystander in his own story. Or perhaps he was just overshadowed by the abundance of new and reformed characters… In any case, he was barely there to be noticed.\r\n\r\n8. Soundtrack. The score of KA1 was so damn cool, with original, poppy punk music and electro that consistently added something to every scene. Here, I only remember one scene that caught that vibe and it still wasn't half as good.\r\n\r\n9. It was seriously offensive. A \"joke\" about rape? Are you kidding me?! And I'm not talking about some guys hanging around, talking about wanting to 'do' some girl or whatever. No, I'm talking about The Motherf***er seriously intending to rape Night Bitch, except he can't because he's got no wood. Real classy.\r\n\r\nThere are some redeeming points to this otherwise complete crap fest, but honestly, they are so few and far in between they're not even worth mentioning. Well, I guess this is what you get for hiring some D-grade nobody to replace Matthew Vaughn. Don't waste your time with this garbage.\r\n_(June 2014)_", "created_at": "2017-02-21T14:06:20.419Z"}, {"movie_id": 59859, "review_id": "5a630df79251410b2d008ef0", "rating": 5.0, "review_text": "The first Kick Ass movie was a fresh idea and I quite liked that movie. Unfortunately this one seems to have be the creation of someone that believes that a good movie can be made by stacking extreme silliness and vulgarities on top of each other until you reach about a 100 minutes or so.\r\n\r\nMost of the movie is unbelievably silly. The original movie also had plenty of silly moments but they were more there to support the plot and not to build the movie as in this one. The main villain is so contrived and stupid that he is just not funny.\r\n\r\nThe so called “superheroes” are equally ridiculous. The costumes are just awful. Sure, they are supposed to be amateurs but still…\r\n\r\nThe entire movie is pretty much shouldered by Hit-Girl who is the only one who is not absolutely ridiculous. Without her this movie would have been a total turkey. Unfortunately the vulgarity seeking script writer managed to put her up in a overdone and very disgusting puking scene that really dragged down the movie.\r\n\r\nThe scenes with Hit-Girl in them, except the above mentioned one, and the action scenes are where almost all the enjoyment of the movie lies. The rest is either so silly or so disgusting that it is barely watchable.", "created_at": "2018-01-20T09:37:59.162Z"}, {"movie_id": 59859, "review_id": "64f6fcacf29d66356658c211", "rating": 6.0, "review_text": "I was actually quite surprised to see three of the leads who made the first film (2010) return for this far inferior sequel. Following on from the denouement of that enterprise, \"Red Mist\" (Christopher Mintz-Plasse) is using his father's ill-gotten gains to assemble a force that can combat the growing number of lycra-clad have-a-go heroes that are attempting to cut crime in their community. Without dad this time, it falls to \"Mindy\" (Chloë Grace Moretz) to train up our still pretty hapless hero (Aaron Taylor-Johnson) so they can be ready for the formidable foes that are now facing them. ATJ still looks great with his shirt off, thereafter this is really nothing at all to write home about. It's all just by-the-numbers film making with perfectly choreographed, and extended, combat scenes with violence that has become more graphically brutal leading to a conclusion that you don't need any kind of map to find. What made the first film a bit quirkier is not in evidence here; the language and humour is largely plain crass and Jim Carrey adds really very little as this rumbles along. Hopefully we will never see any more of \"Kick-Ass\"; this mini-franchise has definitely run it's course and belongs in glass case.", "created_at": "2023-09-05T10:02:20.754Z"}]