[{"movie_id": 512195, "review_id": "6192a3b9dbf1440092832291", "rating": 3.0, "review_text": "i realize that this movie was not set to be a cinematographic masterpiece, but this is way too primitive of a plot, actor's performance, and overall impression.", "created_at": "2021-11-15T18:15:21.555Z"}, {"movie_id": 512195, "review_id": "619d16c569d28000298f8b68", "rating": 4.0, "review_text": "Heist Movie? Gal Gadot? I’m in.\r\n\r\nPlus Dwayne Johnson and Ryan Reynolds.\r\n\r\nI said I’m in! Sounds like a bunch of fun.\r\n\r\nBut somehow, it’s just not.\r\n\r\nJohnson is FBI agent John Hartley, and he’s on the trail of Nolan Booth (Reynolds), the 2nd most wanted art thief in the world.\r\n\r\nWho’s number 1? That would be The Bishop (Gadot), a mysterious criminal who always seems one step ahead of Booth in the quest to reunite three priceless jeweled eggs that Marc Antony once gave to Cleopatra. Yes, Cleopatra.\r\n\r\nAfter a snappy, parkour-heavy chase to open the film, Hartley offers Booth the chance to move up to the top spot on Interpol’s Red Notice (highest level arrest warrant) list. All he has to do is help Hartley and the Feds nab The Bishop.\r\n\r\nAnd the game is on!\r\n\r\nRead the full review on our website. https://www.ukfilmreview.co.uk/reviews/red-notice", "created_at": "2021-11-23T16:28:53.825Z"}, {"movie_id": 512195, "review_id": "625fcd7dd1a893009ca6576c", "rating": null, "review_text": "This movie is one of those ridiculously silly but quite fun movies. It is a movie that makes no pretense other than to be entertaining.\r\n\r\nThe movie is a mixture of art heist thriller, Indiana Jones inspired treasure hunts and fast and furious chase action. All served with a large dose of humor.\r\n\r\nI have to confess one thing right away. Ryan Reynolds grated on me. I guess he was chosen to provide most of the comic relief and, to me, he is over the top silly not to mention dishonest (most of the time) in a way that was not really my cup of tea.\r\n\r\nLuckily Dwayne Johnson largely compensated for that. I have not yet seen a movie with Dwayne Johnson in that I felt was really bad. Also, sorry to all the Gal Gadot haters out there, I did like her in this movie but then, as guy, maybe I am a wee bit biased on that, you know what I mean.\r\n\r\nThe story is bordering on the ludicrous with, mostly predictable, twists around every corner but then it is just there to tie the action sequences and jokes together so it is good enough.\r\n\r\nThis is a movie that you watch for the silly action, even sillier jokes and, for me at least, because Dwayne Johnson is in it. It has a single purpose and that is to entertain. No bullshit preaching, no finger pointing and no pretense to provide food for your brain.\r\n\r\nI liked it. It allowed me to spend two hours together with my oldest son just being entertained.\r\n\r\nOh, one more proof that it is a movie worthwhile to watch is of course the woke crappy tomatoes score. Note the discrepancy between their far left woke “critics” and the actual audience. Even that bullshit of separating the audience in “verified” and others couldn’t hide the fact that their “critics” are totally out of sync with the audience.", "created_at": "2022-04-20T09:08:13.250Z"}, {"movie_id": 512195, "review_id": "62d2ea6d91745b00674290ba", "rating": 4.0, "review_text": "_Red Notice_ is a run of the mill spy adventure with twists, turns, and an inflated runtime that leaves the movie feeling bloated. I was having a decent time in the start of the movie, I enjoyed the back and forth between Dwayne Johnson and Ryan Reynolds, the set pieces were great, and the plot was somewhat interesting. But after awhile, the movie got stale as the same style jokes were recycled and the plot kept being strung along. All the acting was fine in the film, but by this point Dwayne Johnson plays Dwayne Johnson and Ryan Reynolds plays Ryan Reynolds. There is no diversity in their acting, every role they take on is the exact same. In the beginning it was fine, but too much of a good thing is not enough. I found myself getting increasingly bored throughout the duration of the film, and the ending was a grind to get through. The twists at the end were interesting, although if I was remotely engaged in the plot I could have spotted it from a mile away. Overall, this film was below average cinema, even after the spending $60m plus on star power.\r\n\r\n**Score:** _45%_\r\n**Verdict:** _Poor_", "created_at": "2022-07-16T16:42:21.690Z"}, {"movie_id": 512195, "review_id": "6346d4e3d34eb30079febf57", "rating": 7.0, "review_text": "**Red Notice might be imperfect, but it is definitely enjoyable with its mega-star cast and grand adventure.**\r\n\r\nRed Notice is a fun adventure film with the biggest stars, beautiful locations, and spectacular effects while missing the mark in a few places. Still, it is an entertaining movie that is wildly enjoyable if you don't take it too seriously. With a cast boasting three of the most sought-after A-Listers of its day, Red Notice wisely focuses on these characters giving each actor a chance to grace the screen with their unique charm. The movie advances rapidly from action set piece to action set piece. The moments in between are filled with Reynolds and Johnson's playful banter that is funny but not as natural as Kevin Hart's chemistry with Dwayne Johnson. Ryan Reynolds does a great job playing his character that fits his strengths, but there are times when Johnson and Gadot's characters start to venture into Batman and Robin levels of cheesiness. Yes, Red Notice has flaws, but it really is an enjoyable film, and I look forward to its sequels.", "created_at": "2022-10-12T14:53:23.988Z"}]