[{"movie_id": 448119, "review_id": "5e8f5cf9197de4001b05a2fa", "rating": 2.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nWe have all watched the Dolittle movies starring Eddie Murphy. I'm not going to lie, I was never a fan of these films. Yes, they're purposefully dumb, innocent, and feature that basic level of comedy. They never annoyed me, but they also never did anything remarkably surprising. 2020's version of the known tale is the first post-MCU role of Robert Downey Jr., it boasts an A-list cast, and… it's one of the worst movies of the year, without a single doubt. A complete disaster in every area of filmmaking.\r\n\r\nI don't even know where to start. Maybe with RDJ since he's the most significant negative surprise. I can't believe such a charismatic and now iconic actor like him could deliver a performance this awful. His Welsh (?) accent is not only a terrible choice character-wise, but I doubt that any children can understand what he's saying. RDJ acts like a baffling caricature of himself, not helping an already flawed film. The voice work from the remaining cast might be the only positive of the whole movie, but the CGI animals are way too unconvincing.\r\n\r\nHowever, as always, the most impactful issues belong to the actual story. Instead of being an entertaining and fun adventure, it's an incredibly boring, nonsensical, structure-less journey into one of the most ridiculous third acts of cinema. Even placing myself in a child's mind, I don't think I would be able to enjoy this mess of a screenplay. Like I wrote above, not even the animals look great…\r\n\r\nCertain characters possess these unknown relationships that the audience is supposed to care about, but no background is given to any of them. Tons of plot points lack a logical explanation. The entire narrative is void of any creativity or uniqueness whatsoever, looking simply like a lazy, unimaginative piece of work. The \"young queen who falls gravely ill\" is just a woman sleeping in bed, not looking ill at all, which proves that not even the makeup department was interested in making an effort.\r\n\r\nBut all of the issues above are nothing compared to the film's climax. I don't want to spoil anything, so I'll just write that I still can't believe what I witnessed. Around ninety minutes of build-up lead to the most shocking, hilarious, utterly absurd moment. The humor is a level below childish. Dozens of fart jokes (including one during the climax), over-the-top reactions, and I don't even know what else. Between Bloodshot, Fantasy Island, and The Grudge… Let the devil come and choose!\r\n\r\nAll in all, Dolittle is a massive fail at all levels. It was meant to be one of the worst movies of the year, and it undoubtedly accomplished this goal. From the surprisingly awful performance from Robert Downey Jr. to one of the most shockingly terrible climaxes in the history of cinema, Stephen Gaghan delivers a structure-less screenplay, filled with nonsensical narrative decisions, and featuring an extremely dull adventure. The CGI animals are far from being remotely impressive, the characters lack personality (bringing an A-list actor doesn't guarantee anything), and the comedy is so astonishingly basic that I doubt kids will laugh at some of the jokes, and they laugh at everything. With a budget of 175M (!!!), it's not understandable how and why a studio would waste this much money on such an obvious flop. The voice work from the cast is good… and it genuinely could have been worse. This is the closest I can get to a positive.\r\n\r\nRating: D-", "created_at": "2020-04-09T17:35:53.291Z"}, {"movie_id": 448119, "review_id": "5fd24e028e87020040d88aff", "rating": 5.0, "review_text": "A weird watch, probably won't watch again, and can't recommend.\r\n\r\nI'm not sure if this is supposed to be closer to the books, or if Disney was just fed up with having wonderful magic in their products, but having Dolittle act out animal behavior in order to communicate to the them really ruins the vibe, as well as making it something you can learn makes it incredibly unremarkable.  It should just be something people teach in this movie's universe.\r\n\r\nRobert Downey Jr., despite claiming he wants to play new characters, basically just played Sherlock Holmes that can talk to animals, to include uncovering a plot to kill the queen.\r\n\r\nThe only real saving grace in this is the pure technical detail in the CG.  The cast and voices were all fine, but the animal CG is over the top good, if a little goofy at times.\r\n\r\nMost of the movie is \"what are they doing now?\", or more of \"why are they doing this now?\".  It really seemed they had to add a lot to the story of Dolittle, the doctor who talks to animals, to make it worthy of a movie.  They also had to shift the focus away from him quite a bit, and while previous iterations have chosen to focus on the togetherness of the family, this movie has chosen to go with the \"dead wife so I hate the world\" cliche, which is always uplifting.\r\n\r\nThey just made a lot of dark, and weird choices for this movie that did not improve it.", "created_at": "2020-12-10T16:34:10.614Z"}, {"movie_id": 448119, "review_id": "5fe8cbda07a808003e8c7b79", "rating": 4.0, "review_text": "So pointless, so bad.\r\n\r\nThe one solace of praise I have for <em>'Dolittle'</em> is that it at least mixes things up compared to the Eddie Murphy remake, as well as potentially the 1967 original - though I haven't seen that, but this sounds a little different based on '67's synopsis.\r\n\r\nThis film wastes a fantastic cast list. Robert Downey Jr. is of course the lead, but there are also notable appearances from the likes of Antonio Banderas, Michael Sheen and Jim Broadbent - as well as voice roles for the likes of Emma Thompson, Rami Malek and Octavia Spencer. Yet, all of those talents are completely wasted - I didn't even recognise some until the end credits.\r\n\r\nDowney, as the main man, merits the most attention. He is kinda awful, especially with his dreadful attempt at a Welsh accent - which is, I'm sure, ADR'd in places. It never feels like Downey fits as Dolittle, a role which comes across as perfect for Johnny Depp; though I'm glad it didn't fall to him, given how poor this is.\r\n\r\nThe special effects are passable, but not as great as you'd expect from a 2020 (2018? 2019?) film with this budget and production company. The plot is OK, but it's all just a bit limp unfortunately. It needed strong humour, which it didn't get.\r\n\r\nNo idea why they chose to remake this but here we are. Very poor, in my opinion anyway.", "created_at": "2020-12-27T18:00:58.322Z"}]