[{"movie_id": 834, "review_id": "5627ee93c3a36872900003db", "rating": 7.0, "review_text": "Oh Brother!\r\n\r\nThe sequel to cult fave Underworld (2003) finds vampire warrior Selene (Kate Beckinsale) and half werewolf Michael (Scott Speedman) unravelling the truth about their respective blood lines. Just what caused the feud between the vampires and the lycans?\r\n\r\nUnsurprisingly reviews for this sequel are mixed, it's either a smart action popcorner that was warranted, or it's a huge let down after the first film. Personally I'm in the first camp, personally because it does pretty much the same things, only the story has a bit of complexity about it to try and bluff us that it's cerebral.\r\n\r\nFor a film about vampires and werewolves at war it delivers all that is required in the modern era. There's lots of high energy action, blood and guts galore, CGI overdrive, fast pacing and a sexy lead actress fronting the piece. The story ticks along nicely, introducing new and interesting characters, while flashbacks fill in the gaps for any newcomers to the series. The main villain is one bad-ass winged mofo, a genuine terror that our protagonists have right to fear, and the finale is as expected a bonkers array of bloody chaos.\r\n\r\nSmartly put together by director Len Wiseman and coolly photographed by Simon Duggan (steel blues and greys), it isn't ground breaking cinema, but it's a wail of a time for those with expectation levels set at popcorn bonanza. 7/10", "created_at": "2015-10-21T19:59:15.402Z"}, {"movie_id": 834, "review_id": "5edd0e889c24fc002168595a", "rating": 9.0, "review_text": "I'm sorry but I've denied myself this for far too long. _Underworld: Evolution_ is a cinematic masterpiece and I will fight to the death to defend it.\r\n\r\n(I won't actually fight to the death to defend it, or even really try to defend it at all. I know I am in the vast minority here, but I absolutely love this film.)\r\n\r\n_Final rating:★★★★½ - Ridiculously strong appeal. I can’t stop thinking about it._", "created_at": "2020-06-07T15:58:00.819Z"}]