[{"movie_id": 395458, "review_id": "62b45608e786870061815e56", "rating": 4.0, "review_text": "**A film that recreates the modus vivendi of the 50s suburbs, but fails to give us a story with tension and suspense that we can adhere to.**\r\n\r\nAny Cohen Brothers film is always a film that promises not to be like any other. Their style is quite unique and does not suit everyone. And this time they bring us a film that is entirely about the importance of appearances, the rottenness they cover up, and a certain self-destruction latent beneath an impeccable appearance. It's a film that tries to teach us that nothing is what it seems, nothing is perfect, there are no paradises on Earth, and everything that seems too perfect always has something decadent or spoiled behind it. Yet another film that promises to annoy those who see it... a nuisance that helps us understand why the film was so poor at the box office.\r\n\r\nThis is the lesson of Suburbicon, a seemingly perfect and very friendly community, all white Caucasians, with impeccable houses, cars and lawns, which will begin to experience days of enormous turmoil and riot when a black family decides to move there. The family in question seems as impeccable as they are, and as wealthy as any of their neighbors... but they are black, and that is enough to be undesirable in the eyes of the neighbors. At the same time, one of those impeccable families begins to implode after a home invasion results in a murder and, days later, an inspector shows up, thinking it's all a crime committed to grab the life insurance money.\r\n\r\nAs we can see, the script is not difficult to describe succinctly, despite joining two plots that, alone, could make a solo film. Set in the 1950s, the film shows us how the suburban neighborhood was born, with a large urbanization boosted by the growing prosperity and purchasing power of a rapidly growing middle class. However, throughout the film, the feeling of artificiality and falsehood that surrounds the neighborhood (and that ideal family in particular) is accentuated, in proportion to the suspicions of the authorities and the hostility towards the black family. Unfortunately, the film fails to convey that tension to the audience, and the atmosphere is never as thick and disturbing as it should be.\r\n\r\nGeorge Clooney may not be part of the cast, but he ensures a safe direction and is aware of what he wants... although he doesn't seem to know exactly how to get there! He takes great efforts in the most technical and artistic points, in the sets design, in the recreation of the period, but he fails to shape the environment in such a way that the tension and suspense can be built up on the way to the climax, nor that the cast corresponds with the same effort and commitment. The proof is Matt Damon, who brings the protagonist to life in a lukewarm way, similar to what he did in _Good Shepherd_ (the similarity between characters, from a visual and behavioral point of view, is huge and not pleasant). Julianne Moore turns out to be the best actress here, with a good performance where she combines a calculating and meticulous spirit with an appearance of an ideal housewife.\r\n\r\nTechnically, it's a well-executed film on many levels: the cinematography is colorful, vivid, and the filming work was well done. The sets manage to resurrect the idyllic appearance of the middle-class suburb of the 50s, with the sets betting on period furniture and colors between green and pink. The cars are an important part of the movie, and they are all magnificent. The costumes, most particularly Moore's, are also excellent and bring back the women's fashion of that period. Alexander Desplat signs the soundtrack and does a very well executed job.", "created_at": "2022-06-23T12:01:12.504Z"}, {"movie_id": 395458, "review_id": "63bf84d48efe7300a0e9ff49", "rating": 1.0, "review_text": "The Coens are experts in their ability to write a political satire, or a movie with a strong political message, and make it feel natural and organic to the plot so much so that, even if you don't agree with whatever they are trying to say, you don't care because they are still telling a great story...and the story always comes first.\r\n\r\nHowever, put George Clooney at the helm and all the talent that the Coens have for expertly into a stylish story goes straight out the window.\r\n\r\nAnd the result is...a bore.\r\n\r\nClooney put the politics above the story and you can tell. It felt preachy, it felt pretentious, it felt like a lecture...What it didn't feel like was entertainment.\r\n\r\nBut that's what happens when you have a great script with a strong political message...and you decide that the political message has to be front and center, in your face, at the expense of actually telling a story.\r\n\r\nHad the Coen's actually directed it, they could have sold the audience the same message, without making it feel like it was forced down your throat.", "created_at": "2023-01-12T03:56:04.292Z"}]