[{"movie_id": 411, "review_id": "5fa1d9ae96e30b0037348481", "rating": 9.0, "review_text": "Long bloody title, but a great film no doubt.\r\n\r\nI had seen <em>'The Chronicles of Narnia: The Lion, the Witch and the Wardrobe'</em> before but hadn't watched it for years and years, I remembered the vast majority though - it's a memorable film after all. There's a great battle scene in there, some fun characters and strong effects. It's a tad too long, but not by much.\r\n\r\nIt has a nice charm to it also, as they set up Narnia excellently. The quartet of children are very well cast, all four of them suit their roles to a T. Georgie Henley is sweet as Lucy, while William Moseley and Anna Popplewell fulfil the roles of Peter and Susan comfortably. Edmund, meanwhile, is of course annoying, but Skandar Keynes does a good job portraying him.\r\n\r\nElsewhere, Tilda Swinton and Liam Neeson are terrific casts as the White Witch and Aslan. Both do great, especially Swinton. James McAvoy, Ray Winstone, Michael Madsen and Rupert Everett are smart choices too.\r\n\r\nI've, as far as I'm aware, never seen the two sequels so very much look forward to seeing what they have in store for me. They'll do well to match this first film, that's for sure.", "created_at": "2020-11-03T22:29:02.051Z"}, {"movie_id": 411, "review_id": "65399e96b87aec00c3a2aa6c", "rating": 10.0, "review_text": "In my last review (which you can find on my Letterboxd), I said _The Lion, the Witch, and the Wardrobe_ was a \"nearly perfect film.\" Well, I am here to say that with this viewing, to me, it is a perfect film. \r\n\r\nI used to always think this film was a sort of step below LOTR, and, while LOTR is indeed a masterpiece of cinema, I don't regard this film as lesser.\r\n\r\nThe movie is just pure magic! Every aspect of the movie (minus the CGI – which doesn't really hold up [except for Aslan] but is still serviceable) is even better with age! And I find myself moved emotionally by more things this time than I ever have watching this film.\r\n\r\nThe score by Harry Gregson-Williams is just phenomenal. Especially \"The Battle\" – that goes without saying. But this time, part of the magic and nostalgia I was struck by was the musical piece that sounds like it's a song. The one that plays while the train is leaving London. (I found out it's actually about halfway into the track \"Evacuating London.\") That magical song, combined with the great camera work by Donald M. McAlpine and the appearance of the movie title makes for feelings of peak nostalgia and magic for me.\r\n\r\nAlso, this film has one of the best opening scenes of all time. When Netflix (finally) remakes the films, I don't know how they can top this opening. \r\n– In fact, that's another thing about this movie: There are so many things that I don't think any remake could top. Liam Neeson as Aslan, Tilda Swinton as Jadis, the White Witch, and James McAvoy as Tumnus. – Oh, and, though he's not in the book, the centaur, Oreius (played by Patrick Kake), is so cool! Can't top that.\r\n\r\nAlso, the costuming is excellent – especially for the White Witch – and the gryphons are so cool! The sound design on their shriek gives me chills (in a good way).\r\n\r\nAnd I can't go without saying that this is also an emotional story because of what the story represents, the symbolism of the story.\r\nEdmund represents us – represents me, a sinner. I who have walked in rebellion against God, and who am by nature opposed to God. And as such, I deserve the wrath of God, punishment that He would be fully just to give me. But Aslan represents Jesus Christ. Like Aslan sacrificed himself for Edmund, dying the death he should have died, Jesus sacrificed Himself in our stead, taking upon Himself the wrath of God we deserved, so that “if [we] confess with [our] mouth that Jesus is Lord and believe in [our] heart that God raised Him from the dead, [we] will be saved” (Romans 10:9), we “will not perish but have eternal life” (from John 3:16), and as a result of that faith, “we have peace with God through our Lord Jesus Christ” (from Romans 5:1).\r\n\r\n‭‭Ephesians‬ ‭2:1‭-‬10‬\r\n\r\n> “[1] And you were dead in the trespasses and sins [2] in which you once walked, following the course of this world, following the prince of the power of the air, the spirit that is now at work in the sons of disobedience— [3] among whom we all once lived in the passions of our flesh, carrying out the desires of the body and the mind, and were by nature children of wrath, like the rest of mankind. [4] But God, being rich in mercy, because of the great love with which He loved us, [5] even when we were dead in our trespasses, made us alive together with Christ—by grace you have been saved— [6] and raised us up with Him and seated us with Him in the heavenly places in Christ Jesus, [7] so that in the coming ages He might show the immeasurable riches of His grace in kindness toward us in Christ Jesus. [8] For by grace you have been saved through faith. And this is not your own doing; it is the gift of God, [9] not a result of works, so that no one may boast. [10] For we are His workmanship, created in Christ Jesus for good works, which God prepared beforehand, that we should walk in them.”", "created_at": "2023-10-25T23:02:46.570Z"}]