[{"movie_id": 9592, "review_id": "5d78d34139549a001297ec4b", "rating": 3.0, "review_text": "The jump in video quality from the first _Open Water_ movie to this one is **astounding**. But it's still real bad. Plus, this isn't even a shark movie! I know it isn't specifically touted to be one, but I was still very surprised. Honestly, I think what happened here was someone wanted to make a very stupid movie, but were then informed that a movie, near identical in both plot and stupidity, already existed, and to cover their tracks, they quickly decide all of a sudden that this movie was a \"sequel\" to the original _Open Water_. I guess it was kind of cool seeing the guy that plays Loki/Gabriel in Supernatural in another role, but I can't imagine that's a thing that'll carry much weight with audiences in general.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2019-09-11T10:58:09.443Z"}, {"movie_id": 9592, "review_id": "5f8e079e11386c484ffd1e0e", "rating": 7.0, "review_text": "This is not a shark movie as I had thought nor a related sequel to the equally charming first instalment in the Open Water series, but it did get me hooked quickly when a group of friends impulsively decide to take a dive in open waters without lowering the ladder on their yacht. It's crazy how things move from there with basic instincts kicking in and the blame game starting up. It's solid entertainment if you are into survival thrillers. Has a few clichés here and there, but overall Adrift gave me a good 90 minutes of pure thrills. (Grade B). TN.", "created_at": "2020-10-19T21:39:42.849Z"}, {"movie_id": 9592, "review_id": "642c71bd8de0ae0113512d71", "rating": 7.0, "review_text": "**Much better than expected.**\r\n\r\nI saw this film very recently, following another, Portuguese one, which is a copy of it. The film is much better than I expected and, even if it is not based on true events (the producers should be sued for misleading advertising), it is quite well made, tells a good story and entertains quite well.\r\n\r\nEverything takes place at sea, on a luxurious boat. Six childhood friends meet up for a walk and everything seems to be going quite well until they all end up in the sea: when they want to get back on the boat, they realize that no one has remembered the ladder to climb.\r\n\r\nNormally, this type of film contains idiotic people doing idiotic things that end in the worst way, and who ends up being saved is always the character that gives us the most sympathy. It's almost mathematical, and I didn't expect much more. I was surprised to find a film that manages to be that, but go beyond that and give us entertainment, a story capable of minimally convincing us and relatively well-built characters. It's not an exceptional film, but it's frankly better than most of its counterparts.\r\n\r\nI'm convinced that the secret to this film's success lies in the team of very competent screenwriters called to work, and also in the intelligent direction of Hans Horn, who was able to manage the cast in the most capable way possible. Susan May Prat is believable in everything she does, and she's the standout actress here, but Eric Dane and Richard Speight Jr. they are also quite good on the job they have done.\r\n\r\nTechnically, it's a pretty good movie, considering the budget and other constraints the production faced. Being a film that was made a little outside the big studios and the millions in the industry, it is a very competent work, with excellent cinematography, good editing, good soundtrack and sound effects, and good use of the filming location.", "created_at": "2023-04-04T18:51:41.392Z"}]