[{"movie_id": 14160, "review_id": "5f396885c5840d00329e56c6", "rating": 8.0, "review_text": "A fun and charming adventure.\r\n\r\n<em>'Up'</em> certainly knows how to tug at the heartstrings. It creates a very meaningful story around Carl Fredricksen (Ed Asner), with the early scenes particularly standing out as superb.\r\n\r\nI don't overly enjoy the parts with Dug (Bob Peterson) and Kevin (Pete Docter), not that they are bad, though everything with Fredricksen, Russell (Jordan Nagai) and Charles F. Muntz (Christopher Plummer) is entertaining and/or hearty.\r\n\r\nAsner and Nagai do terrific, in what is one of Disney's 'best of the rest' films. There is some lovely music by Michael Giacchino, too. Go watch!", "created_at": "2020-08-16T17:10:29.520Z"}, {"movie_id": 14160, "review_id": "612ce388a4af8f008a2c9ee2", "rating": 9.0, "review_text": "To Christopher Plummer and Ed Asner...\r\n\r\nRIP.", "created_at": "2021-08-30T13:56:24.751Z"}, {"movie_id": 14160, "review_id": "657244906c849200eac6bb81", "rating": 7.0, "review_text": "Widowed \"Carl\" (anyone else thinks he looks like Henry Kissinger?) gets himself involved in an altercation with a construction worker that sees him court-ordered to the \"Shady Oak\" retirement home. He's having none of that, and on the day of his deportation releases thousands of balloons from his chimney. They manage to uproot his house and using some rudimentary sails he sets off in search of \"Paradise Falls\". Deep in South America lie these idyllic waters where he and his late wife dreamt of visiting. En route, and a few hundred feet up, he hears a knock at the door. It's \"Russell\". A boy scout from his home town who just happened to find himself on the balcony when it took flight. The two don't immediately bond, but after a thunderstorm when it becomes clear that the youngster has his uses, a truce sets in as they end up having to walk through the jungle towing his still airborne home behind them. This is when they meet the big-beaked \"Kevin\" and the talking dog \"Dug\". Continuing their search, they stumble upon an adventurer who is warm and welcoming, but is he all that he seems - especially when he learns of \"Kevin\"? The animation is lively and vibrant and it's quite good fun this adventure, with loads of sarcastic attitude from the curmudgeonly old git, a breezy and not too annoying child in \"Russell\" and a last ten minutes, or so, that are fairly action packed and enjoyable to watch. It's not my favourite Disney/Pixar film this, but it passes ninety minutes effortlessly enough.", "created_at": "2023-12-07T22:17:52.679Z"}]