[{"movie_id": 393559, "review_id": "5901268a92514155f0003086", "rating": 7.0, "review_text": "**Seeking a second chance for the normal life.**\r\n\r\nWhenever I review a Stop-motion animated film, I always start with by saying it is a dying art form that needs a bigger lift from us. It gave a new life for filmmaking when there were no technology like computers hundred years ago for the creation of giant creatures to all the fantasy and magical world. I am glad that every year someone coming forward to show the world how beautiful these are.\r\n\r\nI think there's a quota for it and 2D animation for the Oscars. Otherwise, these formats would die sooner than we expected, so that recognition in the big stage. Every year at least one film from these two categories makes out. This year it was a double jackpot for Stop-motion animation. Including this, 'Kubo and the Two Strings' was the other one to shine in the world's biggest film awards ceremony. But winning the trophy is almost impossible in this 3D animated film world. Anyway, I'm happy for this, that I enjoyed watching it.\r\n\r\nIt was a short film, that ran for just one hour. First, we have to understand filmmaking in this form is a most challenging one than any other. It is a manual work. I mean people get in there and frame by frame do all the work. So for this one hour film, they had done the great hard work and it paid off well by got nominated for the Oscars. It was also Switzerland's official submission for the Best Foreign Language Film, but failed to make progress in that race.\r\n\r\nThe screenplay was based on the book. A simple story with a strong message. This is the tale of a boy with full of dreams and after his alcoholic mother died, he is taken to the orphanage. That is the last place he wanted to be where he meets a mean boy and soon becomes his close friend. Being young kids, they tend to play some pranks with officials, visitors and themselves. That's one of the ways to cope with for where they have ended. So the remaining is to tell us would they get a second chance in their lives.\r\n\r\n> ❝I don't know why I'm crying. Sometimes people cry because they're happy.❞\r\n\r\nWhen some take up a project like this, they are not offered to make mistakes in choosing a weak screenplay. Because there are thousands of films in production around the world and in those, a handful of animated films, but probably he's only one up for a Stop-motion animated feature. Which means everyone with the knowledge of his commitment will be looking forward to it. So the filmmakers have opted to adapt a novel, which is always a best option in filmmaking.\r\n\r\nThe next is the characters. Making them come alive, particularly initial stage, the creation of models. Yep, they have done that job as well so well. Gooding looking ones, especially among the kids for having similarity with their vision. The frame rate was good. Very smoother for viewing. So technically it was a flawless for the normal watch. An impressive storyline, which might serve as a tearjerker for a few.\r\n\r\nThere's a little romance, but from the children's perspective of having a crush. Since the girl character was introduced, the narration takes a fresh look. The following event becomes even more adventurous and fun filled till the end. The voice-over was excellent. From the dialogues to the film scenes very impressive. It marks the directional debut for a short filmmaker. An appreciable work and I hope he makes more like them with new technics than migrating to computer animations.\r\n\r\nOne of the advantages is it is a short and sweet film, but those who love such films might feel it is too short. Most importantly, there're not clichés like what we've seen films that takes place in the orphanages. The opening was shocking. If it was a real life, the boy would have ended in a different place. Still the emotional parts were less explored, yet very convincing for not leaning too much on that facet.\r\n\r\nThe film is one of the best in its kind, but I agree it's not a masterpiece. Not if you have seen plenty of Stop-motion animations in your life. Yet it can't be neglected that easily and surely it is for everyone. I know there are folks who thinks this format of films are for little ones, but the truth is they are still in the pre 90s mindset. This is good, give it a try and you might love it. Anyway, for its rareness itself highly recommended, then you decided how do you liked it or not.\r\n\r\n_7/10_", "created_at": "2017-04-26T23:00:26.212Z"}]