[{"movie_id": 147773, "review_id": "60e2031e071650002d67ae23", "rating": 9.0, "review_text": "_**A boy coming-of-age near Cape Cod and more**_  \r\n\r\nA 14 year-old boy (Liam James) struggles to fit-in with the family & friends of his mother’s new beau (Steve Carell) as they partake of a vacation at his beach house in the Cape Cod area. The teen finds a quasi-mentor (Sam Rockwell) at a water park while developing a friendship with the cute neighbor girl (AnnaSophia Robb). Toni Collette plays the mother, Allison Janney a friend and Amanda Peet a flirty woman.\r\n\r\n“The Way Way Back” (2013) is a coming-of-age flick that meshes elements of films like \"The Squid and the Whale\" (2005), “The Summer of ’42” (1971), “Meatballs” (1979), “Swimming” (2000) and “Lawn Dogs” (1997), but this is arguably the best of them. \r\n\r\nPart of the genius of the movie is that the potential stepfather (Carell) isn’t made out to be totally evil nor is the seeming mentor (Rockwell) perfect. They’re both flawed men with presumably good intentions toward the boy, but only one proves that he’s a worthy father-figure. Moreover, the all-around writing/acting smacks of real life.  \r\n\r\nAnnaSophia is super cute on the female front while Zoe Levin is alluring as the pouty, bratty stepsister. Meanwhile Andria Blackman has a standout cameo as the girl in a yellow bikini.   \r\n\r\nThe film runs 1 hour, 43 minutes, and was shot in the Cape Code region of Massachusetts: Wareham & nearby Onset; Marshfield & nearby Duxbury.\r\n\r\nGRADE: A/A-", "created_at": "2021-07-04T18:51:10.891Z"}, {"movie_id": 147773, "review_id": "62ae2ec262e86f00608405cd", "rating": 6.0, "review_text": "\"Duncan\" (Liam James) is a typical fourteen year old boy. He keeps himself to himself, and isn't greatly looking forward to his family holiday with mother and her boyfriend and his older teenage daughter. Determined to get away from this domestic bliss, he heads to the \"Wizz\" water park where he strikes up a friendship with one of the animal keepers \"Owen\" (Sam Rockwell). The latter sees something, perhaps of himself, in this younger lad and allows him to help him. As the summer progresses, both help the other to find an inner strength to deal with their demons - and, gradually, a newly empowered \"Duncan\" emerges ready to assert himself a little more. Whilst this isn't a great film, there is something about James's strong and personable performance that merits watching. His teenage angst is cleverly, subtly even, presented to us and his relationship with Rockwell, not an obvious friend for the boy, evolves by degree - and not always positively, either. There is way too much dialogue, and I found the family sub-plot with his over-bearing step-father \"Trent\" (Steve Carrell) and his really irritating daughter \"Steph\" (Zoe Levin) whom would cheerfully have left in the shark pen, got in the way of the intensity of this otherwise quite engaging exercise in bonding and maturing confidence. Worth a watch.", "created_at": "2022-06-18T20:00:02.259Z"}]