[{"movie_id": 138122, "review_id": "50b5c72e19c2956cd3000849", "rating": 8.5, "review_text": "**Quick Review**\r\n\r\nStudent Of The Year aka SOTY had a pretty good expectations, considering its youngistan theme, makers and star cast of the film, and not to forget the appealing storyline of it. However it had indeed satisfied the expectations, and further more had hit the right chord to their target audience. On the other hand, the movie was compared with many other movies which had similar kind of themes (college campus), but SOTY is an altogether a complete film with different storyline, and thus provides you a totally fresh and entertaining product.\r\n\r\n**Story**\r\n\r\nIt is the story about three friends - Abhimanyu Singh, Rohan Nanda and Shanaya Singhania - and their group of buddies. Rohan Nanda aka Ro (Varun Dhawan) is a rich son of a well-known business tycoon Nanda (Ram Kapoor), and rules the St. Teresa's High School (Dehradun) with his style, attitude and riches. He is quite flirty among other girls, but has a beautiful and gorgeous girlfriend, Shanaya (Alia Bhatt). Also though Ro was a rich son of an entrepreneur, but he had a soft heart for everyone. Shanaya is a rich modern girl, who thinks herself as a fashion designer, and rules the college with her charm, beauty, and sex-appeal. Now the entry of Abhimanyu aka Abhi, he hails from a small town and aspires to become a big person one fine day. Abhi rules the college with his style, attitude and a perfect victory in everything. This irks Ro, and the two often clashes with each other. However because of his soft heart, both of them became friends and then best friends.\r\n\r\nThe turning point comes when an unexpected love triangle happens between Ro, Abhi and Shanaya, which is further followed by the 'Student Of The Year' competition in St. Teresa's High School. How these three people copes up with their complicated relationship, and eventually who wins the coveted trophy of Student Of The Year, forms the crux of the story.\r\n\r\n**Final Verdict**\r\n\r\nIt's a new age mixture of Kuch Kuch Hota Hai and Jo Jeeta Wohi Sikander, with a complete different and engaging storyline. On the whole, Karan Johar's 'Student Of The Year' is a perfect film for all the youngistan, a perfect film for entertainment, and a perfect film to watch it again and again. 'Student Of The Year' is the 'Film Of The Year' for the youth gang.", "created_at": "2012-11-28T08:11:26.000Z"}]