[{"movie_id": 292011, "review_id": "5e44738a9603310017f3d57d", "rating": 6.0, "review_text": "Despite some stumbles with the script, 'Richard Jewell' is a well-acted and admirably low-key piece from Eastwood that raises a lot of questions. At the risk of sounding ageist, most 89-year-olds are lucky to have one good bowel movement left in them, let alone films this interesting.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-richard-jewell-man-versus-media", "created_at": "2020-02-12T21:52:10.397Z"}, {"movie_id": 292011, "review_id": "5f238d203503980034e785a6", "rating": 5.0, "review_text": "Since I couldn't have told you when the Olympics were in Atlanta, I found it worth watching. Whether there's much to the story beyond the depiction of events is an entirely different conversation.", "created_at": "2020-07-31T03:16:48.975Z"}, {"movie_id": 292011, "review_id": "5fe76a38e18b97003e8d2ccb", "rating": 6.0, "review_text": "Before talking about the movie, it can be said that \"Richard Jewell\" is one of those movies that proves that art does not know age. Ninety-year-old Clint Eastwood is still alive in the cinema and can make good films. The most important strength of the movie is its strong characterization, so that in the very first few scenes, we get a good definition and knowledge of the main character, in a way that from the very beginning, Richard finds his place in our hearts. And we want everything that is good for him until the end of the film. This innocence of Jewell, which turns into oppression throughout the film, keeps us by his side until the end of the movie and does not allow the viewer to be indifferent to Jewell and his fate. The camera also plays an important role in completing this characterization and the viewer 's closeness to Jewell's character, from the very opening scenes that represent him, the middle of the film which is the culmination of events for him and his mother and the end of the film which is a good ending. This strong characterization has also been performed for Jewell's mother, who is also far from exaggerated and can be fully understood and believed. This point, however, is a bit weak for the lawyer, so that the reason for his acceptance of the case is a bit weak, but with the progress of the film, his efforts are somewhat acceptable, although this point still has no effect on the emotional depth of the film. The script, which is the most fundamental cinematic element of any movie, plays a very important role here as well, and this characterization comes out of it.This coherence and quality of the script makes Richard's ideals of believing in the law and the police credible And it does not let his honorable sentences in the last interrogation seem like slogans at all. In the meantime, the good acting of \"Paul Walter Hauser\", \"Sam Rockwell\" and of course \"Kathy Bates\" cannot be easily overlooked. Kitty's character is also somewhat good, but her sudden and emotional change at the end of the movie is not very believable. Eastwood has done well in instilling a hatred of the media in the viewer which is sometimes even more dangerous than the law and its injustice, but one downside to the film is that the federal police investigation process is somewhat vague and it is not clear exactly how and with what evidence they can advance the case so much, but this movie is enough good that these negative points do not have much effect on its quality. The final sequence of the interrogation is also a good sequence, because we see the release of real Jewell's thoughts and ideals, not slogans, through words that are still uttered innocently, like himself, and according to the characterization and script, it is not a cliché at all. Also, it should be noted that the camera works well in the same sequence and the mise en scène is also acceptable. In general, \"Richard Jewell\" is a good film that entertains and satisfies the audience as much as it can.", "created_at": "2020-12-26T16:52:08.076Z"}, {"movie_id": 292011, "review_id": "620b0d4c9715ae002c8c8e03", "rating": 9.0, "review_text": "This is an excellent film from Clint Eastwood!\r\n\r\nFirstly, what a terrific performance from Paul Walter Hauser! He plays lead perfectly, as he makes it impossible not to root for the titular character - which is admittedly a given due to the plot, but Hauser adds an extra level of believability to proceedings. I felt every intended emotion.\r\n\r\nSam Rockwell does very good behind Hauser, as do Kathy Bates and Olivia Wilde. Jon Hamm is good, too, as he returns to an Eastwood flick, having made his film debut in the latter's <em>'<a href=\"https://letterboxd.com/film/space-cowboys/\" rel=\"nofollow\">Space Cowboys</a>'</em> nineteen years prior.\r\n\r\nPortraying a messed up true event, <em>'Richard Jewell'</em> is a film that I'd most definitely suggest you check out. 9/10 from me.", "created_at": "2022-02-15T02:17:48.924Z"}, {"movie_id": 292011, "review_id": "624059f745765d00944b31c9", "rating": 7.0, "review_text": "I was working in Atlanta for a broadcaster the night of the Atlanta bombing at the Olympics so remember quite a lot of the immediate aftermath and the enormous speculation into what had actually happened and of the expectations put on law enforcement to convince not just the USA but the rest of the world that the Games were safe. This film is an authentic take on these days with a strong performance from Paul Walter Hauser as the security guard who found the bomb only to be later accused of having planted it in the first place. Sam Rockwell is great as the attorney determined not to cave in to the pressure and ensure his client gets a fair hearing as the authorities appear determined to scapegoat him. Kathy Bates plays his mum strongly, too. It's far too long, though - and at times it sags in the middle - it is virtually impossible to sustain the level of intense dialogue. It's a good film, but not a great film.", "created_at": "2022-03-27T12:35:03.838Z"}]