[{"movie_id": 340102, "review_id": "5f4ce0bf65e0a20035540e4a", "rating": 6.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @ https://www.msbreviews.com\r\n\r\nI still can't believe I'm about to write a review for The New Mutants... The last X-Men movie before they're introduced into the MCU became one of the most delayed films ever, but it finally got released this week. Shot in 2017 with an original release date of April 2018, Josh Boone had reshoots planned, which postponed the movie for the first time. Disney began negotiations to merge with 20th Century Fox (now 20th Century Studios), keeping the film in a limbo state. A global pandemic emerged, pushing the movie even further. Final outcome: a worldwide limited release three years after finishing shooting, and without any reshoots. So, obviously, my expectations were pretty low...\r\n\r\nSurprise, surprise, The New Mutants isn't a horrible mess, it's... fine! I feel really sorry that so many people worked on this film and had to wait so long to see it being released to the world. I love how it's far from being just another generic, formulaic superhero flick. Sure, it has tons of cliches, and it does still feel like an X-Men movie at times, but I'll get there. I genuinely appreciate that Boone and Knate Lee wrote a narrative packed with significant and detailed character development, including a compelling romantic arc. Every young mutant gets their own story explained front-center. Each time the film dives into a character's past, it never feels like an irrelevant subplot. It all serves a purpose.\r\n\r\nThe technical crew had a very low budget to work with compared to other movies in the genre, so I must praise them for transforming a small, one-location film into something surprisingly entertaining. The visual effects definitely don't have that quality that viewers are used to seeing now, but they're reasonably okay for the most part. The horror atmosphere is definitely present, but it feels like the movie could have benefited from a more assertive, bolder approach to these nightmarish sequences. The best aspect of the whole film is related to the indisputably talented cast, with just one exception...\r\n\r\nFrom Anya-Taylor Joy's rebel behavior to Charlie Heaton's experienced performance, passing through Maisie Williams' emotional display and Henry Zaga's charming one-liners, every one of these actors proves why they were cast in such a well-known franchise. Despite the ridiculously flawed accents, all share great chemistry between each other, including debutant Blu Hunt. However, the latter fails to be a compelling protagonist clearly due to her inexperience. I don't want to be too harsh on her because I did see some great moments when she shared the screen with her colleagues. However, I do need to state that every scene where she acts alone or against a green screen reaches cringe-worthy levels of bad acting.\r\n\r\nBoone and/or the casting crew must also take responsibility for choosing her as the main character, but honestly, she's not even my main issue. That has to do with her own character. While she gets the same focus as her fellow mutants when it comes to her backstory, she never really has to deal with her powers' consequences. Some mutants hurt or killed people, and they're unquestionably damaged because of it. Dani doesn't have a single moment where she feels sorry for whatever happened in her past or where she's confronted with it. It's quite hard to connect with a protagonist when both the character and the actress playing her lack that captivating personality.\r\n\r\nFinally, Alice Braga, as the doctor, is probably the most formulaic component of the movie. From the first conversation she has with the mutants, any viewer can guess where the story is going. Braga is good as Dr. Cecilia Reyes, but coincidentally or not, her character is the only one whose backstory wasn't remotely explored. Reyes' motivations and what lies beyond the hospital raise intriguing questions that, unfortunately, never get answered. Maybe the supposed reshoots could have solved some of these issues, perhaps they could have added some more. I don't know for sure, but what I do know is that The New Mutants is far from being an awful mess.\r\n\r\nAll in all, Josh Boone and Knate Lee deliver a reasonably entertaining screenplay out of the generic zone of the superhero genre, packed with detailed character development and decent horror sequences, especially having in mind the low budget. The New Mutants features a marvelous cast, where everyone shares tremendous chemistry with each other. All actors deliver great performances, except for the debutant Blu Hunt who unfortunately lets her inexperience overcome her evident potential. Contrasting with the overall character treatment, Dani Moonstar fails to be a compelling protagonist since she's barely shown having to deal with the emotional consequences of her powers like every other mutant does. Despite the refreshing take on the overall story, there are still a few cliches and formulaic components throughout the film, especially related to the hospital. Overall, it's surprisingly okay considering the numerous production issues, so I definitely recommend it at least just to say goodbye to the last X-Men installment pre-MCU.\r\n\r\nRating: B-", "created_at": "2020-08-31T11:36:31.643Z"}, {"movie_id": 340102, "review_id": "5f531eb4848eb900365e91ca", "rating": 6.0, "review_text": "Just like 'Dark Phoenix', Fox's greatest loss is Disney's greatest gain: even as 'The New Mutants' opened, the discussion was already focused on how Disney's MCU is bound to resuscitate 'X-Men'. That's a shame because Josh Boone's relic from a defunct franchise, unceremoniously dumped in cinemas in the middle of pandemic, was a step in a potentially interesting new direction.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-the-new-mutants-an-enjoyably-small-scale-superheroic-character-piece", "created_at": "2020-09-05T05:14:28.519Z"}, {"movie_id": 340102, "review_id": "5fb2be9c1f0275003e5c5fe4", "rating": 1.0, "review_text": "The problem with The New Mutants is that it fails in so many different areas that's its difficult to pin point why it's such a bad movie. If you're a X-Man fan you'll be disappointed by the main characters mutations, if you're a thriller fan you'll be disappointed by the villain.\r\n\r\n**When to watch:** The only scenario I would recommend you watch this movie is if you are die hard fan of one of the actors (Even still you might be disappointed)\r\n\r\n**How to fix this movie:**\r\n\r\n1. Replace the villain, stop trying to make this a weird horror crossover and focus on what made X-Man good to begin with. A PROPER VILLAIN.\r\n2. Far to much focus on the poorly written backstory for each main character.\r\n3. Make the Mutations better! The super powers should make the audience want to be them.\r\n4. Cut the cheesy dialogue and pick a clear genre, this is a toss up between, Sci-Fi, Action, Horror, Romance, Cheesy B Level Movie.", "created_at": "2020-11-16T18:02:04.768Z"}, {"movie_id": 340102, "review_id": "5fb4b467d1a893003fdb5983", "rating": 5.0, "review_text": "As both a horror and X-men fan, I was looking forward to this mashup since the first trailer dropped. Even recently with mostly bad reviews and press, I wanted to see it for myself. \r\n\r\nAnd ... it pretty much sucked. That doesn't bode well for future work from Josh \"The Fault in my Stars\" Boone (e.g. \"The Stand\" mini-series. \r\n\r\nWe pretty much know the gist from the trailers. Young mutants are haunted/harassed by something in a mental hospital. \r\n\r\nThe best parts are pulled from the X-men series in which mutants first find out their powers, typically represented effectively on screen. Most times these scenes are fun, but the special effects are a mixed bag, jumping back and forth from decent to cheesy. \r\n\r\nMost of the ensemble cast are relatively new up-and-coming stars such as Maise Williams (\"Game of Thrones\"), Anya Taylor-Joy (\"The Witch/Queen's Gambit\"), and Charlie Heaton (\"Stranger Things\") but the acting is mediocre, and worst of all, they butcher whatever accent they are supposed to have (Irish, Russian[?], and U.S. southern respectively). \r\n\r\nAnd the story -- disappointing to say the least. \r\n\r\nIf you drop your expectations to a bad 90 minute \"Buffy the Vampire\" episode, then maybe you'll find something to like.", "created_at": "2020-11-18T05:43:03.587Z"}, {"movie_id": 340102, "review_id": "60c655412da8460070b437b3", "rating": 8.0, "review_text": "Surprisingly great watch, will likely watch again, and do recommend.\r\n\r\nMy expectations of this one were rock bottom: I honestly didn't think much of the trailer.  I thought they were ruining \"The New Warriors\", my mistake, and I didn't realize they gender bent a character I was already familiar with.  (Moonstar is basically another guy character from \"The Initiative\" in Marvel Comcs)\r\n\r\nWhat is really interesting, and NEVER ADDRESSED is what the facility is, who runs it, and what the point is.  There just aren't answers to be had so simply during an uprising.  Honestly worst part of the movie, but unless you're paying too much attention, you probably won't even notice.\r\n\r\nThe characters are deceptively interesting, to the point where I was actually surprised at certain points, but they are what makes the movie.  The discovery of the characters, they're evolution as a team, and their personal struggles are what makes the movie great.\r\n\r\nIt is also FILLED with action after a certain point, beautifully rendered and weighted combat with something somewhat meaningful behind it.\r\n\r\nIf you're into super powered action on any level, then give this a watch.", "created_at": "2021-06-13T18:58:09.008Z"}]