[{"movie_id": 404368, "review_id": "5c44023b0e0a266d69d27886", "rating": 5.0, "review_text": "Gets right into the \"Internet\" part of _Ralph Breaks the Internet_ real early in the piece, and scarcely plods along ever-after. I was surprised that I enjoyed the first _Wreck-It Ralph_ movie, but I was expecting a step down in quality for this one, which I absolutely got. There's still some things to like, and even the core message is an important one we don't see much of, plus i'm sure this will work as a movie for kids, which to be fair is its target demographic, I'm just saying I don't think I'll ever come back to see Ralph break the Internet a second time around.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-01-20T05:08:11.412Z"}, {"movie_id": 404368, "review_id": "5f469dc3efca000037ba4fda", "rating": 8.0, "review_text": "Marginally exceeds the original, at least in my eyes.\r\n\r\nThe internet setting works way better than the video game world. Don't get me wrong, I very much enjoyed <em>'Wreck-It Ralph'</em>. I just think this one feels much more relatable, the vast majority of viewers understand the internet as opposed to the smaller market for old arcade games. For that, it means you can do some much more with the premise. All the references are amusing, while the inclusion of the Disney world itself is pretty cool.\r\n\r\nI do have a few critiques, of course. The run time is about 20 minutes too long, while the final act isn't as great as it could've been. Everything else, though, they get mostly spot on. It's very entertaining, the end credit scenes are terrific too.\r\n\r\nJohn C. Reilly (Ralph) and Sarah Silverman (Vanellope) are again very good, Jane Lynch (Calhoun) and Jack McBrayer (Felix) are marginalised but I'd argue that's fine - there's not much more you could do with those two characters. Alan Tudyk returns too, albeit in a new role as KnowsMore. I'm not usually a fan of same actor/different character, but that newbie is fun. Taraji P. Henson (Yesss) and Gal Gadot (Shank) are two newcomers, Gadot's character is more memorable but both are up-to-scratch.\r\n\r\nI really like this <em>'Ralph Breaks the Internet'</em>, it's a rare Disney animated sequel that has strong quality.", "created_at": "2020-08-26T17:37:07.444Z"}, {"movie_id": 404368, "review_id": "5f6dd36fa0b6900036426a1b", "rating": 8.0, "review_text": "Great watch, will watch again, and do recommend.\r\n\r\nEven if you haven't seen the first one, you can watch this just fine.\r\n\r\nAs much as I like this movie, the best part is by far the cg animated Disney Princesses: what a good tease for new CG movies, which they should have been doing instead of the live action garbage.\r\n\r\nAgain, as much as I like this, it is a bit of a deviation from the first movie with a bit of a mixed antithetical message to it.  While the first movie focused on Ralph and his quest dragging collateral damage in its wake to eventually bring the characters together in a spirit of inclusion, this movie scales up in a weird way, showing the internet as a place of connected inclusion and then \"wrecking it\".  Even the main story line is about Ralph's mission to fix things so they can maintain a status quo and Vanellope's search for change and \"the new\".  It's literally about how they shouldn't be together, or maybe that they're still together even if they aren't.\r\n\r\nIt just gets weird real fast, and while J.C. Reilly and Sarah Silverman do a great job with their roles, you've got to operate with some suspension of disbelief that they can do any of what they're doing or that it makes any sense.  They also deviated with how Ralph \"wrecks\" things.\r\n\r\nOnce you get past some of the nit-picky stuff, they're on a well structured adventure filled with charm and wonderment with lots of interesting characters.\r\n\r\nI honestly would be surprised if anyone actively disliked this.", "created_at": "2020-09-25T11:24:31.698Z"}, {"movie_id": 404368, "review_id": "6592f28f4f9a99738e7837da", "rating": 5.0, "review_text": "Six years after \"Ralph\" and \"Vanellope\" put paid to the aspirations of the evil \"Candy King\", she's getting a bit tired and restless with their daily life in the arcade. He decides that he can use the internet to make her \"Sugar Rush\" game more exciting, but all they end up with is a broken steering wheel and a real struggle to get it repaired before the whole game is permanently unplugged! Off into the very fabric of the web they must travel where they encounter the \"netizens\" and \"Yesss\" - the ultimate in trend-setting. What i just didn't like here was the style of animation. It's very two-dimensional with some really basic background CGI effects to prop up an extremely dialogue heavy series of escapades that just reminded me of \"Tron\" with too many words. There are a couple of redeeming scenes that do shine a light on just how complex and intricate the functioning web actually is, but they are tangential to a weak story with two characters that look like happy meal toys. I didn't love the first one, bit it was way better than this derivative stuff.", "created_at": "2024-01-01T17:12:47.366Z"}]