[{"movie_id": 73873, "review_id": "62ef3c4d7d5504007bb6d489", "rating": 4.0, "review_text": "**Glenn Close shone in one of the most interesting films she's made in recent years.**\r\n\r\nGlenn Close is undoubtedly a great actress, with a lot of credit, even if she has terrible bad luck at the Oscars, with eight nominations and eight letdowns. I've seen several works that she really puts a lot of effort into, and this film is just one more. She had already played the same character on Broadway before, but this time in addition to being an actress, she was still dedicated to scriptwriting, production and other details. So, the film entirely bears the imprint of this great artist.\r\n\r\nBased on a fictional text, the film introduces us to a mature woman who, after a life of difficulties, decided to hide her gender and disguise herself as a man in order to work. So, Albert Nobbs is a shy and withdrawn woman who never lived a full life because of this lie. Her dream is to save enough to start her own business. He finally meets someone in a similar situation to her and gains the courage to woo Helen Dawes, a chambermaid at the same hotel where he works... but she's not entirely genuine in the way she lets herself be wooed. She has a boyfriend who is interested in Nobbs' savings.\r\n\r\nThe film has an excellent initial premise and that works very well, but the truth is that the characters are too dense for a film that I would classify as a “light drama” given the inability to create a more tense and more serious atmosphere. To make things more difficult, the film is extremely slow and most of the characters don't evoke any sympathy, and they weren't particularly well-thought-out.\r\n\r\nThe strongest point of the whole film is Close's enormous multipurpose exercise, who writes a song for the film, helps with the script, produces and still acts wonderfully. She gives Nobbs a typically British composure and sheer shyness that I thought suited the character. Mia Wasilowska does what she can and makes the most of her beauty and charm, but the character seems shallow and uninteresting. Aaron Johnson doesn't look bad to me either, but the truth is that he, like Pauline Collins and Janet McTeer, had almost no screen time. They are actors who have been set aside.\r\n\r\nTechnically, the film has low-key production values ​​and successfully seeks to set its story in the Dublin city of the late 19th century. The props, costumes and sets are what you would expect in a good movie. Cinematography is average, editing is not very good, dialogue is decent but not particularly good. The soundtrack has moments of quality and a lot of inspiration.", "created_at": "2022-08-07T04:15:09.970Z"}]