[{"movie_id": 1696, "review_id": "5e0725424c1d9a0013e1343a", "rating": 8.0, "review_text": "The _Empire Strikes Back_ of the Firefly Family franchise. Firstly because they're both the middle entry in their respective trilogies, and secondly because I gave them both the same rating. And I say that knowing full well how much the film community at large will look down on me for admitting it. But I don't care. This is a fantastic movie. Probably Zombie's best. Mm, second best. After _Halloween II_. Which is also the best _Halloween_ movie.\r\n\r\n...Now they're really coming for me.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2019-12-28T09:49:54.738Z"}, {"movie_id": 1696, "review_id": "641d9242befb09010d013976", "rating": 3.0, "review_text": "**Between black comedy and disgusting horror, it's not a movie that wants to be taken seriously.**\r\n\r\nRob Zombie is a decidedly strong stomach man. His musical curriculum could be enough to prove it, but we still have his horror films, full proof of his taste for blood and shocking scenes. Personally, I'm not a fan of excessively bloody films, I think that the blood and deaths in a horror film shouldn't be indiscriminate, it ends up being counterproductive and having a perverse effect, as if we got used to it, making this type of resource less effective.\r\n\r\nThis film is the sequel to “House of 1000 Corpses”: starting where it ends, it shows us the siege of the decrepit Firefly house to arrest or massacre that family of degenerates. They manage to escape and will spread panic in the region, while the local police try everything to catch them. To understand this film, therefore, I recommend first seeing the film that gives rise to these events (and which is just as violent and disgusting as this one). However, I felt that this film has a slightly better script than its predecessor and that it tries to at least create a good story, \"Bonnie & Clyde\" style, with cultural references to Ned Kelly, Ma Barker and others.\r\n\r\nThe slash subgenre, to which this film belongs, has a legion of fans and some renowned films, namely the “Saw” franchise. They are films filled with violent deaths, infamous acts, obscenities and graphic content. I already expected this here. What I really don't understand is how Zombie tries to introduce comedy into a movie like this. Even dealing with black humor, attempts to introduce humor end up cutting the atmosphere.\r\n\r\nBack to characters they already knew, Sid Haig and Bill Moseley continue to do a great job as actors. They dominate the film and their characters are both comic (it didn't work for me but…) and brutal and sadistic. Sherry Moon Zombie, who is the director's wife, gained more prominence in this film, where she appears naked (or almost) in several scenes. The veteran and prestigious Leslie Easterbrook (who most people will remember for her performance in the comedies of the “Police Academy” franchise) replaced Karen Black, but I confess that I felt at various times that the actress did not fit into this type of material. The film also features other well-known actors such as William Forsythe, Ken Foree, Danny Trejo and Taylor Maine.\r\n\r\nTechnically, the film has some points that deserve to be highlighted, starting with the use of good special effects and good digital resources, which the director took full advantage of. We cannot fail to observe with some pleasure the richness of detail in the sets and costumes, and the good work of the camera. The soundtrack features several well-known songs, and contributes to not taking the film too seriously.", "created_at": "2023-03-24T12:06:26.848Z"}]