[{"movie_id": 38575, "review_id": "54f5f880925141240e000057", "rating": 5.0, "review_text": "A Karate kid which practices Kung Fu for a bad re-make.\r\n\r\nOnly Jackie Chan could be saved from this movie.", "created_at": "2015-03-03T18:08:00.245Z"}, {"movie_id": 38575, "review_id": "589c4322925141254b00358f", "rating": 10.0, "review_text": "Well, the theme of the movie is the same as the original Karate Kid BUT this movie is actually not about karate but kung fu. The comedic parts and the dramatic parts are just right. The action is okay. There weren't much especially from Jaden. He just got some action in the end. But then it's enough for the film considering kids will be watching this movie.\r\n\r\n\r\nJaden Smith is amazing in this movie. I kept on saying that Will and Jada Pinkett made a good investment in their son. Just like his parents, he's a great actor. He's good in both drama and comedy. He did well in this movie. There were even \"kilig\" moments with him. I just love him. \r\n\r\n\r\nJackie Chan is of course amazing as well. His character was an older man but that didn't stop him from having a fight scene of his own. We all know he has great comedic timing but I was really impressed when he did his dramatic acting in this movie. It's a different Jackie Chan. And that's what makes him great. He has always something to surprise his audience with.\r\n\r\n\r\nJaden's nemesis is also great. He's scary. But I like the pictures of behind the scenes in the end because it showed that he's not that scary after all. He looks like a nice guy who's friends with Jaden.\r\n\r\n\r\nMy rate for this movie is A. It's a great movie for everyone and I'm not even surprised that it's a box office hit.", "created_at": "2017-02-09T10:23:30.886Z"}, {"movie_id": 38575, "review_id": "5d677ab4aaf8970010fa6900", "rating": 2.0, "review_text": "I can not understand which was the purpose of this remake . A really bad choice . A movie which was 100 times worst than the original one . It was a waste of time for me . I am a huge karate kid fan but this one was one of the worst remakes i have ever seen .", "created_at": "2019-08-29T07:11:48.555Z"}]