[{"movie_id": 341012, "review_id": "57aceffec3a3682063000173", "rating": null, "review_text": "This movie could have been hour HBO special and been just as good if not better but it's still a pretty funny movie! Read my full review here.\r\n\r\nhttp://www.hweird1reviews.com/allreviews/popstar-never-stop-never-stopping-review", "created_at": "2016-08-11T21:37:02.105Z"}, {"movie_id": 341012, "review_id": "57d0ddc3c3a3684b3e003397", "rating": 4.0, "review_text": "Perhaps for someone who is more engrained in the pop culture of the day, this would be a success. It's not that I didn't understand the references, it's just that I didn't care.\r\n\r\n_Final rating:★★ - Definitely not for me, but I sort of get the appeal._", "created_at": "2016-09-08T03:40:51.645Z"}, {"movie_id": 341012, "review_id": "57f40e16c3a36805ac0002c4", "rating": 7.0, "review_text": "**A fun film, but also very sensible.**\r\n\r\nThe title clearly says it is a parody of 'Justin Bieber: Never Say Never'. I haven't seen that, but this film was so fun. Just like another 'Walk Hard: The Dewey Cox Story'. If you like the combination of music and comedy, this is for you. I think the writing was the best thing, even the lyrics of the songs. The directors did their part very well, but in the end it was the actors who saved the film. Andy Samberg was splendid.\r\n\r\nThe film was narrated in a documentary style like a series of interviews which also includes behind scenes, I mean unedited clips like the live recording. It is the story of three members of a famous band in America. When everything was going well for them, the split happens unexpectedly. So the main singer decides to go solo and sees some success. But he struggles through his girlfriend and their marriage plans, and also he finds some issue with his manager. You know the makeover begins, how he comes back to his normal life was the remaining film.\r\n\r\nIt is not anybody's biography, but you should still watch it. The storytelling is not preoccupied with the drugs and sexes, though there are some amounts, which makes it is good viewing for the adults. Don't think it is some silly comedy, lots of things from it makes sense. You can enjoy the music and at a time you would have some laughs. Well balanced contents and overall it is a rare comedy.\r\n\r\n_7/10_", "created_at": "2016-10-04T20:16:22.531Z"}]