[{"movie_id": 381890, "review_id": "57b502979251413cf300007b", "rating": 4.0, "review_text": "> A modern Chinese fairytale.\r\n\r\nThis is from one of the renowned filmmaker from China, Stephen Chow. The film holds the numerous records, including the highest grossing Chinese film of all time. So anybody would be curious enough to check it out. This is highly inspired by the western fairytale 'The Little Mermaid', but totally a Chinese. It carries a strong message about the marine life and pollution, especially that coming from China is obviously not usual. A great theme for a Mandarin film to get exposed to the International stage. An appreciable effort with the decent graphics, but it's filled with lots of negatives than leaving a good impression on the viewers.\r\n\r\nThe story is very important for a film and this is a very simple and short, but the remaining is packed with the comedies and stunt sequences. The film opens with the introduction of a multi- billionaire Xuan, who unveils his new sonar project on the coast Green Gulf where marine creatures consider it as a paradise. On the other side the shrunken to a very few, the merpeople plot to kill him. So they send their finest young mermaid, Shan to seduce him, but instead it creates a chaos when she falls in love with him. The final standoff between the man and merfolks set to reveal who will be the victorious at the end and the fate of Green Gulf.\r\n\r\nIf you are a die-hard fan of Stephen Chow, be prepared for a big disappointment. He's out of his comfort zone here. Thankfully, he did not star in this crap. His strength are comedy and martial arts, but this film was none of them. I mean it is categorised as a comedy, but those parts were too sensitive to call them jokes. You won't be laughing much because of the killing, hurting, tortures, kind of upsetting events draws us away from enjoying it. So if you think it is a cute mermaid love story aimed for children just like CJ7 and if you allow them to watch it, you might regret it later.\r\n\r\n> \"Love has no law. It is beyond any rules and boundaries.\"\r\n\r\nI don't know what is the rating for the domestic release, but this is definitely an R. It is certainly for adults and not everybody going like it. Looks like a film made for the local market only despite the influence of the western fairytale. It might have done well in Chinese box office, but the rest of the world does not consider it Mr. Chow's one of the best works. I think he should stay away from such project in the future, instead make a sequel for CJ7 or for the 'Kung Fu Hustle' where his fans are very eager for the official announcement.\r\n\r\nIf you had seen all his film, especially the directed ones, then you might enjoy some of the jokes from this which is his trademark. The romance was underdeveloped and then the event followed by it that brings the grand finale was too violence. That is when this fantasy-comedy turns an action-thriller without a forewarning. I was shocked for such kind of transformation in the story. I wanted to like it, but could not because I expected something like a Disney film, but it was more like a semi Tarantino film.\r\n\r\nThe addition of a cecaelian character was good from the comedy perspective. But just one from its kind makes him the last survivor and have sympathy than as he's the centre of the comedy in the narration. The overall story as well as all the main characters were never established to its full potential. I'm disappointed with the writing, the director is known for genuine screenplay, but he terribly failed to please his international fans. Of all, I only hope there won't be a follow up to it because we want the old Stephen Chow. He's better than this and I'm sure he will come strong. I can't recommend this film for children or the families, the youngster who are not very sensitive might be the right audience.\r\n\r\n4/10", "created_at": "2016-08-18T00:34:31.228Z"}]