[{"movie_id": 77174, "review_id": "535b95c00e0a264fe500151a", "rating": 8.0, "review_text": "Mom, tell the Zombie to stop saying stuff about me!\r\n\r\nThe medium of animated films has really gone through the roof in the last 20 years. There was a time when Disney was the only reliable source for such colourful frolics. Now we are blessed with a whole raft of film makers creating their own animated films born out by their personal visions. One of the benefits of this \"branching out\" has been the rise in the animated horror comedy, right up there with the best of them in recent times is ParaNorman.\r\n\r\nNorman Babcock is considered to be the weird kid in town, you see he claims to see ghosts. Little do the residents of this New England haven know it, but they will soon need Norman to break a centuries old witches curse or they are all doomed!\r\n\r\nPicture unfolds in a delightfully quirky nature, with the makers showing great love and respect to both the genres it appertains to. As with the best animated films, ParaNorman manages to be an all encompassing family friendly production. The chilly thrills are the right side of child friendly, the animation craft superb, while the humour is smart and the Gothic atmosphere surrounding the tale is pitch perfect. It all builds nicely to a bona fide thrilling finale, where the visual spectacle sits comfortably with the emotional beats of the film. Lovely, intelligent and spooky into the bargain. 8/10", "created_at": "2014-04-26T11:17:20.062Z"}, {"movie_id": 77174, "review_id": "5f9343be84448e00619a1381", "rating": 7.0, "review_text": "Really good watch, could watch again, and can recommend.\r\n\r\nThis is surprisingly dark, and underrated.  While the animated characters are almost grosteque in their stylization, it serves fairly well when it comes to the undead.  It also pushes the boundaries of it being a \"kid's\" movie or an \"adult's\" movie in it's content.  So this is probably a movie for \"older younger\" audiences.\r\n\r\nNot only is this a great concept, effect execution, and story, the characters that do pop, really do.  I honestly could have done without a few of them, but most of the important characters work for what they need to do.\r\n\r\nThere is a much appreciated \"twist\" that examples some self-aware story telling that comes with the tropes typically involved with \"I see dead people\" stories.  Its really rather refreshing without removing the idea that burning witches at the stake was an atrocity in history.\r\n\r\nThe story is touching and charming and just requires an open mind, which is part of the message of the story.", "created_at": "2020-10-23T20:57:34.260Z"}, {"movie_id": 77174, "review_id": "637b9d897719d7007d848911", "rating": 7.0, "review_text": "His parents think he's a bit bonkers, but \"Norman\" swears that he can communicate with his deceased grandmother (especially when she wants the central heating turned up!). When his uncle tells him that his unique skills might help with a ritual that could spare their sleepy town from a curse, he agrees to help - but oops! Next thing, the place is awash with zombies and it falls to \"Norman\" to figure out just what originally caused the curse and to find a way - together with his popular sister and his new found, and rather unlikely, friends - to annul it before it is too late! This is a fun family adventure with some strong characterisations (including the really enthusiastic voice talent of Kodi Smit-McPhee in the title role) and some superbly detailed stop motion animation. The writing is frequently quite pithy with plenty for the grown ups to smile at, and think about, as the story progresses. Though hardly original - the story itself has everything from \"Salem's Lot\" (1979) to \"Hocus Pocus\" (1993) running through it - it's still an enjoyable watch that lends itself well to a big screen to better appreciate the colourful vivacity of the creative artistry and lively Jon Brian score. Sure, their heads are bigger than the rest of their bodes combined, but the facial expressions are what makes this and I rather liked this film.", "created_at": "2022-11-21T15:47:21.722Z"}]