[{"movie_id": 420634, "review_id": "5d34e0e22f8d090388d4540e", "rating": 8.0, "review_text": "Terrifier is a gory movie with a sadistic killer clown that revels in mutilating his victims in creative ways and willing to use any kind of improvised weapon as well as one not often seen in slasher movies. The movie makes effective use of practical effects and the gory murders are graphic enough to make you know this movie means business. David Howard Thornton stars as Art the Clown and his portrayal is devilishly effective as a villain who is mute and must use facial gestures to express himself in his ghoulish clown makeup. The story is the usual cat and mouse variety but this film is more about watching Art capture, torture and mutilate his victims. Terrifier is an effective and bloody slasher film that follows the usual formula of 1980's horror films and has crowned Art the Clown as one of the new faces of horror.", "created_at": "2019-07-21T22:02:10.366Z"}, {"movie_id": 420634, "review_id": "634db9861089ba0082f09165", "rating": 3.0, "review_text": "_Terrifier_ had a lot of hype behind it with its very successful sequel hitting theaters this month, and unfortunately it did not translate to a pleasurable viewing experience. Before I jump into my criticisms of the film, the on-screen quality of visuals and effects were top notch for a budget of a mere $25,000. It is amazing what this crew was able to do with their conditions and everyone involved should be proud. With that being said, the limited budget does not give excuses for a poor script, dialogue and performances. This movie had a tremendous amount of cringe with perverted dialogue that seemed as if a middle schooler wrote it. The performances were campy, but not in a good way. In classic horror films the camp has a sense of nostalgia and a sign of the times but with this modern film with kills and elements that are taking themselves somewhat seriously, it just comes off as bad. The actor behind Art did do a fantastic job though. His portrayal of a mute killer who communicates to his victims with mimes and clown tricks was funny and chilling at the same time. The plot on its face did not have much depth to it. It boiled down to people in the wrong place at the wrong time. There was no added depth or lore to why these events were happening, although I did enjoy how each character who was tragically murdered had a connection the plot and were not just some random people introduced and killed in a single scene just to pad the kill count. As horror film, this movie failed to add any stakes or tension. The director leaned more into the gore which can be unsettling to look at but never made me feel uneasy. There was no build up to any of the kills, these classic horror elements made the movie seem extremely bland. Overall, I think this film is a marvel from a technical perspective based on its low budget, but when judging it from a film perspective it left me bored and waiting for the credits.\r\n\r\n**Score:** _33%_\r\n**Verdict:** _Bad_", "created_at": "2022-10-17T20:22:30.837Z"}]