[{"movie_id": 970948, "review_id": "6545d53e6beaea012c8dd893", "rating": null, "review_text": "A true rom-com for grown-ups. \r\n\r\nYou'll have to forgive me for the length of this. I'd written a solid 500-ish words explaining everything about this and then one errant cat step on a mouse and here we are: a new tab with the old review gone for good. \r\n\r\nThis feels like it's from an alternate reality where Gerard Butler didn't kill of rom-coms in American cinema in the 2010s and, instead, the field got to thrive like its 90s heyday. \r\n\r\nDuchovny and Ryan are charming as hell, which is to be expected in a movie that's literally just three credited people. The two of them, plus the person voicing the airport's PA system. \r\n\r\nGiven this is a rom-com directed by Meg Ryan, queen of the 90s rom-com, and it's dedicated to Nora Ephron, even the simple premise of \"two people who used to love each other are snowed in at a regional airport\" is given a little heightened reality juice. \r\n\r\nWhile Ryan is not above getting cheesy with it (the airport is basically sentient in how the 'magic' of the day keeps both characters together), the movie also shows some truly adult restraint. It doesn't just give you what you expect from a rom-com for free. There's a maturity to it all. \r\n\r\nI think the best compliment I can give this movie is it's like a good play where the actual sets seem to melt away. As you learn more about both characters, the more they tell stories, and because it's frigging Meg Ryan and David Duchovny they have the chops to capture you into those stories to the point you feel like you saw it happen in a flashback. \r\n\r\nAn absolute blast to watch. I hope it performs well enough to show trimming the fat off a budget and just making a damned good romantic comedy is both possible and profitable. A solid 9/10. I can't wait to get a physical copy, put it on a shelf, and treat myself to a rewatch every few months when the genre winds blow in the right direction.", "created_at": "2023-11-04T05:23:10.566Z"}, {"movie_id": 970948, "review_id": "65845c04e295b43bc76915f5", "rating": 5.0, "review_text": "Trapped in an airport by a meteorological \"snowbomb\", we are introduced to two people with the same name - \"W. Davis\". One, \"Willa\" (Meg Ryan) is trying to get to Boston with her rainstick; the other \"Bill\" (David Duchovny) is heading for a meeting with his new whizzkid boss in Austin. Why do we care? Well - in theory because the two used to date twenty-odd years ago and so after a little tentative, polite, conversation they decide to reminisce and drag us along for the ride. In practice - we ought not to care at all. Right from the start this has the look of a stage play to it - and not a very interesting one at that. The two are all we have to concentrate on as their narrative becomes more and more uninteresting, their characters become less and less engaging and were it not for the very occasional interventions of the airport voice - some sort of omnipotent diviner of truth and reconciliation, we might all be just plain bored. Essentially, this is simply an over-written and underwhelming 1¾ of contrived melodrama that includes just about every tragic emotion known to man, all a whilst surrounded by the least convincing CGI snow storm I think I have ever seen. There's little, or no, chemistry on display and it ends about four times more times that it needed to... If I ever met two people like this at an airport, I think I would need a very large bar! Trading on the names of two people very, very, far from their peak and I suspect it'd be more likely heads banging on the table this time...", "created_at": "2023-12-21T15:38:44.929Z"}]