[{"movie_id": 534, "review_id": "500ece6f19c295594f0033b2", "rating": null, "review_text": "What can I say about this movie, its amazing! full of explosions and action. The setting is slightly different than other terminator films but I like this new \"survival\" setting more so than the older terminators. Terminator 2 was and always will be my favourite terminator movie but this one sure comes close, defiantly my second favourite terminator movie.\r\n\r\nThere is only so much a review can tell you but this is a must watch movie for any one who has not seen it yet.", "created_at": "2012-07-24T16:33:51.000Z"}, {"movie_id": 534, "review_id": "50950a25760ee369ec001532", "rating": 7.0, "review_text": "worst of the terminator series", "created_at": "2012-11-03T12:12:21.000Z"}, {"movie_id": 534, "review_id": "58a854b09251415671008faf", "rating": 6.0, "review_text": "What can I say about Terminator Salvation? It's a decent addition to the Terminator series, but has major issues. Some would say that it is the worst of the series, but I disagree. T3 will always hold that top honor for me. \r\n\r\nIt was nice to see the return of Kyle Reeese. It was a different look at a character that was forgotten to quickly. John Connor was a bit stale and I wanted way from his character. \r\n\r\nIt was nice to see this future everyone spoke about in past films, Problem was this film felt darker than all the others, excluding T1. The first film was pretty dark but had a storyline And an R Rating to back that up. This film just didn't feel like it belonged to the Terminator world. And a few nostalgic lines and visuals did nothing to make it feel like it was part of the franchise. \r\n\r\nAll of that being said, the film still had some decent action scenes and some interesting moments. It's not bad, but its not fantastic either.", "created_at": "2017-02-18T14:05:36.257Z"}, {"movie_id": 534, "review_id": "5e86c3053f7e1d00175d6748", "rating": 6.0, "review_text": "I know that even amongst the rocky track record of the _Terminator_franchise, _Terminator Salvation_ is not especially well-liked. I've always been a little bit of an outlier when it came to this series though; like everyone else, I know the first two are the only great ones, but to me, it's actually not _T2_ that stands at the top of the pile, but _The Terminator_, the first film. And since that first film, we've copped 5 new runs at a _Terminator_ movie. Out of all 5 of them, _Salvation_ is the only one that tried something different from the first one. Even the lofty success of _T2_ was garnered using the same core concept as the original movie. _Salvation_ hits something new, and while that obviously doesn't work for a lot of its audience, for me, it's the best movie outside of the first two that the franchise has made to date.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2020-04-03T05:00:53.171Z"}, {"movie_id": 534, "review_id": "60f5c79bf1759c0046616dda", "rating": 6.0, "review_text": "_**Wall-to-wall post-apocalyptic action needed more time to breathe**_\r\n\r\nThe first couple of Terminator films are easily two of the greatest sci-fi/action flicks in history. The problem with the third one, more than anything else, was that it was largely just more of the same; and you can only recycle the same plot so many times before it gets stale. This explains the filmmakers’ decision to set this fourth installment (2009) in the post-apocalyptic future where the machine-controlled Skynet is at war with the surviving humans, otherwise known as The Resistance.\r\n\r\nA few characters from the previous films are featured: An older John Conner (Christian Bale), his dad Kyle Reese (Anton Yelchin), who's actually just a teenager here (such are the complexities of time travel) and the T-800 Schwarzenegger Terminator (CGI face, of course). Beyond these we get some new characters, the best being Marcus Wright (Sam Worthington), followed by Blair Williams (Moon Bloodgood). Also on hand are: Conner's mate, Kate (Bryce Dallas Howard), a mute girl named Star and Helena Bonham Carter in a peripheral role.\r\n\r\nOn the surface everything is of the highest filmmaking caliber. The problem is that there's not enough character development or intriguing respites. So what we end up with is a plot that strings together a bunch of cool post-apocalyptic action sequences with people who are constantly grim, shouting and killing, but we barely know them and therefore hardly care. It's like putting on an extreme metal cd that's full of hyper drumming, buzzsaw riffing & screeching/grunting vocals from beginning to end. There are no valleys to contrast the over-the-top highs and so it cops a samey-sounding, dull vibe. In other words, the very energy and excitement meant to impress & move the consumer backfires due to overkill. That's why they call it \"overKILL.\" It's a curious thing but all too true.\r\n\r\nBe that as it may, there are enough positive elements in “Terminator Salvation” to make it worth checking out if you’ve seen the first two films. For instance, Marcus Wright is an intriguing protagonist who thinks there's no good in him until he is informed otherwise. At around the 45-minute mark there's a good campfire scene in the desert between two characters sharing a warm moment in a world gone mad. The film would have been more effective if it contained more scenes like this. But there's a decent revelation in the second hour concerning one of the main characters. Meanwhile Bryce Dallas Howard has a uniquely beautiful face (although she’s pregnant throughout the story). There are also some interesting ruminations about the nature of being a human and being a machine, or both.\r\n\r\nBottom line, if you love action, you'll get it here. There are motorcycle-bots, fish-bots, giant-bots, flying-bots and Schwarzenegger-bots, all trying to terminate the protagonists. Since the events take place in a post-apocalyptic world it’s reminiscent of films like “Beneath the Planet of the Apes” (1970), “Mad Max: Beyond Thunderdome” (1985) and, especially, “Reign of Fire” (2002), albeit with constant outrageous thrills.\r\n\r\nThe first two films in the series successfully captivate the viewer from the get-go and the suspense builds to avalanche proportions. Even the third installment accomplished this to a lesser degree, although the plot was old-hat by that point (2003); still, it was a decent entry. \"Terminator Salvation,\" on the other hand, only captivates marginally in preference for wall-to-wall action. That's too bad, but it has its moments; it's thankfully not as bad as \"The Mummy Returns\" (2001) in this regard. Not to mention it'll likely play better on repeat viewings in light of the convoluted plot.\r\n\r\nThe theatrical release runs 115 minutes and the director's cut 118 minutes. The film was shot in New Mexico.\r\n\r\nHere's how I grade each of the Terminator outings (I have yet to see the sixth one):\r\n\r\nT1: A+\r\n\r\nT2: A+\r\n\r\nT3: B+\r\n\r\nT4: B-\r\n\r\nT5: C+", "created_at": "2021-07-19T18:42:35.297Z"}, {"movie_id": 534, "review_id": "63bf721fa5743d00c3be8ff4", "rating": 1.0, "review_text": "So... this was awful. It was just kind of pointless, but at least (unlike the new ones that seem to want to destroy the Terminator franchise) it fit into the series. So, you know, it COULD have been worse. At least Salvation seems like a continuation of the Terminator movies.\r\n\r\nThat's about the best thing that could be said about it.\r\n\r\nBale really stinks it up, but then again, it's an MCG film and he really doesn't know how to handle things. He splices it together, scene by scene, with no uniformity or any real transitions to lead the viewer through the story, and does so with a convoluted plot that does, kind of, make a little bit of sense... kind of.\r\n\r\nThe John Connor scenes are terrible, the everything scenes are really terrible, and you only have one or two moments that actually feel like they are coming from a Terminator movie and not a second rate clone.", "created_at": "2023-01-12T02:36:15.468Z"}]