[{"movie_id": 8321, "review_id": "5e077c31eda4b700172c4029", "rating": 9.0, "review_text": "There are good movies. Then there are great movies. And then there are perfect movies. Movies like In Bruges fall in the last category.\r\n\r\nBut what is In Bruges? It's a simple story of two hitmen hiding in Bruges, Belgium, while waiting for further instructions from their boss. It is a relatively simple story. Even the cast lacks any star names. Then what makes this film \"perfect\"?\r\n\r\nWell, pretty much everything. You see, rarely do we see a film which makes us feel a range of emotions; In Bruges is one of those films. We laugh in the absurd and often downright offensive jokes; we sympathise with the characters' woes in life; we feel scared at the bullets flying in the crowded Belgian streets. We \"feel\" everything when we are watching this movie. It's not a movie, it is an experience.\r\n\r\nThis character-driven movie is cinema at its finest. It's a must-watch for everyone who wishes to know why British humour is loved around the world. If nothing else persuades you, just watch it to see Colin Farrell deliver a performance of a lifetime.", "created_at": "2019-12-28T16:00:49.029Z"}, {"movie_id": 8321, "review_id": "5e5a6acd55c92600174e7fe4", "rating": 8.0, "review_text": "In a fairytale city with a couple of foul mouthed hit men.\r\n\r\nRay (Colin Farrell) & Ken (Brendan Gleeson) are two Irish hit men who are sent to lay low in the beautiful city of Bruges by their gangster boss Harry Waters (Ralph Fiennes). As they wait for instruction from Harry the pair start to address many things that are troubling them, with one pressing matter particularly relevant to their lives post the Bruges visit.\r\n\r\nWritten and directed by Martin McDonagh, a man more known for his play writing abilities, In Bruges is a rare old animal indeed. Not only is it a winner in the very wobbly sub-genre that encompasses the British gangster movie, it's also a hugely funny and tasteless button pusher to boot. From the outset the film sets itself up to not be to everybody's cup of tea. As Colin Farrell and Brendan Gleeson exchange expletive after expletive whilst surrounded by the considerable beauty of Bruges, it's obvious this is not going to be a \"normal\" movie. Throw in drug abuse, prostitution and a racist dwarf, well you can understand why the film is seen as unpalatable to some - yet still be digestible brilliance to others. What is for sure is that those who haven't seen it really should do so for it may just become one of your favourite movies, yes, it really does deserve the chance to pull you on board.\r\n\r\nBy definition, it's an ultimate black comedy, But in amongst the laughs, and there are many, lies a potent and affecting human drama involving love, guilt, morals and redemption. With the trick pulled by McDonagh being that of having every character in the piece dislikable, and yet easy to be on side with. Don't be surprised if you find yourself welling up with emotion during some of the more critical scenes. For the screenplay (BAFTA Award Winning) and the performances of Farrell (Golden Globe Award Best Actor) & Gleeson are razor sharp and very involving. Even Fiennes' spiv gangster boss is shown to be a ruthless sweary anger merchant, yet still capable of apology and genuinely respective of good principals. If that sounds odd? Then good, because it's an odd and strange little movie. I mean the love interest comes in the form of pretty Clémence Poésy, a criminal femme fatale type here, but once \"Fleur Delacour\" in \"Harry Potter\" & \"The Goblet Of Fire\". While Canadian dwarf actor Jordan Prentice is more well known for playing \"Howard The Duck\". Each of them serving genuine purpose, both for the funny side of the story, and for the more humanistic elements that unravel as we hurtle towards to the coup de grâce a like finale.\r\n\r\nA barbed wire black comedy led by a towering performance from Farrell - where just like him you should laugh, cry and swear to your hearts content. 9/10", "created_at": "2020-02-29T13:44:45.684Z"}]