[{"movie_id": 499701, "review_id": "5d71e9ccfa78cd0012dd87f9", "rating": 8.0, "review_text": "This is legit Indiana Jones/Tomb Raider/National Treasure for kids - nothing and no-one is sexualised and there’s no violence, aside from the slapstick kind. Plus the humour is fantastic and friendly, and the film even pokes fun at the original TV show in a really great way. Everything is vibrant and exciting, and who doesn’t love a monkey sidekick and a thieving fox? Dora is annoyingly positive every step of the way (don’t worry, it’s a thing) and she sings about everything from her backpack to pooping (don’t be alarmed, I swear it’s still a thing). ’Dora’ also boasts great messages about fitting in and being yourself as only a teenager still rocking the same haircut, pink t-shirt and orange shorts can do.\r\n- Jess Fenton\r\n\r\nRead Jess' full article...\r\nhttps://www.maketheswitch.com.au/article/review-dora-and-the-lost-city-of-gold-dora-meets-indiana-jones-and-a-song-about-poop", "created_at": "2019-09-06T05:08:28.652Z"}, {"movie_id": 499701, "review_id": "5dc612006f8d950017c3d342", "rating": 6.0, "review_text": "The first 15 minutes of this movie had me worried. As someone who has never seen \"Dora the Explorer\", the in-jokes (outside of her talking to the audience early on) were completely lost on me. The scenes at the high school were pretty hard to watch, but once she and the group are in the jungles, I didn't mind it so much and the third act very much felt like an homage to Raiders of the Lost Ark.\r\n\r\nIsabela Moner was wonderful and not at all obnoxious in the lead and the other teenage-aged actors were alright, but Eugenio Derbez is still an awful actor and the style of humor is certainly aimed at a younger audience. Even so, it was a lot better than I expected. **3.0/5**", "created_at": "2019-11-09T01:10:24.672Z"}, {"movie_id": 499701, "review_id": "5f28a0c5869e7500375c1477", "rating": 7.0, "review_text": "Really good watch, would watch again, and can recommend.\r\n\r\nThere are a lot of confusing aspects to this movie that definitely hurt it, but it starts high enough each time, you just kind of personally pause and then the movie continues as if it wasn't a thing.\r\n\r\nThe only thing that persists as a problem of casting beautiful adults in the role of children (I just kept going, they don't look like kids), and while I don't remember how much time passes until Dora goes to American high school, it can't be senior year because they have another year after the movie.\r\n\r\nI'm pretty sure College Humor covered this joke/problem when they had Ariel Winter (\"Modern Family\") as Dora and she was 15, but maybe that was the point: yeesh, what a minefield to navigate.\r\n\r\nThe movie is very well produced, the story is actually well written, and at one point I had the thought that this could have been an Indiana Jones plot with some expected tweaks.\r\n\r\nThere are a few things that just break the experience, and I don't just mean all the cringe moments when you put jungle girl into high school.  \r\n\r\nShe's literally insane, they address it multiple times in the movie, and it's the opening scene.  Fortunately she's such a likeable character that you forget, until it's convenient to remind you.\r\n\r\nThe animals: spoiler or not, the crazy cg animals really mess with your suspension of disbelief and bring you out of the movie: there is literally a plot armor moment where they just make the solution \"an animal does something impossible\".  And they talk about it, there are multiple discussions about these animals doing impossible things.\r\n\r\nIt really is a good movie, and I think it is designed the way it is to be family friendly.  Worth taking the time to watch.", "created_at": "2020-08-03T23:41:57.796Z"}]