[{"movie_id": 120, "review_id": "51ea51a4760ee3602024a27e", "rating": 10.0, "review_text": "Brooking no argument, history should quickly regard Peter Jackson’s The Fellowship Of The Ring as the first instalment of the best fantasy epic in motion picture history. This statement is worthy of investigation for several reasons.\r\n\r\nFellowship is indeed merely an opening salvo, and even after three hours in the dark you will likely exit the cinema ravenous with anticipation for the further two parts of the trilogy. Fellowship is also unabashedly rooted in the fantasy genre. Not to be confused with the techno-cool of good science fiction, nor even the cutesy charm of family fare like Harry Potter, the territory of Tolkien is clearly marked by goo and goblins and gobbledegook. Persons with an aversion to lines such as, “To the bridge of Khazad-dûm!” are as well to stay within the Shire-like comforts of home (their loss).\r\n\r\nWith those caveats in place, it bears repeating: fantasy does not come finer. There are electrifying moments — notably the computer-assisted swooping camera through Isengard as it transforms into a factory for evil — when Jackson’s flight of fancy approaches the sublime as the romantic poets would understand it: inspiring awe.\r\n\r\nLeaving aside the thorny issue of Tolkien die-hards and their inevitable gripes — “What no Tom Bombadil?” — Jackson’s screenplay (written in collaboration with Fran Walsh and Phillipa Boyens) is both bolder and more judicious than Steven Kloves’ surprisingly timid retread of Harry Potter. In particular, rescuing the romance of Arwen and Aragorn from the footnotes and the elevation of Saruman to all-action bad guy actually has a corrective influence on Tolkien’s often oblique and female-sparse source material.\r\n\r\nThere are problems, though. The three-hour running time is high on incident and low on discernible form. After successive detours to Elf habitats Rivendell (the watery home of Elrond) and Lothlórien (the forest home of the Lady Galadriel), the uninitiated might well ask why these crazy Elf kids can’t just live together and spare us all this attenuated dramatic structure.\r\n\r\nMore importantly, the action clearly climaxes in the desperate flight from the Mines Of Moria, where the largely seamless SFX is showcased in the best possible light — total darkness — but the narrative demands a different, downbeat ending. Indeed, but for some fine emotional playing from Bean, Mortensen, Astin and Wood, the final fight might feel like a particularly brutal game of paintball in Bluebell Wood. But then, the real battles are yet to come...\r\n\r\n\r\nVerdict - Putting formula blockbusters to shame, Fellowship is impeccably cast and constructed with both care and passion: this is a labour of love that never feels laboured. Emotional range and character depth ultimately take us beyond genre limitations, and it deserves to play as wide as a certain Mr. Potter.\r\n\r\n5/5\r\n\r\n- Colin Kennedy, Empire Magazine", "created_at": "2013-07-20T09:00:20.421Z"}, {"movie_id": 120, "review_id": "59f99302c3a3682d7b0111da", "rating": 10.0, "review_text": "An epic movie if I ever saw one. Captivating and just plain fun to watch. This movie is, indeed, art.", "created_at": "2017-11-01T09:25:22.233Z"}, {"movie_id": 120, "review_id": "5aa3628dc3a3687bfc004d51", "rating": 7.0, "review_text": "Tolkien’s adventure/fantasy LOOKS and SOUNDS fabulous, but is not without flaws.\r\n\r\nRELEASED 2001 and directed by Peter Jackson, “The Lord of the Rings: The Fellowship of the Ring” adapts the first part of JRR Tolkien’s popular fantasy trilogy about adventures on Middle-Earth. The story starts in the homeland of the Hobbits (innocent, diminutive humanoids) where Frodo (Elijah Wood) is instructed by the noble wizard Gandalf (Ian McKellen) to quickly leave the Shire with the powerful One Ring in his possession. Gandalf and Frodo are later accompanied by seven others, the titular ‘Fellowship of the Ring,’ to take the ring to the only place it can be destroyed, the fires of Mount Doom in Mordor. \r\n\r\nThe rest of the main cast include Sean Astin (Sam), Viggo Mortensen (Aragorn), Sean Bean (Boromir), Christopher Lee (Saruman), Orlando Bloom (Legolas), John Rhys-Davies (Gimli) and Hugo Weaving (Elrond).        \r\n\r\nThis three-hour fantasy features a diverse cast of colorful characters, quaint beings and settings, moments of genuine wonder, dark ee-vil creatures, high adventure, thrilling brutal action, a superb score, magnificent locations (forests, mountains, rivers, etc.), and wondrous CGI sets. The film LOOKS and SOUNDS so great that it’d be sinful to give it a lower rating. \r\n\r\nThere are problems, however, at least for those who aren’t uber-fans of Tolkien. For one, the opening is hindered by prologue that is overlong and convoluted, not to mention unnecessary. The bulk of it could’ve been conveyed later via flashback, which they do a little bit anyway. Secondly, the story takes forever to build any drive. Thirdly, except for maybe Frodo and Gandalf, the characters are shallow and I didn’t care much what happened to them. Fourthly, main protagonists getting seriously wounded and everyone else expressing their melodramatic concern gets redundant.  \r\n\r\nFifthly, there are only two females in the main cast (Liv Tyler as Arwen, a half-Elf princess, and Cate Blanchett as Galadriel, a royal Elf); unfortunately, their parts aren’t much more than glorified cameos. “Mythica: A Quest for Heroes” (2014) cost LESS THAN $100,000 to make, which is a mere fraction of the $93 million it cost to make this blockbuster and the filmmakers knew enough to include a couple of prominent babes as key protagonists in the story. \r\n\r\nDespite these negatives, “The Fellowship of the Ring” is the best of the trilogy and is a must for fantasy/adventure aficionados, especially Tolkien fans.                      \r\n\r\nTHE MOVIE RUNS 2 hours 58 minutes and was shot in New Zealand. \r\n\r\nGRADE: B/B- (6.5/10)", "created_at": "2018-03-10T04:43:57.981Z"}, {"movie_id": 120, "review_id": "5c15adc5c3a36866cc3713d9", "rating": 8.0, "review_text": "Overall, I give this four stars.  Not five, because some of the changes really bug me, as a long-time Tolkien fan, but a solid four.  \r\n\r\nThe casting, to start, was brilliant.  Sean Astin was the absolute perfect choice for Sam, and did a remarkable job bringing that character to life for us.  He really WAS Sam, in this role, in a very deep way.  I always liked his acting, but here, he showed how talented he actually is.  Just amazing.  Elijah Wood gives a great performance of Frodo, and those expressive eyes of his really add a lot of depth to the emotions the character goes through, which are such an important part of the story.  Billy Boyd and Dominic Monaghan both did great work, for our other two main hobbits.  Their smiles, their singing; just every aspect of these characters was so real.  Viggo Mortensen, of course, was excellent.  He's always good, and though I never would have pictures him as Aragorn, he delivered everything we could hope for.  Great choice for that role!  John Rhys-Davies, as expected, gave us the Gimli we wanted.  Phenomenal actor, and I can't imagine anyone doing that role better.  Orlando Bloom plays a convincing Legolas, and handles the nuances of being an elf quite well.  Sean Bean as Boromir was outstanding, bringing the strength of that character to life, and making us love him.  Then we have Ian McKellen, as Gandalf.  I could never have chosen someone for that role, but the casting folks hit a home run with this one.  Everything about his character was just right.  Literally everything.  I can't read the books without seeing these people in these roles now.  The rest of the cast ws good as well.\r\n\r\nThen we have the setting.  New Zealand has to have some of the most utterly gorgeous scenery on the planet.  Seeing it in these movies was great, and convincingly Middle Earth, and seeing more since, in other videos, just WOW!  Thanks, to the people of New Zealand, for allowing this to be filmed there!  \r\n\r\nThe sets were just fantastic.  Everything looked as good as I'd always hoped it would look, with all the charm, mystery, and wonder  Tolkien fan could hope for.  From Bag end to Rivendell to the vastness of \r\nMiddle Earth, everything we saw was just right.  \r\n\r\nThe only issues I had were some of the changes.  Yes, I know things don't always work in movies as they do in books, but when whole sections are just omitted, that bothers me.  It's not like the movies weren't long already!  That omitted section, with which Tolkien fans will be quite familiar, was a very important part of the plot!  I also didn't care for some of the other changes, and the way Arwen was used, the scene at the river being one example.  \r\n\r\nAll in all, though, this was a well done movie, and even though some things bug me, this film, and the rest of the series, will be viewed many times.  Classics, worth collecting and treasuring.", "created_at": "2018-12-16T01:43:33.548Z"}, {"movie_id": 120, "review_id": "5f5ea32c156cc70038db737b", "rating": 9.0, "review_text": "Lost count how many times I've seen the \"The Fellowship of the Ring\" but still fantastic after all these years, epic on every level and just all around entertaining, the 3.5 running time just flies by. Will be watching \"The Two Towers\" either tonight or tomorrow followed by \"The Return of the King\". **4.75/5**", "created_at": "2020-09-13T22:54:36.297Z"}, {"movie_id": 120, "review_id": "5fa9aeb521621d003ff9c55f", "rating": 8.0, "review_text": "Well, I wouldn’t read this review if you are a true fan of fantasy adventure epics, because I am not. Don’t get me wrong, I like this movie and have watched it a few times over the years, but I have watched  (or read, for that matter) very little else in the fantasy  genre. I didn’t get too far into the Game of Thrones as the violent rapes got old for me fast. \r\n\r\nSo I watched this first entry of the Lord of the Rings trilogy as just a viewer, not a fan, and I liked it just fine. The complex plot held together well and the scenery was gorgeous. There was violence, but not gore, and for those who don’t like war movies, there wasn’t as much of it here as there is in the other two films of the trilogy.\r\n\r\nI gather the elfin roles for women were enlarged and brought to the fore, and why not; women were mostly good for setting mead and large pieces of rare meat down on tables in front of their warrior men.\r\n\r\nI must confess, I found it jarring that the warriors like Strider were so invincible, walking into a horde of sixty orcs and scattering them like toy soldiers with his sword. I know they are epic heroes, but if I’m an orc, I stand back and throw something or whatever, but it is similar to the old legends with semi-gods like Achilles, back when Hector was a pup.\r\n\r\nI am not going to compare the film to the book — I read it decades ago when I was in high school. It is worth watching and though real fans will take this with a large grain of salt, I think it is possibly the definitive adaptation of the book. (I need to watch the other two entries in the series before I say the same about those.) if you are among the 12% percent of movie goers who haven’t seen it, give it a try.", "created_at": "2020-11-09T21:03:49.600Z"}, {"movie_id": 120, "review_id": "602b1ecbab5e34003f9ffdfc", "rating": 10.0, "review_text": "Magnificent! A great start to the franchise.\r\n\r\n<em>'The Lord of the Rings'</em> is yet another film series that I am incredibly late to viewing, at least I've finally got around to it... albeit almost twenty years on from this film's release.\r\n\r\n<em>'The Lord of the Rings: The Fellowship of the Ring'</em> is delightful. I never know what to expect from a film that goes on for nearly three hours, the pacing has to be near perfection for it to work - and boy does it here. The run time flew by, which is always a terrific sign.\r\n\r\nI love a load of things about this, the one that actually sticks out most is the outstanding score. Music can play a huge part in how much I enjoy a film, so I'm delighted to say that the score is here is fantastic. That is by no means the only positive, obviously.\r\n\r\nThe cast are excellent. Elijah Wood gives a strong performance in the lead role. I've seen Wood in others things down the years and have actually found him a bit hit-and-miss, but here he is very good. Elsewhere, I really enjoyed watching Viggo Mortensen's character.\r\n\r\nAway from those two, there are a whole host of noteworthy cast members. Orlando Bloom, or Will Turner to me, is involved, as are the likes of Ian McKellen and Sean Bean. I also liked Liv Tyler in her role.\r\n\r\nThe look of the film is spectacular, and has aged extremely well even to this day. Everything from the cinematography to the costumes is brilliant, those two things really make the film come alive - helped by the aforementioned score, of course.\r\n\r\nVery eager to check out the sequels, prequels and, eventually, the upcoming television series.", "created_at": "2021-02-16T01:24:27.766Z"}, {"movie_id": 120, "review_id": "643e2300e0ca7f050906cedd", "rating": 10.0, "review_text": "This film may be perfect.\r\nBased on the fantasy world written by Tolkien, we see the halfling hobbits, the most unlikely of heroes, a breed of human type beings who indulge in pleasures, games, and fun, and do little evil.\r\nIn the same world are more powerful beings, some good, like the elves and wizards, some evil, like the orcs, trolls, and dragons, and some in between, like the dwarves and men.\r\nAnd one evil super being, Sauron, the second in command to the \"devil\" of this world called Middle Earth, and that devil called Melkor is now in chains and powerless, so Sauron rules all evil.\r\nThat said, we get a very faithful version to the book, only improved. This is the first of three segments called \"The Lord of the Rings\". The parts left out are parts best left out. Tom Bombadil, for example, along with his wife, represents a very Hitler like Aryan ideology of supremacy that Tolkien often engaged in. \r\nThe film begins with a narrative and action sequence that is awesome, and then goes into the \"status quo\" setting of the \"shire\" of hobbits, much like the status quo setting of films like \"Women of Dolwyn\".\r\nFrom there, we get an amazing story of four hobbits who embark on a journey of utmost importance, joined by a wizard, an elf, a dwarf, and two men.\r\nThe direction is stunning. The motivation even better explained than in the Tolkien books. This is a masterpiece.", "created_at": "2023-04-18T04:56:32.176Z"}, {"movie_id": 120, "review_id": "64f2e8f197a4e600c487b64e", "rating": 8.0, "review_text": "So now that the picture houses across the UK are beginning to reopen, this is the third film I've settled down to watch in front of a huge big screen - and it's a belter. You can only wonder at the sheer imagination of JRR Tolkien and of Peter Jackson, Fran Walsh & Philippa Boyens as they adeptly adapt this epic tale of power for a new generation. Certainly, it over-hams the accents - maybe just a few too many \"rrrs\" in \"Arrragorrrrn\" but otherwise it's a feast for senses. When the hairy-footed Hobbit \"Bilbo\" (Sir Ian Holm) gets to eleventy-one he sets off to write his life-story with the elves. He leaves his possessions - including a mysterious ring - to Frodo (Elijah Wood). When visiting wizard \"Gandalf\" (Sir Ian McKellen) identifies it as the epitome of wickedness that puts all of their lives are in danger, \"Frodo\" and his lifelong friend \"Sam\" (Sean Astin) must flee their bucolic happiness. This first instalment of the trilogy tracks the journey of the hobbits as they meet \"Stryder\" (Viggo Mortensen) and together try to evade the pursuing wraith attempting to get to \"Elrond\" the Elvish king in \"Rivendell\" and decide what is best to do with this evil, seemingly indestructible talisman. Their only solution proves to be returning the ring to the lava-filled cavern of \"Mount Doom\" where it was forged: only there can it's corruption be defeated. The brave hobbits, together with two men, an elf and a dwarf set out to accomplish this all but impossible task fighting the weather, evil orcs, malevolent magic and the harsh terrain on their treacherous way. It's the ultimate fantasy adventure; that sticks to the spirit, if not to every word, of the original work. The effects both in make-up and from the computer are expertly applied creating a real sense of tension and peril that compliments, rather than subsumes, the actual action and beautiful cinematography of the New Zealand scenery through which our intrepid gang must travel. This is probably the weakest of the three episodes as it takes a good hour to get going; but once it does and the \"Fellowship\" takes firmer form with a superb John Howard-Davies; a handsome Orlando Bloom and even the usually wooden Sean Bean raises his game to give us as a truly cracking, at times quite scary adventure that is magnificently scored by the inspired Howard Shore. This is not really a film that works on the telly - however large the screen may be. To do justice to the creativity of all concerned it just has to be given the respect it deserves and be seen in the cinema. If you get a chance, you should go see it (again!).", "created_at": "2023-09-02T07:49:05.394Z"}]