[{"movie_id": 74534, "review_id": "4fce77e4760ee365510004f1", "rating": 8.5, "review_text": "This is an excellent movie with a great cast. Before seeing the movie I saw one review categorizing it as having Benny Hill style comedy. I did _NOT_ see that at all in this movie. In fact, one criticism that I have is that I'd liked to have seen a little more comedy.  One of the characters is truly over the top, but not slapstick.  But regardless this movie flows elegantly start to finish without being overly saccharine or morbid or falling back on what you might expect for comedy involving the elderly.  This film won't move you like Slumdog Millionaire but it is a quality film in its own right.", "created_at": "2012-06-05T21:19:32.000Z"}, {"movie_id": 74534, "review_id": "5ebafb0411c066001f226d4a", "rating": 10.0, "review_text": "This is easily one of the best films I have ever watched. I cannot put it into words that will describe my feelings towards the film. From the very beginning to the very end, the characters were introduced excellently.\r\n\r\nYou feel a strong bond for each and every character. Every single one of them are so relatable, as if this was a reality show and not a film.\r\n\r\nEspecially in the days when most of the world continues to live repetitive lives due to the COVID-19 pandemic, more and more people question the ordinary lives we all have. This film can be the one spark you need in your life to start over.\r\n\r\nWould I watch this again? Absolutely! Would I make my friends watch it? Without a doubt!", "created_at": "2020-05-12T19:37:40.664Z"}, {"movie_id": 74534, "review_id": "64d741c2d100b600ada116f7", "rating": 7.0, "review_text": "We've all read brochures that extol the virtues of an hotel or resort (or maybe even read the effusive nonsense MUBI write about their daily, \"hand-picked\" film selection) so we won't be surprised to learn that when a selection of elderly Brits arrive at the ramshackle \"Exotic Marigold Hotel\", they are sure to be surprised. Recently widowed \"Evelyn\" (Dame Judi Dench), curmudgeonly \"Mrs. Donnelly\" (Dame Maggie Smith) and retired High Court Judge \"Dashwood\" (Tom Wilkinson) are amongst this motley collection who must adjust to their new lives in this vibrant and frenetically different city - all whilst under the watchful gaze of the enthusiastic, but pretty hapless young, and loved-up, hotel owner \"Sonny\" (Dev Patel). Yep, it plays to just about every stereotype in the book. That can either ruin it for you, or serve as quite a fun conduit to tackling some of these pre-conceived ideas and in some cases - from both cultures - hold them up to a bit of humorous scrutiny. The characters are possibly a bit too much of a potpourri of society. Gay, straight, happy, sad, lonely - you name it, but the character actors engaged here - especially Celia Imrie and Ronald Pickup, I found - help to dismantle the template of ignorance that prevails at the start of this light-hearted comedy. The writing is often effective at illustrating that age (or declining health) is not necessarily a barrier to happiness and fulfilment, and though this film is very much more on the simplistic side of an evaluation of race, religion and creed - it's not meant to be a documentary. It's an enjoyable bit of cinema that does raise a smile.", "created_at": "2023-08-12T08:24:34.035Z"}]