[{"movie_id": 37958, "review_id": "5214832a760ee36dfb09ec2f", "rating": 3.0, "review_text": "Total failure of doing a movie with the aesthetics and success of \"300\".\r\n\r\nMediocre story, bad planned action scenes, tons of Fx, poorly developed characters and tons of stereotypes.", "created_at": "2013-08-21T09:06:50.660Z"}, {"movie_id": 37958, "review_id": "5f1d65900bb0760033f12620", "rating": 4.0, "review_text": "Everyone talks about how _Immortals_ is a _300_ ripoff, and don't get me wrong, it absolutely is, but I haven't yet seen anyone talk about how it's also a bit of a _God of War_ ripoff.\r\n\r\nI'm actually quite fond of historically-set mythology films, but I don't believe the problem with _Immortals_ isn't the setting or the genre, it's the motivation behind its being made the way it was. The _300_ movie exists to be an adaptation of the _300_ comic book, the _Immortals_ movie exists because the _300_ movie made money. (Don't get me wrong, I know that the real motivation behind both these, and of any other studio film, is money. But someone involved somewhere has to want more from their movie than that. And _Immortals_ doesn't give me the vibe that anyone did).\r\n\r\nI can handle _Immortals_ doing what _300_ does. Hell, if enough people rip an idea off over a long enough period of time, in movies, we call that a genre. My issue is that it **only** exists to do what _300_ did, yet it does **all** of it so much worse. There are maybe two fights in _Immortals_ that last for longer than 30 seconds, even with all that slow-mo stretching the runtime, and neither are filmed as well as the ones in _300_. It's nowhere near as fun, it's not superior in any technical category, it's harder to tell what the fuck is going on. Even the acting, which is NOT _300's_ strong suit, is worse here than it is there. There were maybe flashes where you could glimpse a cohesive idea that desired to form, but it never even got close.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2020-07-26T11:14:24.788Z"}]