[{"movie_id": 785084, "review_id": "634aff4768b1ea007a6cbfd3", "rating": 8.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/the-whale-spoiler-free-review-lff-2022\r\n\r\n\"The Whale earns its place in the \"most tearful films of the year\" list as it moves slowly yet efficiently towards its overwhelmingly emotional ending, especially elevated by the most subtly powerful & irrefutably moving performance of Brendan Fraser's career.\r\n\r\nThe rest of the cast contributes to the construction of a character with whom tremendous compassion is produced, but it isn't an easily digestible movie due to its disturbing, uncomfortable moments.\r\n\r\nDarren Aronofsky presents a depressing, passionate, and, above all, brutally honest story about trauma, acceptance, and positivity. The filmmaker's lack of restraint may be a trigger for some, but the impact of his messages couldn't be more memorable.\r\n\r\nBring tissues.\"\r\n\r\nRating: B+", "created_at": "2022-10-15T18:43:19.092Z"}, {"movie_id": 785084, "review_id": "63daabe5a9117f0083ff7656", "rating": 8.0, "review_text": "The Whale is a heart breaking story of our main character, Charlie (Brendon Fraser), as he tries to make amends for abandoning his daughter. Charlie is obese, an ailment that has manifested itself as a coping mechanism for a life of regret. In every scene and interaction this regret is worn by Charlie as a cloak of his past that will stay with him until his dying breath. This character is an immense undertaking and Brendon Fraser plays him perfectly. The emotion he delivers is palpable, which lends itself so seamlessly to scenes of raw sadness and despair. Not only is Fraser a highlight, but the entire supporting cast does an excellent job. Hong Chau is superb, and despite her tough, no nonsense, science focused exterior hides a deep and genuine connection with Charlie. She is incredibly hurt by the way he is treating his body, but is defenseless to his desires, resulting in her to continually feed his addiction. It is a brutal back and forth that is tackled with immense care. Sadie Sink is great as well, she is delivers a brutal performance that leaves the character of Ellie easily hatable with very little redeemable qualities. I understand that this was the point of her character, and by no means is this a knock on Sink's performance, but it felt like a bit much. She was too cruel, to the point of unbelievability, which took a bit away from the message that was trying to be delivered. The pace was a bit slow for my liking. I felt as if the Thomas subplot was a bit pointless and could have been cut from the movie with no ill effects. But despite my minor complaints, the movie is carried by fantastic performances, amazing cinematography and intense emotions that will leave many viewers pleased with their experience, but will not be for everyone.\r\n\r\nScore: 82%\r\nVerdict: Great", "created_at": "2023-02-01T18:13:57.073Z"}, {"movie_id": 785084, "review_id": "63e4d9062e2b2c00849fde60", "rating": 7.0, "review_text": "Yikes, but this second gay-themed outing for Brendan Fraser could hardly be more different from his 1998 \"Gods and Monsters\" one. Here his is the critically obese \"Charlie\" who has grown to a size where his health is in tatters and he has virtually no mobility as he regularly consumes two large pizzas for dinner and two great meatball subs for lunch. We learn quite quickly a little of what initially drove this man to this level of despair and as things begin to look terminal, we share his aspirations to reconcile with his daughter whom he left eight years earlier to be with his gay lover \"Allan\". Now for all I thought Fraser was superb in this film, I found Sadie Sink's performance as the truly selfish, conniving and odious daughter \"Ellie\" (upon whom he rather dotes) stole this for me. At times I really did want to shoot her! Ty Simpkins also does well as the well meaning god-squadder who finds his association with this dysfunctional family helps open his eyes too. Hong Chau performs well as his long suffering friend/nurse/confidante \"Liz\", and as mortality looms the characters are drawn into an increasingly angry, hostile environment that is full of bitterness, rancour and regret certainly, but maybe - just maybe - the slightest hint of reconciliation. Fraser will never deliver another performance like this again. Sure, his size and generally slothful demeanour are so far from the hale-fellow-well-met series of characters we have seen thus far in his career that they are bound to have an effect. His acting, though, is honest and emotional. His character is torn and distraught and he conveys that potently, especially in the scenes with his obnoxious daughter. The plot has an inevitability to it, which doesn't usually work so well for me - but here, it helps focus on the few interlinked stories and characters allowing little room for distraction. It's not without it's humour now and again, either. I've deliberately avoided reading about how he got to that size - somehow, knowing might spoil what is undoubtedly a tour de force from both him and Miss Sink. Brave and uncompromising - well worth a watch.", "created_at": "2023-02-09T11:29:10.110Z"}, {"movie_id": 785084, "review_id": "63ea643dd388ae007d2abe52", "rating": 10.0, "review_text": "I doubt I can add much more to what has already been said about <em>'The Whale'</em>, but in a word: Bravo!\r\n\r\nBrendan Fraser truly is sensational in this role. I heard about all the acclaim and seen a few of the standing ovations he has received and all I can say is that it is unequivocally deserved. Truly outstanding from the first scene (yes, even with that... ha) to the very last. It's great to see the dude that I first saw as a kid in <em>'<a href=\"https://letterboxd.com/film/george-of-the-jungle/\">George of the Jungle</a>'</em> well and truly back in the game.\r\n\r\nOne thing about Fraser getting all the (undoubtedly merited) plaudits from this Darren Aronofsky flick is that I didn't know what to expect from the support cast, and man are there some absolutely stellar performances behind Fraser. Sadie Sink, Ty Simpkins and Samantha Morton are top notch, though Hong Chau is a cut above that trio - brilliant stuff from her!\r\n\r\nThere are some powerful scenes in there. I'm not one to cry with fictional works (my brain automatically knows it's 'fake', I can't help it) but man even I got major goosebumps and gut punches (pardon the pun?) from what's portrayed onscreen. Fraser, and Chau, are naturally the major reasons for that, but everyone - on and off the screen - deserves big props for this 2022 film.\r\n\r\nThe definition of a must-watch.", "created_at": "2023-02-13T16:24:29.087Z"}, {"movie_id": 785084, "review_id": "6416738a0d5d8500f2d6c621", "rating": 9.0, "review_text": "I like this one.\r\nIt really made me feel something.", "created_at": "2023-03-19T02:29:30.754Z"}, {"movie_id": 785084, "review_id": "6420291d53466100aa0004cc", "rating": 9.0, "review_text": "write something honest\r\n\r\nAny movie directed by Darren Aronofsky contains a lot of violent scenes that are unfamiliar and hard on the eyes to see. Darren Aronofsky is a director whose work must be eagerly awaited because one of his films, Requiem of Dream 2000, is one of my favorites.\r\n\r\nThe most important event in the movie The Whale is the star Brendan Fraser, after suffering from many health problems, especially with the spine, and was forced to perform surgeries, in addition to the withdrawal of lights and fame from him, and his playing movie roles that didn't achieve wide success.\r\n\r\nBrendan Fraser played a terrible role that deserves an Academy Award due to his genius performance, and you do not expect this wonderful acting performance from him, especially since he is an actor who is very good at comedy roles. He did a lot of dramatic work, but he didn't reach perfection like the one in the movie The Whale.\r\n\r\nThis amazing drama was like a oneman show although the other actors did well but the main reason for my admiration for the movie is Brendan Fraser. It was the make-up and the way the breathing was unbelievable and it's mind blowing how someone can pull off such a role\r\n\r\nThe film was shot in only one location, with the exception of the flashback scenes. Sadie Sink It was provocative from the first minutes, getting on your nerves and pushing you to throw something on the visual medium through which you watch the movie, whether it is a mobile phone, a laptop, or even in theaters.\r\n\r\nHong Chau has an incredible charisma and addition to any work, even if she didn't appear much, and I wish to see her in many scenes, she is wonderful.", "created_at": "2023-03-26T11:14:37.758Z"}, {"movie_id": 785084, "review_id": "6444d30a651fcf04b29da7a9", "rating": 9.0, "review_text": "**By: Louisa Moore / www.ScreenZealots.com**\r\n\r\n_This film was screened at the Toronto International Film Festival_\r\n\r\nWhen thinking about “The Whale,” I feel it’s important to start at the end rather than the beginning because the melodramatic finale almost ruins everything that’s good about the film. The finale is grossly manipulative, corny, excessive, and if what came before wasn’t so great, it would diminish director Darren Aronofsky’s entire project. Thanks to a heartbreaking script (from writer Samuel D. Hunter) and a once-in-a-lifetime lead performance from Brendan Fraser, it takes little effort to overlook the film’s more negative aspects.\r\n\r\nBased on Hunter’s 2012 play of the same name, the psychological drama tells the story of Charlie (Fraser), a reclusive English professor who is living with severe obesity. Weighing over 600 pounds and unable to leave his home, Charlie spends his days alone in his small, dingy apartment with intermittent visits from his friend and nurse Liz (Hong Chau), who is his only companion. It’s been an interesting week for the man, as he’s had two additional unexpected visitors: a religious missionary (Ty Simpkins) who is compelled to continue his visits, and Charlie’s estranged and hostile teenager daughter, Ellie (Sadie Sink). With his health in grave decline (he repeatedly refuses to seek care at a hospital), Charlie decides to do everything in his power to gain one last chance at redemption in his daughter’s eyes, and every ounce of time he has left is spent reconnecting with her.\r\n\r\nThe film takes place in a confined space, and the lead character spends the majority of his time sitting on a sofa. This cramped setting feels suffocating, which in turn conveys the feelings that Charlie is also experiencing. This is a story about empathy, and it’s admittedly challenging at first glance to feel a ton of compassion for Charlie no matter how accepting you may think you are or claim to be. His outward appearance is shocking and repellant, and it’s part of human nature to look at him as if he were a freak show attraction. What’s interesting about the film is that it digs deeper beneath Charlie’s obesity and lets you into his heart. I was surprised to find by the end of the story just how much I had grown to care so deeply for him.\r\n\r\nFolks who have seen the film and are crying that it is “fat shaming” are missing the point. This isn’t a story about humiliation or degradation, it’s a film about actually seeing the person inside a repulsive exterior and giving them humanity. This is not a project that mocks obesity, as has so often (and sadly) been the case with many Hollywood films. This is a story with substantial and challenging themes about depression, mental illness, and addiction. In this case, Charlie has spent years self-medicating his despair and unhappiness with food, and is now suffering from an eating disorder that has raged out of control.\r\n\r\nNone of this would be so emotionally touching if not for Fraser’s lead performance. He is impressive and outstanding as Charlie, and it’s one of the greatest cinematic performances in years (and definitely of the actor’s career). It’s not the spectacle of the makeup or fat suit that makes him memorable: it’s how Fraser thoroughly embodies Charlie with a deep, soulful pain in his eyes. His performance absolutely ripped my heart right out of my chest to the point where I found it difficult to breathe. He’s _that_ good.\r\n\r\nWhile there’s been so much talk about Fraser, Chau’s performance is equally heartbreaking. Through her facial expressions and body language, you can see and feel the pain Charlie is causing Liz. Everyone is simply waiting for the man to die, and you’re right there by Liz’s side as she cares for her best friend in a final act of selfless affection. It’s an agonizing thing to watch and experience, and Chau conveys her torment in an understated, poignant way.\r\n\r\nIf it sounds like this is a tough film to watch, I will assure you that it is. You won’t leave the theater floating on air when it’s over. This is an adult drama that will leave you in tears with its story of resentment, vulnerability, regret, and humanity. That’s also why “The Whale” is one of the very best films of the year.", "created_at": "2023-04-23T06:41:14.611Z"}, {"movie_id": 785084, "review_id": "644857592fdec60573a09a39", "rating": 7.0, "review_text": "At least partly because this movie was based on a play, most of the action takes place in one room. Of course, the nature of the character’s health issues makes it hard for him to move around, but I think the limited setting worked against the film. Maybe it is just my eyes getting older, but the cinematography of The Whale seems to follow the current trend of being dark, dark, dark. Are they desperate to show the mood through lighting, were they trying to simulate the inside of a whale’s stomach, or is it less expensive to film in the gloomy interiors, or what? Would it kill them to turn on a light now and again?\r\n\r\nAnyway, the movie tugs at the appropriate heartstrings and throws a curve here and there, and is an excellent work of drama noir.", "created_at": "2023-04-25T22:42:34.017Z"}]