[{"movie_id": 168672, "review_id": "52c429bc19c295718d1211a4", "rating": null, "review_text": "Good", "created_at": "2014-01-01T14:44:12.932Z"}, {"movie_id": 168672, "review_id": "58d046c0c3a3682d720002d2", "rating": 6.0, "review_text": "American Hustle is has a heavy dose of Scorsese circa 1970s with the violence replaced more by black humour.\r\n\r\nChristian Bale, Amy Adams, Jennifer Lawrence, Jeremy Renner and Bradley Cooper all deliver excellent performances. Robert De Niro makes a cameo and reminds the audience why he was at one time the best screen actor in the world.\r\n\r\nThis is a black comedy-drama set in the late 1970's based on the true life Abscam scandal. FBI agents and con artists joined up to frame politicians for taking bribes.\r\n\r\nBale plays a pot bellied hustler with bad hair. Amy Adams is his partner in crime who passes off as an English Aristocrat. Both have struck it rich in a scam where they dupe arrangement fees for loans that never come to fruition.\r\n\r\nCooper is the ambitious FBI agent with a big ego who has the the mafia in his sights and wants to reel in a big catch but he might be out of his depth.\r\n\r\nJeremy Renner is the charismatic Mayor of New Jersey. A man with a big heart who wants to get things done and Bale feels guilty about getting him involved in the sting operation.\r\n\r\nDirector David O Russell gets great performances from his cast but the film feels flabby which blunts the story and the humour feels stretched at times.", "created_at": "2017-03-20T21:16:48.923Z"}, {"movie_id": 168672, "review_id": "5dfee8399824c80015e1017f", "rating": 8.0, "review_text": "A very well acted, directed, filmed movie telling an interesting story about terrible terrible people. I didn't like and couldn't root for anyone which /almost/ made me hate the film, but it was so well done and the story was interesting...so 4 stars.", "created_at": "2019-12-22T03:51:21.216Z"}, {"movie_id": 168672, "review_id": "63ba7dc3fc31d3007e314fb1", "rating": 6.0, "review_text": "Christian Bale has always been prepared to go the extra mile for his art, but I am not sure it was worth it for this rather lengthy and messy crime caper. He portrays con-man \"Irving\" who works a series of scams with his glamorous British partner \"Sydney\" (Amy Adams). They are quite successful, until - that is - they fall foul of aspiring FBI investigator \"DiMaso\" (Bradley Cooper) who decides he can use their skills to infiltrate the murky world the Mafia. Add to this potentially toxic scenario the politically savvy and aptly named \"Polito\" (Jeremy Renner) and the omni-presence of \"Rosalyn\" (Jennifer Lawrence) who just happens to be the wife of \"Irving\" and who is none too pleased about her husband's antics with his new colleague. What ensues here now is a clunkily thrown together series of escapades that all hang on certain aspects of the story and characterisations that just don't really work. The attempts at humour miss much more than they hit; the faux-gangster plot falls flat and lacks grit or plausibility and Adams' British accent (and therefore her identity) is all over the place - I doubt it would convince even Dick van Dyke let along the FBI! The attempts at building an intricate domino-style plot where it could all come a-tumbling down at any time are too contrived, and that jeopardy presents it's self once too often and with ever diminishing effect as the story rather lurches along to it's almost slap-stick denouement. Though it features an A-list cast, there is not much chemistry on display for us here and the whole thing just takes far, far, too long to get up any head of steam. It does look good, and the soundtrack offers an enjoyably eclectic mix of songs, but I just wasn't sold on the very wordy suckering and scheming, sorry.", "created_at": "2023-01-08T08:24:35.280Z"}]