[{"movie_id": 10972, "review_id": "5da9214bb2681f00128e8055", "rating": 10.0, "review_text": "Madness is just overactive curiosity. \r\n\r\nSession 9 is directed by Brad Anderson who also co-writes the screenplay with Stephen Gevedon. It stars Peter Mullan, David Caruso, Josh Lucas, Brendan Sexton III and Stephen Gevedon. Music is scored by Climax Golden Twins and cinematography is by Uta Briesewitz.\r\n\r\nDanvers State Hospital (AKA: State Lunatic Hospital at Danvers, The Danvers Lunatic Asylum, and The Danvers State Insane Asylum), Massachusetts. Built in 1874, opened in 1878 and closed in 1992. The home to misery, madness, tragedies and troubling treatments. Five men from an asbestos removal company, each with issues or points to prove, enter the vast bat shaped structure under the promise of a big pay off to get the job done in one week. But over the course of the week money will be the last thing on their minds.\r\n\r\nPsychological horror at its finest, Session 9, in the hands of Brad Anderson, pretty much gets everything right in this most skin itching of sub-genres. Like the ghost story splinter of horror, setting is absolutely everything, and few, if any? Horror settings are as imposing or eerie as the one time Danvers State Hospital. Sadly demolished in 2006/7 to make way for an apartment complex (bastard property developers have no respect outside of the purse), the place positively oozes unease throughout the movie. With Anderson choosing to shoot his film on videotape, this further aids the sense of realism and palpable dread, and although it isn't a stretch of the mind to think about some of the misery that played out in reality at Danvers, Anderson and his photographer Briesewitz ensure that it never leaves our conscious. Tone is set from the off as being slow burn, this is perfect as it allows us to get a grasp of the characters, their psychological make ups and narrative worth.\r\n\r\nWith the Danvers facility proving to be the extra character, all things come together seamlessly to gnaw away at the viewers. It's a devilishly odd thing to say, but as the story and characters are given room to breath, the audience who have immersed themselves in the picture will start to feel claustrophobic, and then for the night time sequences, even achluophobic. It's pitch perfect pacing by Anderson, who prior to unleashing the unnerving finale, has pulled us (and his excellent cast) slowly through a labyrinth of dank corridors, wards, treatment rooms, caged stairwells and a morgue. Even on the outside during daylight hours everything feels bleak, either with characters loomed over by the building, or on a roof chatting while Gothic turrets watch over them menacingly, the ghosts and bitterness of Danvers Hospital exist fully in Anderson's movie.\r\n\r\nStory links a tape recording found by Mike (Gevedon) with that of the workers' unfolding plight. The tape tells of 9 sessions with a troubled patient named Mary Hobbes, to say anymore would be spoilerish, but for the record in this writers eyes it's the creepiest tape recording in horrorville. Add in the odd hospital prop such as a lone wheelchair, a hydrotherapy bath or an orbitoclast! Well you get the picture I'm sure. Climax Golden Twins provide a suitably jarring score, where disjointed noises and elongated tonal strains further enhance the pervading disquiet. Picture only falls down slightly with silly plot error involving a furnace, and for some folk the ending will inevitably be met with dissatisfaction. I liked it plenty but I also feel they could have gone another way with it. But it does work well and isn't a cop out, and certainly it's better than the alternate ending available in the extras section of home disc formats.\r\n\r\nIt's a horror film aimed at a certain horror fan, the one who has the patience to enjoy slow burn psychological pin prickery. All played out expertly by cast and film makers at a naturally unsettling location. 9/10", "created_at": "2019-10-18T02:19:55.361Z"}]