[{"movie_id": 317557, "review_id": "5844ceb392514169d90102eb", "rating": 6.0, "review_text": "From a technical point of view, _Queen of Katwe_ is not a resounding success. There is bad audio, continuity errors, hammy dialogue, some very bizarre choices in cinematography and the occasional scene of poor acting.\r\n\r\nThe story however (while following a fairly predictable family-friendly line) is totally engrossing. Chess may not be the most engaging spectator sport, but the journey of lead-character Phiona is a thorough one, and an intriguing side-step away from the usual Disney setting.\r\n\r\nDavid Oyelowo is particularly worth looking out for. He (unsurprisingly) gives a fantastic performance.\r\n\r\n_Final rating:★★★ - I personally recommend you give it a go._", "created_at": "2016-12-05T02:19:31.803Z"}, {"movie_id": 317557, "review_id": "59cae0de9251412b98005478", "rating": 8.0, "review_text": "**A life changing game.**\r\n\r\nI am not a big fan of Mira Nair. But I like some of her films, particularly 'Amelia'. Because she usually prefers India and Indian subjects and cast as what she's. Outside that circle, she was not that successful, until now. It was a sport film, that revolved around chess game. Inspired by an incredible true story from the dark continent. It all happened less than ten years ago. Disney and ESPN together produced it. So when these two productions come together, you would know what to expect.\r\n\r\nSeeing the opening few minutes, it reminded me the recent New Zealand film 'The Dark Horse'. Kind of a similar film, but I was not that impressed with that. But this one was awesome. Simply a miracle. Like any fairy-tale from the Disney. She was not a princess, but in a way she turns to be one. Years ago when I reviewed 'Searching for Bobby Fischer', I said that was the film should be shown in the schools. Now add this title as well to the list.\r\n\r\nThe opening was the ending. Then followed the flashback, which went to the 4 years ago. Living in a slum of Katwe, a single mother raising her children, but not without their contribution to the family. Now the focus shifts to one of the family members, Phiona. Curiosity on her brother who disappears every day after sold out his goods leads her to a new path. That's when she discovers a game she had never heard of before. After learning the basics, she quickly picks up the rest of the game on her own and becomes a prodigy.\r\n\r\n> ❝Losing teaches me how to play better.❞\r\n\r\nThis is like most of the true stories you have seen, but that's the truth as well in here. What might come later could impress you. Because it was not like she has a superpower, so she can clear her life path just like that. Honestly, the real test begins now for her, how she uses her gift. But it was her coach who understood the situation, and tried his best to push her further with the big tournaments, in the national and the international level. Not just her, there has been a team behind her. So the remaining is to reveal how far she would go, as well as the story of her struggling family.\r\n\r\nThey have got the cast perfectly. Everyone was brilliant. David Oyelowo was amazing, surely one of my favourite British actors for now. This is the second consecutive time he's making a such impression. Not long ago with 'A United Kingdom'. Definitely the Oscars is just a corner. And then Lupita Nyong'o, she was not the centre of the story, but had enough part and she excelled every bit of it. The rest of the actors, including the one who played Phiona was amazing. At the end credit, both the cinematic and the real life characters appeared. I felt that was a result of excitement, but liked it.\r\n\r\nThe sad part was why such films were ignored at the big stages! This is a must see film, especially if you have a kid(s) in the home, show it to them. Being the parents, uncle and aunt, that's one of the best thing you would do for them. Because no one knows when and where kids gets their confidence boost, inspiration or discovering a new path. You can't compare films with real life, even it was a biopic. But still the true story always remains a true story, even after they're compressed to 120 minutes. Particularly the Disney film gets rid of harsh parts, making a family friendly film. So watch it for a change, you have no other reasons, you could be impressed!\r\n\r\n_8/10_", "created_at": "2017-09-26T23:21:02.489Z"}, {"movie_id": 317557, "review_id": "5fb34e66e24e3a003fea6ebf", "rating": 8.0, "review_text": "Excellent.\r\n\r\n<em>'Queen of Katwe'</em> is another Disney sports biopic, but one made with a difference - it doesn't hit the exact same notes as the studio usually does in this genre, which is a positive. The film is shot lovely, with a terrific main cast.\r\n\r\nLupita Nyong'o is top notch in the role of Nakku, while Madina Nalwanga impresses in the lead as Phiona. David Oyelowo would be my personal standout, he's terrific as Robert, but all three add a great deal to the film to be fair. A few of the child actors give good support performances, also.\r\n\r\nIt does slightly suffer with the fact its story revolves around chess, which isn't the most exciting or massively interesting game/sport to watch across 124 minutes. However, it's about much more than just chess - it features a big life story too. It does a grand job at making you care for the individuals onscreen.\r\n\r\nHighly recommend.", "created_at": "2020-11-17T04:15:34.900Z"}]