[{"movie_id": 342473, "review_id": "591b6091c3a3683a9306d70b", "rating": 7.0, "review_text": "**Dreaming's easy, but chasing it needs all the effort.**\r\n\r\nWell, I praise a lot, particularly the European animations for preserving the 2D animation. That does not mean they lack behind in 3D format. The recent film 'The Little Prince' was the perfect example of a quality 3D animation outside Hollywood. Pars with Disney, Pixar standards. Technically, as well as the story contents. But the quantities are very less and also making it a bit expensive. So they usually prefer producing it in the English language for the wider/international market, keeping North America particularly in mind. This is a French English-language film that co-produced by Canada.\r\n\r\nThis is a nice film, that particularly targets little kids and mostly the girl audience to inspire Ballerina. Cute characters and scenes, but very familiar story. Shares lots of similarities with 'August Rush', except the field of interest. I am not an expert or know all about Ballet, but some of the parts involving them were turned me off. I know the gravitation force is irrelevant in animation since they're not real world to comply with science, but maybe I'm being an adult and knowing that stuff might have influenced me to think that way. It reminds me I'm really an adult, though this film should be watched as a kid despite whatever you are. However, nothing affected me from enjoying it.\r\n\r\nIt sets in the 80s of the 19th century France. At the time when Eiffel Tower and Statue of Libery were on the construction, a poor orphan girl named Felicie escapes orphanage with another boy to pursue her dream to be a ballerina. Then they arrive in Paris, and very soon they find their separate ways to achieve the goals. Not all smooth sail, especially for her. So she takes the opportunity that comes her way, even after knowing it was wrong to do.\r\n\r\n> ❝You have something that she can only dream of: passion!❞\r\n\r\nFrom there, with all the complications tailing her, how far she could go to make her dream come true. Which also includes the amount of dedication put on her undertaking to meet the expectations of her trainer, rivals and many others. And to show the world the interest is not simply based on enthusiasm, but willingness to sacrifice anything for it. Her journey from nothing to the edge of something new to define her life is the film that briefs for just short of 90 minutes.\r\n\r\nThis is not another 'Billy Elliot'. Animations are usually comedy, fantasy and musical, but recently the adventures and science fictions are surging. I don't remember I ever have seen an animated dance flick. Not the classical dance, not in the modern 3D animation format. The closest one was a decade old 'Happy Feet'. So that makes it is a unique product and comes under a must see for all the animation fans. But the storyline is predictable and many sequences were intentionally dragged to be cliché. Because it works, particularly if they're aiming for the younger generation who haven't seen many films in their lives. Only we the grownups whine.\r\n\r\nMost of the voice-over artists are well known Americans actors which boosted the film. The character combinations are good. It brought the variety, especially slightly to ride off the main theme in a few occasions. Like the boy's interest in inventing things which were other major parts of the twist and turns in the narration. It is not a great animation if it was from Hollywood, but coming from France and the theme it focused on, the effort must be appreciated. Overall a much better film than what the average reviews and ratings around the internet says. It is a ballet film means not those who love it should watch it, but those target audience should not miss it. That means generally worth a watch, but not for everyone.\r\n\r\n_7/10_", "created_at": "2017-05-16T20:26:57.431Z"}]