[{"movie_id": 291805, "review_id": "579d0389c3a36837ea00105e", "rating": null, "review_text": "A SCREEN ZEALOTS REVIEW www.screenzealots.com\r\n\r\nMost moviegoers weren’t clamoring for a follow-up to 2013’s smart magic heist thriller “Now You See Me,” but here’s one of the rare instances where the sequel is actually better than the original. While viewing the first film would be helpful before seeing “Now You See Me 2,” it’s not necessary. Even newbies can follow along with this slick magic show.\r\n\r\nThe Four Horsemen are back, this time fighting the powers that be with even greater illusions. Atlas (Jesse Eisenberg), Merritt (Woody Harrelson) and Jack (Dave Franco) are now joined by Lula (Lizzy Caplan, a welcome replacement for Isla Fisher as the “girl Horseman”). Mabry (Daniel Radcliffe) plays a tech nerd who forces the Horsemen to steal a chip so he can control all of the computers in the entire world — but who is really pulling the curtain? Mark Ruffalo is back as FBI agent and magician Rhodes. Here he still aids the Horsemen (and seeks to find some closure with Thaddeus (Morgan Freeman), a man Rhodes blames for the death of his father). Yes, there’s a lot going on in this convoluted plot, but it is exciting from beginning to end.\r\n\r\nOne of the most enjoyable aspects of the movie is the elevated performances. I love the trend of casting accomplished actors in fun summer movies; I think audiences get a better movie for it. These are talented actors who visibly enjoyed working together; they play off each other with an effortless believability. Their repartee is lively and their visible enthusiasm for their roles (and the film) is contagious and as a result, I was smiling throughout the whole movie. Harrelson will probably be taking some jabs for his partially silly turn (I don’t want to say how because I don’t want to spoil it), but I thought he was ridiculously amusing. No matter how you feel about the film, you have to agree that these characters are a hoot to spend a few hours with.\r\n\r\nAs with the first film, this one is packed full of entertaining twists and fun “gotchas!” A lot of it is, of course, ridiculous, but interspersed throughout the flashy trickery are some truly funny and memorable moments. Most of the stunts are CGI animation but even though they are fake, they’re still pretty damn cool. The big finale may be predictable but that makes it no less fun. I love the all of the misdirection this film includes (it’s the perfect homage to real magicians and tricksters), and it’s done in a witty and skilled fashion. Is this film as clever as it thinks it is? No. But so what? It’s a fun, wild ride.\r\n**\r\nA SCREEN ZEALOTS REVIEW www.screenzealots.com**", "created_at": "2016-07-30T19:44:09.868Z"}, {"movie_id": 291805, "review_id": "57ed87eb9251414c9a00040c", "rating": 6.0, "review_text": "**Not seeing what's coming to them, but overcoming is their task to complete.**\r\n\r\nI never thought a sequel would be made. Now it seems this will going to be an unstoppable franchise, we could expect more, the next one was official, especially after considering how this film fared at the box office. All the main cast returned with the new ones. I think Daniel Radcliffe was good, first time I had impression like that on him after Harry Potter series. So good to see the two legends, Morgan Freeman and Michael Caine. The rest of the cast was good, but nothing to praise like they have pulled off the impossible. Overall, this is a good follow-up, but not best I was looking for. Though, the writing and direction were decent with some nice Chinese locations.\r\n\r\nThe story follows after some time where the first one ended. After the biggest heist, now they are back with the new public shows. A new member was included, a female to balance with the existing ones. While performing a show, they had to abort it in the middle when the cops raid them. This time they are tricked by some unknown people and land in a foreign territory. In order to escape from there, they had to play what was instructed to them and so they comply with it. When their boss comes to their rescue, the things around them begin to change. So how it all ends was another twist.\r\n\r\nThe film was two hours long, but not bad to hook for that long when pace and the story looked better. I'm not fully satisfied, particularly about the China. I know Hollywood found its second home, but that does not mean they have to add China flavour all the time to just make money in China. They might succeed from it, particularly from earning Yuan, but I'm the not happy, the world is not happy about that. You can make full length China subject film, but this kind of altering script is becoming sick. Because all the major films trying to do the same thing. I disliked this from that perspective. So sorry Hollywood, better luck next time.\r\n\r\n_5.5/10_", "created_at": "2016-09-29T21:30:19.169Z"}, {"movie_id": 291805, "review_id": "60e1bf5f83ee670046f24a76", "rating": 2.0, "review_text": "**Now You See Me (but why would you)**\r\n\r\nStage magic and movies are very much alike. The more convincing, the better. Unfortunately the action in this film, magic tricks, sleight of hand, hypnotizing people, is simply unbelievable - in a bad way. This is not an alternate universe with different rules of physics. This is not a group of super heroes using their powers, this is not a tale of magic becoming reality, this is simply unrealistic garbage.\r\n\r\nAs for the actors, most notably we have Mark Zuckerberg (played by Lex Luthor) trying to take away the leadership of the \"Horsemen\" from \"Jack\" (played by someone without any screen presence whatsoever). Then we have a new person in the crew, an obnoxious girl, replacing someone from the prequel who I can't remember, because they were just as forgettable as the whole drivel that makes up both stories. We have Woody, Morgan Freeman, Caine, and Harry (Potter). In other words no one likable, unless you like them. Mark Ruffalo (Hulk) also shows his unlikable side.\r\n\r\nI tried to keep this on to help me sleep, but during the action scenes they cranked up the volume (as is customary in movies for some reason) so I ended up switching it off.\r\n\r\nThe extra star I gave is for production value.\r\n\r\n25 August 2016\r\n\r\nI am migrating my reviews from a different site which has become like the reality of this flick. TMDB looks awesome and I look forward to be a part of it.", "created_at": "2021-07-04T14:02:07.667Z"}]