[{"movie_id": 82690, "review_id": "5142992119c29552ea0e470a", "rating": 8.5, "review_text": "Wreck-It Ralph is a great movie with my love for games in there with it. The movie had some great childhood memories of mine, with all the characters from the best games. The graphics are excellent and the voice acting couldn't be better. This movie is great for adults and kids.", "created_at": "2013-03-15T03:44:33.581Z"}, {"movie_id": 82690, "review_id": "54f5f7e492514123fe00001e", "rating": 7.0, "review_text": "Surely the thematic is great and it is funny to see old pals from several video games but Wreck-it Ralph lacks the hook of most of Disney movies.", "created_at": "2015-03-03T18:05:24.036Z"}, {"movie_id": 82690, "review_id": "5f4589ca99d5c30033c5860f", "rating": 8.0, "review_text": "Thoroughly enjoyable.\r\n\r\n<em>'Wreck-It Ralph'</em> is very good. At the beginning it feels as if it might just be a video game rehash of <em>'Toy Story'</em>. However, pleasingly, it does its own thing as it gives a positive message and has more than satisfactory humour.\r\n\r\nI'm never been a proper gamer, at least not in the sphere of games used here, but I still got a load of the little references. I also like how the world is built, it's silly sure but it's still pretty neat how they tie it all together.\r\n\r\nJohn C. Reilly and Sarah Silverman are excellent in their roles as Ralph and Vanellope. It's very easy to care for those two characters, with both having meaningful stories. Jane Lynch (Calhoun), Jack McBrayer (Felix) and Alan Tudyk (Candy) add to the film with their characters - it's clear to see the ode (copy?) to Ed Wynn and his Mad Hatter for Tudyk's role.\r\n\r\nThe animation is nice, while the music - though not memorable at all - is rather catchy and suits the Sugar Rush surroundings in particular. Give it a watch.", "created_at": "2020-08-25T21:59:38.266Z"}, {"movie_id": 82690, "review_id": "65929dc6a58902717f96ad37", "rating": 6.0, "review_text": "The adventures of an arcade game villain who is fed up watching everyone else get rewards and medals whilst he is always portrayed as the baddie. \"Ralph\" decides that the time has come to abscond and try and emulate his pal \"Fix-it-Felix\" in the feel good, popularity, stakes. His first encounter is with the no-nonsense \"Sgt. Calhoun\" in a shoot-em-up but instead of thriving, he manages to destroy just about everything there and soon threaten the entire arcade. How to stop this catastrophe? Well that might be down to his new, enthusiastic pal \"Vanellope\". She's what is called a \"glitch\" from a neighbouring racer game - where everything looks like it's straight out of \"Wonkaland\" - and the two must work together and race to thwart the increasingly evil ambitions of \"King Candy\". It's OK, this film. perhaps gamers will get more from it, but I'm not a gamer so was rather unimpressed with the rather predictable messages of undervalued person seeking validation and affection in a cruel, uncaring, world. Some of the animation is great fun, it features a bit of Pac-man nostalgia and there is plenty of lively action packed into one hundred minutes of characterful storytelling - it's just that the story, for me anyway, was just thin and procedural and there is way too much dialogue. Sorry.", "created_at": "2024-01-01T11:11:02.842Z"}]