[{"movie_id": 210860, "review_id": "6405ac34383df200a955b66e", "rating": 5.0, "review_text": "**A film that is much better than the critics would have said. Unfortunately, it's excessively exaggerated, has a confusing script and excessive sexualized characters and situations.**\r\n\r\nDavid Koepp must have been very confident about this project. To make this film, he sought out a little-known character from a series of novels by Kyril Bonfiglioli, an author who will only be known by the English or by those who speak English as a native language. I have never found this author's books in Portugal. The film was a huge financial and critical failure, and I was afraid of what I was going to find, but the truth is that I find it mildly satisfactory.\r\n\r\nThe film begins by introducing us, in the voice of the protagonist, to the central characters of the plot: the art dealer Charlie Mortdecai, an aristocratic bon vivant, his beautiful wife and his faithful henchman Jock, tough and excessively virile. From here, we follow the protagonist on an adventure in search of a missing painting that could be a work by Francisco de Goya, with a past associated with the Nazis and believed as lost.\r\n\r\nThis comedy makes a huge effort to be as funny as possible and bets everything on a kind of comedy of exaggerations, in which each character is caricatured and everything is taken to the point of absurdity: Mortdcai, for example, is not just a “marchant d'art”, he's an insolvent aristocrat with tics of grandeur and a fetish for his mustache (okay, I wore a mustache myself, and it was a similar style, but I never let the mustache used me, if you know what I mean). Likewise, Jock is transformed into a mobster and sexual athlete. Exaggeration pays off: it is impossible not to laugh at the absurdity. The most obvious example is the way in which Mortdecai insults the US when he treats it as if it were still an uncivilized British colony.\r\n\r\nThe problem with exaggeration is that it doesn't work if it's overused: the second half is much weaker because we already know what to expect from the characters. I'm even willing to forgive that; harder to forgive is how the script ends up lost in its own twists and turns. Am I the only one who feels that the story is so confusing that even the characters don't know what they need to do? I also can't forgive the amount of sexual jokes. The film had a very restrictive parental rating in the US, but the overwhelming majority of other countries, including Portugal, made the big mistake of giving it a much lower rating, making the film available to a teenage audience. It's not the fault of the producers, it's the authorities of each country, but I wonder if our teenagers, who are starting their sex life earlier and with less awareness, need more sex-promoting stuff. We are no longer in the domain of hedonism, this is perversion.\r\n\r\nDespite having a string of hits and a solid career, Johnny Depp is not in top form. Having made this film after two other failures, the actor was going through a bad professional phase, which was associated with a controversial marriage (and a divorce, litigious and mediatic, years later). I don't know to what extent his personal life influenced his work, what I can say is that Depp is a shadow of himself. The jokes, the humour, the comic gestures that he masters so well… everything comes out so forced that it's not funny. Paul Bettany, Depp's personal friend and another actor with established credits, is much more effective in the role of Jock. It wasn't the first time that the actor played a tough character, and it seems to me that he has a knack for this type of material. It's nice to see Gwyneth Paltrow here: despite the cold and forced chemistry with Depp, I think the characters asked for it and Paltrow knew how to give her character an additional elegance and charm. Ewan McGregor is welcome support but has little to do.\r\n\r\nTechnically, the film has many qualities, and it is obvious that it had a budget worthy of the cast it had. The cinematography is very good, with excellent colors, lighting and sharpness, and it makes deft and intelligent use of effects and CGI. I particularly liked the effect with the planes and the names of the cities, used whenever the characters had to travel. The filming locations were well chosen and the props and costumes (in particular Depp's and Paltrow's) were very well designed... although I need to consider that the Mortdecai costumes, with excessive use of silks, velvets and strong colors, exude a certain \"nouveau riche aroma\" that a legitimate blood aristocrat would not fail to condemn. The soundtrack also does its job flawlessly.", "created_at": "2023-03-06T09:02:44.208Z"}]