[{"movie_id": 11683, "review_id": "5636ccf29251414ad801a7ab", "rating": 7.0, "review_text": "Romero lines up the Bush administration for à la carte eats.\r\n\r\nLand Of The Dead is directed & written by George A. Romero and it's the fourth film in his Zombie based series of films. It stars Simon Baker, John Leguizamo, Dennis Hopper, Eugene Clark & Asia Argento.\r\n\r\nHuman society has regrouped and formed a new community in a sealed off section of America. Run by a feudal government headed by Paul Kaufman (Hopper), the state survives on supplies garnered from the outside world by Riley (Baker) and his \"Dead Reckoning\" team. But during one of their raids they notice that one of the Zombies, Big Daddy (Clark), is starting to show signs of human awareness.\r\n\r\nAfter the emergence of the Dawn Of The Dead remake in 2004 and the plaudits heaped upon zom-com Shaun Of The Dead also in 2004, one question immediately sprang to the minds of zombie fans, \"could Romero, the don of the dead, be stirred into a new entry in his already heralded series?\". Yes was the joyous answer to that, and although a torn ligament down from previous instalments, the great news is that Land Of The Dead rocks with gore and politico fervour. Naturally a lot has changed in the world of zombiedom since Romero's last venture in 85, but he manages to tonally keep the old fashioned feel while observing the unsteady social climate that was seeping from the wounds in 2005.\r\n\r\nBy his own admission he is taking pot shots at the Bush administration, while Hopper, on delightfully excessive form, deliberately channels Donald Rumsfeld. From fireworks in the sky bringing conformity, to class division down on the turf, Romero as always has something to say. The cast are a solid and energetic bunch, with Baker pleasingly coming up trumps as a hero type, while gore hounds are very well served here as George finds new and inventive ways of delivering the ick (one \"head\" sequence is genius). Sure there's a suggestion that the central idea of the zombies getting smarter is kind of going off tangent, but since he wrote the rules, he's also allowed to change them. But with this ending here it offers hope, not just in this skew whiff world he's created, but also of further film's to come. And that maybe is a touch too far? 7/10", "created_at": "2015-11-02T02:39:46.061Z"}, {"movie_id": 11683, "review_id": "64aab4d93e2ec800af7db071", "rating": 6.0, "review_text": "Not the best zombie movie I ever seen. It is ok. It takes a few times of watching it to really get the whole concept of the movie. Could have made the storyline a little better. Hey really all that matters is that theirs a lot of killing zombies and zombie killings happening.", "created_at": "2023-07-09T13:23:37.104Z"}]