[{"movie_id": 291870, "review_id": "56a7b3b8c3a36828c1001577", "rating": null, "review_text": "In the raucous and woefully wretched **Dirty Grandpa** director Dan Mazer's lazy and lethargic laugher gives a whole new meaning to the term \"gag comedy\" with the emphasis on the word gag. One might want to upchuck at this mindless ragtag romp that desperately tries too hard to reel in the obnoxious chuckles. Undoubtedly toothless, unimaginative, and aimlessly insipid the degenerative **Dirty Grandpa** has all the cheeky charm and hilarity as a waxy floor in an arthritic nursing home patient's dim lit room.\r\n\r\nNaturally, the questionable punchline to this foolish and crass joke-of-a-movie is why a prestigious performer of Oscar-winner Robert DeNiro's caliber doing such silly and offensive sludge as the flatulent farce **Dirty Grandpa** in the first place? Sure, DeNiro has done his share of hit-and-miss comedies in his career as well as some dramas that were lackluster and forgettable. It is true...even the great cinematic icons can gravitate to the usual duds from time to time. However, watching the intense and revered seventy-something veteran DeNiro wallow in this madcap mess is utterly inexcusable. What even possessed DeNiro to appear in such a diaper rash of a juvenile comedy? Did he lose a bet or was challenged to a dare of some awful kind?\r\n\r\nAs for DeNiro's co-star in ex-Disney Channel dreamboat star Zac Efron one can not be hardly surprised that the big screen boytoy as popped up in this train wreck of a treat seeing as though Efron's past film choices have not been what one might call consistently stellar in his film career thus far. Let's face it...**Dirty Grandpa** was begging for a tongue-lashing and rightfully so. Unless you are an uncontrollable hormonal teen with a locker room mentality attached to your blank psyche then one might find the witless **Dirty Grandpa** a bombastic bore that could not clean up its noxious act even if it ran through several durable car washes.  \r\n\r\nScreenwriter John Phillips wants to present DeNiro's crusty curmudgeon Dick Kelly as a walking wrecking ball with no filter whatsoever. In fact, DeNiro's Dick Kelly is a tragic figure that could be misunderstood by some and mistrusted by others. It appears that Dick Kelly is the cursed clown with the wounded soul--no doubt Phillips's ridiculed target for the inside satirical look at aging hardcore has-beens that rail against a world they no longer recognize and allowed to pass them by in the process. **Dirty Grandpa** could have been a dark and impish commentary on maturing quiet rage with snarling senior citizen Dick Kelly's ignorance serving as a red button for panic. Unfortunately for the throwaway **Dirty Grampa** it is not clever or calculating enough to realize its potential as a subversive chuckler while simple resting its guffaws on cheap-minded edgy banality. \r\n\r\nIn a nutshell, recent widower Dick Kelly wants to unwind in the aftermath of his wife's passing and head down to Florida where he and his late beloved bride spent their treasured days near their summer home. This means enlisting the assistance of his grandson Jason (Zac Efron) to accompany him to the Sunshine State so that Dick can get loose and wild. \r\n\r\nDick, a retired military man, is not a Golden-Aged Boy Scout by any means. He is indeed a Dirty Grandpa based on his persona as a bombastic bastard of a character. Dick is a proud-minded racist, misogynist and homophobe...and these are his good qualities! Dick is indignant as he incredulously wonders why he cannot utter the N-word and does not miss a beat when drooling over the bouncy babes that could easily pass for his granddaughters. And Dick has his \"gaydar\" gander up when confronted with \"swishy guys\" in his presence. Also, there is no shame whenever Dick feels free to...um, pleasure himself regardless of whether Jason is in the vicinity or not. Dick, to say the least, is a tool in the worst way. \r\n\r\nNaturally, **Dirty Grandpa** eagerly wants to throw into the sordid mix other wacked-out characterizations to add to the clumsy raunchfest. Both Mazer and Phillips get their junk food jollies in presenting supporting players that gleefully reinforce all the staged nuttiness at hand. There is a curious slutty siren (Aubrey Plaza from TV's \"Parks and Recreation\") that wants to \"do the naughty\" with Dick to satisfy her fetish for pleasuring old geezers. And then there is Jason's galpal (Julianne Hough) that seriously needs a stick removed from her no-nonsense butt before she ties the knot. Of course this dumb display tosses a couple of collegiate cut-ups (Michael Hudson and Jake Picking) and Jason's cousin Nick (Adam Pally)--a disabled \"Dick\" wannabe.\r\n\r\nSo **Dirty Grandpa** marches to its wacky beat without realizing how much of a Grade-A stinker this insufferable session of comatose comedy this shoddy showcase really is at heart? Breezy bathroom-related humor, recycled masturbation giggles, bubbly bimbos and slap-happy drug use high-jinks--all befitting whatever odious overtones this needless and fetid funny fable managed to pull off.\r\n\r\nFor DeNiro and company **Dirty Grandpa** may have been a quick and profitable payday but for the rest of us the payoff was mere chump change.\r\n\r\n**Dirty Grandpa** (2016)\r\n\r\n1 hr. 42 mins.\r\n\r\nStarring: Robert DeNiro, Zac Efron, Zoey Deutch, Aubrey Plaza, Julianne Hough, Jason Mantzoukas, Jake Picking, Michael Hudson, Mo Collins, Dermot Mulrooney\r\n\r\nDirected by: Dan Mazer\r\n\r\nMPAA Rating: R\r\n\r\nGenre: Comedy\r\n\r\nCritic's rating: * star (out of 4 stars)\r\n\r\n(c) Frank Ochieng", "created_at": "2016-01-26T17:58:16.392Z"}, {"movie_id": 291870, "review_id": "5752e1b69251416bb7000014", "rating": 3.0, "review_text": "> The usual, nothing innovative about it!\r\n\r\nEverything I wrote was just my personal opinion, definitely not intended to offend anybody. This should have been one of the best comedies of the year, but now it belongs to one of the worst. I recommend 'Grandma' instead this which I felt a much better comedy.\r\n\r\nAt this age, Robert De Niro was unbelievably awesome, though his character needed a good support from another and that's where as usual Zac failed to deliver his part. I would have preferred someone like Taylor Lautner who's desperate for a breakthrough than the Zac who ruins always.\r\n\r\nThe screenplay was from the 'blacklist', knowing this they should have been more careful while casting for it. The story was okay, because it was not meant for one of the greatest films of all time. It was sort of a weekend getaway or the bachelor party theme, but the film gives its original reason and then those developed plots were too familiar if you have seen plenty of teen films, in the party theme.\r\n\r\nIt's supposed to make us laugh, but there are lots of outdated humours tried in the unusual route to narrate them. The grandfather-grandson combo was an excellent idea, the main plot revolves around them and it should have remained that way, but the undetermined romance was an interruption. Or they should have developed a decent romance track for a better balance in the genre.\r\n\r\nAt least it would have been all right if it was a teen film. Many of those who appeared in it were actually too old to represent the roles given to them. That's fine too, because films are fake, everything is make-up and performance, but none were at their best except De Niro and Aubrey Plaza. It is definitely a film to skip, that's my opinion, but they're a few who are defending it, so be careful that I'm not always right and they're not always wrong if you want to choose it.\r\n\r\n3/10", "created_at": "2016-06-04T14:12:06.893Z"}]