[{"movie_id": 10479, "review_id": "6442aa97e2bca80461436b8b", "rating": 5.0, "review_text": "**It had everything to be much better and complex, but it was deliberately simplified to become a courtroom drama with touches of puffed up patriotism.**\r\n\r\nI was never in the military, I didn't need to be (I'll be the first to volunteer if my country needs it), but I am the son of an ex-military man, a war veteran with years of combat in Africa. And I know that, when you are in a combat scenario, the rules don't matter, what matters is getting out of there alive, and the concern of an officer with soldiers in his charge is to accomplish the mission with the minimum of casualties, to do the job and come back with all the boys. My father taught me this and told me several stories that prove it, and I'm talking about this now because the film, due to its theme, makes me remember and think about it.\r\n\r\nThe script begins with a combat in the middle of Vietnam, where an officer, Terry Childers, executes a captured Viet Cong to force the commander of the hostile force, also taken prisoner, to order his men to retreat. That is, he clearly violates a combat rule in order to save the lives of soldiers under his command. Years later, he is sent to Yemen to protect the US embassy, which is surrounded by a hostile mob and under sniper fire. In the evacuation of the embassy, Childers loses three soldiers and sees a fourth comrade fall, mortally wounded, ordering the others to return fire and fire on a crowd killing 83 people. In the following months, however, he is taken to the Military Court and accused of murder and inappropriate conduct of an officer, calling to defend him an old friend from Vietnam, Hays Hodges, who owes him his life for what he did there.\r\n\r\nWe've had our fair share of movies with military courts and trials, that's not new, and director William Friedkin made the mistake of turning the movie into a simple courtroom drama. The plot is effective in the task of making us doubt Childers' guilt, and leaves the public free to support him or not, but it does so effortlessly, going in simple ways: for example, demonizing politicians and highlighting a cabal. to withhold evidence and force the court to convict him. It is quite obvious that there are powerful people interested in condemning him and using him as a sacrificial lamb to remedy a political and diplomatic imbroglio. Unfortunately, the film does not explore this, it pushes more complex issues out of the way, it never addresses the position of the State Department or even that of the President and everything is simplified, resulting in a film that, despite being entertaining, is quite forgettable.\r\n\r\nThe cast has a range of excellent actors and very solid credits for the characters they will play. Tommy Lee Jones and Samuel L. Jackson have already done other similar jobs and are very safe bets for the two central characters in the plot. However, none of them will one day be remembered for this film. Guy Pearce also does a satisfactory job and within what could be expected from the actor. Ben Kingsley makes a relatively brief appearance and doesn't add much to the film, but the one who really does poorly is Bruce Greenwood. He plays the role of a cabinet politician... yet the character is downright underwritten and is only here to be hated by all of us.\r\n\r\nTechnically, the film is up to the standards of what I call \"American patriotic films\". It has good cinematography and good effects, a very martial soundtrack, excellent action scenes with good combat moments and, of course, the ubiquitous flag of the USA, revered and protected by the blood of heroic soldiers. Here, without a doubt, we feel the aroma of advertising. The USA is a country that likes to meddle in the affairs of other countries and assumes the role of the planet's police, but it is enough that the polls of the electorate are more adverse than the generals immediately order the withdrawal of troops. We saw the result of all this patriotism in Kabul very recently, but those of us who are older will remember Saigon.", "created_at": "2023-04-21T15:24:07.794Z"}]