[{"movie_id": 500916, "review_id": "5e07563fd236e600169e7fbb", "rating": 5.0, "review_text": "This was exactly what I needed tonight. But what I needed wasn't something good. Nic Cage and everything that happens within his 30-foot sphere of influence is one hundred percent unbelievable at all times. _Under Siege_ with talking parrots, what could wrong? Lots. Still fun though. \r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-12-28T13:18:55.526Z"}, {"movie_id": 500916, "review_id": "5e24cfb8397df000129de888", "rating": 6.0, "review_text": "Pretty standard thriller, though compared to some of Cage's other direct-to-video flicks. Not altogether bad and I found some of it to be halfway entertaining, even with some questionable visual effects (which I give  a pass considering what I assume wasn't a big budget), and it's never a bad thing seeing Famke Janssen. And for his part, as normal Cage performances go, he wasn't bad.\r\n\r\nThe biggest drawback however was the convoluted plot, I'll give them this high-value prisoner has a health condition that precluded them from flying him back, but the reasoning to be on a cargo vessel was dumb. **2.75/5**", "created_at": "2020-01-19T21:52:57.001Z"}, {"movie_id": 500916, "review_id": "5f7141a2d55e4d00378c780d", "rating": 7.0, "review_text": "Really good watch, could watch again, and can recommend.\r\n\r\nThis is one of Nicolas Cage's more reserved roles, and the movie is very well balanced between him and Kevin Durand (and LaMonica Garrett and his team dealing with Durand's character).\r\n\r\nThe premise is intriguing and simple: trapped on a boat with a killer, wild animals, military, and a hunter: who wins?\r\n\r\nThe biggest problem I have with this, and the movie specifically leans into it, is that Nicolas Cage is not playing a good guy, he's a poacher.  The only reason he doesn't go to prison for life (though I'm sketchy if the US Cost Guard has jurisdiction given it's not a US ship and neither country involved in the trip is the US), is because Famke Janssen has the hots for him.\r\n\r\nKevin Durand really is amazing in this.  He's been reserved to what feels like bit parts in the past, but giving a chance to shine, he really does.  He's able to steal the light from Cage in some parts of the movie.\r\n\r\nThis isn't the greatest movie ever, but it's really good, and I think you'll remember it.", "created_at": "2020-09-28T01:51:30.138Z"}, {"movie_id": 500916, "review_id": "62113f93a84ff7006d22e99a", "rating": 6.0, "review_text": "_**Solid ship adventure with Cage, Famke and a cargo of jungle animals**_\r\n\r\nA ship with a cargo of deadly exotic wildlife, including a rare white jaguar, travels from the Amazon to Puerto Rico when a political killer being secretly extradited to the USA (Kevin Durand) escapes captivity and releases the animals for a voyage of utter mayhem. Nicolas Cage and Famke Janssen head the cast.\r\n\r\n\"Primal\" (2019) is an amusing, action-packed ship adventure with jungle accoutrements. It’s a mix of “Under Siege” (1992), “The Lost Continent” (1968) and Tarzan. The writing/acting is snappy and the violence extreme while the story briskly moves along without ever bogging down. \r\n\r\nFamke is the only one on the feminine front (except for village lasses in the opening). She’s in shape, but has obviously gotten plastic surgery since the last time I saw her 5-6 years prior. Hey, age happens.\r\n \r\nThe movie runs 1 hour, 37 minutes, and was shot mostly on a cargo ship in Puerto Rico & waters nearby.\r\n\r\nGRADE: B-", "created_at": "2022-02-19T19:05:55.614Z"}]