[{"movie_id": 365222, "review_id": "56a448a6925141720700525b", "rating": null, "review_text": "This was a great or big and fantastic movie series.\r\ni'm big fan of mr. Donnie yen.\r\nso i like that movie series.\r\nit's a complete Action or Biography movie.", "created_at": "2016-01-24T03:44:38.516Z"}, {"movie_id": 365222, "review_id": "56f3f2b19251410e640007b0", "rating": 8.0, "review_text": "> It gets closer to the legend's personal life.\r\n\r\nA few movies about Yip Man were made in the past, but Donnie Yen's 2008 version rewrote the history. Because the craze about martial arts in the last two decades and of course digital world made it to reach every corner of the world. Followed by a sequel and its massive hit, then came many unofficial versions to this series that set in a different timeline of the martial art legend's life.\r\n\r\nWith this movie, the narration gets lots closer to tell the personal life of Yip Man. But in the first half, like the previous two films, focused on the social issue. Yip Man is fighting for the children's education, when a real estate tycoon plans to replace the school building to a commercial complex. That's it, later the story begins to take us to the random events like a man who's hungry for the best fighter in the town title who end up challenging Yip Man to face him. From there, it's all about Yip Man and his ill wife where the movie switches from action mode to sentimental.\r\n\r\nThat's not what we expected from a man who's famous for his martial art. Surprisingly, this different approach in storytelling was refreshing. Saving school, the clash for the title and ill wife, so the overall movie was like had three episodes and each dealt on a different motive. Being a biopic and also a martial art movie, it exploited the theme fairly.\r\n\r\nI can't say Mike Tyson's acting was so good because it was weird him to speak Cantonese. He was in a minor role, but his presence was a big boost for the movie. If we see him in an action movie, then we all know what to expect and it did not fail to fulfill our wish.\r\n\r\n> \"There's nothing more important than the love of those by your side.\"\r\n\r\nThe stunts were not as good as the previous two films and they were too short as well, but technically looked so perfect, especially locking horns between Tyson and Donnie Yen was like head-to-head confrontation between Hollywood and Hong Kong. The other reason to shorten stunts in the movie was to get closer to the legend's personal life. After the survival and fighting the foreign forces, now the time to focus on his own life issues.\r\n\r\nThe first two films were breathtaking, no one can doubt that. I don't know why it took so long for this third movie, but it still worked. Yet not the best in the trilogy, but remained very close to them with unlike storyline and action sequences. I was disappointed for not continuing from where it ended in the 2nd part. I mean the story has a clean flow, but not what I expected, like, I wanted Bruce Lee and the grand-master coming together.\r\n\r\nActually, I never expected the third installment, I considered it was one of the best duologies you could find in world cinema. But I'm happy they made this one and I'm very much sure there will be fourth. So at least I can expect the Bruce Lee's part in the Yip Man's life story. I was waiting for that from a very long and I believe it won't let me down this time. All the above, I'm looking for the official announcement.\r\n\r\n7½/10", "created_at": "2016-03-24T13:59:13.954Z"}]