[{"movie_id": 82700, "review_id": "59425f1fc3a3686c2c00958c", "rating": 4.0, "review_text": "I was not impressed by this movie. Having said that I do not think it deserves the many 1 star ratings that it have received nor do I think that the acting by neither Will Smith nor his son Jaden was as bad as some people claim. My gripe with this movie lies more with the actual implementation of the story.\r\n\r\nThe basic idea is not really a bad one. It could have been made into a rather good movie. However the result that we see is rather shallow. Worse it is riddled with stupidities and illogicalness.\r\n\r\nThe movie starts off with the all too common humans are destroying the planet, we are so bad, bla bla. I am so tired of seeing that crap being stuffed into movies (and books) left right and center. When I read want to ponder those questions I read the appropriate science papers. Stop stuffing it in my face when I just want to be entertained.\r\n\r\nThen we get to know that some alien presence where dropping monsters on the humans. Monsters that where genetically bred to kill humans. Okay…? If they wanted to exterminate us why make it in such a long-winded way? And what happened afterward? When it apparently failed to exterminate us did they just go “oh well” and left?\r\n\r\nThe basic story of the film is that the ship carrying Cypher and Katai crash lands on old Earth which are now supposedly inhabitable for humans. Okay but, apart from the fact that a thousand years in the future one would have thought that they could avoid meteor storms easily, what is this mumbo jumbo that Cypher can somehow “feel” the storm coming?\r\n\r\nLet us continue with Earth itself. It is supposed to be inhabitable for humans. Could they not have made a little better effort to make it look inhabitable then? It looks like a semi-tropical/tempered paradise to me. Also, the temperatures are supposed to drop to well below zero every night yet the vegetation is abundant and green? While we are on the subject of vegetation, how the bloody hell can they need “breathing pills” when the vegetation, and thus the oxygen production, is that abundant? Things like this just sticks out like a sore thumb and drags down the movie.\r\n\r\nThen we have these Ursa’s. They are bread for the purpose of exterminating humans. They are blind and tracks the humans by the fear pheremones. Say again? What kind of idiot alien would do such a thing? Any bioengineer worth their salary would ensure that such a creature had every advantage they could get. That would include sight and hearing as well as smell (and probably a few other senses like infrared as well). Also, this idea of having to be fearless is just dumb. Apart from simple things like staying downwind the only thing the humans would have to do was to outfit their soldiers with airtight combat suits.\r\n\r\nI am not saying that a science fiction movie (or any movie) should be all science and believable but this movie is just too filled with glaring stupidities. For me it is not the total turkey that some people seems to think it is. It has some entertainment value but not more than 4 out of 10 stars worth.", "created_at": "2017-06-15T10:19:11.437Z"}, {"movie_id": 82700, "review_id": "6438ea6287f3f200764a01f8", "rating": 4.0, "review_text": "Decent movie. Nothing like dad giving you a lead role. There should have been more fighting in the movie instead of seeing him struggle so much.", "created_at": "2023-04-14T05:53:38.940Z"}]