[{"movie_id": 429202, "review_id": "5d69c0be0929f6001544ba7d", "rating": 8.0, "review_text": "_**Irreverent, dynamic, and portentous; the picture it paints of the increasingly indistinguishable divide between celebrity and notoriety isn't pretty though**_\r\n\r\n> **Bill O'Reilly**: _You can take some of your lyrics, such as, \"You'll understand when I'm dead.\" I mean, disturbed kids could take the lyrics and say, \"you know, when I'm dead, everybody's going to know me.\"_\r\n> \r\n> **Marilyn Manson**: _Well, I think that's a very valid point, and I think that that's a reflection of, not necessarily this program, but of television in general - if you die and enough people are watching, then you_ _become a martyr, you become a hero, you become well-known. So when you have things like Columbine and you have these kids that are angry and they have something to say and no one's listening, the media sends a message that if you do something loud enough and it gets our attention, then you will be famous for it. Those kids ended up on the cover of_ Time _magazine twice. The media gave them exactly what they wanted._\r\n\r\n- Marilyn Manson speaking with Bill O'Reilly; _The O'Reilly Factor_ (August 20, 2001)\r\n\r\n> _The movie's inspired by Apple News updates, and the way that you have four or five top stories; basically, at any given time, there's usually some coverage of a mass murder and maybe something about Ariana Grande having cut off her ponytail. In 20 or 30 years, when we're at the mid-century mark and we have a little perspective, what are the events that we will identify as having defined this time? I do think that there's been a major shift in the culture since Columbine and 9/11, and now we've had an even greater tectonic shift with this new administration. When people look back, they remember Britney Spears along with 9/11. Popular music is just a way of talking about the popular culture._\r\n\r\n- Brady Corbet; \"Vox Lux's Brady Corbet on Making One of the Most Polarising Movies of the Year\" (Charles Bramesco); _Vulture_ (December 7, 2018)\r\n\r\nA story about popular art born amidst violent trauma. A thriller about the remorseless and cannibalistic machinations of fame. An allegory for the calcification of celebrity-obsessed American society. A study of the interactions between pop culture and global terrorism. A _bildungsroman_ about the possible consequences of a troubled childhood. A dark fairy tale about the music industry. A threnody for a pre-Columbine and 9/11 world. The bold, wildly ambitious _Vox Lux_ is all of these. And more. Written by former actor Brady Corbet and his partner Mona Fastvold, and directed by Corbet, the film takes the basic _A Star is Born_ template, and gives it an angry and bitter 21st-century makeover, mercilessly torpedoing Bradley Cooper's whimsical paean to Old Hollywood romanticism into neon-soaked glitter-adorned oblivion. As a director, Corbet exploded onto the scene in 2015 with the sensational, out-of-nowhere _The Childhood of a Leader_, a visually stunning examination of the birth of 20th-century fascism from 19th-century aristocracy. And although _Vox Lux_, a film about a contemporary pop star, seems to have no thematic connection to _Childhood_, there are marked similarities between the two films - they both examine troubled formative childhood years intertwined with global tragedy that ultimately produce less than admirable adults; they both use the specifics of a small group of people to synecdochally engage with larger socio-political issues; they both unapologetically indict a culture in its death throes; they are both fundamentally built on asking questions without providing answers; neither is especially interested in conventional psychology or character arcs. There are a couple of problems (the film could be accused of relying too heavily on voiceover; it strays into cliché on occasion; it's front-loaded, with the best scenes happening in the first act; it walks a very fine line between portentousness and pretentiousness), but all things considered, this is another superb film from a director who, at only 30, is already a unique and exciting cinematic voice.\r\n\r\nDivided into four parts (\"Prelude - 1999\"; \"Act I: Genesis - 2000-2001\"; \"Act II: Regenesis - 2017\"; and \"Finale - XXI\") the story begins on Staten Island in 1999, with a student opening fire in his school. 13-year-old Celeste Montgomery (Raffey Cassidy) tries to talk him down, but is shot in the throat. Although she survives, the bullet is lodged in such a way as to make it impossible to remove, and thus she will be in permanent pain for the rest of her life. Several months later, at a memorial service for the slain students, Celeste sings a song written by herself and her elder sister Eleanor (Stacy Martin). The performance goes viral, and draws the attention of a talented, if not entirely scrupulous, manager (Jude Law), with Celeste suddenly finding herself on the fast track to global superstardom. With Act I concluding with 9/11, the film then jumps to Croatia in 2017, as a terrorist group open fire on a beach. Wearing masks similar to those worn in one of her first music videos, the bad publicity comes as the now adult Celeste (Natalie Portman), a neurotic, self-obsessed, and barely functioning alcoholic, is putting the finishing touches to a new album and preparing for a massive concert and tour. Her mood isn't helped by her fraught relationships with her own teenage daughter Albertine (also played by Cassidy), her manager, her publicist Josie (Jennifer Ehle), and Eleanor, who has basically raised Albertine. When asked by a reporter (Christopher Abbott) about the terrorist attack in Croatia, Celeste makes an offhand comment that seems to invite an attack at her show later that night, sending her behind-the-scenes people into a tailspin as they try to decide whether to go ahead with the concert.\r\n\r\nAesthetically, as one would expect from the director of _Childhood_, there's all manner of things to be fascinated by in _Vox Lux_. The film's temporal structure, for example; whereas the Prelude and Act I cover about two years, followed by a 16-year gap, Act II and the Finale take place over the course of roughly eight hours. There's also the voiceover (provided by Willem Dafoe). The existential, adjective-heavy, and almost \"_once upon a time_\"-like quality to the narration is the very definition of purple prose, but it works magnificently in context. For example, the film begins with,\r\n\r\n> _Celeste was born in America in 1986. Considering her parents' background, education, and socioeconomic status, being somewhat on the losing side of Reaganomics, the name of Latin origin seemed an especially poetic choice. It carved her out some predetermined destination, a route by which to travel. But many years before \"Celeste\" rolled off the cultural tongue like a principled anecdote one senses they were born knowing, she might not have been described as all that special or conspicuously talented. However, she did possess that proverbial \"something,\" which on occasion captured the attention of her teachers and young peers._\r\n\r\nThe narration does have an important thematic purpose, however, serving as a kind of omniscient chorus on events, with Dafoe describing it as \"_an important tonal element and framing device. It's a kind of go-between with the audience_\". Also aesthetically important is the music. The unashamedly over-produced and plastic songs sung by Celeste are all written by Sia (although they're performed by Cassidy and Portman), whilst the score is provided by the legendary Scott Walker, whose music so elevated the grandeur of _Childhood of a Leader_. He's more restrained and contemplative here, but it's still an exceptionally important component of the film, and represents the last piece of original work before his untimely death earlier this year.\r\n\r\nIn terms of the acting, there's no weak link. Tapping into some of the same energy she possessed in Darren Aronofsky's _Black Swan_ (2010) and some of the same nuance she showed in Pablo Larraín's _Jackie_ (2016), Portman plays adult Celeste as suitably frazzled. Holding nothing back, her histrionic but always authentic depiction of a woman on the edge of a total breakdown is mesmerising to watch, whilst a concert sequence is as bravura a piece of acting as anything from _Black Swan_. In the dual role of young Celeste and Albertine, Cassidy does enough to differentiate the parts, but not so much as for the roles to seemingly have no connection to one another; her Celeste is all overwhelmed and innocent, struggling to maintain control, whilst her Albertine is stoic and world-weary, mature before her years. Jude Law's unnamed manager is just sleazy enough to be disreputable but just honest enough to be likeable, whilst Jennifer Ehle's Josie is wonderfully _haute_, permanently looking down on pretty much everyone around her, Law in particular.\r\n\r\nThematically, the film's most salient concern is a cynical deconstruction of celebrity and fame, specifically the 21st-century post-reality TV incarnation of such (there's a reason the closing credits give the film the subtitle, \"_A Twenty-First Century Portrait_\"). In an era whereby one can become famous for virtually anything, the film is painfully of its time, saying as much about celebrities and the machinery of fame as it does about celebrity-obsessed culture. Important in this is that there's no real attempt to make adult Celeste likeable or sympathetic. Sure, she's very much a product of her time, and she's been forced to live her entire life within the parameters of what happened when she was 13. But she's also emblematic of some of the worst components of her time, and Corbet is unconcerned whether the audience empathises with her; his critique of celebrity works just as well if we despise her and all she represents.\r\n\r\nOf course, much of the film's biting satire is tied into the plot itself, with Celeste building a career based off a massacre; gun violence used to sell records (a nice visual representation of this is that Celeste turns the neck scarf she has to wear post-shooting into a glittery accessorised part of her brand). She is literally the beneficiary of tragedy in a world where mass shootings have become so commonplace that they can serve as launch-pads for musical careers. Indeed, Corbet is one of very few American directors operating at the moment who is too young to have really known a world in which such incidents weren't an accepted part of the cultural fabric (he was 11 when Columbine happened), and this feeds into the film's DNA. Although the shooting with which the film opens is fictional, it is obviously based on Columbine (both occur in 1999), whilst the shooting in Croatia seems derived from the 2015 massacre at Port El Kantaoui. And obviously, 9/11 looms large, forming the closing punctuation to Act I, with Corbet able to use the transition to subtly suggest that post-9/11 everything has fundamentally changed.\r\n\r\nCeleste herself articulates an important element of the connection between pop culture and mass murder when she says, \"_nihilist radical groups perceived as superstars. If everyone stopped talking about them, they'd disappear_\", which is very reminiscent of the main theme in Oliver Stone's _Natural Born Killers_ (1994), and which is an even more pertinent sentiment today than it was in 1994. By way of illustration, think about how most people know the names of the Columbine shooters, or the 2012 Aurora shooter, or the 2017 Las Vegas shooter, or, to get away from the US, the 2011 Utøya shooter. Now think about how many victims from any of those tragedies you can name off the top of your head. People know the names of Eric Harris and Dylan Klebold; very few know the names of William \"Dave\" Sanders, Jon Curtis, or Jay Gallentine, the Columbine teacher and two janitors who saved over 100 students, at the cost of Sanders's life. _Vox Lux_ doesn't provide any answers to the question of the crossover between pop culture and terrorism - how one might lead to the other, or how both provide opportunities for fame - but that's because there _are_ no easy answers. It's simply the way things are, and Corbet's cynicism emphasises that just because this is the way things are, doesn't mean this is the way they should be. And the irony at the heart of the film is that in 1999, a mass shooting shaped Celeste, but in 2017, Celeste shaped a mass shooting. This is the nightmare of the 21st-century celebrity wheel of time, and it's brilliantly, if distressingly, presented.\r\n\r\nThere are more grounded engagements with celebrity as well. An early scene, for example, sees Celeste proudly declare that she's \"_in command of [her] own destiny_\", followed immediately by a scene of her vomiting into a toilet after drinking too much. In another scene, Corbet brilliantly nails the drudgery of press junkets that every celebrity seems to despise, with Celeste trying to talk about her album, but all any of the journalists want to talk about is the shooting in Croatia. Another aspect of this, and something the film has in common with Cooper's _A Star is Born_, is that as time goes on, Celeste moves further and further away from her stylistic origin point. Introduced as a good Christian girl into folk music and gentle ballads, when we meet her as an adult, she's an autotuned, silicon amalgamation of Madonna, Katy Perry, and Lady Gaga, with her music just one step above boy band quality (as she herself says, \"_I don't want people to have to think too hard. I just want them to feel good_\"). However, she's also wildly popular, and her music clearly does make people feel good, even if it says precisely nothing of interest or note (which is, of course, ironic considering that her breakthrough came with a song that spoke volumes to the entire world, giving voice to unspoken collective grief).\r\n\r\nIn terms of problems, there are a few. Obviously, any film with such lofty aims as mapping the ideological decline of 21st culture onto the rise and fall and rise of a pop star is setting itself a huge task, and at times Corbet's ambitions exceed his reach. Parts of the adult Celeste portion of the film definitely stray into melodrama, and the fact that the first act is so good does make the second seem a little prosaic in comparison (although the Finale is mesmerising). The ambiguity of the first act, which is unclear if Celeste's rise to fame is redemptive or an extension of the evil unleashed in the shooting, gives way in the second to the far more mundane (and clichéd) study of a harried celebrity, and although the totality is satisfying, I couldn't shake the feeling that the first act seemed to be setting up for something upon which the second fails to deliver. The tone of the film is also ice-cold, and in tandem with its sardonic attitude, could rub some people the wrong way.\r\n\r\nNevertheless, this is a vicious, deeply cynical, deeply sardonic, and deeply ironic dissection of contemporary culture and the forces that drive it. However, finding much to criticise in the millennial pop landscape, Corbet is never nihilistic, mainly because Celeste may have lost her soul, but she is still able to make millions of people happy, even if only transitorily. Both a victim of her time and its desensitised apotheosis, through her, much as he did through Prescott in _Childhood_ of a Leader, Corbet explores questions relating to the interaction between the private and the public. Where are we as a society? What does our obsession with celebrity say about us? What is the cost of fame? Is there any real difference between fame and notoriety? _Vox Lux_ asks such questions, but does not provide answers. That's not Corbet's remit; he merely holds up the looking glass. What we see in it is entirely up to each of us.", "created_at": "2019-08-31T00:35:10.575Z"}]