[{"movie_id": 440021, "review_id": "5a4f25310e0a2657650092e8", "rating": 6.0, "review_text": "If _Mean Girls_ and _Groundhog Day_ had a baby... and then that baby stabbed you... H_appy Death Day_ is an imperfect movie that I had **such** a good time with. I was on board ever since I first saw the trailer, and though it won't be making my top 5 or anything, I definitely was not disappointed.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2018-01-05T07:11:45.175Z"}, {"movie_id": 440021, "review_id": "5c842a8d92514127661f21db", "rating": 6.0, "review_text": "Happy Death Day is surprisingly great fun. It doesn't have a reason to exist other than to tell a slasher film in the Groundhog Day formula, but it's funny when it wants to be, creepy when it wants to be, and Jessica Rothe has got great screen presence. The film could have benefitted from more creative kills (and an R rating), but for a one or two time watch, Happy Death Day is sure to entertain.", "created_at": "2019-03-09T21:05:17.217Z"}, {"movie_id": 440021, "review_id": "62b0c70877b1fb0093b08964", "rating": 7.0, "review_text": "Full review: <a>https://www.tinakakadelis.com/beyond-the-cinerama-dome/2021/12/28/kill-me-baby-one-morenbsptime-happy-death-day-review<a>\r\n\r\n_Happy Death Day_ works because Rothe is a charismatic lead, invoking the scream queen performances of yesteryear. Most of the other characters are far more secondary, so the burden falls on Rothe to bring life to a grounding role. As the lead, Tree needs to be intriguing enough for the audience to put up with the repetitive nature of the genre, but also pliable enough to allow her character to grow. Her relationship with Carter is particularly interesting because it has to both progress over the course of one day for Carter (who forgets everything as the day resets) and vary for Tree over the many different versions of the one day she lives through. Their relationship must be both a blank slate and feel as though the needle has moved forward at the end of each repeated day. Broussard and Rothe are able to sell it completely from the first time Tree wakes up confused in Carter’s bed.", "created_at": "2022-06-20T19:14:16.661Z"}, {"movie_id": 440021, "review_id": "63002c103e6f2b007d271a87", "rating": 8.0, "review_text": "**Blumhouse killed it with this one! 😜**\r\n\r\nIf Groundhog's Day and Scream had a baby, it would be this entertaining gem of a movie! I went in with low expectations and was so pleasantly surprised and highly entertained. Jessica Rothe's acting is delightful, taking the typical mean girl trope and filling it with soul and charm. In a world of remakes and reboots, Happy Death Day shines with a fun plot and great acting. Definitely worth a watch.", "created_at": "2022-08-20T00:34:24.805Z"}]