[{"movie_id": 10623, "review_id": "539e2d33c3a3683b59004959", "rating": 4.0, "review_text": "High on action, low on grey matter.\r\n\r\nI guess when push comes to shove it’s an action film that delivers the requisite supply of biff, bam and kerpow action sequences. Yet even allowing for the old “leave the brain at the door” requirement for such action comic malarkey, the script is too poor, the acting equally so, while the choreography is weak. The latter of which a big misstep when you have Jet Li and Mark Dacascos fronting the good guy/bad guy axis of the story.\r\n\r\nPlot pitches Li’s ass kicking detective with DMX’s urban thief together as an unlikely buddy buddy combo trailing missing diamonds and DMX’s kidnapped daughter, and that’s pretty much it. There’s no attempts to expand the characters or add some emotional depth to what is meant to be a pretty critical situation.\r\n\r\nIt often feels tired, like a recycling of so many other film’s of similar ilk, originality is out the window here, hell they even get Tom Arnold in to reprise a watered down version of his character from True Lies. Gabrielle Union and Kelly Hu are on hand to add the sexy sizzle in thankless roles, while Dacascos barely registers as an uber villain.\r\n\r\nLazy and redundant, all told, a waste of time for cast and viewers alike. 4/10", "created_at": "2014-06-15T23:33:07.309Z"}, {"movie_id": 10623, "review_id": "5f581a4f05a53300381bc926", "rating": 7.0, "review_text": "Extremely dumb, but <em>'Cradle 2 the Grave'</em> actually did entertain me.\r\n\r\nThe humour and cast are the strongest parts to this film, it made me laugh a couple of times to be fair. Jet Li (Su) and DMX (Anthony) are the two leads, they aren't all that memorable in truth but at least do have a few good scenes. The main ones I'll remember are in fact two bit part roles in Anthony Anderson (Tommy) and Tom Arnold (Archie). Those two kept things comedic which worked well. Chi McBride is also solid as Chambers, who should've been the main villain in my opinion.\r\n\r\nThe premise is borderline rubbish, but the above mentioned things as well as the music/action made sure I was enjoying myself while watching this - that's sometimes all you want.", "created_at": "2020-09-08T23:57:03.878Z"}]