[{"movie_id": 12783, "review_id": "62adaf8d944a5703e4f6a750", "rating": 8.0, "review_text": "**A good period film, visually magnificent, but with several flaws from the point of view of accuracy and historical rigor.**\r\n\r\nGeorgiana Cavendish, born Spencer, was one of the most interesting, remarkable and charismatic personalities in British society at the end of the 18th century. She made an enviable marriage, for the period, by marrying the 5th Duke of Devonshire, one of the richest and most powerful British peers. However, they had nothing in common: the duke was a man of few words and saw marriage as a means to an end: to have a legitimate male heir. Georgiana, on the other hand, was not content to be just a decorative figure or a child-bearer. Unhappy, she found herself so lonely that she decided to accept the sexual affair that her husband started with her best friend, Lady Foster, who moves in to their house and has adulterous children with him, in a humiliating \"ménage à trois\" which the Duchess supports in exchange for the friendship of Lady Foster, on whom she becomes emotionally dependent. To this day, the moral attitude of both women is debatable, and also the extent to which Lady Foster didn't seek, from the beginning, to replace Georgiana, whom she envied and befriended in equal measure.\r\n\r\nFor the rest, we know that the three elements of this love triangle were not faithful, keeping, each one for himself, other affairs and sexual engagements outside this arrangement. When the Duchess became pregnant by one of her lovers, the much younger Charles Gray, she was forced to travel to France, where she gave birth, maintaining for the rest of her life a close but discreet relationship with her adulterous daughter. Upon returning to London, Georgiana changed: by accepting her conjugal situation, she began to look for a series of escapes and distractions that would make her existence bearable: her presence at parties and balls made her a fashion icon, and her support for the Whig Party influenced the course of British politics at the time. The hapless Georgiana developed a ruinous gambling addiction, perhaps depression and even an eating disorder, factors that greatly contributed to her rapid decline in health. She died early, with many debts, many admirers and some literary works published.\r\n\r\nAll this is the short story of this intriguing historical figure. The film, directed by Saul Dibb and starring Keira Knightley, takes a very light approach to her life, and sometimes fails to be faithful to historical facts (warning), even though it delights us visually. In fact, the production values are high, and the highlight is clearly the detailed and well-made costumes, and the sets, many of them handpicked from the most luxurious palatial interiors, capable of instantly transporting us to the time. And context. Also, the cinematography and filming work were well done, as well as the soundtrack, signed by Rachel Portman, is very good, making good use of various pieces of baroque music. The biggest negative criticism I feel I have to make is the editing work, which makes us waste a lot of time on minor details, causing the film to take on an uneven pace. The sense of time passing was not done properly either: we never quite understand the passage of years, since the characters don't age and nothing changes.\r\n\r\nAs for the cast, I think it's fair to congratulate Keira Knightley's work. The actress already has a long history of period films and seems to have developed a certain predilection for this type of dramatic work, so I felt quite comfortable with the role and the character. The way she played opposite and related to Ralph Fiennes is very good, and the actor is excellent in the way he assumes the reserved, distant and sometimes rude ways of the duke, whom she makes an unpleasant and morally controversial figure. Hayley Atwell was also very good in the role of Lady Foster, although she was not able to give the character the moral nuances and ambiguity that the historical character deserved to have. The film also has good minor appearances from Charlotte Rampling and Simon McBurney. Dominic Cooper did what he could in the role of Charles Gray, but I couldn't help but think the actor was too old for the character, who was several years younger than the Duchess.", "created_at": "2022-06-18T10:57:17.210Z"}]