[{"movie_id": 23168, "review_id": "51cd30dc19c2957695020b2d", "rating": 6.5, "review_text": "Good movie with good cast.\r\n\r\nNo new plot but well performed and entertaining.", "created_at": "2013-06-28T06:44:44.072Z"}, {"movie_id": 23168, "review_id": "5cd129ba0e0a262fcd09d78d", "rating": 9.0, "review_text": "You know people get up everyday, tell themselves something's gonna change their lives.\r\n\r\nThe Town is Charlestown, Boston, a place where crime is a way of life. Following a bank robbery, professional thief Doug MacRay (Ben Affleck) has to keep a watch on bank manager Claire Keesey (Rebecca Hall) because after using her as hostage leverage during escape from the heist, she is the only witness who could possibly identify his gang. But once the two meet they start to fall for each other, forcing MacRay to re-evaluate his life in Charlestown. It's a re-evaluation that will upset a lot of people close to him and the gangster boss who hires him, and all this at a time when FBI agent Adam Frawley (Jon Hamm) is closing in on the gang.\r\n\r\nOne of the most startling things about Ben Affleck's second film as director is that even with the conventional plot, and the formulaic characters, it's still an exhilarating and fresh picture. With Affleck comfortable in his Boston surroundings, it's evident that he and the team went for authenticity, something which in the main they achieve. Sure there's the odd implausible moments, they are - like it or not - cops and robbers staples, but \"The Town\" is not your standard run of the mill actioner. It is, for want of pigeon holing, a modern day noir, resplendent with bleak mood and well oiled characters. Based on Chuck Hogan's novel \"Prince of Thieves\", pic follows the formula of a rotten town with rotten people doing their best or worst to live and get by. Into the pot comes the bad guy who meets a good woman who wants to leave his crappy life and crappy home behind. So far so well trodden path, then, but this is not a giant gangland operation, like, say, \"The Departed\" or \"The Godfather\" et al, this is a small neighbourhood setting, with a small group of everyday dressed young men. It's one of the reasons why Affleck's film feels so very authentic.\r\n\r\nHelping to exude the naturalistic and human feel of the drama is that Affleck doesn't overdo his action sections, yet they are terrific sections for sure. This is not Tony Scott/Don Simpson/Jerry Bruckheimer action for popcorn excess. From the electric kick-start of the first heist, to the mid-section car chase - and to the knock out coup de grâce set in motion at Red Sox Stadium - Affleck shows great skill as a crafter of action - aided superbly by Dylan Tichenor's energised editing. Other violence is swift and to the point, the director knowing not to dwell too long on vicious passages in the narrative, thus keeping his characters free of caricatures. Mind, he is thankful to the great cast assembled for his picture, for this is very much an actors piece. Well written without flabby periods of talk for talk sake, The Town provides proper drama for proper actors - and that includes the director himself.\r\n\r\nJeremy Renner is quickly turning into the go to guy for edginess, here as MacRay's best pal, Jem, he deals out a frightening loose cannon turn. Chris Cooper and Pete Postlethwaite have small roles, but both impact hard on proceedings, both memorable and both adding a touch of classy know how. Hamm arguably has the hardest role, for as FBI Agent Frawley he has to carry on his own the other plot thread that is the investigation. Not just that, but the film lends itself to one which dares you to root for the bad guys, it's a tough ask of the \"Mad Men\" actor but he nails it, with one two-fold scene in a bar, as he grills MacRay's ex, Krista (Blake Lively heartfelt and believable), particularly offering a glimpse of what a good actor he can be. Ultimately the main load has to be carried by Affleck and Hall as the central doomed lovers. There is death and misery every where in Charlestown - and for the protagonists of the story, including Doug & Claire. Their relationship offers hope, a beacon of hope in a murky world, but it's a relationship founded on black secrets and built around falsehoods. That Affleck & Hall draw us in with charm and acting gravitas further serves notice as to why The Town is top draw stuff.\r\n\r\nHardships, hard decisions and hard characters come alive in The Town, a great modern day drama that's showing \"Gone Baby Gone\" was no fluke, this lad Affleck really is some director. 9/10", "created_at": "2019-05-07T06:46:18.922Z"}, {"movie_id": 23168, "review_id": "6309c7f4dcb6a3007bb3972c", "rating": 6.0, "review_text": "**Affleck does an excellent job, where Jeremy Renner particularly stands out.**\r\n\r\nI really enjoyed this film, where action, drama and romance are mixed in a well-balanced and intelligent way. The script is set in Boston, and takes us to meet a group of professional bank robbers, some of them with criminality in their blood and with incarcerated parents. The group makes an ostentatious robbery in which they force the manager to open the safe, and to go with them in the escape, as a human shield. Later, fearing that she might recognize them, one of the robbers decides to keep an eye on her, but ends up approaching her and starting a more personal relationship, which could threaten the group's illegal activities.\r\n\r\nThe screenplay is very well written and is intelligent in the way it presents itself and develops. It is not an original film, it brings elements and themes that have been repeated in cinema several times, and in much better films. Other than that, the film isn't particularly memorable or very impressive. Therefore, we cannot expect a brilliant work, but a good piece of cinema, which entertains us satisfactorily while it lasts.\r\n\r\nBen Affleck takes on the direction as well as the lead role, and he proved to be very confident and capable in both tasks. A recognized actor, he shines in the role of the heartthrob, and makes good use of his personal charisma. Jeremy Renner, however, shines in a very special way, managing to leave us here one of the most complete and powerful works of his career as an actor (not as impressive as “Hurt Locker”, but truly impressive). Rebecca Hall does an equally positive job, she is very beautiful and attractive, but she gives us a character full of content, personality and charisma. John Hamm, Chris Cooper and Blake Lively also don't let themselves be left behind and punctuate their work with high quality notes.\r\n\r\nTechnically, the film deserves a positive mention for the quality of the visual, special and sound effects, especially with regard to the action scenes. The film has plenty of action for moviegoers, though it's not gory, and the chases and robberies are truly lavish and Hollywood-worthy. The film makes good use of filming locations and sets, and the cinematography is elegant, well-executed, and enhanced by a good job of editing. Unfortunately, everything else, including the soundtrack, is relatively average.", "created_at": "2022-08-27T07:29:56.985Z"}]