[{"movie_id": 449562, "review_id": "5d6255ca6dea3a1851937c6b", "rating": 4.0, "review_text": "Normally, I really like Anne Hathaway. **Especially** recently. But not only did I think The Hustle was pretty bad, even she specifically was pretty bad in it.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._", "created_at": "2019-08-25T09:32:58.063Z"}, {"movie_id": 449562, "review_id": "5d66ff7cecbde9001095b7d0", "rating": 4.0, "review_text": "Point by point remake of Dirty Rotten Scoundrels and while I don't hold that movie in as high regards compared to others, this spit in its face with offering absolutely nothing new with the comedy falling flat at every turn and worse yet, where Michael Caine and Steve Martin were great together, Anne Hathaway and Rebel Wilson shared no chemistry.\r\n\r\nSince this movie did not deviate at all from Dirty Rotten Scoundrels, I found myself mostly bored and just waiting for it to end. Although I've seen worse, I was never angry or anything, just thinking what was the point?", "created_at": "2019-08-28T22:26:04.710Z"}, {"movie_id": 449562, "review_id": "624049215a9915005d50caa7", "rating": 4.0, "review_text": "A totally class-free remake of the var superior \"Bedtime Story\" (1964) that is both vulgar and crass. All it needed was a little bit of subtlety and it could have been quite a fun role-reversal caper; instead it is clumsy and cringe-makingly unsophisticated. No amount of glamorous location photography can make it any less so. I never leave the cinema half way through a film, but was sorely tempted with this nonsense.", "created_at": "2022-03-27T11:23:13.480Z"}, {"movie_id": 449562, "review_id": "63bf711fdf857c008926c758", "rating": 1.0, "review_text": "It's pretty much a re-make of \"Dirty Rotten Scoundrels\" which was itself a remake, only this one isn't as good.\r\n\r\nIt's actually just \"Dirty Rotten Scoundrels\" that has been gender swapped and, like all of the gender swapped remakes of late, the humor, the plot, the entire story is wrapped around the fact that the gender has been swapped, and done so without an actual story or humor.\r\n\r\nIt's basically a remake with women and the draw is intended to be that it has women in it this time rather than men... and that doesn't work without a story or actual jokes with punchlines and timing, jokes that divert expectations... not jokes that are revolved around a swap in characters and nothing more.\r\n\r\nSave your time, it's just like Ghostbusters, What Men Want, Oceans 8 and all the other movies that have done the exact same thing and failed because they lacked an actual story and humor", "created_at": "2023-01-12T02:31:59.736Z"}]