[{"movie_id": 109424, "review_id": "53a4dcc40e0a26143900058e", "rating": null, "review_text": "Allow me to start with what you likely have already read — this film is well-crafted and tense procedural about a true story. The fact that I still found it tense and exciting, even when I already knew the ending (including the oft-mentioned Captain Phillips ending scene) is a high compliment.\r\n\r\nSo why tell this story? I took it as a meditation on powerlessness, a film that didn't deal with heroes or villains, only victims. There's a shipping crew that is easily sought out by pirates, and there are the pirates that ultimately fail. In either case, it's not as if either side feels in control of their destiny. They're just playing to some largely unseen authority. After the crew deflects the first attempted piracy in the film, one character says that as a union member, he didn't sign up for this kind of danger. The reaction? He chose to work on a ship that went around the horn of Africa. \"What did you expect?\" he's asked. Later, when one of the pirates steps on broken glass and injures he foot, he's asked the very same question by his leaders. Even the two competing captains — the pirate and the title character — ultimately are swayed (or saved) by the power of the state. What did they expect? To be the one in control?", "created_at": "2014-06-21T01:15:48.267Z"}, {"movie_id": 109424, "review_id": "55d07b47c3a3681567007205", "rating": 8.0, "review_text": "Well done movie, good script and exceptional performances. Specially by Hanks and Abdi but also the rest of the pirates crew.\r\n\r\nHanks could have won the Oscar for this one.", "created_at": "2015-08-16T12:00:07.735Z"}, {"movie_id": 109424, "review_id": "58a9b9db9251417421009c6f", "rating": 10.0, "review_text": "Let me begin by saying that Captain Phillips, as an action film, turned out to be much more than I had initially anticipated. I was expecting half drama / half moderate action film with likely a good dash of political hopscotch. It's probably a good thing then, that I knew next to nothing about the actual story, because I love a good surprise. Captain Phillips is two hours of absolutely intense and absolutely uncompromising physical and psychological anxiety. At the end of it, I literally had to sit for a minute and just breathe, because this story gripped me by the throat like few films in recent memory have.\r\n\r\nFor those still unfamiliar with the story – this is a retelling of a historical event; the first US cargo ship in 200 years to be hijacked by pirates. During which, its captain Richard Phillips is taken hostage by the pirates, on his own lifeboat no less.\r\n\r\nI got the sense that, somewhere in between the lines it was the director's intention to perhaps create an opening for a different story to be told: that of the Somali pirates, and why they do what they do. We are told that they are fishermen, and sheer poverty has driven them to these desperate acts. However, I don't know for sure if I'm supposed to feel any sympathy for these men, if I was supposed to 'understand' their motives – if this was Paul Greengrass' intention, it didn't work. Because no matter which way you swing it, these pirates are the bad guys and that's as clear as day. No degree of poverty or despair should be held as an excuse for such gruesome acts. Then again, if this was at all the point, I'm glad it wasn't hammered down in any way. It was merely a thought, and one conveyed subtly enough for anyone to make up their own mind about this issue.\r\n\r\nWhat is clear here, is that these men (only four of them, surprisingly) committed a terrible crime. Not even so much the piracy itself, but the kidnapping and abuse of one individual. This individual is played by Tom Hanks, and he delivers one of his most eloquent and restrained performances to date. Here is a man, a captain of a large cargo ship, who is usually very much in control of his life and a clearheaded leader of his crew – but who, in the heat of reality, is just as human as any of us and simply does the best he can, even when (in spite of overwhelming protocol) one simply doesn't know what to do. Because protocol doesn't apply to the emotions that take control of both the captain and his captors, when they face a situation none of them anticipated. This is immediately one if my favourite performances by Tom Hanks, whose strength here lies mostly in the quiet moments in between all the chaos surrounding him. You can tell that he never stops thinking, never stops analyzing his situation, no matter what the pirates do to intimidate him. He conveys it all in the eyes – all the fear and anxiety, while constantly staying calm and collected, trying to talk to his captors, never losing his head. Even when fighting for his life, there is an assertive calmness that comes across so strongly that you can do nothing but admire this man. Hanks' performance is so convincing, it almost doesn't look like acting anymore... and that's a huge compliment.\r\n\r\nThe same goes for the other actors, especially the men playing the Somali pirates. Before being cast for this film, none of them had any acting experience, which makes their performances all the more impressive. Then, it also makes one wonder how much of a compliment it actually is when a director literally picks you off the street because apparently he thinks that you're perfectly fit for the part of a menacing pirate, but that's food for another discussion, another time... In any case, he was right about them. These men ARE absolutely convincing and authentic. Especially the leader of the gang, played by Barkhad Abdi, is right on the money. He needs nothing more than the look in his eyes to convince you that you're right to feel absolutely terrified of him.\r\n\r\nFrom a technical standpoint, Captain Phillips is very well made. My only grievance is Greengrass' typical trademark: the shaky handy-cam. Here and there it's almost enough to make you seasick, and I really wish he would ease up on this gimmick, because although it adds to the feeling of suspense and chaos, that doesn't weigh up to the headache it causes. Steady-cam was invented for a reason, mister director. Use it. Still, the other qualities of the film are easily strong enough to make up for this one point of critique. The pacing is excellent, it grips you like a pitbull and never lets go until the credits roll in. Colouring and lighting effects are perfectly used for an incredibly realistic feel and claustrophobic atmosphere. Everything feels very real and absolutely no sentimental plot devices are exploited here. Top-notch screen writing.\r\n\r\nI can do nothing other than strongly recommend this film. It is very intense and at times very violent, and definitely one of the best films in its genre. And if this doesn't convince you, see it for one of Tom Hanks' best performances of his career.\r\n_(December 2014)_", "created_at": "2017-02-19T15:29:31.915Z"}, {"movie_id": 109424, "review_id": "6351565ca0f1a2007962b1d4", "rating": 7.0, "review_text": "**Tension and chaos flood from incredible performances, making Captain Phillip’s powerful story riveting and compelling.**\r\n\r\nCaptain Phillips is a tense fast-paced movie about a heroic captain saving lives and battling for his survival from pirates in the waters off the Horn of Africa. Hanks’ performance elevates the film from good to fantastic, making the fear, suspense, and quick decisions more frantic and pivotal. Paul Greengrass’ directing matched the story well, delivering a gritty, realistic thriller grounded in this courageous true story. Even with a long runtime, the plot was gripping and engaging. The quality and tension remind me of Deepwater Horizon or Patriots Day. Captain Phillips is an excellent film with a great cast and a powerful story.", "created_at": "2022-10-20T14:08:28.586Z"}, {"movie_id": 109424, "review_id": "63daabc185702e05480dea1e", "rating": 9.0, "review_text": "Captain Phillips was fantastic, from start to finish. The performances were great featuring one of Tom Hanks' best. His calmness under extreme pressure was captivating but the ability to have that all crumble down once it is over was just, perfect. His raw portrayal of trauma was one of the most impressive feats of acting I've ever seen. For a nearly two and a half hour runtime, this movie was paced very well, filled with tension throughout. I was holding my breath in so many scenes as the pirates were within a foot of catching a crew mate or as they were creeping closer and closer in their small boarding boat. This constant tension mixed with a fantastic script and story left me glued to my screen for its entirety.\r\n\r\nScore: 89%\r\nVerdict: Excellent", "created_at": "2023-02-01T18:13:21.707Z"}]