[{"movie_id": 199373, "review_id": "5a95976892514154fa0004c0", "rating": 7.0, "review_text": "RELEASED IN 2013 and written & directed by Scott Walker, \"The Frozen Ground\" is a crime thriller based on the true story of Alaskan serial killer Robert Hansen, who raped, tortured and killed numerous young women from 1971-1983. Vanessa Hudgens plays a 17 year-old prostitute who successfully escaped from Hansen (John Cusack). Nicolas Cage plays the trooper who establishes a relationship with her as he zeroes-in on Hansen.    \r\n\r\nThis has elements like “Kiss the Girls” (1997), “The Flock” (2007) and “Hardcore” (1979). If you like those crime thrillers, you’ll appreciate this one. The Anchorage locations are perpetually overcast, but breathtaking and foreboding. Cusack is notable as the average-looking killer and Cage is stalwart as usual. The events take place in 1983 when anchorage was booming due to the pipeline and the ensuing sex industry. The scenes depicting the sleazy underbelly of the city (at that time) are well done and convincing.                             \r\n\r\nTHE MOVIE RUNS 1 hour 45 minutes and was shot entirely in Alaska. \r\n\r\nGRADE: B", "created_at": "2018-02-27T17:37:44.636Z"}, {"movie_id": 199373, "review_id": "5f1d71770e597b00343bffa8", "rating": 3.0, "review_text": "Very poorly edited and features some of the worst examples of Vanessa Hudgens acting to date (if there are good examples, I haven't seen them, but in _The Frozen Ground_ she is especially egregious.\r\n\r\nNo spoilers but I wonder if the real case this was based on wrapped up in the same way/for the same reason that this movie did, because if so... Jesus. What a tit.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._", "created_at": "2020-07-26T12:05:11.636Z"}, {"movie_id": 199373, "review_id": "605963b8b04228005488aa1b", "rating": 7.0, "review_text": "Watched this after it was recommended on a Podcast I listen to. One of the episodes was about Robert Hansen and all his victims. Watching the movie after listening o the podcast makes you realize all the things they left out and the horrific way that he killed all these women. Its a pretty standard police movie only you do know the criminal from the beginning the problem is trying to make the evidence stick to him. Seems like the local cops are on his side in the beginning. Its a pretty good movie to watch. Don't really need to pay attention one hundred percent but you will still under what is going on.\r\n\r\nIt would have been better if they focused more on Cindy Paulson and what she went through rather than the cop and his home life which really added nothing to the story. Even focusing more on the cop would have been fine but they barely showed anything and you really didn't need that small glimpse you got into his life. Exploring Hansen's family life would have added more to the story too. You don't see much except one interaction but you don't really understand how he could be hiding this big secret from the world. Seeing more of his wife and family might have clarified it.\r\n\r\nThe acting was amazing in this. Nicolas Cage bought his best and so did John Cusack and Vanessa Hudgens. Cusack went from being soft spoken and stuttering to losing his mind and being angry. I think he did that well and actually looked a bit like the actual killer. Vanessa Hudgens really made you feel for her character but also understand her fright and her situation. \r\n\r\nOverall, great movie to watch but not if you want something more than recounting of the events. Doesn't really go deep into anything. And you probably want to avoid this if you are sensitive to violence and sexual assault.", "created_at": "2021-03-23T03:42:48.752Z"}]