[{"movie_id": 230179, "review_id": "64500d1452dc7f02dddb5fe5", "rating": 2.0, "review_text": "**An American oddity made by Finns and set in Finland is still an American oddity.**\r\n\r\nHollywood has already used us to films where the sacrosanct figure of the President of the USA is the target of the most barbaric attacks, bloodthirsty enemies and a thousand and one terrorist attacks. Frequently, the president is sufficiently capable of extricating himself, with the indispensable help of his military and secret agents. Sometimes, however, he becomes something of a damsel in distress. This type of film is very pleasant, especially for the American public, as it appeals to the most basic patriotism and often places the USA as a kind of pivot of the West, a great defender of democracies and champion of freedoms, ignoring all sorts of atrocities what the US has done against other countries to defend economic and political interests that have little to do with democracy or freedom.\r\n\r\nWhat this film does is essentially take one of these films and place it in Lapland, a region in Finland that ordinary people only know because it's the land where Santa Claus lives. And it could have been Santa Claus to come to the rescue of the troubled president... but this time, the life of the champion of freedom is in the hands of a Finnish child, armed with a bow and a quiver of arrows. A small hunter who knows the forests, the sounds of hunting, the techniques to survive, but who will have to face a group of armed men.\r\n\r\nAs far as I know, it was the first Finnish film I saw, even though it is a co-production in which the USA bet a lot and which is almost entirely spoken in English. Directed by Jalmari Helander, a director who managed to go international and bring a bit of his country to the path of international cinema (we lack men like that in Portuguese cinema), it was a fun film that would have been better if it had more scenes in Finnish. I don't know if the majority of people in this country are fluent in English, like that boy, but such fluency in a foreign language – even if it is the most international language today – seems to me not very credible in such a young boy. And it would be good if this were the only unbelievable situation here, but unfortunately the film is full of moments where plausibility goes out the door.\r\n\r\nI liked the work of Samuel L. Jackson. He is an extremely competent actor for all sorts of action characters and has an extraordinary charisma that he puts to good use in the film. Despite not being, exactly, the protagonist, he assumes a certain protagonism in the story, not allowing himself to be captured without putting up a fight and without resistance, and establishing an excellent collaboration with the young actor Onni Tommila. The two actors are, to put it mildly, the only ones that deserve a special note. We can still add Ray Stevenson, but I felt several times that the actor seemed to be struggling with the material he was given, and Jim Broadbent doesn't have much to do here.\r\n\r\nThe best thing about this movie is that it's fun to watch, especially for anyone who likes American-style over-the-top action movies. It's full of action scenes, exaggerated and heroic moments, and that makes it able to entertain us. Of course, that doesn't mean it's a good movie. It's not. It lacks intelligence, it lacks logic, it lacks scenes in which we are able to see the real Finland and not the French Alps, it lacks visual and special effects that are really credible and worthy of the name. Finally, it lacks a soundtrack that is less presumptuous and strident, and more harmonic. Sibelius probably revolved in his grave when he listened to this film's soundtrack.", "created_at": "2023-05-01T19:03:48.756Z"}]