[{"movie_id": 324857, "review_id": "5c17088b92514132ba0be321", "rating": null, "review_text": "First of all, I love the animation style in this film. The animation in this film is styled to look like an actual comic book. I think this approach for this kind of film was an excellent choice because we’ve all seen the usual kind of animation but nothing like this. To tie in with the animation I need to talk about the action scenes in this film. These tie in with the animation because of the way the directors styled the action shots is to look like something in a comic panel. Most people don’t know who Miles Morales is and after this film, you’ll want to learn more about him because of how they made him so relatable in this film. He acts like a typical teen in this situation compared to other versions of Spider-Man. Other versions kind of just acted like they always knew how to use their powers when Miles struggles with his. Miles isn’t the only relatable character film all of them are. The creators of this film did a “Marvel”ous job at making each character in this film somebody at least one person in the audience can relate to. All of the voice actors did a great job in their respected roles but it would’ve been nice to have a returning voice to at least one of the Spider-Man. It would’ve been cool to hear a returning voice even if it was for a few seconds. I have to talk about the humour in this film. It isn’t overpowered in this film and I felt like it had just the right amount of humour that will make everybody laugh. They poke fun of things that wouldn’t make sense in a real movie and other Spider-Man movies. Not a single moment in this film felt rushed or slowed down every scene felt the right pace for a movie like this. The cinematography in this movie was spectacular. This is probably because of it looking like a comic book and how the lighting needs to match up with how it would look in an actual book. If you are a comic book junkie you’ll love all of the easter eggs in this film. Some of them just comic book readers will get but others a majority of people will understand. The music in this film is fantastic. Every song in this film isn’t overused and matches perfectly with the age of the character. Somebody Miles age would be listening to the type of music he listens to. And the music without lyrics helps increase the emotion in the film. Also, there are two end credit scenes that are worth waiting for. In the end, this film is perfect for everybody. I give Spider-Man: Into the Spider-Verse a 10/10.", "created_at": "2018-12-17T02:23:07.899Z"}, {"movie_id": 324857, "review_id": "5c6b7a529251412fc40c2bb0", "rating": 7.0, "review_text": "It's true I liked it less than perhaps the vast majority of _Spider-Verse's_ audience, but this was still great, the animation enamouring, and the depth of its story and reference totally engaging. Not to me the best Spider-Man movie as many have said, (that honour still goes to _Homecoming_) but a blast all the same.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2019-02-19T03:38:58.950Z"}, {"movie_id": 324857, "review_id": "5c9444f6c3a3682e53f23301", "rating": null, "review_text": "My wife doesn’t care for Spider-Man at all - as Batman is her favorite superhero.\r\n\r\nWith that being said, she loves this movie to death, along with my son and I. It’s safe to say we’ve watched this movie over 10 times and we’ve shown it to all our friends. It’s a really great movie that promotes diversity, good animation, and has a great story. I highly recommend to all who are interested in watching.", "created_at": "2019-03-22T02:14:14.626Z"}, {"movie_id": 324857, "review_id": "5cd04fcdc3a3684fbcdea3dd", "rating": 7.0, "review_text": "Spider-Man: Into the Spider-Verse (2018) is no ordinary Spider-Man movie, it contains multiple characters with the same powers in multiple dimensions.\r\n This is also not an ordinary animated movie. It has animated style we have never seen before. There were 177 animators and it took 1 week to animate 1 second and 1 year to nail down 10 seconds. Nowadays, animations are being made to look real but this movie was different. However, the creators wanted it to look like something new for viewers. They don't make it realistic or cartoon. The creators used an old-school technique called \"smear\". If you look in a single frame, you'll notice things like multiple limbs to create the illusion of movement. Basically, the entire movie was a comic book that moves. There is a technique in half-toning, which uses dots to create colors and gradients. They were really jaw-dropping. The shadows were created with hatching or crisscrossed lines. The movie had some textures so it would be exactly like a comic and I was glad that it deserved Oscars's Best Animated Feature. All of these techniques combined to make a movie that was the best animated feature not just in 2018 but perhaps of all time. It was really like a masterpiece of animation!\r\n The story plot was really good. The scenes were quite EPIC and sometimes tragic and hilarious. The unbelievable thing was when Peter Parker died in Miles' Dimension. It was really sad to see an iconic superhero killed by a supervillain. The deaths are moving and the hilarious scenes kept me laugh a lot. I like the end-credits when it started in the Animated Tv Show Spider-Man (1966) when the two Spider-Men look exactly like each other arguing, but this time, it was Spider-Man pointing to Spider-Man 2099. How did they do that? Perhaps the best moment to me was “A Leap of Faith” when Miles tried to be the one and only Spider-Man in his dimension, after Peter Parker was dead.\r\nI wasn't bored watching this movie, it kept my eyes open on the screen looking at the newest kind of animation. I was totally impressed! Perhaps this is the greatest animated movie of alll time! It was a really good idea to release this on Christmas!", "created_at": "2019-05-06T15:16:29.737Z"}, {"movie_id": 324857, "review_id": "5dc330a48d22fc00183ca033", "rating": null, "review_text": "Stan Lee would be proud! Great story, great message, and great animation.", "created_at": "2019-11-06T20:44:20.986Z"}, {"movie_id": 324857, "review_id": "5dc38a8a99259c00157a96be", "rating": null, "review_text": "It's easy to see how this became the visual masterpiece it is. The creators put a lot of love and passion into its making and the results are amazing!", "created_at": "2019-11-07T03:07:54.180Z"}, {"movie_id": 324857, "review_id": "5dc393cc8d22fc00123d455f", "rating": null, "review_text": "I was asleep most of the time while watching this film,  but during the times I was awake, I enjoyed the animation and it looked like something I would've enjoyed - if I weren't too busy dozing off.", "created_at": "2019-11-07T03:47:24.137Z"}, {"movie_id": 324857, "review_id": "5dc399b799259c00157ab520", "rating": null, "review_text": "I didn't expect I would enjoy this movie this much. The trailers looked too hyped for me and so I thought it would flop just like the other ones. Surprisingly, it didn't and I had my eyes glued to the screen because of the awesome animation the creators put out. Really good job!", "created_at": "2019-11-07T04:12:39.928Z"}, {"movie_id": 324857, "review_id": "5dc56f7e6f8d950010c2e4fe", "rating": null, "review_text": "Spider-Man has always been that character that I saw in live-action movies so to see him in an animated version was a first for me. It was hard for me to enjoy it at first but the movie didn't seem too bad and had a really good plot.", "created_at": "2019-11-08T13:37:02.640Z"}, {"movie_id": 324857, "review_id": "5dc57a69ab1bc70013ff31db", "rating": null, "review_text": "At first,  I expected I was gonna be disappointed because all of the trailers for this Spider-Man looked childish and too millennial for me. And being a fan of the Tobey Spider-Man, I had high expectations. Surprisingly though, I was able to still love the film!", "created_at": "2019-11-08T14:23:37.053Z"}, {"movie_id": 324857, "review_id": "5e00ef3fd1a89300198cc902", "rating": null, "review_text": "No doubt about it. This is truly Marvel, from the bold storytelling all the way to its stylish animations.", "created_at": "2019-12-23T16:45:51.105Z"}, {"movie_id": 324857, "review_id": "5e0102d465686e0015979678", "rating": null, "review_text": "A lot of risks were taken in this video and all that paid off giving us one hell of a film!", "created_at": "2019-12-23T18:09:24.928Z"}, {"movie_id": 324857, "review_id": "5e011ba326dac10014660944", "rating": null, "review_text": "Although the story was a textbook plot, it still had enough twists to satisfy both new and returning audiences.", "created_at": "2019-12-23T19:55:15.622Z"}, {"movie_id": 324857, "review_id": "5e0286a375110d0018db488a", "rating": null, "review_text": "This definitely has Stan Lee's seal of approval. People in the studio, be proud of yourselves. You have made Stan Lee proud.", "created_at": "2019-12-24T21:44:03.625Z"}, {"movie_id": 324857, "review_id": "5e092493fea0d70013bba0bb", "rating": null, "review_text": "One of the few films that lived up to the hype and even surpassed my expectations.", "created_at": "2019-12-29T22:11:31.487Z"}, {"movie_id": 324857, "review_id": "5e09c663b4a5430012c4ca42", "rating": null, "review_text": "Watched this movie a couple of times and I think it's safe to say that it's a near, perfect movie.", "created_at": "2019-12-30T09:41:55.671Z"}, {"movie_id": 324857, "review_id": "5e0e0cd69974ee0012a6d421", "rating": null, "review_text": "Animators really outdid themselves on this one by giving each character a uniqueness to them.", "created_at": "2020-01-02T15:31:34.004Z"}, {"movie_id": 324857, "review_id": "5e0e16f168b1ea00157f8301", "rating": null, "review_text": "Sony really nails making character movement look detailed and pronounced.", "created_at": "2020-01-02T16:14:41.314Z"}, {"movie_id": 324857, "review_id": "5e0e212c12c60400123f51c6", "rating": null, "review_text": "Despite having a plot that's almost predictable, the visual style and the way it was presented made the film feel fresh.", "created_at": "2020-01-02T16:58:20.647Z"}, {"movie_id": 324857, "review_id": "5e0e2ba9fd4f8000175e8135", "rating": null, "review_text": "The visuals, concepts, soundtrack, and characters are some of the best I've ever seen!", "created_at": "2020-01-02T17:43:05.971Z"}, {"movie_id": 324857, "review_id": "5e0e47e76dc6c000154d0b85", "rating": null, "review_text": "There really is no way to describe this film. It is just plain AMAZING!", "created_at": "2020-01-02T19:43:35.484Z"}, {"movie_id": 324857, "review_id": "5e0e531ac2f44b001330326b", "rating": null, "review_text": "Great storyline and cast, amazing soundtrack and stunning visuals. Big thanks to both Marvel and Sony for making Spider-Man great again.", "created_at": "2020-01-02T20:31:22.076Z"}, {"movie_id": 324857, "review_id": "5e0f0f6a663b8700177eb501", "rating": null, "review_text": "Visuals for this movie is definitely worth all the awards. No other words to describe it, just plain AMAZING.", "created_at": "2020-01-03T09:54:50.077Z"}, {"movie_id": 324857, "review_id": "5e0f427c663b8700137f0d13", "rating": null, "review_text": "Stunning visuals and mindblowing storyline. What else do you want? It's a superhero movie for everyone - literally everyone. You can be young, old, male, female, or whatever and you will still love this movie.", "created_at": "2020-01-03T13:32:44.119Z"}, {"movie_id": 324857, "review_id": "5e1080d25907de0017da758e", "rating": null, "review_text": "Darn good film! I must say it's really almost perfect for a superhero film. It's as if the comic books were given life and I was watching it through a screen. Amazing work right there!", "created_at": "2020-01-04T12:10:58.629Z"}, {"movie_id": 324857, "review_id": "5e124cfefc5f0600158f8412", "rating": null, "review_text": "A game-changer for the superhero film genre. Hopefully in a few years now we get to see more of near-perfect films such as this one.", "created_at": "2020-01-05T20:54:22.981Z"}, {"movie_id": 324857, "review_id": "5e126887fc5f0600158fb728", "rating": null, "review_text": "It's mindblowing how they were able to tell so many character back stories in such a short amount of time.", "created_at": "2020-01-05T22:51:51.021Z"}, {"movie_id": 324857, "review_id": "5e12c62ed8af670012be2dab", "rating": null, "review_text": "The stylish animation presented in this film was just top-notch. It feels like they combined comic book visuals and Playstation animation to create this perfect look.", "created_at": "2020-01-06T05:31:26.944Z"}, {"movie_id": 324857, "review_id": "5e12c62fd8af670012be2dac", "rating": null, "review_text": "The stylish animation presented in this film was just top-notch. It feels like they combined comic book visuals and Playstation animation to create this perfect look.", "created_at": "2020-01-06T05:31:27.326Z"}, {"movie_id": 324857, "review_id": "5e12ca4a8741c400143daa77", "rating": null, "review_text": "More than the visuals, the story was great. The pacing was just impressive and they told the story wonderfully.", "created_at": "2020-01-06T05:48:58.439Z"}, {"movie_id": 324857, "review_id": "5e12ce449020120013b75f17", "rating": null, "review_text": "Despite the short amount of time, it was incredible that they were able to give so much backstory to all the characters they had!", "created_at": "2020-01-06T06:05:56.712Z"}, {"movie_id": 324857, "review_id": "5e12d2b7d64ac2001865eb29", "rating": null, "review_text": "It's like reading a comic book and watching a movie at the same time! Indescribable!", "created_at": "2020-01-06T06:24:55.905Z"}, {"movie_id": 324857, "review_id": "5e20d7acbfeb8b0015cca1d5", "rating": null, "review_text": "Oh wow. I am blown away. How on Earth did an animated film such as this do so well? And how were they able to take all these separate characters and give them so much development without the film feeling like a drag.", "created_at": "2020-01-16T21:37:48.058Z"}, {"movie_id": 324857, "review_id": "5e20e10c397df00012966a5a", "rating": null, "review_text": "Alright. I can really tell that a lot of effort, love, and passion has been put into this film. And as with any film where creators really put a lot of soul into making, it came out really successful.", "created_at": "2020-01-16T22:17:48.110Z"}, {"movie_id": 324857, "review_id": "5e20f644bfeb8b0011cce55c", "rating": null, "review_text": "SONY redeemed themselves from the flop that was the Emoji Movie, and introduced one of the most amazing Spider-Man movies of all time! The animation, the pacing, the characters, and the musical scores -- all of these were perfect! Will definitely want to watch it again and again.", "created_at": "2020-01-16T23:48:20.886Z"}, {"movie_id": 324857, "review_id": "5e21de37cf4b8b0014f14c5f", "rating": null, "review_text": "If Stan Lee was still alive, I bet you he is smiling right now. Incredible animation and an awesome story goes a long way. If you haven't watched this one yet, I suggest you do because you're missing out on life.", "created_at": "2020-01-17T16:17:59.671Z"}, {"movie_id": 324857, "review_id": "5e24a55e1dcb770016ca05c7", "rating": null, "review_text": "The animation for this one is so on point. It is like watching a comic book come to life! The stylish way it was presented, along with the spectacular storytelling, made me love the Spider-Man that is Miles Morales more.", "created_at": "2020-01-19T18:52:14.787Z"}, {"movie_id": 324857, "review_id": "5e24acd2bfeb8b0013d440c7", "rating": null, "review_text": "I must say, I have doubts about this movie when it first came out because I was afraid of \"Sony\" being \"Sony\". But I’m glad I did watch it. Super solid movie with a very fulfilling Spider-Man origin story. 10/10", "created_at": "2020-01-19T19:24:02.948Z"}, {"movie_id": 324857, "review_id": "5e24b655bfeb8b0015d49123", "rating": null, "review_text": "Spider-Man: Into The Spiderverse is one of the movies that when you see, you will just be left speechless and dumbfounded because of the superior animation, amazing story, and great soundtrack which you can jam with anytime.", "created_at": "2020-01-19T20:04:37.169Z"}, {"movie_id": 324857, "review_id": "5e24bca3d6c300001742434a", "rating": null, "review_text": "This is a MASTERPIECE! Best experience of my life so far!", "created_at": "2020-01-19T20:31:31.482Z"}, {"movie_id": 324857, "review_id": "5e24c6085ed8e9001560e954", "rating": null, "review_text": "Stan Lee can rest easy in heaven knowing that his beloved Spidey has a very good movie now. Kudos to everyone who created this masterpiece of a movie. Excelsior!", "created_at": "2020-01-19T21:11:36.928Z"}, {"movie_id": 324857, "review_id": "5e24cbb8a894d6000f3a6e28", "rating": null, "review_text": "Everything felt cohesive. It was surprisingly hilarious in many different ways, that it became the somewhat core of the movie. Also, stay at the very end, it has a top-tier end credit scene.", "created_at": "2020-01-19T21:35:52.430Z"}, {"movie_id": 324857, "review_id": "5e24d2c3397df000169e9f19", "rating": null, "review_text": "Finally, Miles Morales has been given the spotlight after so many renditions of the Peter Parker version of Spider-man. This movie was everything I wanted, and I hope they will have a sequel just as amazing as this one.", "created_at": "2020-01-19T22:05:55.825Z"}, {"movie_id": 324857, "review_id": "5e26f24d1685da0013ded826", "rating": null, "review_text": "I have always been a fan of Spider-man ever since I was a kid, and I must say, forget the previous renditions of Spider-man, this one IS...THE...BOMB! Watch it if you haven't seen it yet. Seriously, watch it.", "created_at": "2020-01-21T12:45:02.001Z"}, {"movie_id": 324857, "review_id": "5e2701bb168935000f34b5d6", "rating": null, "review_text": "AESTHETICALLY PLEASING! This movie gave the \"comic book coming to life\" vibe that surely made all who were watching, Marvel fans or not, enjoy the movie till the very last second.", "created_at": "2020-01-21T13:50:51.520Z"}, {"movie_id": 324857, "review_id": "5e270fff168935001234c7b9", "rating": null, "review_text": "Appealing to all ages, teaches a lot of lessons, and full of surprises! 11/10 will watch again.", "created_at": "2020-01-21T14:51:43.452Z"}, {"movie_id": 324857, "review_id": "5e2908d24ca6760012421027", "rating": null, "review_text": "ONE OF THE BEST! It gave justice to our friendly neighborhood Spiderman, and all the scenes were amazing. It was like reading an animated comic book!", "created_at": "2020-01-23T02:45:38.910Z"}, {"movie_id": 324857, "review_id": "5e2916751685da0013e26143", "rating": null, "review_text": "If you haven't seen it yet, you're missing out on life! One of the best portrayal of Spider-Man for me, with fresh new characters and villains alike.", "created_at": "2020-01-23T03:43:49.797Z"}, {"movie_id": 324857, "review_id": "6046d1b33e01ea0058216d92", "rating": 7.0, "review_text": "I can see why this is highly regarded, especially if you have a connection as a comic reader. Alas, I do not, but I still had a good time watching this.\r\n\r\nIt was cool seeing every department of the story come together, while the animation is definitely one of its big plus points - I enjoyed seeing it. The voice cast all do respectable jobs too. I have no issues with this film, to be honest. I just guess there isn't anything I love about it either.\r\n\r\nShameik Moore is good in the lead, while Jake Johnson supports competently in his role. Hailee Steinfeld, Nicolas Cage and Kathryn Hahn, as well as a few others, stick out too. Away from the already mentioned, I also like the music - having already known about \"Sunflower\".\r\n\r\nEvidently it didn't connect to me, someone who has zero attachment to the source material, massively. That doesn't, though, change the fact that I did find enjoyment with <em>'Spider-Man: Into the Spider-Verse'</em> and I would certainly recommend it.", "created_at": "2021-03-09T01:38:59.571Z"}, {"movie_id": 324857, "review_id": "61caac70cdbaff009cb4d6c0", "rating": 10.0, "review_text": "Basically, if you disliked this movie, its probably just not for your, or you just hate good movies XD\r\nHard to hate a movie when you know so much love and care was put into it. \r\n\r\nAlways found it funny how this movie was made by the same company as \"The emoji movie\".\r\n\r\nJust watch the movie, its absolutely stellar, the only thing Id hate this movie for is the fact we didnt see much of anime spooder man XD", "created_at": "2021-12-28T06:19:28.537Z"}, {"movie_id": 324857, "review_id": "62b0bf489c24fc008b84e37e", "rating": 10.0, "review_text": "Full review: <a>https://www.tinakakadelis.com/beyond-the-cinerama-dome/2021/12/28/leap-of-faith-spider-man-into-the-spider-verse-review<a>\r\n\r\nThe superhero genre can feel tedious at times, especially to anyone who may not have had a strong childhood connection to these characters. Most of the movies in this category are retreads of the same old coming-into-superpowers narratives played over and over again, just set in different places and populated with different casts of characters. Every once in a while, though, a movie comes out and reinvigorates the genre. The animated _Spider-Man: Into the Spider-Verse_ has done exactly that.", "created_at": "2022-06-20T18:41:12.236Z"}, {"movie_id": 324857, "review_id": "635671c9d6c300007ad3512d", "rating": 7.0, "review_text": "I'm still a little wary of this multi-verse theme. I find it can lead to some seriously lazy writing as inter-dimensional characterisations can write, then re-write their own pasts and futures in a fashion that can become dull and repetitive quickly. This is not one of those. It centres around \"Miles\", a young lad who likes to hang out with his wayward uncle \"Aaron\" and who has a penchant for street art. It's whilst they are decorating an underground wall that he gets bitten by a spider and soon afterwards starts to feel the effects of his spidery-transformation. Meantime, the real \"Spider-Man\" aka \"Peter Parker\" falls foul of the evil \"Kingpin\" who has created a collider that will enable him to enter parallel realities in the hope of reuniting with his family, tragically lost to him years earlier. The more he messes with the timeline, though, the more chaotic the effects and the more our new, trainee, \"Spider-Man\" meets his equivalents from those different dimensions. It isn't long before they conclude that only as a team can they hope to thwart the megalomaniac and young \"Miles\" must find new inner strength to take charge of this mission to ensure all his colleagues get safely home. It's a good, characterful, story this - the youngster finding his feet and learning to use his new-found skills is entertaining to watch. The dialogue is frequently quite amusing, and the action scenes hold the attention rather than recycle themselves endlessly. As I watched it, I wondered if it might have made for a good exercise for 3D cinema. As it is, though, it's quickly paced with plenty of action, a little food-for-thought and it might just be the most \"human\" of the Spidey iterations I've yet seen.", "created_at": "2022-10-24T11:06:49.322Z"}, {"movie_id": 324857, "review_id": "63c1ed0223be46007cbabfce", "rating": 1.0, "review_text": "I'll be upfront, I'm giving this 1 star because of the treatment of Peter Parker.\r\n\r\nThey didn't do the Andrew Garfield thing and turn him into a bully. But they did do that Modern Marvel Comics thing and turn him into an idiot screw-up in an effort to alienate the fans and somehow make Miles better by mocking Peter.\r\n\r\nAnd I'm not a fan of that. Parker is a dork, he's got a smart mouth...but he's really smart, a genius, totally heroic, and well, the call him \"The Friendly Neighborhood Spider-Man\" for a reason. He cares, specifically he cares about the average working schulb.\r\n\r\nThis kind of just took Peter Parker and almost mocked him and, honestly, I can't get behind that. i couldn't get behind it when they turned him into a bully in the Garfield movies, and I don't care for it when they mock him here.", "created_at": "2023-01-13T23:45:06.935Z"}]