[{"movie_id": 68727, "review_id": "5c5badbc925141338cb97125", "rating": 9.0, "review_text": "But no piece of art is worth a human life... \r\n\r\nTrance is directed by Danny Boyle and adapted to screenplay by John Hodge from Joe Ahearne's film of the same name from 2001. It stars James McAvoy, Vincent Cassel and Rosario Dawson. Music is scored by Rick Smith and cinematography is by Anthony Dod Mantle. \r\n\r\nArt auctioneer worker Simon (McAvoy) does the double-cross on Franck (Cassel), his partner in an art heist, but after taking a blow to the head suffers amnesia and can't recall where he has hidden a stolen Goya masterpiece. Franck and his thug side-kicks decide to send Simon to hypnotherapist Elizabeth (Dawson) in the hope of unlocking the painting's hiding place. However, once the therapy starts, secrets come tumbling out and nothing is ever as it at first seems. \r\n\r\nAlready this early in the day after the film's release, we know for certain that Danny Boyle's foray into neo-noir is going to split his fan base considerably. Admired for his ability to turn his hand at any genre he fancies, Boyle reaches back to his earlier movies and comes up with a mind bending neo-noir that crackles with the kind of sexual edginess that Paul Verhoeven thrived upon. It sounds snobbish I know, and I have been called a neo-noir snob recently, but if all things noir are not your thing then this really is a film you should stay away from. Think Basic Instinct meets Inception and they take out a 40s Heist movie for drinks and you get an idea where we are at with Trance. \r\n\r\nAll the hallmarks of noir, both neo and conventional classics, are evident here, from characterisations to visual smarts, it's a noir head's dream and very much a must see on the big screen or on Blu-ray formats. Forget any notion of having someone to root for in this, there is scarcely a decent human bone on show. Characters are either fuelled by greed, lust, jealousy or vengeance, or quite simply just not smart enough to operate in the circles they move in. Amnesia is a key component of the story, something which again features a lot in olde noir, as does the central character being a complete dupe...To expand upon more would be stupid of me, the less you know the better it actually is upon first viewing. It really is a difficult film to discuss without delving into why it is such a trippy and deliciously cheeky piece of film. That's not to say that narratively it's smarter than a brain pie, because that's not the case. For as the threads untangle, several times, the mind meld aspect will fall apart if plot dissection is your thing? Also cramming so much \"brain food\" into the last quarter of film kind of feels like too much, overkill if you will. While Franck's side-kick bad boys are irritatingly disposable. Yet it's a film that begs to be seen more than once, twice, thrice even... \r\n\r\nVisually it's superlative, it's clear that Boyle and Mantle know and admire noir's visual splendours, with an awareness of atmospheric importance (noir is an atmosphere, not a genre. There's the snob in me again!) pulsing throughout. Set in London but filmed out of Dungeness in Kent, the backdrop is a city of steel and mirrors, a thriving city of wealth and mistrust. The tricks of the trade are here but never once is it style over substance, the visual ticks matter to the narrative. Night time overhead shots of a bustling city come and go, different colour tones for different character's apartments are clever, oblique camera angles ensure distortion of frame is equal to distortion of antagonists/protagonists minds (whose trance is this, really?...). Smudgey silhouettes through bronze glass, outrageous POV shots and caressing camera shots of the human form, no shot is wasted in the name of adding detail. Rest assured, Boyle brings his \"A\" game here. All of which is covered over by Smith's slow rumbling score that acts as a foreboding observer ready to unleash itself when the carnage begins. \r\n\r\nThe three principal actors come out firing and clearly are enjoying themselves. McAvoy cements his \"A\" list credentials with a multi layered performance, Cassel is as usual a mighty presence and Dawson, in a bold role, does her best work so far and hints she's ready to move into the big league. While it has to be noted that all three actors have to play their cards very close to their chests throughout; and do so admirably. Boyle's action construction is kinetic, with the pre-credits sequence one of the best opening sequences lately, and Hodge's script has a playfulness about it that ensures those paying attention know the film is self-mocking and not taking itself half as seriously as some film fans seem to think. An audience splitter it is sure to be, but for those with a bent for noirish sexy mind bending heist capers? Get in there! 9/10", "created_at": "2019-02-07T04:02:04.423Z"}]