[{"movie_id": 274855, "review_id": "5ae58ae40e0a26024900267b", "rating": 7.0, "review_text": "If you take this movie for what it is, an action / science fiction movie with emphasis on fiction, then it is, in my opinion, actually not too bad.\r\n\r\nThe movie starts of with the usual suspects, a bunch of political asswipes setting off to create their, equally usual, clusterfuck firing the one competent person they actually needed to run the climate control project successfully. To make matters worse the entire project are about to be turned over to “the international community” which of course is a well known recipe for disaster.\r\n\r\nHollywood lives in their usual dream world of course so they throw in suitable, old-fashioned, bad guy with the “correct” political views for a bad guy and with an outrageous and apocalyptic plan and we are all set.\r\n\r\nLet’s ignore all that crap and focus on the movie. Once that nonsense is out of the way what is left is a fairly entertaining science fiction disaster thriller movie. The special effects are not bad and the movie moves along at a decent pace. The “raison de etre” for this movie is the action and the special effects so the story and the acting is adequate and nothing more.\r\n\r\nUnfortunately, as is all too often the case, the story writer is a bit of a low watt bulb. This satellite network that is the foundation of the movie is fairly unrealistic even for a science fiction movie. Let’s forget about the total insanity in even trying to cover the planet in a network of satellites that are actually physically connected, the feats that these satellites achieve is just so far off the realism scale that is is annoying. What the heck are powering them? Anti-matter, black holes? This could have been done much better.\r\n\r\nThen we have the self destruct sequence that is playing a large part towards the end of the movie. What kind of fucking self destruct blows up a few bits and pieces for show and then pauses so the characters can run around for half an hour or so? Either the story writer is dumb as a door nail or he thinks the audience is that dumb.\r\n\r\nAnyway, the annoying parts aside, as a science fiction and fantasy geek this was a fairly entertaining movie for me.", "created_at": "2018-04-29T09:05:40.337Z"}, {"movie_id": 274855, "review_id": "5d17de9590fca33f29a8e526", "rating": 2.0, "review_text": "Today I attended a beautiful wedding where my baby sister took her vows, and started the next great chapter of her life. And then, when I got home, I inexplicably watched this piece of garbage, which might be the most subtle, yet clearly defined moment of emotional self-sabotage in my entire life. I am obviously unable to allow myself to be happy. \r\n\r\n<i>Geostorm</i> stars Gerard Butler as the least believable super scientist to ever exist. He looks like a drummer who is between bands and working part time as a bartender while he lives rent-free at his girlfriend's place. The plot is absurd even in the realm of sci-fi. The effects are awful, buildings topple over intact like giant building blocks, everything hot explodes, and typhoon waves deflect off of buildings and flow through the streets. \r\n\r\nEven if you couldn't guess every turn of the plot long before the movie manages to stumble toward it, the story wouldn't be any good. All of the humanity and heart is an afterthought: deadbeat dad makes his daughter a promise and has to save the world while he keeps it, weasel brother makes some hard choices to earn another chance with his family, etc. Basically, this movie is <i>The Wandering Earth</i> only even less entertaining.", "created_at": "2019-06-29T21:56:37.933Z"}, {"movie_id": 274855, "review_id": "5ed4d27521c4ca0021e3441c", "rating": 7.0, "review_text": "So cheesy it's good!", "created_at": "2020-06-01T10:03:33.322Z"}]