[{"movie_id": 521029, "review_id": "5d14c5d2bbd0b00030c14c88", "rating": 3.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nI went to this movie not expecting much, but it never crossed my mind that I would be watching a film as bad or worse than The Nun. Honestly, going back, I was too easy on the latter since I didn’t exactly give it a massively negative review, which it surely deserves. However, Annabelle Comes Home really tries its best to be even worse. I hate it. I truly do. The horror genre has been exponentially growing, and it’s one of the two most popular genres right now (comic-book movies are the other), but this cheap, bland, cliche, predictable, and forgettable class of horror films is genuinely starting to annoy and frustrate me. The Conjuring Universe became just a set of silly spin-offs with entities that have no interest whatsoever and filled with extremely under-developed characters.\r\n\r\nThis is the third movie about Annabelle. Three films that address the powers of a freaking doll. Three! Very few people liked the first one, the prequel was admittedly a pleasant surprise, but this one is just atrociously bad. There’s not even a story. The whole movie is based on repeating almost laughable jump scares sequences. Literally, it’s all some sort of variation of the following:\r\n\r\nCharacter walks down the hall -> A strange noise occurs-> Character slowly follows that noise -> Score starts to become louder -> Character checks something and camera closes in on the actor’s face -> Score becomes heavier and louder with the introduction of bass -> Another noise occurs behind the character -> Camera pans with the character and nothing happens -> Character continues to check on something -> Another noise, another pan, nothing again -> Score is reaching its climax -> Character continues doing the same thing -> Final noise, pan, and then one out of the two predictable jump scares happen: BOO! or Fake! … BOO! -> These are accompanied by a ridiculously loud sound that everyone in the theater is already bracing for because, guess what, everyone knows it’s coming -> Cut -> Repeat.\r\n\r\nExcept for the first 15-20 minutes, which are used to solely provide backstory to the three main characters, every single scene is an uninspired, unimaginative, anticipated, and tedious build-up to a jump scare that heavily relies on an exaggeratedly loud sound, and someone screaming. There’s no real narrative besides some character backstories which also have their own issues, especially one that involves an attempt at the start of a silly romance. Gary Dauberman tried to insert comedy in order to balance an otherwise monotonous film, but he failed miserably. Every supposedly funny moment is astonishingly cringe-worthy. It was his directorial feature-debut, and it shows.\r\n\r\nIt just feels like another cheap horror flick, filled with nothing but jump scares. One after the other. Every director in Hollywood could have done this, there’s no distinct style or a trademark shot. Nothing. I do believe that every movie takes a lot of work, and there are tons of people behind a film that genuinely give it their all every time. But Annabelle Comes Home feels so much like a pure cash grab, and I hate writing these words because every movie ever is ultimately an attempt to win money for the studios. However, this sequel never feels like it’s actually serving any purpose for the expansion or improvement of the universe it represents. It’s a horror flick filmed in just one location, something that I usually love because you can do so much with it, but this time it really seems that it was filmed entirely at a house because it was cheaper, hence more probability of profit.\r\n\r\nThere are two clear areas in the horror genre: the zone with films like Hereditary, Get Out and Us, where the story and its characters are what’s more important and scarier; and the other with movies like The Nun, The Curse of La Llorona or Annabelle Comes Home, where the only goal is to cyclically produce jump scare sequences with no narrative significance or impact. If you enjoy this latter type of films (which is absolutely okay, everything is subjective to personal preferences), then you’ll probably enjoy this movie. At least, people in my theater screamed and laughed pretty hard with no respect for the moviegoers that were trying to watch the actual film. However, if you’re sick of watching the same thing over and over and over and over again, please, for your own sake, skip it.\r\n\r\nIf it wasn’t for the truly amazing performances, this could very easily be the worst movie of the year (Serenity still holds that spot). McKenna Grace is phenomenal as Judy! Madison Iseman and Katie Sarife are also pretty good at their roles. Patrick Wilson and Vera Farmiga barely have any screentime, but when they do show up, they definitely elevate the scene. Everything related to the production design is quite good, but technicalities will never save a film from misery if the two pillars of any movie (story and characters) are thrown down the sewer. Also, I was shocked when I discovered that this is Rated R. There’s barely any blood or anything that justifies that type of rating. It’s another aspect that makes this film an even bigger disappointment.\r\n\r\nIn the end, Annabelle Comes Home is as poor or worse than The Nun. I can’t really decide which one I would watch instead of the other because I truly don’t want to watch any of these ever again. A brilliant cast might save this movie from a completely negative review, but it’s still an atrociously cheap addition to the horror genre. Everyone knows why this film doesn’t work: continuously repeating predictable, loud, and hollow jump scare sequences is not a story. I can’t feel invested in any of these scenes if they lack narrative impact or a minimum level of scariness. The fact that I barely even instinctively flinched (something I can’t really avoid) is a sign of how horrible this movie is. My expectations for The Conjuring 3 just dropped tremendously. Good luck, James Wan. You’re going to need it.\r\n\r\nRating: D", "created_at": "2019-06-27T13:34:10.843Z"}, {"movie_id": 521029, "review_id": "5d9c8de26b5fc2001ed8b96f", "rating": 5.0, "review_text": "I was a little less worried about a third _Annabelle_ movie than I was the second one, because, well this came off the back of that second one, and that second one was okay. But that second one came off the back of the first _Annabelle_ movie... And that was a fucking disaster. Lots of people say that the whole Conjuring franchise is a cool thing, but nothing has come close to the quality of that first _The Conjuring_ movie. Respectfully, I disagree. The franchise as a whole is okay, but not only is has something better come out post-_The Conjuring_, furthermore, I'm gonna go ahead and say that the first _Conjuring_ movie isn't even really that good. The only entry I've given a favourable review (\"favourable\" here meaning \"more than a 5 outta 10\") iissss *dramatic pause* THIS O- no I'm kidding it's _Conjuring 2. Conjuring 2_ is the good one and everything else ranges from \"alright\" to \"dumpster fire\", and the first _Annabelle_ is firmly at the bottom of that dumpster fire. What's the next best entry? The crème de la compètènt? It's... Oh my God I think it actually is this one... You guys is _Annabelle Comes Home_ the closes thing we've got to a second good movie? ...Fuck... I'm pretty sure it is.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-10-08T13:23:46.079Z"}, {"movie_id": 521029, "review_id": "5d9d0139a5046e004382b2a7", "rating": 3.0, "review_text": "Hopefully this brings an end to a dreadful trilogy. Not as terrible as the first one at least but this had nothing to offer and yet another one of these movies where an evil supernatural entity seems more intent on f'ing around with the characters rather than actually harming them. One upside was the acting at least wasn't terrible and, albeit they were only in it for 10-minutes, I did like seeing Patrick Wilson and Vera Farmiga. **1.75/5**", "created_at": "2019-10-08T21:35:53.042Z"}, {"movie_id": 521029, "review_id": "64c86cfeb9744200ad31520b", "rating": 8.0, "review_text": "This movie is easily my favorite out of the series. Cause not only are they dealing with annabelle but they have to deal with multiple ghost and haunting.", "created_at": "2023-08-01T02:25:02.882Z"}]