[{"movie_id": 653851, "review_id": "6385bfd1229ae21572a9c785", "rating": 7.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://www.msbreviews.com/movie-reviews/devotion-spoiler-free-review\r\n\r\n\"Devotion tells a character-driven story with emotionally complex protagonists, proudly focusing on honoring forgotten heroes and interestingly developing moral themes despite the somewhat repetitive structure.\r\n\r\nIt may not have the energetic, intense action of \"that other planes flick\", but it doesn't need to either, as the film's engine is found in the in-depth arcs of each character. Jonathan Majors and Glen Powell are phenomenal, bringing tremendous authenticity to their roles and interactions.\r\n\r\nA character study that won't have the success of its genre counterpart but that deserves to be seen on the big screen.\"\r\n\r\nRating: B", "created_at": "2022-11-29T08:16:17.564Z"}, {"movie_id": 653851, "review_id": "63daaaaca9117f0083ff75fc", "rating": 8.0, "review_text": "It is a shame that Devotion was somewhat overshadowed with another somewhat popular aviator movie this year... but, it separates itself with a more grounded and dramatic approach.\r\n\r\nDevotion follows the first Black aviator, Jessie Brown, (Jonathan Majors) and his friendship with fellow pilot Tom Hudner, (Glen Powell). At first, the two are at odds with each other, trying to gauge what type of man they were. Overtime the two grow an incredible bond that is extremely genuine as they persevere the struggles of the war and the constant racism Brown endures.\r\n\r\nThe main relationship of this movie worked incredibly well, the chemistry between Majors and Powell was infectious. Hudner displays a genuine desire to be a good person and stand up for Brown, but his naiveness gets in his way as he does not see his actions are causing more harm than good. This film does a great job of portraying the nuances of racism, some old and some that still are relevant today. It did so very soft handed and as a backdrop of the film, which worked well in delivering the main narrative of this emotional story.\r\n\r\nI would have to argue that the action in this film is almost better than Top Gun: Maverick. Almost every action scene is in combat with enemy fighters and anti-air tanks, as opposed to training sessions and montages. This creates a much more tense experience as at any second our main characters could get shot down or killed. The high stakes mixed with great cinematography created a very riveting action experience.\r\n\r\nOverall, I had a really great time with this film. It is great balance of action and drama with an ending that brought tears to my eye.\r\n\r\nScore: 79%\r\nVerdict: Great", "created_at": "2023-02-01T18:08:44.165Z"}, {"movie_id": 653851, "review_id": "63e9f2fc63aad200a14d40d6", "rating": 6.0, "review_text": "Glen Powell again dons his flying suit for this passable tribute to two fighter pilots who fought during the Korean war. He is Tom Hudner, whom together with Jesse Brown (Jonathan Majors) became joined at the hip as the latter became the former pilot's wingman. They both joined the US Navy at around the same time and their bond is little short of brotherhood as they undergo combat training and then combat itself together. It's on one such mission that that friendship is tested to the extreme... This is a well produced and good looking film that illustrates well the extent of loyalties and inter-dependencies of these men on each other and on their equipment. It also demonstrates the dangers of warfare, even for those flying at great speed several hundred feet up in the air, and it does both quite well. The acting, though, is a little dry with there actually being little chemistry between the two men here. The writing is adequate and there is plenty of airborne photography to bring it alive, but somehow that sense of brotherhood is just lacking. History tells us that this is true, and like so many wartime stories serves to illustrate that racism has no place in anyone's heart. It is way less gung-ho and ye-ha than many of this genre which is good - I just wish they had cast it a bit more strongly.", "created_at": "2023-02-13T08:21:16.916Z"}, {"movie_id": 653851, "review_id": "63f41a1415376c008bc151b2", "rating": 7.0, "review_text": "The <em>'<a href=\"https://letterboxd.com/film/top-gun-maverick/\" rel=\"nofollow\">Top Gun: Maverick</a>'</em> comparisons are unfortunately hard to shake, but <em>'Devotion'</em> remains a good flick.\r\n\r\nJonathan Majors produces a very good performance here, particularly in one or two scenes where he is particularly brilliant. Glen Powell, also in that other 2022 film of course, is good too. I don't think their onscreen chemistry is perfect, but I did enjoy watching 'em and respect their (based on real life) characters.\r\n\r\nThe look of the film visually is pleasant, good to see them use practical effects; aerial stunt coordinator Kevin LaRosa worked on this, having, you guessed it, worked on that <em>'<a href=\"https://letterboxd.com/film/top-gun/\" rel=\"nofollow\">Top Gun</a>'</em> sequel. Towards the end, I thoroughly enjoyed the music - it sets the tone for the conclusion ideally.\r\n\r\nSomewhat of a shame this didn't come out a few years earlier or later than it in fact did. I still dig it on its own merits, all the same.", "created_at": "2023-02-21T01:10:44.291Z"}]