[{"movie_id": 11423, "review_id": "63ac248dc8113d00ae3fc7b8", "rating": 8.0, "review_text": "Doch eines ist sicher, alle die sich auf das koreanische Kino einlassen können werden bei „Memories of a Murder“ mit einem Film belohnt, der nachwirkt, der nach dem Abspann nicht nur ein weiterer gesehener Film ist. Man liest es vielleicht aus dieser Rezension raus, dass „Memories of a Murder“ überzeugen konnte und genau deswegen sollte auch klar sein, was Ihr nun tun solltet. Genau! Schaut Euch „Memories of a Murder“ an. Überzeugt Euch selbst davon, wie vielschichtig und spannend dieser Film ist. Fiebert selbst mit den Ermittlern mit und rätselt wer die Taten begangen hat. „Memories of a Murder“ ist sicher kein einfacher Film und auch kein „Feel Good“-Film, aber ein mehr als sehenswerter Film. [Sneakfilm.de]", "created_at": "2022-12-28T11:12:13.779Z"}, {"movie_id": 11423, "review_id": "64f4c8c43d43e00138f6f195", "rating": 7.0, "review_text": "This is cracking serial killer drama from Bong Joon Ho - with some superb performances - that tracks a police investigation trying almost every technique known to man to trace a rapist/murderer who is terrorising young women (especially if it is raining and if they are wearing red). Kang-ho Song, Sang-kyung Kim and Roe-ha Kim don't exactly see eye to eye as they set about their task, adopting some scientific and not-so scientific approaches to their detection. The stylish and witty writing allows the characters to develop at a slow, but steady and interesting pace - using humour, pathos and violence - and at times it is the methods and attitudes of the police that appear under more scrutiny than the perpetrator of the crimes! Sadly, though, it does sag towards the end. The sharp pace of the writing and the intensity of the performances having reached a pretty high plateau, comes off the boil a bit and I found the ending annoyingly self-defeating: the identity of the criminal being less important to me than the collapsing integrity of those charged with his discovery. We never quite get back to that high standard of storytelling achieved in the first 90 minutes and as the quirkiness of the plot becomes more subsumed into the increasing frustrations of the investigators, the film becomes more and more a generic crime thriller losing much of its uniqueness. Certainly well worth watching, but perhaps it could have been shaved a bit to maintain the jeopardy.", "created_at": "2023-09-03T17:56:20.531Z"}]