[{"movie_id": 10145, "review_id": "5b3918810e0a2675e0005f78", "rating": 7.0, "review_text": "Love vs. cold analytical thought\r\n\r\nRELEASED IN 2004 and directed by Joseph Ruben, \"The Forgotten\" relays the story of Telly (Julianne Moore), a mother who discovers all traces of her deceased 9 year-old son have been erased, including photos, videos, documents and the memories of other people. Her psychologist (Gary Sinise) and husband tell her she's delusional, but she KNOWS otherwise. Thus begins a thrilling search for the truth wherein she teams-up with Ash (Dominic West) and tangles with NSA agents and more.\r\n\r\nThe reviews to “The Forgotten” couldn't be more opposite, which isn't necessarily a bad thing since some of the best artistic items polarize opinion. The film admittedly has weaknesses and those who don’t like it zero-in on these flaws.\r\n\r\nIn style, it is similar to \"The Mothman Prophesies\" (2002), but not as good, intricate or artistic. There are similarities to The X-Files with the two protagonists, one being a female redhead, searching for the truth in what is essentially a sci-fi/mystery tale with the government somehow being involved.\r\n\r\nBecause of the highly mixed reviews I was watching the first 15 minutes only half-attentive, but when Telly (Moore) confronts Ash (West) and subsequently teams-up with him my attention perked up. Ash is an ex-NHL player who's given up on life and turned to alcohol to drown out his sorrows. What tragic event happened that would cause him to throw in the towel and turn to the bottle? I'll leave that to you to discover.\r\n\r\nAnyway, remember the great masculine actors of the past, like Charlton Heston, Clint Eastwood, Burt Reynolds and perhaps even Marlon Brando? There was just something about them that set ’em apart and made you take notice when they were on screen. Dominic West is such an actor. He's reminiscent of James Remar, whom you might remember as Ajax in \"The Warriors\" (1979).\r\n\r\nThe subplot of Ash's drunkenness struck a chord with me because I know people, incredibly talented people like Ash, who've essentially given up and given in to alcohol, wasting their lives away. Not to mention the fact that I've been seriously tempted to give up as well at times (albeit not to alcohol). I can relate and I'm sure you can too.\r\n\r\nAs noted, the film is a sci-fi/mystery tale and therefore the explanation (no spoilers) is rather outlandish, but not necessarily unbelievable. \"Flightplan\" (2005) was a similarly-themed film; although its explanation was not outlandish, just totally unbelievable. So if you can't handle outlandishness I suggest you forget \"The Forgotten.\"\r\n\r\n\"The Forgotten\" is essentially a story of love v.s. cold analytical thought. Personally I fall right in the middle between these two dynamics. This conflict is what made the character of Spock so fascinating. Remember the Star Trek episode \"This Side of Paradise\" where he was able to walk free of his strict adherence to logic and experience the warmth & joy of love for the first time? At the end of the episode he sadly states that it was the first time in his life that he was truly happy.\r\n\r\n\"The Forgotten\" is a story of tortuous struggle and potential triumph, for both Telly and Ash. Although logic is important, love is more powerful. Not to mention warmer and life-inducing.\r\n\r\nThe film is short and sweet at a mere 1 hour and 26 minutes before credits. The DVD features an extended cut with an alternative ending wherein the possible conspiracy is less malevolent. Watch the theatrical cut first and then simply go to the deleted scenes section and watch the two deleted scenes and the alternate ending (unless you want to watch the ENTIRE film twice, that is; it's just not necessary). I'll say this: the kissing scene should have never been omitted. It works. But perhaps the filmmakers didn't want to paint Telly as a potential adulterer, which isn't a bad thing.\r\n\r\nDon't listen to the grumps who didn't 'get' \"The Forgotten.\" The reason they didn't 'get' it is because their pendulum veers too heavily toward cold logic, but they don't have to stay that way. :)\r\n\r\nTHE MOVIE RUNS 1 hour, 39 minutes and was shot in the New York City area. WRITER: Gerald Di Pego.\r\n\r\nGRADE: B/B-", "created_at": "2018-07-01T18:08:01.848Z"}]