[{"movie_id": 118289, "review_id": "52f1eed692514115b0098ca7", "rating": 5.0, "review_text": "Naomi Watts portrays a great Diana but the movie is otherwise meaningless. It wants to focus on her love story with Dr. Hasnat leaving everything aside, even everything else that could have done this movie interesting.", "created_at": "2014-02-05T07:57:10.846Z"}, {"movie_id": 118289, "review_id": "54218bc0c3a36818d2001865", "rating": 7.0, "review_text": "A biographical movie of princess Diana. It tells the story of her last two years of life, especially the romance side. A better movie than I anticipated. I think Jessica Chastain would have been also a good choice to play the role princess Diana, anyway Naomi Watts excelled in her opportunity. The movie did not fail because of the cast, characters and performances, the thing is I really don't know why, different people say different reason, but I enjoyed it. This real incident was happened when I was a little kid, I did not know the whole story then till I watch it now.\r\n\r\n**‘‘There's about 5 billion people on this planet who can say\r\nthey love me! But is there one who can stay with me?’’**\r\n\r\nAfter all Diana was also a human like everybody else and I did not find anything wrong with her romantic affair in her final days. In fact, as a cinematic it chronicles on the sufficient amount of limited characters. Lots of the big names were just left out. That's great because the movie had all the time to concentrate on the particular relationship. Except that I waited for the end tragedy scene which never came. I assumed, that could have been the highlight of the movie, which might have brought the tears. So I believe it is a great let down, the movie did not have the car crash scene. Especially the real reason behind it remains fishy and mystery. Naveen Andrews was great, but he was no way near to Hasnat Khan in appearance.\r\n\r\nThere might be some flaws in the movie, because in the biopics people often complain about many things. Those who observed all this incident closely at that time when it happened may recognize errors. But I feel modification sometimes need while transforming a real life to cinematic. Like any romantic movie it can be enjoyed by everyone who love biography. I did and liked it, certainly not a class movie like it should have been.", "created_at": "2014-09-23T15:03:28.468Z"}]