[{"movie_id": 447200, "review_id": "5b4c4c9b9251417d1103157e", "rating": 5.0, "review_text": "You might expect a former FBI agent to be able to handle a gun, or protect himself at gunpoint. But you sure as hell don’t expect a doctor to, and yet, Sarah Sawyer can not only steal a gun pointed at her, she can stop a burning building’s fire without even being in the building!\r\n\r\nWill Sawyer’s posed with a challenge when the tablet that he was for some reason given with full control of the security system and just about everything else about the building, gets stolen, the building set on fire, and his family stuck above the fire with little means to get out.\r\n\r\nWill, who is now a suspect, takes it upon himself to enter the burning building, get his family, and leave the burning building. This isn’t as easy as that sounds, because there’s a MacGuffin to be gotten and the people that set the building on fire will stop at nothing to get it. Oh, and did I mention **he only has one leg!**\r\n\r\n_Minor spoilers ahead._\r\n\r\nSkyscraper was extremely predictable, the only thing I didn’t see coming was the fact that they wasted five minutes of our time showing Will telling Sarah to turn off and back on her phone to fix it, just to set up the ending where Sarah turns off and back on the building to stop the fire.\r\n\r\nThe one thing I did enjoy from this film was near the ending when they’re in _The Pearl_, but you don’t watch a movie for a single scene.\r\n\r\nRawson Thurber should stick to comedy, where he has experience. This is a waste of the $125,000,000 it took to make it, and it’s a waste of the $12 to watch it. Skip this one.", "created_at": "2018-07-16T07:43:23.071Z"}, {"movie_id": 447200, "review_id": "5c161753c3a36866c7375d20", "rating": 6.0, "review_text": "Well, if you are a fan of The Rock this is a decent enough high octane action, disaster and special effects movie. If not, well then you probably have to be a pretty big fan of special effects and action to overlook its weak points.\r\n\r\nLet’s start with the good stuff. One, it is The Rock (yes I am a fan) although he certainly doesn’t come out at his best in this movie. Personally I could do without the artificial leg crap but it didn’t bother me too much in the end. It didn’t really add anything except some silly (and unrealistic scenes) though.\r\n\r\nThen we have the action and the special effects. They were as good as you would expect from a multi million dollar action movie. At least I enjoyed them. I really liked the design of the Skyscraper. I thought it was booth cool and beautiful. I kind of would like to see it built in real life.\r\n\r\nWas the movie derivative? Well of course it can be said to be derivative! How many movies with burning Skyscrapers and bad guys hi-jacking them can you make before it becomes derivative after all? The first movie named Skyscraper was made in 1928 for Christ sake. It didn’t bother me at all.\r\n\r\nNow for the not so good. The movie was hugely predictable. I mean, you could tell who the bad guys were from the first scene they were in. Especially the rat faced jerk Mr Pierce. The main bad guy? Well, he was no Hans Gruber that’s for sure. More like a common thug. The movie really lacked a bad guy with some charisma. Overall, most of the movie from start to finish was really a no-surprise-there event from the first bad guy entering the scene to the rebooting of the systems.\r\n\r\nThen we have the realism factor. I do not expect an action and special effects movie to be realistic but there are some limits. Sawyer climbing around on the outside of the building (with one leg remember) in the updraft from 50 or so burning levels was just nonsense. Also, a building burning that much and that long and yet all the electrical wiring and plumbing still working was a bit too much. The absolutely worst offence though was how everyone magically survived sitting in the middle of the fire being extinguished by the release of halon gas (or some equivalent). That just brings stupidity (or maybe laziness) in script writing to a whole new level.\r\n\r\nSo, to sum it up, this move could have been a lot better. To me it was saved by The Rock and my love of special effects loaded action movies.", "created_at": "2018-12-16T09:13:55.778Z"}, {"movie_id": 447200, "review_id": "5c4464609251412be8ddf5e1", "rating": 4.0, "review_text": "_Die Hard in a (X)_ is a pretty classic movie formula, it doesn't get as much play now as it did in the 80s and 90s, but we can still reliably expect at **least** one every couple of years, even now. But when it's _Die Hard in a Skyscraper_... I mean... That's just _Die Hard_. Even _Die Hard 2_ had the sensibility to be _Die Hard in an Airport_.\r\n\r\nExcept that, no, this isn't just _Die Hard_, because (and I don't think anyone would be shocked to find this) it's not as good. I mean I love The Rock and all, but come on.\r\n\r\nFinal rating:★★ - Had some things that appeal to me, but a poor finished product.", "created_at": "2019-01-20T12:06:56.800Z"}, {"movie_id": 447200, "review_id": "5cc54cff0e0a265b0ff615ae", "rating": 6.0, "review_text": "It's an ultimate frame of mind movie.\r\n\r\nIt is what it is, it's Dwayne \"The Rock\" Johnson as the hero of the tale who has to achieve the impossible when the world's tallest building catches fire. His family is trapped in said building inferno and there's bad guys running around creating trouble.\r\n\r\nSo sit down and get ready for fantastically high energy action scenes and hold your breath peril sequences. You have to be in the right frame of mind for this type of entertainment, to understand it's a blockbusting popcorn piece made to take you out of the real world, it does not have cranial splendours or social commentary.\r\n\r\nIt's great to have Neve Campbell back kicking butt, rising above just being a female token waiting to be saved by her heroic husband. And of course if you can't smile at the makers having Johnson being handicapped with an artificial leg - and still turning into Usain Bolt for various scenes - then this isn't the film for you.\r\n\r\nSome way short of the classy verve of The Towering Inferno or the brutal brilliance of Die Hard, this does its job handsomely enough for the like minded souls after some escapist carnage. 6/10", "created_at": "2019-04-28T06:49:35.289Z"}]