[{"movie_id": 336050, "review_id": "572a046c9251414b850013e3", "rating": 7.0, "review_text": "> Experiencing what Saul's seeing, hearing and undertaking.\r\n\r\nThe World War II is the largest source supplier for the war movies. I have seen numerous breathtaking braverism, as well as heartbreakingly suffering film characters which are based on the real and sometimes fiction. The genre too differs, from action, adventure, war to the comedy, romance, drama et cetera. Since the Academy Awards nominee announcement in the January I had an eye on this, but now it had won the Oscars that draw my interest even more on this. Anyway, finally saw this, so let me tell you what I feel about it.\r\n\r\nIt is no ones biopic, but inspired by a collection of testimonies of those who had made out alive from the Auschwitz. Like some of the WWII films, it is very unique, that focused on a particular event and a person. Saul is one of the prisoners in the Nazi held concentration camp who is a slave-labour. His job is to clean the place after prisoners were executed. One day he finds a young boy who was executed and soon he takes the responsibility to give him a proper burial. Risking his own life and others, he begins to find a rabbi to perform the last rites. So what happens later and how it ends is the remaining film.\r\n\r\nIt is not only enthralling story, but was very clever and unique filmmaking. In this whole film you will see one face at all the time in different angles and mostly they're close shots. Yes, Saul is everywhere, the camera never takes off its lens out of him. We would experience what he sees, listening and undertaking, more like in the real time. Just like a computer game where everything is from our (player's) angle, but here it is us again barely through the Saul's perspective. (Something like the upcoming Hollywood film 'Hardcore Henry' trailer I saw.)\r\n\r\nAlthough, the movies are not the games, like I felt weird during watching 'Need for Speed', when Aaron Paul was at my place. And a movie always needs a character that can take us to the journey through the time and space where it sets, otherwise it will be called a documentary film. The aspect ratio was like the older day films which is narrow that takes time for us to get used to it, yet it is a colour film. More like the entire story is taking place within the 48 hours. Interesting pace and developments, and a decent conclusion. I think it deserved all the praise and prizes given to it.\r\n\r\n> \"You have forsaken the living for the dead.\"\r\n\r\nI know the seriousness of the film and its contents, but I could not avoid the laugh at the end scene. I did not want to, but I did it without my self-awareness after seeing the Saul's face. I hope, there are others too, like me in that situation. Yet the storyline was very strong, like how far would a man can go knowing the life is meaningless after what he's going through. That makes him to take a solo mission when others are struggling and working together for their freedom.\r\n\r\nSince I don't know any language that spoken in the movie, I had no problem too to follow the movie. The 1944 settings were so realistic, I think everyone's hard-work was this film's result. All the performances were excellent, especially who played the Saul's role. That is the face no one is going to forget who had watched this film. However the real hero of the film was not the actors or the writers and the director, but the cameraman. Like I said earlier, he had done a brilliant job. If anyone wants to praise this film, he/she must begin with him. The cinematography award at the Oscars might have went to 'The Revenant', but the cameraman award is none other than this guy who shot this film.\r\n\r\nI really liked this film, but not overly sympathised or enjoyed. Usually if any movie that's based on the real gets my favour, even the movie has been low quality with more than ignorable flaws. Because telling the truth to the world is what I consider is foremost important than trying to get benefit out of it. But when it's not factual, I expect whatever the cinematical options can make it a better product.\r\n\r\nThis film comes between them both, but leans mostly on the truth about the World War II prison camp. An insight of what the prisoners have went through. Painful to watch a movie like this, at a time I appreciate the filmmakers for giving this film and let the younger generation know a tiny dot of the incident of the WWII. To watch this film, no one needs a reason. It is automatically a must see, but after watching it, whether you liked it or not is an individual opinion.\r\n\r\n7/10", "created_at": "2016-05-04T14:17:16.885Z"}]