[{"movie_id": 8204, "review_id": "6501790c5545ca00ab5d9ddc", "rating": 9.0, "review_text": "**This fantasy film deserves our sympathy and attention.**\r\n\r\nThis is a good film to watch with the family because it will easily appeal to young people and adults alike. However, I think it never received the attention it deserved, perhaps due to the fact that it was released at a time when the fantasy genre was dominated by a group of other much stronger and more relevant films. The film also strives to show the hidden side of knowledge as something dangerous, less than desirable, following the logic of “there are things we simply shouldn’t know”.\r\n\r\nThe story begins when a recently divorced woman moves with her children to a rustic house in the forest, which belongs to a great-aunt hospitalized as crazy. This house has been closed for a long time, there is salt on all the windows and an industrial amount of tomato sauce and honey in the kitchen pantry. Intriguing. It is quite evident from the beginning that the brothers get along badly, and that the youngest is very attached to his father and waits for him to return. And it is precisely he who begins to hear noises that convince him that there is something more in the house. He discovers a book with a dark warning, but still decides to read it, finding himself in the power of a series of hidden knowledge that should never have reached him, and that were collected eighty years earlier by a great-uncle, who disappeared without a trace.\r\n\r\nLike I said, it's a good film and tells a good story. The characters are good, from the humans to the enchanted figures, and there's a lot of entertainment and creativity here. It didn't have a great reception in America, but it was a success in Europe and continues to appear on television from time to time. Directed by Mark Waters, who already has some experience in films for young people, but was far from being a name to consider from the outset, it has a good group of actors. Freddie Highmore shows talent and commitment, which opened many doors for him in the following years, and Irishwoman Sarah Bolger is not far behind. David Strathairn and Joan Plowright are the adult actors who deserve the most praise for their efforts here. Both were very good, and brought credible and adorably magical characters to life. Nick Nolte also makes a cameo appearance.\r\n\r\nTechnically, the film relies heavily on high-quality CGI, great visual impact and scenic effect. There's no doubt that there was a lot of money invested in the visuals and cinematography, and it paid off: the film doesn't feel unrealistic or overly fanciful. The enchanted objects and characters seem realistic, worthy of the credit we want to give them. The colors are magnificent, the light is ideal, the studio filming was well done and the house where the film takes place is visually magnificent, worthy of a fairy tale. James Horner provides the soundtrack in an effective but not memorable way.", "created_at": "2023-09-13T08:55:40.374Z"}]