[{"movie_id": 166424, "review_id": "566ee1a19251415ec500f899", "rating": 7.0, "review_text": "> Too slow and dramatised superhero flick, but acceptable.\r\n\r\nI can't say I liked the previous films and not this one. In fact, I kind of enjoyed watching this reboot. It was much better than what I have heard about it. At least it did not sound like a loud and lousy like any modern sci-fi flicks, chasing bad guys, bombing cities and downing buildings. But as a superhero and sci-fi film, it had its moment, only at the end.\r\n\r\nObviously the film was too slow and dramatisation was a backslash keeping the youngsters (audience) in mind. I actually expected hefty stunt sequences. Without actions, a superhero movie is like a limbless spider and toothless shark. If the web and tooth are the superpowers, then they must handle it quite smartly. So that is where this film failed to be a clever. This film had 4 superheroes and until the climax they were impotent. Which means the only superhero movie in the recent time that meant for older people. Precisely to say, if you are a 30+, you might enjoy it as I did. I know I can't talk for you and what kind of movies you like, but I know todays youngsters who refuse dramas and accept action-adventures.\r\n\r\nI agree it did not deliver as it should have been as a theatrical feature where surround speakers are ready to give us a breathtaking sound mix. I felt it some kind of a television episode. Because that is how the modern television series are presented. Personally, I would like to say that don't mind my words and the review, because I usually enjoy all the films I watch. So this one was average to me, but definitely not a bad and I won't slam it. Though I recommend it for old people who does not like modern high-octane stunts.\r\n\r\n6/10", "created_at": "2015-12-14T15:34:57.449Z"}, {"movie_id": 166424, "review_id": "5986ff11c3a3680d5100fbd6", "rating": 8.0, "review_text": "I just saw this and I wasn't expecting much as I have read some really negative reviews about it online and elsewhere. Honestly, I think they were wrong. It's not a bad film at all, just not as fast paced as the previous version which I quite liked too ... mind you, I am 60+ so maybe that has something to do with it. A scifi/action film for the older generation perhaps? I really enjoyed it. I gave it 4/5 stars here.", "created_at": "2017-08-06T11:35:45.152Z"}, {"movie_id": 166424, "review_id": "5a85c0770e0a2653b3024b57", "rating": 6.0, "review_text": "I was actually not having great hopes for this movie giving how Hollywood have screwed up with a lot of my favourite super heroes (Spiderman, Fantastic Four, Dare Devil and a few others). Having said that maybe there was still a glimmer of hope given that some of their latest Marvel work have been rather okay. Unfortunately this is not the reboot of the Fantastic Four that I, and a dare say the fans, hoped for.\r\n\r\nOne thing that I do not understand is why the dumbass script writers that Hollywood employs always have to change the basic story of a set of characters that have a solid fan base? There was nothing wrong with the original story, and thus origin, of the Fantastic Four and the source of their powers. Maybe I am just old-fashioned but still.\r\n\r\nThe second gripe I have with this movie is the nonsensical stuff with members of the Fantastic Four, especially Ben, being deployed by the US military. It is just so cliché. Lazy script writing plain and simple. Unfortunately this also causes the movie to not really feel like it is a Fantastic Four movie. The team is split up and it is not until the very end that they actually become a team, gets a headquarter and so on. Big fail as far as I am concerned.\r\n\r\nHaving said all that, I do not think it is as bad as some people claim. There are some good stuff in there. The story is not all bad after all even though it is not exactly to my liking and the special effects are quite okay. One thing that annoys me with the story is that the role of Reed is really diminished and he is never really allowed to show of his powers. Yes, I know, there are some “stretching” moments but, well, meh! To add to the pain the actor cast as Reed is, in my mind, totally unconvincing.\r\n\r\nThe bad guy is also somewhat underwhelming and thoroughly predictable. As I said a classical Hollywood concoction aimed towards the less intelligent viewers. I do not understand why Hollywood seems to be so bent on repeating the same mistakes over and over again?\r\n\r\nWell, as I wrote, the movie is not as bad as some people claim but it is far from great. Given the abysmal reviews I am afraid that we will not be getting a sequel which is a shame. This is one of the (few) Marvel comics that I read as a kid (in Sweden we did not get treated to that many of these kind of comics) so it is indeed a bit of a disappointment that they managed to screw this movie up…again.", "created_at": "2018-02-15T17:16:39.484Z"}, {"movie_id": 166424, "review_id": "63967095a0f1a200c880f1eb", "rating": 8.0, "review_text": "**Better remake but with unneccessary hate**\r\n\r\nBetter story than the first film with less of the annoying hollywood romantics. Could do better with the humour.\r\n\r\nAccompanied with better graphics too as it's 2015. Of course, the mainstream hate exists because our hollywood world has its dumb morals.", "created_at": "2022-12-12T00:06:45.699Z"}]