[{"movie_id": 14161, "review_id": "519a3369760ee37bb029a010", "rating": null, "review_text": "In 2009 is geoloog Adrian Helmsley op bezoek in India bij een collega en krijgt te horen dat door een grote zonnevlam neutrino's tegenwoordig microgolven afgeven. Daardoor warmt de kern van de aarde met grote snelheid op wat zal leiden tot rampzalige gevolgen voor de planeet. Adrian haast zich terug naar de Verenigde Staten en waarschuwt Anheuser, stafchef van het Witte Huis, die op zijn beurt de president inlicht. Adrian maakt vanaf dan deel uit van de staf van de president en wordt gevraagd een schema te maken van de mogelijke gebeurtenissen die zullen plaatsvinden in de komende jaren.\r\nIn 2012 blijkt dat de president opdracht heeft gegeven om 8 grote arken te bouwen waarin 800.000 mensen op basis van DNA, expertise en wetenschap zich schuil zouden kunnen houden. Inmiddels weten ook alle leiders van de meeste landen in de wereld van dit plan af en worden er selecties gemaakt. Ondertussen komt Jackson Curtis in Los Angeles zijn kinderen ophalen bij zijn ex-vrouw Kate (die samenwoont met haar vriend Gordon). Hij neemt z'n kinderen mee naar Yellowstone National Park. Daar worden ze vervolgens meegenomen door het leger en ontmoeten Adrian, die hen de smoes voorlegt dat Yellowstone in moeilijkheden verkeert en daarom geen toeristen toestaat. Ook ontmoeten ze Charlie Frost, die een eigen radiozender heeft en Jackson vertelt dat de wereld binnenkort vergaat. Hij zegt erbij dat er een grote groep mensen is die plaats mag nemen in \"ruimteschepen\" waar hij de locatie van weet. Jackson brengt op verzoek van zijn ex-vrouw zijn kinderen terug naar L.A., alwaar hij hoort dat er een aardbeving heeft plaatsgevonden die een grote scheur in de aarde heeft veroorzaakt. In het Witte Huis wordt duidelijk dat het schema van Adrian sneller verloopt dan ze dachten, en dat door de grote hitte van de aardkern de mantel ook vloeibaarder is geworden, waardoor de aardkorst als het ware \"los\" kan drijven, en dus zal gaan verschuiven. Ook krijgen ze te horen dat er maar 4 arken op tijd klaar zullen zijn. Jackson wordt opgeroepen als chauffeur om de zoons van de Russische miljardair Yuri Karpov op te halen en ze naar het vliegveld te brengen. Hier laat één van de zoons per ongeluk los dat zij de rampen zullen overleven en Jackson niet. Met de informatie die Jackson al van Charlie kreeg, realiseert hij zich dat er inderdaad rampzalige dingen zullen gaan gebeuren, en hij rijdt terug naar L.A. om z'n familie op te halen. Hij gebruikt een vliegtuig en Gordon, die amateurpiloot is, is uiteindelijk gedwongen het vliegtuig te besturen wanneer hun piloot blijkt te zijn omgekomen. Terwijl ze opstijgen is de familie Curtis getuige van de complete verwoesting van Los Angeles. De stad verdwijnt door de aardkorstverschuiving volledig in de Stille Oceaan.\r\nIn het Witte Huis wordt Adrian verteld dat de aardkorstverschuiving voor honderden aardbevingen heeft gezorgd en al 2 miljoen slachtoffers heeft geëist. President Wilson geeft het bevel dat zijn personeel zo snel mogelijk het vliegtuig in moet om naar China te vertrekken, waar de ruimteschepen liggen. Hij onthult ook aan Adrian dat hij zelf niet mee zal gaan, omdat iemand de rest van de wereld op de hoogte zal moeten brengen van de komende rampen die tot het einde van de wereld zullen leiden. De president vindt dat hijzelf daar de aangewezen persoon voor is. Adrian gaat vervolgens met Anheuser en andere personeelsleden aan boord van een Air Force One. Jackson beseft intussen dat als ze het willen overleven, ze de locatie van de schepen moeten zien te achterhalen. Hij overtuigt Gordon er daarom van om naar Yellowstone te vliegen en Charlie te vinden, om zo de locatie van de \"ruimteschepen\" te achterhalen. Terwijl Gordon het vliegtuig bijvult met brandstof, gaat Jackson op zoek naar Charlie en vindt hem. Hij vertelt dat de kaart in zijn camper ligt. Jackson weet net op tijd weg te komen als de vulkaan onder Yellowstone plotseling uitbarst. De familie ontsnapt met het vliegtuig net op tijd aan de aswolken. Jackson ontdekt op de kaart dat ze naar China moeten en ze landen uiteindelijk in Las Vegas om nieuwe brandstof te tanken. Hier lopen ze Yuri en z'n gezin tegen het lijf. Hun vliegtuig is gecrasht. Yuri's piloot Sascha neemt vervolgens een oude Antonov An-225 over, maar heeft een co-piloot nodig, waardoor de familie Curtis en Gordon mee kunnen. Ze willen landen in Hawaï om meer brandstof te tanken, maar ontdekken dat Hawaï volledig is veranderd in een vulkanisch gebied. Ze zijn gedwongen verder te vliegen. Sascha voorspelt dat ze binnen 15 minuten in de Stille Oceaan zullen neerstorten. Wanneer hij door de wolken heen is, ziet hij dat waar de oceaan zou moeten zijn, een grote ijsmassa te vinden is. Jackson realiseert zich dat de aardkorstverschuivingstheorie werkelijk bestaat. Ze storten neer op een gletsjer waarbij Sascha omkomt. Vervolgens worden ze gevonden door Chinese troepen, die bezig zijn dieren over te brengen naar de schepen. De soldaten nemen Yuri en z'n kinderen mee wanneer hij zijn tickets laat zien. Daardoor blijven de familie Curtis, Gordon en Yuri's vriendin Tamara (die geen ticket had) achter. In China, bij de schepen, wordt duidelijk dat van één van de arken het dak is ingestort door de aardkorstverschuiving en wordt het Laura en Adrian duidelijk dat de passagiers helemaal niet op basis van DNA en wetenschap zijn gekozen, maar dat rijke mensen hun toegang hebben kunnen kopen: zij hebben per ticket 1 miljard euro neergeteld. Adrian wordt vervolgens door zijn Indiase collega opgebeld met de mededeling dat India op het punt staat overspoeld te worden door een gigantische tsunami. Hierdoor beseft Adrian dat de tsunami hen eerder zal bereiken dan gepland, en dat ze op moeten schieten. Wanneer Anheuser dit hoort, maakt hij de beslissing de poorten van de schepen eerder te sluiten, waardoor tienduizenden mensen, onder wie Yuri en zijn zoons, buitengesloten worden.\r\nJackson en z'n familie worden intussen opgepikt door een Tibetaanse monnik die op weg is naar de schepen om aan boord te gaan. Ze worden door diens broer aan boord gesmokkeld van een ark via de machinekamer en Jackson beseft dat de schepen geen ruimteschepen maar arken zijn. Ze komen vast te zitten wanneer de poorten weer zakken op bevel van Adrian, die de buitengesloten mensen toch wil binnenlaten. Gordon wordt tussen de tandwielen geslingerd en overlijdt, en tegelijk komt ook een drilboor vast te zitten tussen de motoren, waardoor de poort niet meer volledig kan sluiten. Yuri weet z'n kinderen net op tijd aan boord te krijgen, maar valt vervolgens zelf van het platform en sterft. Nu de poort niet meer volledig sluit, kan de bemanning de motoren niet starten. De tsunami komt al snel hun kant op en water begint de ark binnen te stromen, waarna de passagiers benedendeks door het water waden. Jackson en z'n gezin worden gesplitst doordat waterbestendige deuren sluiten. Daardoor komen zij in verschillende compartimenten terecht. Adrian ziet via de camera's dat Jackson aan boord is weten te komen en haast zich naar de compartimenten om hem en zijn familie te redden. Tamara, die alleen zit, verdrinkt al snel wanneer het water te hoog komt. Jackson hoort van Adrian dat de compartimenten alleen maar open kunnen gaan wanneer de boor uit de motoren wordt gehaald en het hele systeem weer werkt. Met hulp van z'n zoontje Noah weet Jackson dit voor elkaar te krijgen. De poort sluit weer zodat de motoren kunnen worden gestart en een botsing met de Mount Everest ternauwernood wordt voorkomen. Jackson en z'n familie maar ook de monniken worden bevrijd, en Jackson en Kate herenigen zich.\r\n27 dagen later (datum: \"27ste dag van de eerste maand, jaar 0001\") krijgen de arken de eerste satellietfoto binnen, waaruit duidelijk wordt dat Afrika het enige continent is dat niet volledig is overstroomd. Het ligt nu zelfs hoger, waardoor de Drakensbergen nu de hoogste bergen ter wereld zijn. Uit metingen wordt duidelijk dat de lucht weer enigszins schoon is en dat de poorten van de arken kunnen worden geopend. Daardoor kan de mensheid voor het eerst sinds de overstroming weer naar buiten.", "created_at": "2013-05-20T14:30:01.033Z"}, {"movie_id": 14161, "review_id": "56473fc09251413ae10033a4", "rating": 7.0, "review_text": "And the public gets what the public wants.\r\n\r\nRoland Emmerich was armed with a $200 million budget, and this is what it produced. It's an easy film to dislike from an intellectual level, artistically as well, while the science fiction boffins no doubt had kittens where the science was concerned. It's also easily one hour too long in length, and come the second half of the marathon it starts to sag. There's only so many times you can watch your lead protagonists escape crumbling carnage - via various modes of transport - before the fun factor begins to wane. However.\r\n\r\nThe carnage effects are grade \"A\" stuff, eye popping and ear splintering, Emmerich is a master at this sort of thing, and with a likable cast comfortably chewing through the safe disaster film making screenplay, it's a very decent popcorn blockbuster. It also isn't afraid to explore some dark moments, all of which - while not all being a surprise - strike strong emotional chords. It knows its disaster movie roots and is happy to tug on them.\r\n\r\n2012 made a $500 million profit, that's a figure not to be ignored. The blockbuster movie loving public lapped it up, they often love this stuff, they just want to see the world exploding and chases and crashes and humans imploding or being heroic. If you have to strip it bare on any sort of cerebral level, then of course it's naked. But fully clothed, attired purely in modern film popcorn clobber, then it's grand dramatic and exciting fun. And this even as you have to massage your buttocks at the two hour mark. 7/10", "created_at": "2015-11-14T14:05:52.685Z"}, {"movie_id": 14161, "review_id": "641525529d893900d74893c8", "rating": 8.0, "review_text": "If you like end of the world type movies, then this one is for you. I love this movie more then other end of world movies, because it has multiple disasters that happen. Citizens try to survive them all.", "created_at": "2023-03-18T02:43:30.188Z"}, {"movie_id": 14161, "review_id": "641886ca3103250086f9345d", "rating": 8.0, "review_text": "If you like end of the world type movies, then this one is for you. I love this movie more then other end of world movies, because it has multiple disasters that happen. Citizens try to survive them all.", "created_at": "2023-03-20T16:16:10.573Z"}]