[{"movie_id": 245, "review_id": "5e777e742f3b17001152937a", "rating": 7.0, "review_text": "It didn't kill me softly. \r\n \r\nWill is self centered and has cast off all his responsibilities. But during one of his more dubious scams to date single mothers, he is forced to reconsider his moral fibre after coming into contact with a 12 year old outcast named Marcus.\r\n\r\nAdapted from the massively popular book written by Nick Hornby (\"Fever Pitch\" & \"High Fidelity\") About A Boy easily translates well to the screen without truly breaking free of the modest premise. Oddly enough for such a British picture, this is directed by an American, Paul Weitz, who along with his brother Chris, brought the world \"American Pie\". It works, largely to the undervalued comic talents of one Hugh Grant (Will). I would go so far as to say that without Grant leading the film, this would have been a flop, all the highlights on offer are when Grant is on the screen. Expressive with his face and delivering his lines with a natural high, Grant nicely lures the audience into the less than admirable Will's hands. Which is quite a trick considering that Will is a morally dubious scum bag!.\r\n\r\nNicholas Hoult (Marcus) is OK as child actors go, but here he is given far to much to do. Which is another reason why Grant is so important to the film being a success, he shoulders much of the emotional burden, letting Hoult breathe what life he can into poor young Marcus (worst hair cut on film ever). Solid support comes from Toni Collette and Rachael Weisz, and Weitz's direction is smooth and unobtrusive, with Badly Drawn Boy's score an integral part of the story. Yet as much as I enjoy the film myself, one still feels frustrated that it didn't turn out better than it did. A double handed narration from both lead characters intrudes on the flow of the plot, and the pay off is ultimately an \"oh\" moment. So to me it's an OK movie made into a good one courtesy of one of Britain's best light comedy actors. 7/10", "created_at": "2020-03-22T15:04:20.126Z"}]