[{"movie_id": 361292, "review_id": "5c4565f50e0a264965c6a5ca", "rating": 9.0, "review_text": "Luca's \"Suspiria\" brought me no words.\r\n\r\nThe horror in this movie is not like anything else I've ever heard or seen. The sheer film in Luca's \"Suspiria\" is not like anything that is made by major movie studios such as Columbia, Paramount, 20th Century Fox, Disney, and the like. Director Luca Guadagnino transitioning from the LGBTQ+ drama adaptation \"Call Me By Your Name\" — transitioning to the avant-garde, psychological study in his version of famed director Dario Argento's 1977 \"Suspiria\".\r\n\r\nHorror movies today don't scare me. Horror movies of the 21st century seem to be involved in so much gratuitous gore, typical plotlines, a roulette set of actors playing quasi-characterization, varying degress of quality. Luca's \"Suspiria\" — a horror movie from 2018 — did not scare me. Luca's \"Suspiria\" unnerved me. Luca's \"Suspiria\" built slowly in tension, but also captivated me with raw interest — \"Suspiria\" dealt its final blow, finishing with a nightmarish sixth act and an epilogue.\r\n\r\nArgento's \"Suspiria\" is a movie out of time in its own way. Argento's \"Suspiria\", a film released in 1977, looks fresh and modern — Argento's \"Suspiria\"'s fixation on primary neon colors and gore — Argento's \"Suspiria\" with prog-rock, percussion score by the band Goblin. Director Dario Argento, however, does not like Luca's \"Suspiria\". Director Dario Argento claims it is without spirit, fear and music — Argento thinks the design is beautiful, so Guadagnino must have done something right.\r\n\r\nLuca's \"Suspiria\" is a movie unlike anything out of sheer audacity to become its own. Luca's \"Suspiria\" in the way it handles narrative into six different, self-contained \"acts\" ending with an epilogue — Luca's \"Suspiria\" in its washed-out, bleak setting complementing queer, disenfranchised coloring and nonconforming visual narrative — Luca's \"Suspiria\" with its brooding realism, mysterious witchcraft and black magic — Luca's \"Suspiria\" with mesmerizing visuals; unexplained syntax; self-contained exposure; restraint. Horror in Luca's \"Suspiria\" is much more than simple disgusting imagery — Gore in Luca's \"Suspiria\" is far and in between, but is visceral and disgusting all the same — Nudity in Luca's \"Suspiria\" is all female, except one male.\r\n\r\nPolitics and dance in Luca's \"Suspiria\" are vital to understanding 2018 \"Suspiria\". Dance carries witchcraft and spells, and with it — uncompromising emotion, femininity, power, and rawness. The German Autumn of 1977, in which Luca's \"Suspiria\" is set in a time where Berlin is divided into East and West (and when Argento's \"Suspiria\" was released). The Lufthansa hijacking and the RAF faction. The mention of the Third Reich by Dr. Klemperer as a religion, and a delusion. What is and is not a delusion.\r\n\r\nThere's something dramatic about Luca's \"Suspiria\" itself. Dr. Lutz Klemperer in losing his beloved wife, Anke, in the Holocaust. Sara in losing her beloved friend, Patricia. Madame Blanc in beginning to love her newfound daughter, only to regret what she has done to her. The three girls in the ritual wishing for death, to be given a motherly kiss and then die. Klemperer's meek inability to stop what he has witnessed through psychotherapy; his helpless stature in the finale. His erased memory to absolve him of his guilt, and of what he had to witness.\r\n\r\nDakota Johnson; the one actress from the terrible, mainstream \"Fifty Shades\" film trilogy. Dakota Johnson becomes remarkably unnerving, feminine, sexual, motherly, and incomprehensible. Tilda Swinton — her counterpart, Lutz Ebersdorf. Tilda Swinton's role as a matriarch and founding mother of a coven; Lutz Ebersdorf's role as a skeptical psychotherapist; a grieving widow. Chloe Grace Moretz as a politically-troubled woman; unstable woman; paranoid woman. Everyone's performance as their roles felt utterly average — Everyone's average performance as their roles grounded reality to the movie.\r\n\r\nThom Yorke in the music department did a nice job. Thom Yorke's score for Luca's \"Suspiria\" evoked the mood of a 70s prog-rock band with a niche for ambient synthscapes, musique concrete moods and piano experimentation; if we're judging Thom Yorke's soundtrack, its a nice collection of songs that should have been a Radiohead double album than a soundtrack. Of course, Thom Yorke's score did not always fit Luca's \"Suspiria\"; Some scenes with Thom Yorke's pieces grated the scenes' moods to pieces, yet in a similar manner as Goblin's score for Argento's \"Suspiria\".\r\n* A movie that left me deeply unsettled, and scared in my subconscious. A movie that made me depressed when it was depressed. A multi-faceted piece, Luca's \"Suspiria\" is a rooted testament in femininity and matriarchy. Luca's \"Suspiria\" is a movie without words.", "created_at": "2019-01-21T06:25:57.301Z"}, {"movie_id": 361292, "review_id": "5d1556d871ffdf003086d189", "rating": 4.0, "review_text": "**_Politically juvenile, with a troubling approach to the Feminine, but it's certainly convinced of its own profundity_**\r\n\r\n> _It did not excite me, it betrayed the spirit of the original film: there is no fear, there is no music. The film has not satisfied me so much._\r\n\r\n- Dario Argento's assessment of _Suspiria_; _Un Giorno da Pecora_ (January 18, 2019)\r\n\r\nReleased in 1977, Dario Argento's giallo classic _Suspiria_ (the first part of his _Tre madri_ [_Three Mothers_] trilogy) has a plot you could fit on a stamp – a young American dancer goes to the famous Tanz Dance Academy in Freiburg im Breisgau, Germany, only to find it's a front for a witches coven. That's it, and as the film barely leaves the confines of the Academy, there is no contextualising of the plot against any kind of socio-political background. By no means is it a good film, with terrible acting, a dire script, and laughable effects, but it's immensely enjoyable, partly because it's genuinely creepy in places, but mainly because it doesn't take itself too seriously; the filmmakers know it's nothing more than a surreal, gaudy, style-over-substance, shock-for-shock's sake, Grand Guignol head-trip, and they lean into that identity rather than trying to transcend it. Luca Guadagnino's remake (yes folks, it's a remake) is the polar opposite – it has an intricate plot covering all manner of themes and topics, featuring several new characters, and setting everything against a complex socio-political background; the acting and effects are excellent; it takes itself very, very seriously; and it continually tries to prove to the viewer that it is much more than a piece of kitsch horror. According to Guadagnino, his version of _Suspiria_ is a \"_homage_\" to the \"_powerful emotions_\" of the original (it's a remake), whilst actress Tilda Swinton calls it \"_a cover version_\" (it's a remake). The real question, however, is not how similar or dissimilar it is to Argento. The real question is whether the film is a beautifully mounted insightful exploration of female sexuality, a celebration of a self-contained matriarchy set against the destructive chaos of a failing patriarchy, and a psychoanalytical investigation of national trauma and World War II guilt, or is it an overlong, dull, self-important, incoherent mess, that in trying to be both feminist and feminine somehow ends up being both misogynist and misandrist? Working kind of like a hybrid of Nicholas Winding Refn's _The Neon Demon_ (2016) and Darren Aronofsky's _mother!_ (2017), the film is as far as you can get from Guadagnino's more recent work, specifically _A Bigger Splash_ (2015), and _Call Me By Your Name_ (2017); one can only imagine what people who expected more of the warm sun and delicate eroticism seen in those films must have felt after spending 152 minutes in an arid Berlin winter, witnessing bones pushing through skin, decapitations, night terrors, meat hooks being used in ways meat hooks were not intended to be used, Holocaust survivors, political terrorism, and witches trying to organise an election.\r\n\r\nSet in \"Divided Berlin\" in October 1977, the film is divided into six acts (\"1977\", \"Palaces of Tears\", \"Borrowing\", \"Taking\", \"In the Mütterhaus (All the Floors are Darkness)\", and \"Suspiriorum\") and an epilogue (\"A Sliced-Up Pear\"). It begins with Patricia Hingle (Chloë Grace Moretz, who appears to be cornering the market in rubbish Hollywood remakes), a student at the prestigious Helena Markos Tanzgruppe [Helena Markos Dance Academy] arriving at the home of her psychoanalyst, the Carl Jung-in-all-but-name Dr. Josef Klemperer (Tilda Swinton, credited as Lutz Ebersdorf). Terrified and not making much sense, Hingle tells Klemperer she has discovered something sinister about the Academy and is now in fear for her life. Although Klemperer believes she is delusional, he is concerned for her well-being, but she flees, leaving behind her diary. Meanwhile, Susie Bannion (Dakota Johnson), a Mennonite from Ohio, arrives at the Academy hoping to audition. Impressed with her abilities, lead choreographer Madame Blanc (also Tilda Swinton, channelling Pina Bausch), admits her to the Academy. Becoming close with her roommate, Sara Simms (an excellent Mia Goth), Susie quickly finds herself dancing the lead in the Academy's upcoming piece, _Volk_. Meanwhile, in Hingle's diary, Klemperer reads that the academy is a front for a witches' coven, and learns of the \"Three Mothers\", a triumvirate of powerful witches who predate Christianity – Suspiriorum (Sighs), Tenebrarum (Darkness), and Lachrymarum (Tears). At the same time, he is trying to find out what happened to his wife, Anke (Jessica Harper, who played Susie in the original), who disappeared in 1944 after he tried to convince her it was safe to remain in Berlin. Meanwhile, the Academy's matrons hold an election to choose the coven's leader, with Blanc running against Helena Markos (also Tilda Swinton!), a vote which Markos narrowly wins. Unaware of any of this, as Susie becomes increasingly close to Blanc, Sara grows suspicious of the matrons and begins to investigate on Klemperer's behalf.\r\n\r\nGuadagnino has been obsessed with Argento's original since he first saw it in 1984, and in 2007, he optioned the rights and hired David Gordon Green to write and direct a remake (there's that word again), something with which Argento himself was not especially pleased, believing the film didn't need to be remade. In 2013, Green revealed that legal issues had prevented the film from being made, and in 2014, he also cited the escalating budget. However, in 2015, Guadagnino announced that he himself was now directing a \"_homage_\" (it's a remake), from a script by David Kajganich (_The Invasion_; _True Story_) which focused on \"_the uncompromising force of motherhood._\" Guadagnino's _Suspiria_ is the kind of horror movie that goes for slow-burning psychological dread (there is literally not a single jump-scare), and from the time the project was announced, it has divided opinion, something which continued when it was released; it's that rarest of films whose Metacritic scores range from 0 (for example, Mike LaSalle's review for the _San Francisco Chronicle_) to 100 (for example, Joshua Rothkopf's review for _Time Out_).\r\n\r\nAs the plot outline should make clear, the film deals with a variety of weighty themes, one of which is the political turmoil of the era. Set in October 1977, the events of the _Deutscher Herbst_ [German Autumn] are constantly on the fringes of the narrative – the film opens with a street demo; radio reports speak of Ulrike Meinhof's death in police custody in May 1976, the imprisonment of Andreas Baader and Gudrun Ensslin, the activities of the far-left, anti-imperialistic terrorist group _Rote Armee Fraktion_ [Red Army Faction - RAF], the hijacking of _Lufthansa Flight 181_ by the Popular Front for the Liberation of Palestine, and the kidnapping of Hanns Martin Schleyer; the story the academy put out to explain Hingle's departure is that she has joined the RAF; a bomb explodes off-camera.\r\n\r\nAnd it is in relation to politics where we encounter the first, and most certainly not the last, of the film's problems. Arguing that Germany's failure to process their Nazi past and confront their national shame is manifesting as political disenfranchisement, Guadagnino employs a pseudo-Jungian approach to show that the country's political turmoil runs parallel to the struggle for control of the coven. Emphasising that the world of witches was once harmonious under the rule of the Three Mothers, just like Germany, it has now devolved into factionalism, complete with backroom political manoeuvring, subterfuge within the ranks, and animosity bordering on aggression. Within this dynamic, the matrons are the privileged ruling elite, and the students are the uneducated and disenfranchised \"_volk_\".\r\n\r\nBut to what end does Guadagnino make this parallel? What is he trying to say? Rarely have I encountered a narrative which employs such blatant yet inconclusive and vague political contextualisation. Take the Berlin Wall as an example, which is literally right outside the Academy's door. Why is it there? Why are there so many shots of it? What purpose does it serve in the narrative? The answer is, none. It's purely ornamental, with Guadagnino seemingly hoping for meaning by association – people see the Wall, and immediately begin to attribute to it all manner of allegorical significance, when in fact the film itself suggests nothing of the kind. And none of the other political symbols amount to much more; they certainly don't inform any grand thematic statement or political thesis. Guadagnino bombards the viewer with empty historical and political themes which do nothing for the central storyline, functioning instead as decoration, utterly trivialising and completely disconnected.\r\n\r\nAlso important in relation to the film's politics is _Vergangenheitsbewältigung_ [\"Overcoming the past\"] – essentially, post-1945 Germany's attempt to come to terms with World War II and the Holocaust. This is primarily seen in Klemperer's search for his wife, which throws up another problem. Klemperer, who is not in Argento's original, is a surrogate for the audience. Nothing wrong with that, it's a standard screenwriting technique used to facilitate more organic exposition. However, Klemperer is an extremely distracting and painfully on-the-nose device to afford Guadagnino a vehicle for a political subplot, which is completely superfluous to what is happening in the coven. Every single reference to Anke could be removed from the film, leaving Klemperer as simply an amateur detective trying to find out what happened to Hingle, and the film would work just as well. In fact, it would work better. As his search for his wife becomes more prominent, and he becomes more central, all that is achieved is the waning of the central plot. In a story ostensibly about the Feminine, it's rather troubling that the emotional core of the film is male. The film's preferred point of view is his, with even the epilogue focusing on him. Klemperer is quite literally a man in a woman's world, but exactly why Guadagnino felt the need to shoehorn a man into a story about women is anybody's guess.\r\n\r\nWhich brings us to another theme; femininity (if not necessarily feminism). That the film is deeply interested in this is shown in a number of ways. For example, Susie is told by head matron Tanner (Angela Winkler) that the academy ensures the \"_financial autonomy of our girls_\"; speaking of Nazi Germany, Blanc says the regime wanted women to \"_close their minds and keep their uteruses open_\"; Susie is reminded that \"_before the war, Germany had the strongest women_\". Additionally, Klemperer is played by Swinton, meaning the film effectively has an all-female cast (the only other men with any lines are Glockner and Albrecht (played by Mikael Olsson and Fred Kelemen, respectively), two completely useless policemen whose main scene involves the witches hypnotising them and mocking the size of their genitalia). However, the film isn't interested in idealising female empowerment. Instead, it depicts a matriarchy beset by disruption and the chaos of a struggle for power. As Guadagnino tells Jezebel,\r\n\r\n> _if we talk about the Great Mother, we cannot deny the terrible mother. True feminism is something that doesn't shy away from the complexity of the female identity._\r\n\r\nBut does the film imply that a powerful group of women is something to be inherently feared? Partly. Indeed, the very theme of witchcraft itself (perhaps the purest historical manifestation of the patriarchy's fear of female agency) carries an undercurrent of misogyny, which is not helped by the nudity and repeated violent objectification of the female body. There's a very thin line between condemning the male gaze, which is what Guadagnino claims to be doing, and recreating it, and it's a line which _Suspiria_ frequently crosses (for an excellent example of a film which recreates the male gaze for the purpose of satirising and ridiculing it, see Coralie Fargeat's superb _Revenge_). Maybe the problem here is simply that a story inherently about matriarchy, female empowerment, and the importance of motherhood, is a story a man can't tell very well. I'm reminded of Sofia Coppola's remake of _The Beguiled_ (2017), of which she argued,\r\n\r\n> _this story had to be directed by a woman. The essence of it is feminine, it's seen from a female point of view._\r\n\r\n_Suspiria_ also has a feminine essence, but it doesn't have a female point of view, and one can't help but wonder what a talented female director like Coppola, Mary Harron, Patty Jenkins, or the genius that is Lynne Ramsay would have made of this material.\r\n\r\nHowever, even aside from these problems, there are a plethora of other issues. The character of Blanc, for example, is poorly written, and is stripped of agency towards the end of the film, so by the time of the _dénouement_, she anti-climatically does little in the direction of either outright evil or redemptive good; instead, she just kind of hangs around. As for the matrons, apart from Tanner, none receive an iota of characterisation; they are simply a jumble of non-individualised background extras. The same is true of the dancers. Indeed, there's an absolute dearth of subjectivity or interiority for anyone beyond Susie, Blanc, Klemperer, and, to a lesser extent, Sara and Tanner. There's a cliché-riddled scene showing Blanc telepathically channelling nightmares to Susie, full of images of skulls, worms, rotting flesh, etc. Nothing we haven't seen a hundred times before. Finally, the film is immensely silly in places. For example, the much-talked-about climax is presided over by what can only be described as a female Jabba the Hut wearing sunglasses. Another example is after Susie first dances at the academy, she confides to Blanc, \"_it felt like what I think it must feel like to fuck._\" \"_Do you mean fuck a man?_\" asks Blanc. \"_No_,\" replies Susie, \"_I was thinking of an animal._\" Of course you were.\r\n\r\nFrom an aesthetic point of view, however, there's a great deal to admire, as one would expect from Guadagnino, who is working with much of the same crew as from his last couple of films. Walter Fasano's editing is wonderfully disjointed, often cutting maniacally between inserts, barely affording the viewer time to register the images. The compositions and camera placement of cinematographer Sayombhu Mukdeeprom (_Uncle Boonmee Who Can Recall His Past Lives_) are also fascinating, often putting the camera in such a position as to purposely give a less than perfect view of a particular space. Combined, these two techniques are disorientating and frequently defamiliarising, rendering mundane geographical spaces such as offices, dorm rooms, and rehearsal studios as foreboding and unknowable, almost protean, never allowing the viewer to forget that something is not quite right in this _milieu_. Contributing to this sense is the blocking, particularly the recurring motif of staging conversations so that one character is off-screen, only visible to the audience via reflection. Especially noticeable is the film's colour, or lack thereof. Whereas Argento's original was awash in garish and exaggerated reds, purples, blues, greens, and yellows, Guadagnino's remake was conceived as \"_winterish_\", with as limited a use of primary colours as possible; grey, beige, and brown predominate. Giulia Piersanti's costumes are also superb, with Susie's wardrobe noticeably changing from conservative dresses and sweatpants to more revealing tank tops and shorts as she gains in confidence. Thom Yorke's Krautrock-style score is also excellent, as different from Goblin's prog-rock music from the original as you could possibly imagine.\r\n\r\nThe cumulative tension and dread are also reasonably well managed in the first half of the film, and there are individual scenes of great brilliance. At one point, Sara goes snooping around the Academy, finding something genuinely shocking, the reveal of which is masterfully staged by Guadagnino and Mukdeeprom. Easily the best scene in the film is the one that so traumatised audiences at CinemaCon 2018. As Susie performs an especially energetic dance for Blanc in one room, unbeknownst to her, she is psychically linked to a dancer in another, and every movement of her body is manifested violently in the other room, with the other dancer being flung about like a rag doll. The scene is horrifically gruesome, with bones piercing through flesh, blood and urine flowing copiously, and limbs contorting into truly disturbing positions. What really sells the scene, however, is the combination of Fasano's brilliant intercutting (maintaining continuity of movement from room to room cannot have been easy), Damien Jalet's superb choreography, and the disturbing sound design by Frank Kruse and Markus Stemler (_Cloud Atlas_; _In the Heart of the Sea_; _Assassin's Creed_) contrasting the sharp snapping of breaking bones with the wetter sounds of those bones penetrating flesh.\r\n\r\nSelf-indulgent like little else I can think of, _Suspiria_ is absolutely convinced of its own profundity. Far, far too long and far too self-serious, its themes and messages are poorly iterated, it's insanely dull for long periods, and it's badly unfocused. It's almost an hour longer than the original, and, honestly, it uses that hour to say precisely nothing of interest. The simple fact is that the slight story at the film's core (a coven of witches using a dance academy as a front) is unable to bear the massive weight of themes and narrative diversions heaped upon it; the vehicle just can't carry the message. Its politics are no more insightful than tabloid headlines, and serve only to detract from what is supposed to be the narrative's focus. Ultimately, it has little to say about femininity, feminism, political protest, the Holocaust, Cold War Germany, or World War II guilt, but it damn sure works hard to convince us it has a great deal to say about such topics. As cold as the Berlin winter it depicts, _Suspiria_ is equal parts emotionless, mechanical, and dull.", "created_at": "2019-06-27T23:52:56.619Z"}, {"movie_id": 361292, "review_id": "5dadbdbe93828e00184754c3", "rating": null, "review_text": "I have never seen original Suspiria, but saw this remake and all I can say - it had very unique atmosphere. It was different from a mainstream horror movies. It's not for everyone. If you're fan of SAW with lots of gore or even Conjuring series with lots of makeup and effects, you might not like this movie. Here most important part plays music, dance, places & characters involved in witchcraft that together creates creepy atmosphere. Movie is quite long and if you watch it at night and especially alone, it will give you effect of a nightmare dream. It's one of those weird movies that only few people understand and love.", "created_at": "2019-10-21T14:16:30.050Z"}, {"movie_id": 361292, "review_id": "5e5ccf74357c0000192b4899", "rating": 1.0, "review_text": "This movie is an abomination. I truly wish this hadn’t been labelled a remake and had just been something new that was inspired by Suspiria or something. Imagine taking the most beautiful movie in the world and being like why don’t I make this ugly as hell. It’s also ridiculously long. One of my most hated movies.", "created_at": "2020-03-02T09:18:44.182Z"}, {"movie_id": 361292, "review_id": "6406668ec4ad59008760b63f", "rating": 9.0, "review_text": "Inspite of Argento's dissatisfaction, Suspiria (by Guadagnino) is an evocative reinterpretation. Maybe it is the original creator's prerogative to criticize the execution when remaking classic cinema, peronally, I find the criticism also takes itself too seriously.\r\n\r\nReimagination through the milieu (post-war Germany) affords a shift in depth and focus without complicating the narrative with self-referentiality. Although details have been torn apart for lack of relevance, to my mind,  if the director chose any setting, naivety or irrelevance would still be the low-hanging fruit of critics. The film simply doesn't strive to show a connection, and contextual elements are illustrated with proportionate gravity and relevance.\r\n\r\nIf one has to draw comparisons, there are diametric opposites in many ways. Mainly through through cinematography. No doubt Argento's inspired so much that followed and this ultimately binds it to the genre it inspired. Four decades later, we have a histrionic period drama fused with a supernatural fable forming (unwanted) homage to Argento's suspense, as cinema for today's audience.\r\n\r\nI loved the original score by Goblin and others they did for Argento and Romero. The selective moods created by Thom Yorke, incidentally harmonic vocals and creepy piano motifs fit. Visual stylistic references to Argento are the use of light, costume and retro decor which jarrs to effect but again, is not out of place.\r\n\r\nIn terms of conceptual themes, I think it did well. Perhaps it is not something that everyone will he happy with. Then again, it's not trying to please everyone nor explain connections between a timeless demonic coven in post-war Germany. Let it wash over you and you might feel its crestfallen tones and realism.", "created_at": "2023-03-06T22:17:50.693Z"}]