[{"movie_id": 62046, "review_id": "58ac44e8c3a36849cc01304c", "rating": 8.0, "review_text": "Flypaper is an unconventional 'whodunit' in the form of a screwball comedy. It starts off with a guy named Tripp (played by Patrick Dempsey) who walks into a bank to get some change and ends up in the middle of two simultaneous bank robberies, executed by two different gangs, one of whom highly professional, the other one very much the opposite. What follows is an idiotic muddle of story lines and plot twists, which overall is pretty funny and at times even hilarious. \r\n\r\nFlypaper's biggest asset is its wild array of stereotype characters, which certainly doesn't always work out, but in this case does so very well, mostly because of the clever writing. The dialogue is sharp and witty, and the way the characters are played out against one another is really the stuff of great comedies. One of the best characters is one called Peanut Butter, played by the great Tim Blake Nelson, who, together with his buddy Jelly forms a duo of laughably amateurish hillbilly bank robbers. The other team of (professional) bank robbers is set together of another great group of stereotypes, namely The Black Guy, The Jewish Guy and The British Guy (not their actual character names, just pointing it out), which in itself sounds like a \"three guys walk into a bar\" joke, and it actually works out funnier than you might expect. And then there's the group of hostages (all bank employees), all with their own crazy little character traits, paranoia and strange ulterior motives, more afraid of each other than of the people robbing their bank.\r\n\r\nI must admit, I didn't have great expectations for Patrick Dempsey, but he pleasantly surprised me with his knack for timing and delivery. His character is a completely hyper-active genius, brilliant with numbers and facts, dead-set on solving the strange mysteries that keep piling up in the bank as the robberies go on, and Mr Dempsey plays his role convincingly. Who knew McDreamy had a serious sense of humour. Ashley Judd is a reliable actress, and she can really deliver some good comedy too. But I have to mention one thing: it's really such a shame that all these actresses (who were never bad looking to begin with) have succumbed to the pressures of botox and fillers. She has a really pretty face, but now that she's obviously had some work done, her eyes look puffy and something overall just doesn't look right. The reason I say this is because it gets in the way of her acting, making her expressions a little screwy a times, and this somewhat ruins the experience when she's trying to deliver a certain emotion. And even in a light-hearted comedy, this can work against the quality of someone's performance. It's too bad, but fortunately Ms Judd still has plenty of talent to make up for it. Actually, all the actors are really good in their roles, they're none of them really big names, but obviously, that's not saying anything. There's only one case of miscasting, and that's Mekhi Phifer. He's a very fine actor, but obviously more suited for serious roles. He took his role way too seriously, maintaining a poker face even when everybody around him was acting like a bunch of goofs. And even when he was seemingly trying to be funny, he didn't really deliver. So, no more comedies for you, Mekhi.\r\n\r\nStory wise, Flypaper basically unfolds as an increasingly intricate game of \"Clue\", at one point even bearing some resemblance to a funny version of The Usual Suspects. The plot starts out pretty much literally thin as flypaper, but thickens throughout, without getting ridiculously over thought. The story has some inconsistencies throughout, but they're hardly any bother. And the ending is kind of a cliché, but let's face it, have you ever played \"Clue\" without saying 'I knew it all along!' at the end? Right. There's nothing that actually spoils the fun at any point. This is a semi-dark, adult comedy, with a healthy dose of profanity and crude humour, though innocent like a baby compared to Tarantino or Ritchie. Speaking of which, I sometimes got the feeling that director Rob Minkoff watched these two very closely and took notes, considering some camera techniques and directorial gimmicks he threw in here and there, which is OK up to some level, but not when your film starts to look like a silly rip-off (Snatch comes to mind...). Fortunately, Flypaper manages to keep true to a style of its own, simply 'borrowing' some inspiration from other great crime comedies. And there's nothing wrong with that.\r\n\r\nOverall, Flypaper is an entertaining Sunday evening-filler, somewhere in between indie and low-budget Hollywood. It may be somewhat forgettable but it's surely good enough to keep you in your seat from start to finish, and I would certainly recommend it for an evening of good fun.\r\n_(February 2012)_", "created_at": "2017-02-21T13:47:20.746Z"}]