[{"movie_id": 331482, "review_id": "5df5d0709450fe001125e399", "rating": null, "review_text": "I’m not discounting the new approached Greta has taken here. I personally think it’s great and, in 2019, definitely poignant but it also shows too much respect for only one on-screen woman. I can’t help but feel that, while serving one grand idea, Greta has caused a disservice to those other women in its wake.\r\n- Jess Fenton\r\n\r\nRead Jess' full article...\r\nhttps://www.maketheswitch.com.au/article/review-little-women-a-21st-century-remake-but-does-it-cause-more-harm-than-good", "created_at": "2019-12-15T06:19:28.341Z"}, {"movie_id": 331482, "review_id": "5e0b9581d5dbc20018fdd1b4", "rating": 6.0, "review_text": "Opinions are opinions. Subjective or objective, but I find quite interesting the positive response Greta Gerwig's second feature film has received, considering the so self-complacent film she created.\r\nI personally believe that.\r\n\r\nDo not confuse that feeling with me saying this is a misdone film. There's talent in her direction but Gerwig instead of looking for a challenge having the doors as open as she has them at the moment, she sat in the conformism and made a film that feels totally built as a ''For Your Consideration '' And be afraid if she's not considered.\r\n\r\nI don't deny that Gerwig loves the novel, she shows it and certainly this version is her personal vision but despite the nice attempt, there's nothing new or fresh in her take.\r\nI have to admit and emphasize that at this point it's completely stupid and naive to ask for a radical change in a story which has already been told a lot of times in film, however, it also cannot help feeling like a cheap mean of exploiting the story considering our current times, where feminism is now a driving force in the industry.\r\nLike I said, she went for the safe bet. \r\n\r\nAnd yet despite Gerwig's attempt to increase that specific plot weight, she also avoids going to issues that wouldn't work for the story she was trying to tell, because although they're not girls with money, they have the privilege of being protected from the civil war. \r\n\r\nJo is a young woman aware of herself and her mind, which in those times wasn't something positive but obviously the external world is not a concern for her, only her personal interests. And that's ok, we get to be that way, especially when we're young, but how do you try to make woke characters, if it's only in the things that suits them?\r\nThat's where the pertinent questions should be asked about what it was decided to take in order to make this new version work according to the director's perspective.\r\n\r\nIn the end, despite the production quality, Little Women is just a conventional and ordinary repetition of a literary classic that I personally think has already been too used.\r\nBut the proposal works both to be loved and to be hated and that depends a lot on the mentality you carry with you when you go to see it.\r\nAs always the rest depends on what you get from the film.", "created_at": "2019-12-31T18:37:53.413Z"}, {"movie_id": 331482, "review_id": "5e215062bfeb8b0015ce091e", "rating": 4.0, "review_text": "Guess 2019's just the year for Florence Pugh to be in critically acclaimed and letterboxd beloved movies that I just genuinely didn't care for much.\r\n\r\n_Final rating:★★ - Definitely not for me, but I sort of get the appeal._", "created_at": "2020-01-17T06:12:50.785Z"}, {"movie_id": 331482, "review_id": "5e3327184ca67600174ecd74", "rating": 8.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nThe 92nd Academy Awards are presented this Sunday, and Little Women is part of the few 2019 releases that are only now (2020) being shown in my country. I really want to watch every Best Picture nominee before the ceremony not only to provide my honest predictions but also to have a Top10: Best Movies of 2019 more complete regarding the number of films watched. Well, Greta Gerwig's adaptation of the famous book isn't able to crack a spot in my Top10, but it's definitely worth an honorable mention.\r\n\r\nThere's been a lot of controversy surrounding the Best Director category, way beyond just the Oscars. The lack of a female nominee across a few award shows raised some discontent, and most considered Gerwig's work to be more than enough to warrant more nominations, especially at the Academy Awards. Now, I'm going to be as polite, respectful, and fair as I can. While I do agree that Gerwig does a great job in directing this movie, I still believe that the five male directors nominated for the respective Oscar did an even better one. Even removing Todd Phillips (Joker) out of the equation (which I entirely accept), I would definitely choose Noah Baumbach (Marriage Story) as his replacement.\r\n\r\nWith that said, do I suddenly become a misogynist? Do I always favor men when I send my own ballots to the OFTA Awards, for example? I don't think so. It's just a humble opinion. Putting that discussion aside, let's focus on the positive aspects of Little Women because there are many! Usually, romance isn't a genre I tend to love, but I really enjoyed this adaptation of Alcott's famous novel. I'll start with the cast because how can't I?\r\n\r\nWith such a stellar team of actors, I knew I was going to receive some amazing performances. Every character gets a lot of screentime, but Saoirse Ronan is definitely the lead as Jo. She's the odd sister, the one that doesn't really want to follow the \"rules\" of being a woman in the XIX century. She wants to do what she loves for a living and be independent without having to be this housewife that simply married a rich man. She wants to be remembered. Saoirse incorporates this personality like it's her own, and adds another brilliant display to her acting career.\r\n\r\nHowever, Florence Pugh gives the standout performance as Amy. Undoubtedly, Pugh is the breakthrough actress of this last year. Fantastic physical display in Fighting with my Family, one of the best performances of 2019 in Midsommar, and the most complex role of her career in Little Women. Since the story is continuously going back and forward in time, everyone has to portray two versions of the same character, but Amy is the one that changes the most. As a childish, immature, silly, young Amy, Pugh delivers some of the funniest moments of the film. Truly hilarious at some points. Then, as an adult Amy, she's more grounded, responsible, and about to follow one of the \"rules\" of society regarding women: marrying a rich man.\r\n\r\nEliza Scanlen carries an emotional arc as Beth, and the best past-present sequence is due to her. Emma Watson is Meg, the older sister who everyone looks up to since she seems to be perfect, so her arc goes through some demonstrations of how her imperfections make her a role model to her sisters. Timothée Chalamet is also one of the standouts as Laurie, a neighbor who gets close to the March family, but I won't delve into too many details regarding his story. Laura Dern (Marmee March) and Meryl Streep (Aunt March) are perfect as always. Every character arc is exceptionally developed. With a runtime slightly over two hours, it's remarkable the level of detail, complexity, and depth that the characters possess.\r\n\r\nI can't address every single one in detail since there are so many, but I tried my best to give an overview of each of the main ones. Clearly, Jo, Laurie, and Amy's arcs are the absolute best. However, Emma Watson's character story is the one that feels too superficial and too simple compared with her sisters'. It doesn't really feel like she went through any change throughout the years, and part of her story feels a bit forced. Beth's arc might also be straightforward, but since it's associated with an emotionally powerful plot point, one can understand her little screentime.\r\n\r\nThe past-present storytelling method works for the most part. There are a couple of moments beautifully and seamlessly \"stitched\" together, giving the viewer a sense of fulfillment by witnessing the start and end of a little story that happened in the past and later in the present under other circumstances. Nevertheless, some sequences either drag too much or lack emotional investment. Since the movie crosses the two-hour mark, I found myself bored during certain storylines that failed to captivate me.\r\n\r\nIn a film with so many characters, it's very common to give more focus to only a few of them. It's impossible to call someone a protagonist if half a dozen characters have the same or more screentime or plot relevance. However, this always brings the issue of not being able to fascinate the audience with every character arc. Also, some past-present transitions are so abrupt that they disrupt the overall pacing by being a bit confusing. Nevertheless, Greta Gerwig does an excellent job in balancing these timelines, and an even better one by opposing the contrasting tones of each period and still make them consistent.\r\n\r\nTechnically, Yorick Le Saux offers gorgeous cinematography, Alexandre Desplat provides a subtle yet efficient score, but the costume design steals the show by being extremely period-accurate. The colors of the whole movie tell a story on their own, as well as the set design, so be sure to look around on each wide shot because there is much to see behind the actors.\r\n\r\nIn the end, Little Women doesn't do enough to warrant a spot in my 2019's Top10, but Greta Gerwig's adaptation of the classic graphic novel deserves all of the screenplay awards it has been receiving so far. As expected, the whole cast is phenomenal, but Saoirse Ronan, Florence Pugh, and Timothée Chalamet not only deliver the best performances of the film, but their characters carry the most compelling arcs. With so many people, it's remarkable the level of detail, complexity, and depth that each character has. However, some storylines are not as captivating as others, and the pacing suffers from these less exciting stories, which bring the movie down for some moments. The past-present transitions are mostly well-handled but a few are too confusing and abrupt. The contrasting tones of each timeline are consistent throughout the runtime, and the costume design steals the \"technical spotlight\". Overall, it's a pretty good romance, so if you enjoy the genre, I can't see why you shouldn't enjoy this one.\r\n\r\nRating: B+", "created_at": "2020-01-30T18:57:28.181Z"}, {"movie_id": 331482, "review_id": "62b0bd60bf0f630055c550c7", "rating": 10.0, "review_text": "Full review: <a>https://www.tinakakadelis.com/beyond-the-cinerama-dome/2021/12/28/great-or-nothing-little-women-2019-review<a>\r\n\r\nGreta Gerwig’s adaptation of Louisa May Alcott’s timeless novel, _Little Women_, feels like coming home. It’s the sort of movie that surrounds the audience with feelings of warmth and comfort. This feeling comes from the coziness of the cabin the March family resides in, the love that exudes from the performances, and the treatment of the source material, which was clearly a formative book for Gerwig. She approaches this retelling with a few small updates and a great reverence for the original.", "created_at": "2022-06-20T18:33:04.646Z"}, {"movie_id": 331482, "review_id": "658a03c8fad8e95d768ec039", "rating": 1.0, "review_text": "It's Little Women... with \"modern sensibilities\" and that should be enough of a warning... which is odd given that the novel, and even the 1994 movie both had feminist ideals.  But then they weren't made for \"modern audiences,\" so they have more of a focus on characters and story than pushing \"The Message.\"\r\n\r\nAnd that was the issue here, yet again \"THE MESSAGE\" was the most important part of the movie, and to make sure you understood that the characters were, well caricatured, some of them reduced even further to nothing but cliches.\r\n\r\nThe plot was... rushed.  It seemed to want to jump from message to message rather than tell a cohesive narrative and because of that one of the saddest parts of the novel was almost laughable, almost comedic in this version, most like because it really didn't fit with The Message and needed to be rushed.\r\n\r\nAnd the same thing happened with the dialogue, it was rushed, clipped, and meaningless unless pushing, you guessed it, The Message.\r\n\r\nThe result was that there is little in the way of character development, you can't really get attached to anyone, they have little personality compared to the other adaptations and the source material, but then you get the feeling that this version wasn't about the sisters, it was about the politics that appeal to the \"Modern Audience.\"\r\n\r\nAnd that is a shame, because the modern reader still picks up Little Women and loves it because of the March sisters and not because of \"Modern Sensibilities.\"  But, hey, kudos for not race swapping.", "created_at": "2023-12-25T22:35:52.729Z"}]