[{"movie_id": 10596, "review_id": "54dbf6abc3a3683102002506", "rating": 6.0, "review_text": "Double Trouble for Van Damme again!\r\n\r\nYet another Jean-Claude Van Damme film that sees him tasked with playing two characters. In spite of its shaky reputation this isn’t half bad, it delivers what most Van Damme fans expect, namely bonkers fights and shifty science. Plot has Van Damme as a fire obsessed serial killer who is always one step ahead of the police. Enter science as a chance to clone the killer arises and this sets in motion the wheels of the Van Damme clone trying to come to terms with his alien world as he, and world weary police officer Jake Riley (Michael Rooker), set about capturing the unhinged mad man.\r\n\r\nIt’s of course daft but it’s a whole bunch of fun, and with the strong presence of Rooker supplemented by two very interesting performances by Van Damme, pic is in good hands. The fight scenes are smoothly choreographed and exciting, with director Ringo Lam clearly aware of what makes a Van Damme movie work. It’s not prime Van Damme, but it’s above average and well worth checking out for those so inclined. 6/10", "created_at": "2015-02-12T00:41:15.345Z"}, {"movie_id": 10596, "review_id": "63143795f1b5710082c97861", "rating": 1.0, "review_text": "Jean-Claude Van Damme does the Italian neorealists one better; not only was he born to play himself, but also his twin — here, however, he mixes it up a bit, playing his clone instead. \r\n\r\nJCVD ​​is Edward 'The Torch' Garrotte, a serial killer who likes to burn the corpses of the women he murders (why they gave him that last name but don’t have him use an actual garrotte, I haven’t the foggiest), whom Detective Jake Riley (Michael Rooker) has unsuccessfully pursued for the past three years — up to and including his last day on the force before retiring to apparently take up boat repairing.\r\n\r\nIt turns out to be a 10 Minute Retirement; a secret government agency has cloned Garrotte from DNA found at a crime scene, and needs Jake's help to babysit the clone while he tracks down the killer — except they don’t call it a clone, but a \"replicant\". The difference between one and the other is never satisfactorily explained, but as far as I can tell, it takes at least a week for a replicant to be up and about (\"God created man in six days, we took longer;\" actually, God created man on the sixth day, not in six days. No wonder it took your ignorant asses longer).\r\n\r\nAdditionally, while a clone has to grow and mature, a replicant comes out fully formed (complete, if my eyes don’t deceive me, with a navel), just like Pallas Athena from Zeus’ forehead — but then this is business as usual for clones in the movies, so I don't understand why this one feels the need to make a point out of its not being a clone.\r\n\r\nUnless, of course, director Ringo Lam deliberately wants us to think of Blade Runner (it's never a good idea to remind the audience that they could be watching a much better film; only instead of seeing \"attack ships blazing from Orion's shoulder\" and \"C-beams glowing in the dark near the Tannhäuser Gate,” JCVD ​​eats dog food and falls in love with a whore.\r\n\r\nWhat’s certain is that the Replicant has the same muscular build as Garrotte; now, since a physique like JCVD's usually requires spending a lot in a gym — and time and a gym are two things that the Replicant lacks — I have no choice but to assume that Garrotte was born, like the baby in Meet the Spartans, with built-in muscles, a characteristic that his clone inherited (along with the uncontrollable desire to do splits).\r\n\r\nHow do its creators intend for the Replicant to find Garrotte? “Well, we've augmented his telepathic ability by re-sequencing his genetic code from the genome. It may be our first, but genetic memory has been scientifically proven\" — as has, I guess, telepathy, which is not the same thing; genetic memory would allow an individual to 'remember' something that they never learned (music, math), but the Replicator can recall specific actions performed by Garrotte. \r\nAnyway, the idea is for the Replicant to experience some sort of Proustian Madeleine moment, and it's Jake's job — who presumably knows Garotte as well as Steve Carell knows Proust in Little Miss Sunshine — to jog his memory. \r\n\r\nThe rest is a disastrous hybrid of 48 Hrs. and Rain Man — the Replicant is basically a kid trapped in the body of a Belgian karate fighter (although come to think of it, so is the real JCVD) — that is neither good science fiction (the science, such as it is, being rather nebulous) nor good chopsocky (a character fighting himself invariably results in awkwardly choreographed action sequences). Then again, this movie was doomed they cast Michael 'Henry Lee Lucas' Rooker as the detective as opposed to the serial killer.", "created_at": "2022-09-04T05:28:53.679Z"}]