[{"movie_id": 286567, "review_id": "58b33f7192514177b000b3c7", "rating": 5.0, "review_text": "**A new kid on the block with the superpower.**\r\n\r\nI am not saying the film was terrible, but the timing was bad. There are loads of great sci-fi films were made recently and still coming out. So to compete with them, they have to go through alteration, even if they loose the origins of their film's theme concept. This story is same as many similar themed flicks. For me, it looked like a mini Superman film, but made for kids.\r\n\r\nThe best thing about it was, keeping everything simple. And then the pace, which actually somewhat saved the film. I hooked to it from the beginning till the conclusion, but familiarity is what killed my interest and entertainment. The characters were okay, not developed well enough. But keeping young audience in mind, it does good. Because going deep is unnecessary stretch.\r\n\r\nThe story of a high school boy who transferred back to a small town where has born. As he begins to hear a lot about his father from the local people, he becomes motivated to know more about him. But one day when something goes wrong, the next day he wakes up with great power. Not knowing how to handle it, he befriends with an unusual creature and together they fight those who are after them.\r\n\r\nInitially I thought it was related to 'Real Steel', but realised only while watching it it is completely different. From the director of 'Sorority Row', I think he did nothing wrong. Those who watch less films would enjoy it better. Visually okay, with all those graphics. Since it is PG13, I would say the target audience is the little ones. So from their perspective, it is acceptable. But I warn the grownups, stay away, or be like them while watching it, in order to get entertained.\r\n\r\n_5/10_", "created_at": "2017-02-26T20:49:53.607Z"}, {"movie_id": 286567, "review_id": "5f3ffa56028f1400325bee59", "rating": 1.0, "review_text": "One of the most boring, joyless, and bland movies of all time. Definitley Top 10 worst. 1/10", "created_at": "2020-08-21T16:46:14.503Z"}]