[{"movie_id": 9477, "review_id": "5b15018ac3a368535d00a4e1", "rating": 8.0, "review_text": "Do yourself a favour and grab the **extended **edition of this movie, It's like a whole new film and it is way way better.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "created_at": "2018-06-04T09:08:26.550Z"}, {"movie_id": 9477, "review_id": "6075dc851da7a60027cc3e28", "rating": null, "review_text": "I'll never forget the iced-held river scene. At least I've watched it ten times.Clive Owen and Keira Knightley are my favorites.", "created_at": "2021-04-13T18:01:41.798Z"}, {"movie_id": 9477, "review_id": "64f5613de0ca7f00ae3af2f0", "rating": 5.0, "review_text": "Clive Owen is the eponymous leader of a cohort of the Sarmatian cavalry - on their last mission after a 15 year attachment to the now retreating Roman army. This mission requires them to head to the northern reaches of Britain - beyond Hadrian's wall - to rescue a family whose teenage son is a favoured godson of the Pope. The Saxons are menacingly poised above the wall, heading south and Merlin's Woads are all around, seemingly quite content to let the Romans and the Saxons sort it out between themselves and then take the prize from the weakened victors. This is an ok adventure yarn with a decent cast of British stalwarts - Ioan Gruffudd, Ray Winstone, Joel Edgerton and Hugh Dancy amongst his comrades, as well as Mads Mikkelsen and his hawk all trekking the country fighting as they go. The photography is good, and the battle scenes - especially on the frozen lake is also quite effective. Sadly, though the lead acting is really lacklustre. Clive Owen, Ray Winstone (with his baby's arm holding an apple) and Saxon chief Stellan Skarsgård are all really poor - with very little by way of decent dialogue to help them out either. Keira Knightley turns out to be quite proficient with an arrow but otherwise very little of this is on target. Despite a nice bit of singing from Lisa Gerrard, I cannot imagine this got a cinema release - but it just about kills an overlong two hours on the telly if it's wet outside.", "created_at": "2023-09-04T04:46:53.929Z"}, {"movie_id": 9477, "review_id": "651d359ec50ad200c91d8eab", "rating": 8.0, "review_text": "I had a lot of fun with <em>'King Arthur'</em>!\r\n\r\nIt has all of the ingredients of an entertaining film for me. I'm a sucker for a great score and this 2004 flick has just that, from the very first scene in fact - great way to open the movie! Absolutely no surprise whatsoever to see that Hans Zimmer was on music for this - legend!\r\n\r\nThere are also a number of actors that I like from other productions. Keira Knightley is the standout in my opinion, followed by Ioan Gruffudd - who has a great voice for narration, which kept bringing back fond memories of his showing as Henry Morgan in severely underrated television show <em>'Forever'</em>. Those two I enjoyed most, though Ray Winstone, Stephen Dillane (if underused) and Stellan Skarsgård (if a tad underwhelming) are positives as well.\r\n\r\nThe one obvious omission from that previous paragraph is Clive Owen, who of course plays the titular character. I'm mixed on his performance. He nailed (most of) the speeches, though I wasn't convinced with his overall acting level. I feel like the filmmakers should've chosen someone more commanding to lead this, Owen is a little bit too meh in my eyes.\r\n\r\nNo idea, nor interest in truth, in how supposedly accurate this is in regards to folklore, but simply judging it as a film I can only say I got what I wanted from it - entertainment. 8/10.", "created_at": "2023-10-04T09:51:26.566Z"}]