[{"movie_id": 554241, "review_id": "5ddc6fcfa806730017124950", "rating": 4.0, "review_text": "Paramount has proved themselves with ‘Instant Family’ and this year's ‘Dora and the Lost City of Gold’, showing they can really work some magic and create really funny, wholesome, heartwarming live action family films, and ‘Playing with Fire’ could have been in that bunch if it wasn’t so cheap and derivative. While Cena charms, the rest of the film isn’t that hot.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-playing-with-fire-put-out-this-flaming-mess", "created_at": "2019-11-26T00:20:31.792Z"}, {"movie_id": 554241, "review_id": "5e372e4a4ca67600175355f3", "rating": 6.0, "review_text": "Perfectly harmless movie squarely aimed at kids, but I did manage to chuckle a few times even with the overacting. Also helps that I do genuinely like the cast, John Cena and Keegan-Michael Key. Nothing I'd be keen on watching again, but still was an okay time-waster. **2.75/5**", "created_at": "2020-02-02T20:17:14.746Z"}, {"movie_id": 554241, "review_id": "5f9326497eb5f2003300a426", "rating": 6.0, "review_text": "Decent watch, probably won't watch again, and can only recommend for younger audiences.\r\n\r\nNickelodeon has done some weird things, and putting together this cast is one of them.  It's a great cast, but it's not really what I could consider a kid's movie cast.\r\n\r\nI don't think any kids would know Dennis Haysbert or Judy Greer, and I kind of hope they wouldn't know John Leguizamo, Keegan-Michael Key, or Brianna Hildebrand, but they might know John Cena if they know wrestling.\r\n\r\nThere is a lot of things that happen in this movie with very little happening at the same time.  It's actually a sweet (if ridiculous) concept, but for most of the movie there is very little weight to it other than laughing at the misfortune of these good civil servants.\r\n\r\nA lot of the jokes are too \"grown up\" without being good, or too \"kiddy\" for me to enjoy.  I'm not saying it isn't funny for bubbles to fill a room, but context still helps (see \"Just My Luck\"), and using that as an example, there is actually a good sequence of misfortune right before the bubble scene that sets it up so I know they know how to do it, but they chose to do it another way.\r\n\r\nFor what should have been really good just came out decent.", "created_at": "2020-10-23T18:51:53.515Z"}]