[{"movie_id": 282813, "review_id": "58985f44c3a368770e008512", "rating": 1.0, "review_text": "The only thing worse than Found Footage Horror, is lazy Found Footage Horror. You know? The kind where the camera is inexplicably in a room the crew have never been in before filming every single character while non-diegetic music plays and awful, awful CGI scarpers by? Yeah, that kind.\r\n\r\nI didn't just think that _The Pyramid_ wasn't a good movie, it honestly made me genuinely mad.\r\n\r\nFinal rating:½ - So bad it’s offensive.", "created_at": "2017-02-06T11:34:28.949Z"}, {"movie_id": 282813, "review_id": "59208bda925141485e04c8f0", "rating": 8.0, "review_text": "The Pyramid is a found footage movie but part of a new wave along with As Above so Below released the same year.  \r\nI don't have a problem with the format, it allows the telling of a story from a different perspective to a regular film and if done right gets you closer to the event.  \r\nThe story is a classic horror setup, the finding of a hitherto unknown pyramid and the evil that waits within.  \r\nThe claustrophobic corridors and crawl spaces really work with the close camera work to ramp up the tension.  \r\nHorror often relies on protagonists making stupid decision, which is often infuriating.  \r\nMostly the team were just overconfident, the events are beyond anything they could prepare for so I feel this film avoids that annoyance.\r\nThere are some really haunting images and some impressive deaths given what would be a limited budget.  \r\nOverall this was a very enjoyable horror movie.", "created_at": "2017-05-20T18:32:58.948Z"}, {"movie_id": 282813, "review_id": "62590770614c6d00a56f31ab", "rating": 3.0, "review_text": "The cast list probably fires enough warning shots for us to realise that this is going to be nonsense - and on that front, at least, it doesn't disappoint! A group of archaeologists are poking around inside a previously unexplored Egyptian pyramid when things start going bump in the dark. The building becomes a bit unstable, and next thing they are all being persecuted by a manifestation of Anubis, not best pleased that his slumbers have been disturbed. What now ensues, well you can easily guess. What makes this worse is that director Gregory Levasseur has decided that we are going to have to watch this as if we really were inside the structure. I'm guessing he hoped the darkness, the shadowy torch-light style photography (think \"Blair Witch\" 1999), might help to create some menace. Wrong! It just comes across as cheap and cheerful but with no sign of Boris Karloff or Christopher Lee. On that score, the acting and dialogue are mutually banal (\"thank you captain Egypt\"!), it's got loads of hysterical screaming which, again, annoys rather than scares - and I was rooting for the hungry fiend from pretty early on! Will anyone escape... who cares?", "created_at": "2022-04-15T05:49:36.168Z"}]