[{"movie_id": 207932, "review_id": "5935cf5ac3a3685bac003063", "rating": 6.0, "review_text": "**Racing to stop men with bad intention!**\r\n\r\nCompared to the first two films, it took a long time for the third film. But I expected 'The Lost Symbol' before this one. I don't know why they skipped that book from adapting which was done in the last minutes by the production house. My guess is it might be a controversial as the first one, or simply not good enough for the cinematic version. Anyway, this film was not as good as previous two. Once again, it was directed by Ron Howard and Tom Hanks returned as professor Robert Langdon. Two hours long, but very fast storytelling, non-stop adventures.\r\n\r\nThis is another tale in the series about fighting against the men who believes in the ancient text that's written about to curb the issue the human would face in the future, which is now. After waking up without any memory, professor Langdon with the help of a young woman escape from an assassin. In result, they look for the reason why and whoever behind it wants them dead. So it's not a good story, but entertaining film. Especially if you like action-adventure- suspense.\r\n\r\nNice cast, including Hanks and Jones. The other supporting cast was not bad either. Like always, it's a European adventure, particularly in Venice and neighbouring countries. Some cool secret places, might be the settings, but awesome. Since this part was not received well, I wonder the next one, 'Origin' would be made or not. Even before that, this time I expect 'The Lost Symbol' first to hit if they want to continue with the film series. This is not a film to recommend, but not bad for watching it once.\r\n\r\n_6/10_", "created_at": "2017-06-05T21:38:34.331Z"}, {"movie_id": 207932, "review_id": "63b54703875d1a00a0211c90", "rating": 3.0, "review_text": "**Ron Howard's Inferno.**\r\n\r\nDan Brown has made a lot of money from his mystery books, and his popularity has meant that virtually all of his stories have been ported to the big screen. For this film, Ron Howard adapted Brown's fourth novel, set between Florence, Venice and Istanbul. In the script, Robert Langdon wakes up in a hospital in Florence and discovers that he has been attacked and shot, and that he is being pursued because he knows something important, but has lost his memory. I mean, he knows as much as we do! He will be aided by an attractive doctor who will help him understand what is going on: so, we realize that a crazy Malthusian has decided to create a virus to decimate a third of the human race, and that he is about to spread it.\r\n\r\nIf in the previous films based on Brown we had notable successes, this film would be doomed from the beginning: “Inferno” is perhaps the least inspired and most poorly written book by this author. And there are no miracles in these things: either the source material is good, or you can forget it. The screenplay is also a poor and unhappy adaptation. Because? Because it completely alters the end of the book and gives us an alternate, clichéd, idiotic ending, staying true to the beginning of the story, which starts too abruptly to work well on screen. That is, the script changes things that it should leave and respects the part of the book that most needed adaptations! The dialogues and the construction of the characters also sound bad, and everything has a poorly finished appearance.\r\n\r\nRon Howard has reason to look at this film and bury his head in the sand like an ostrich. For a director of his caliber, with the accolades he has, this film is simply unacceptable. The amateurism, the carelessness, the almost negligent way in which details are approached… I would forgive a newcomer or an untalented director, but not Howard.\r\n\r\nThe cast again has the participation of Tom Hanks in the role of the symbologist. Keeping his record impeccable, the actor perfectly fulfills the role and gives us everything he owes, in a committed and consistent work. Felicity Jones also did a good job, with a skillful harmony between rationality and emotion. The rest of the actors are far below: Omar Sy and Ana Ularu added little and have very little screen time; Irrfan Khan and Sidse Knudsen do a little more and better, but remain in very secondary positions. Ben Foster pretty much counts for nothing.\r\n\r\nTechnically, the film relies heavily on green screen, massive CGI, and visual and special effects. Without them, the film collapses like a house of cards. I don't usually see problems in using these technologies, they can truly enrich a film, but here, I believe, they turned the film into a kind of giant video game, where everything is done against the clock, and where there are dangers so varied that we don't even feel them. The sets and costumes are pretty good, and the choice of filming locations respects the ideas and places the book visited. Also, the soundtrack, again by Hans Zimmer, is perfectly adequate. Unfortunately, the cinematography is thoughtlessly and inelegantly directed, and the entire editing job feels rushed, excessive and far too crude.", "created_at": "2023-01-04T09:29:39.212Z"}]