[{"movie_id": 254191, "review_id": "5540f7edc3a3681dab001bf1", "rating": 5.0, "review_text": "A low budget horror movie from a newcomer director. In that perspective, it was a decent movie, because within the limits everything was done nicely. In fact, it was a minimal cast movie set in an isolated cabin in the woods. A simple story that is like the title, it is about a newly married couple's honeymoon. All sets off nicely to them until strange events begin to follow one after another. How the couple manages to come off of it, or do they is the rest.\r\n\r\nI don't know others, but like I said it was not a bad movie to me. Whatever happened, it just kept me engaged throughout, because of the uptight plot. Though, it raises some questions about the events that takes place in the movie and makes to have your own imagination. In fact, my opinion in the begging was 'big foot', later very quickly I understood what it's about. The writer's notion was also the same, leaving blank space to fill by the viewers with their creative prediction.\r\n\r\nThe most of the answers answered or going to be answered are merely the same (I think). For those who won't get it, will suffer nothing except think they wasted time. The rest will probably want a sequel for a proper and further explanation. Especially a couple of dialogues made me think that way. But, I don't think so there will be one, it will stay a mystery as of now forever, if I'm not wrong. Not a scary movie nor actual violence, but the suspense was the movie's strong hold. If you're looking for that type, you can give it a try other than blood gore and killings.\r\n\r\n5.5/10", "created_at": "2015-04-29T15:25:33.881Z"}, {"movie_id": 254191, "review_id": "5a3d1bf0925141547e0b1a5d", "rating": 5.0, "review_text": "A Kewl_Kat quick review: Honeymoon was suspenseful for a while but ultimately left me feeling dissatisfied. It shouldn't be your first choice on a boring evening but if you happen to watch, it won't be a complete waste of time, either. It's somewhere in the middle. 5/10.", "created_at": "2017-12-22T14:51:28.191Z"}]