[{"movie_id": 19913, "review_id": "6095dbd47f0540003ebc3d96", "rating": 8.0, "review_text": "Fun film.\r\n\r\n<em>'(500) Days of Summer'</em> impressed me. It features a fairly unique and a pretty refreshing romcom story, which is told in an interesting way. Joseph Gordon-Levitt (Tom) is very good, as is co-star Zooey Deschanel (Summer). The pacing is good, as are the comedic aspects. All in all it's a pleasant watch.", "created_at": "2021-05-08T00:31:16.052Z"}, {"movie_id": 19913, "review_id": "61a9401797eab40062590049", "rating": 6.0, "review_text": "I recently had the opportunity to watch this movie again, many years removed from the first time I saw it. I was surprised how few details I remembered.\r\n\r\nDuring the movie’s sharpest moments, the dialogue is witty and fun. The story bounces around back and forth along the 500 day timeline they have measured out for the relationship between the two main characters. The device works; we get to see the state of their couple-ness at various points. It is, most of the time entertaining.\r\n\r\nBut I have to say, as much as I like Zooey in her role (and this time around I know her from her great work in Elf), I was less than dazzled by our hero. I found him to be rather pathetic and despite the fun the two characters shared at times, it felt to me there was not much chemistry between the two, except when Zooey’s character exerted herself in his direction. Perhaps that was intended, given the arc of the plot.\r\n\r\nAs I said above, the movie was entertaining, but ultimately I wasn’t satisfied with the ending. How it turned out for both characters, while believable when looked at from afar, came across as sudden and a little lame. More groundwork should have be laid out for where they stood at the end.", "created_at": "2021-12-02T21:52:23.844Z"}, {"movie_id": 19913, "review_id": "64d0e281549dda00acf12f91", "rating": null, "review_text": "**When I suffer from love pain** after any breakup and cry for days, when I build scenarios in my head and upset myself again, **I will remember (500) days of summer** and I realised much better that t**here is nothing I need to upset myself so much,** because I have experienced that **new people will come up** and make me happy and even make me sad.", "created_at": "2023-08-07T12:24:33.659Z"}]