[{"movie_id": 5876, "review_id": "58c4b57692514163730050c4", "rating": 8.0, "review_text": "Following a devastating storm, a small town in Maine finds that the eerie mist swarming into the neighborhood holds a deadly secret inside that attacks anyone around them and forces a small band of survivors trapped inside a supermarket to hold off the creatures.\r\n\r\nThis one here is an incredibly frustrating King work. A lot of what makes this one so uneven is due to there being a lot to really like about it, a few points to love about it and then there were elements to utterly loathe about it. The film is at it's best with the way the mounting hysteria over the situation with them trapped within the supermarket and how the groups resolve their problems and start new ones which was pretty good and makes for a realistic feeling to the story, detailing how it all breaks down and what the group resorts to in order to keep their sanity. Likewise, that in turn leads into the films' best efforts in the first few attacks with the unknown creatures inside the mist killing off the victims as they refuse to believe what's out there and rush foolishly into the area which makes for a series of fun times out in the cargo hold and the different attempts to reach safety outside and then encountering the different creatures and their powers were all good points. The flying insects and them trying to keep them out as the different creatures break in resulting in a series of great encounters trying to clear them out of the store, and the insane battle in the pharmacy during the pitch-black interior is a rather stark and creepy experience fighting off the array of creatures that gives this one a ton of impressive points. The final few battles and escapes to get out, the blood and gore and the way that the creatures are dealt with are all loved points here as that all leads into the stellar finale which is an absolutely unforeseen and shocking in what goes on as there are some rather disturbing parts in this section. Along with the fine creature effects, these here are the good parts to really love about it although it does have a few issues to be had here. The film's biggest problem is the mere appearance of the religious babble that gets spewed in here which is so wrongheaded and rather off-putting it just makes the viewer feel like not watching it all that often. Yet another big issue here is the length and how overlong it feels, with the rather overlong sections in the middle really making it feel it's length somewhat. While there's plenty to like here, these do hold it back.\r\n\r\nRated R: Graphic Language, Graphic Violence and intense themes of children-in-danger.", "created_at": "2017-03-12T02:41:58.585Z"}, {"movie_id": 5876, "review_id": "5d99564330f79c00114af263", "rating": 8.0, "review_text": "You can't convince some people there's a fire even when their hair is burning. Denial is a powerful thing. \r\n\r\nThe Mist is directed by Frank Darabont and Darabont adapts the screenplay from the story of the same name written by Stephen King. It stars Thomas Jane, Marcia Gay Harden, Toby Jones, Laurie Holden and Andre Braugher. Music is by Mark Isham and cinematography by Rohn Schmidt.​\r\n​\r\nResidents of a small Maine town become trapped in the local supermarket when an otherworldly mist brings deadly creatures in full attack mode. That's not the only problem, for two groups form inside the market, one in favour of escaping, the other for expiation.\r\n\r\nAs is the norm, King adaptations vary in quality and divisive fan appraisals, so with \"The Mist\" on screen not exactly setting the box office alight, and it even getting delayed releases in Europe, one would think this is one of the lesser King adapted lights? Not so, in fact, it is now proving to have a longevity of worth in horror fan circles. So much so, that the great horror writer at the literary source gives it the full thumbs up whilst giving the \"changed\" ending his full pat on the back approval.\r\n\r\nDarabont is of course the director who previously took King's more human interest stories and crafted much beloved movies out of them, so why was he in the chair to direct a film about alien creatures unleashing bloody dread on small town Americana? Well actually the answer is why \"The Mist\" is such a cunning chilly delight. For this not only features monstrous creatures straight out of a Lovecraft/Barker nightmare, but also the monsters of the human kind, where the venality of the human condition is laid bare under duress, of which it is very frightening.\r\n\r\nThe alien creatures themselves creep the flesh, ok the effects work sometimes sags under the scrutiny of \"HD\" viewings, but this is nightmarish stuff, none more so than with a quite brilliant and terrifying sequence of events in a pharmacy. Yet it's the human monsters within the supermarket that usurps our creature invaders, where religious fervour and mans propensity for survival comes crashing together for dynamic results - the cast utterly in tune with the material and delivering quality portrayals.\r\n\r\nOnce the human battles within dissipates, and we come to the resolutions and reasonings of what has caused the creature invasion (hello subtext), we arrive at the much talked about finale. It actually deserves to be divisive, for we don't want yet another horror film finale that has people shrugging their respective shoulders and saying \"fair enough, but is that it?\".\r\n\r\nIf you buy into the all round bleak tonalities that the pic has been serving throughout, then this ending hits all the right buttons. For sure, this is no easy cop out to send you home with a smile on your face, it's brutal, and crucially it's befitting the word of the genre it sits in - horror. 8.5/10", "created_at": "2019-10-06T02:49:39.855Z"}, {"movie_id": 5876, "review_id": "5facd242111da100408256bd", "rating": 10.0, "review_text": "The more I watch this movie, the more convinced I become that this movie is _less_ about the mist as a horrific result of military experiments gone awry, and _more_ a commentary on the fear of death and the unknown beyond.\r\n\r\nThe mist and its Lovecraftianesque creatures are symbolic of humanity's existential dread and the abject fear that there is quite possibly nothing else but this, and the end here is the end forever; or even worse, that what lies beyond is not a benevolent Creator, but rather an entity that either is indifferent to our existence and our plights, or is actively malevolent against us. Jean-Paul Sartre described this fear as \"existential nausea.\"\r\n\r\nMrs. Carmody's ever growing religious cult was the very opposite extreme. She proclaimed to be a prophet of the one true God, yet was hypocritical, judgmental and quick to cast stones even in light of her own sins. Her fundamentalist extremism insured they _never_ escaped their box. But what seemed the logical end result of her many violent transgressions only served to martyr her in the eyes of other extremists -- as it so often does -- and serves, in their twisted minds, as vindication of what they've been preaching all along.\r\n\r\nAnd there are those who simply did the best they could with the circumstances they were given, but in the process, did not sacrifice the wills of others for their own gain while simultaneously giving of themselves unto the service of others. No one can say with absolute certainty what lies in wait beyond this life, but we shouldn't squander the moments we _do_ have on this Earth entombed in fear and letting that fear manipulate us into becoming the monsters we sometimes create ourselves.\r\n\r\nThe end of this movie has always been, in my opinion, the most tragic. The ending was _almost_ a happy one, if only they'd held out for a few moments longer. But in relation to the underlying theme laid out above, this group of people's break from the store to the car to the literal end of the road was metaphorical of venturing out into the unknown, even if it means leaving the comfort yet unstable illusion of safety and well-being, to take our chances navigating life the best we know how. We may feel as if ultimately the only thing we have any control over is when and how we die, but even this is just another illusion.", "created_at": "2020-11-12T06:12:18.638Z"}]