[{"movie_id": 124905, "review_id": "538daff3c3a368714300497a", "rating": null, "review_text": "Muito bom.\r\nMas tem partes que é uma seca.", "created_at": "2014-06-03T11:22:27.511Z"}, {"movie_id": 124905, "review_id": "541e7d39c3a36801ea000e7a", "rating": 6.0, "review_text": "Why must Hollywood scriptwriters of some genres of movies, especially monster, superhero and horror movies, so often think that the audience are total idiots? Or maybe they themselves are severely lacking in brainpower and do not understand the level of trash in what they spew out. In Godzilla scriptwriter Dave (David) Callaham should have a special dishonourable mention for ruining a promising movie.\r\n\r\nThe movie started of with the obligatory nuclear power plant scenes. When it started I first thought, oh no not the blame nuclear power scare again. However, as it turned out, this was not so. Unfortunately, this was pretty much the only good part in the entire script. The rest of the script is just a collection of illogical, unintelligent garbage.\r\n\r\nIt starts quite quickly when Ford’s father suddenly pulls of his mask, takes a sniff, and declares that there is no radioactivity in the air. Only a scientifically ignorant idiot writes something like that. Then we have the scene were the soldiers rush into The Nevada nuclear waste facility and checks the inspection hatch on every door until they find one where there is a light only to discover that the monster have broken free and left a gargantuan hole. A huge monster have broken through the walls of a nuclear waste facility leaving a whole big enough to drive a battleship through and no one would have noticed until some marines goes around and inspects the doors on the inside? Again, you have to be pretty unintelligent to write a scene like that.\r\n\r\nThe entire plot is basically the same unintelligent mess. They follow the creatures around until they reach civilization. First then do they actually try and do something. That is just so nonsensical. In the case that a huge city-destroying creature would approach any large population center it would be blasted way before it reached it. Also, when they do attack they fire some light weaponry and maybe a tank gun or two against it. If millions of people were at risk I think it is not a very far fetched belief that the military would throw everything they had at the threat. And do not get me started on the hair-brained scheme of luring out the monsters to the sea with a nuke. What a load of bullocks!\r\n\r\nOkay, so with all this ranting, why did I give the movie as much as 6 out of 10 stars? Well, I am a fan of huge monster movies and the parts where the monsters rampage around destroying things or slugging it out against each others are great. Unfortunately this is pretty much the good that can be said about this movie.", "created_at": "2014-09-21T07:24:41.105Z"}, {"movie_id": 124905, "review_id": "550f1e9ac3a3683e7f003270", "rating": 6.0, "review_text": "**Fundamentals, reception.**\r\n\r\n1. American/Japanese live action feature length film, 2014, PG-13, 123 minutes, science fiction, action, thriller.  The spoken word is in English, with some sub-titled Japanese.\r\n2. IMDB: 6.6/10.0 from 239,012 audience ratings.\r\n3. Rotten Tomatoes: 74% on the meter (average 6.6/10); 67% liked it from 171,052 audience ratings.\r\n4. I saw this film off DVR from Cinemax.\r\n5. Directed by: Gareth Edwards.\r\n6. **Starring**: Bryan Cranston as Joe Brody, Ken Watanabe as Dr. Ishiro Serizawa, Juliette Binoche as Sandra Brody, Sally Hawkins as Dr. Vivienne Graham, Aaron Taylor-Johnson as Ford Brody, Carson Bolde as Sam Brody, David Strathairn as Admiral William Stenz, Elizabeth Olsen as Elle Brody.\r\n7. Demographic targets: Godzilla fans, action fans, international market.\r\n8. (from Box Office Mojo) Estimated production budget, 160 million USD.  Estimated gross revenue as of 01jan2015: States, 200.7 million USD (38%); overseas, 328.0 million USD (62%).\r\n\r\n**Setup and Plot**\r\n\r\n1. In the opening sequence, Joe Brody, his wife Sandra and son Ford are in Japan. Joe and Sandra work at a project that aims to contain some unexplained phenomena involving huge amounts of energy and a partially buried large object.  The object turns out to be living, breaks much of the containment apparatus, and causes widespread tragedy.  A heavier blanket of secrecy is applied.\r\n2. Jump forward to the present.  Ford is grown up, is in the US armed services, and has a wife Elle and son Sam in San Francisco.  Ford gets a call from Joe, then goes to Japan to get him out of jail.  While Ford helps out Joe, the object (a 'muto') revives, breaks free this time, and flies away, leaving even more destruction and death than in years before.\r\n3. A second, larger muto awakens in Nevada.  The two mutos are tracked by the US Navy, which is now actively involved.  The mutos' activity awakens Godzilla from his long slumber in the Pacific.\r\n4. Ford and Dr. Serizawa are drawn into the military's quest to contain the mutos.  Elle and Sam are at risk as the three giants converge on San Francisco.\r\n\r\n**Observations**\r\n\r\n1. True to tradition in Godzilla movies, human activity is depicted as futile.  Most human efforts against giant monsters have no noticeable effect.  The rest of our efforts catalyse the monsters to rain down more destruction on human cities and military personnel.\r\n2. In a few of the many Godzilla films I have seen, a child is rescued, or a trapped helpless person is released.  But for each such action, thousands of human lives are lost, and tens of billions of dollars of real estate value are zeroed out.  The contrast accentuates the helplessness of the human race against forces it cannot control and never will control.\r\n3. In a slight departure from what I'm used to in the Godzilla universe, a human being does something that will make the survival of the human race more likely. Watch the film; you can't miss it.\r\n4. Godzilla causes a huge amount of property damage and loss of life, though not nearly as much as the mutos cause. The case could be made that Godzilla in this film, as in many others, is indifferent to the fate of the human race. He does in the mutos in order to get back to his snooze beneath the Pacific.\r\n5. **One line summary:** Godzilla saves humanity from the mutos in an 8 minute appearance.\r\n6. Three stars of five.\r\n\r\n**Scores**\r\n\r\n1. **Cinematography**: 8/10 Some of the SFX were cheesy, but most were fabulous.\r\n2. **Sound**: 7/10 Few complaints.  I could hear the dialog.  The music was not too irritating.\r\n3. **Acting**: 6/10 Bryan Cranston, Ken Watanabe, Juliette Binoche, David Strathairn, and Sally Hawkins were fine in their limited roles.  Aaron Taylor-Johnson's performance was both boring (beginning) and believably heroic (toward the end), so I ended up liking him.\r\n4. **Screenplay**: 6/10 The director stayed true to the franchise, but with updated SFX and a few other adjustments.  The holes in the plot, though, seemed endless.", "created_at": "2015-03-22T19:57:14.235Z"}, {"movie_id": 124905, "review_id": "565b6312c3a36850740037bc", "rating": 6.0, "review_text": "The big atomic lizard gets another make over.\r\n\r\nBack in 1954 Ishirô Honda introduced to the film world Gojira, a creature that is still today seen as viable cinematic interest. Gojira, in spite of being a man in a rubber suit monster movie, is a smart and feisty film. Tapping into an oppressive nuclear age via moody atmospherics, whilst simultaneously imbuing plenty of creature feature carnage, it got the balance right. The makers of Godzilla 2014 have tried to do the same, they look back fondly to the original wave, pay it respect, but sadly they don't quite pull it off.\r\n\r\nPlot essentially finds the world under attack by some Kaiju (MUTO) monsters after humans keep dabbling in all things nuclear. The end is nigh, that is unless mankind can find an ally in Godzilla, an almighty prehistoric type lizard who itself is a product of some prior nuclear shenanigans.\r\n\r\nThe human plot strands feature the usual secretive government suits mixing with science guys, all looking worried or running around in a fretful state. There's a father and son axis - with the son a bad ass army guy who has a loving wife and child back home. Characters are many, and they take up a good portion of the film, unfortunately very few of them are interestingly written, which is a shame given the pic is packed with acting talent.\r\n\r\nIt's a two hour plus movie, with the build up being very prolonged, with Zilla not showing up till the hour mark. This renders the main monster as a bit player in its own movie, a mistake often made by others in many a sequel to Honda's original. There's also the irritating fact that what all good Zilla movies need is a shed load of monster mayhem, plenty of smack-downs, but sadly they are in short supply here and are often rendered as background staples. Until the finale that is.\r\n\r\nIt takes a long time to get there, and thankfully saving the pic from below average hell, it's not a let down. It thrills and opens up the eyes and ears considerably, and fans of all things Zilla will get goosebumps upon the arrival of the electrical charge and breathing of nuclear fire sequence. But with that comes the annoyance that the good technical craft within the piece has previously been used sparingly, the decision to put bland characters at the forefront instead of cinema's most famous monster proving to be a huge error.\r\n\r\nThe makers have to considerably up their game for the planned sequels that will feature other legendary creatures. 6.5/10", "created_at": "2015-11-29T20:41:54.431Z"}, {"movie_id": 124905, "review_id": "58ac459292514158c8013b5c", "rating": 7.0, "review_text": "OK, let me start off by saying that the new Godzilla is definitely an entertaining movie and well worth the price of an admission ticket. That is – so long as you go into it with popcorn-level expectations. Now, it has to be said that the bar, since the most recent attempt by Roland Emmerich in 1998 (which was hilarious at best) wasn't set particularly high, to say it nicely. So in all honesty, with today's budget and special effects, it never had big chance of being that bad. But I have to admit, judging from the trailer – I thought it would be better.\r\n\r\nIt starts off pretty good. There is proper story build-up and character lay-out. Where we are – what's happening... It's all there. In fact, the story revolving around the main characters is pretty dramatic from the get-go. Death in the family, trauma leading to obsession over finding the truth surrounding the circumstances. Bryan Cranston is impressive as the family father and science guy. He just knows something is up concerning some big beastie and he won't let up until he figures it out. That is – if he gets the chance. Something happens around one third into the movie that is a pivotal turning point in the story. I knew this immediately when it happened and in the end I realised that I had been correct.\r\n\r\nFrom this point on, it's out with the story and in with the action. An almost mind-numbing, pummelling assault of non-stop action. I'm not saying it's bad, I'm just saying it's a lot less interesting than it could have been.\r\n\r\nHere's the deal: instead of just one Big Monster, they bring in three. One Godzilla, and two huge insect-like creatures that are only designated as MUTO (Massive Unidentified Terrestrial Object). Seriously, they couldn't come up with a proper name? And instead of Godzilla being the big threat to mankind, the MUTO are. In fact, Godzilla turns out to be the good guy because he's the only one that can defeat these insect creeps. This story line is factor one in the reason that this movie isn't what it could have been. Factor two is the plot point that these creatures all feed on nuclear energy instead of \"manburgers\". Consequently, the only real threat they pose is the massive destruction they cause in big cities (and obviously, the human lives that become casualties by default). It's because of this that there is never any real sense of threat or danger. They don't hunt us, they don't care about us. All they want is nuclear energy and a place to breed. What's worse is, these MUTO take screen time and attention away from the monster who's supposed to be the main antagonist and namesake of the movie! It might as well have been called \"Big Creepy Insects\" instead of \"Godzilla\"... \r\n\r\nIn the end, what we're left with is billions of dollars worth of collateral damage and a big-ass monster who's really kind of a nice guy. Weird.\r\n\r\nStill, it's certainly not bad. Aaron Taylor-Johnson does his best at looking very serious and all grown up since his Kick-Ass days, although I am certain that this is definitely one of his less compelling roles. The problem is that from the 1/3 turning point that I mentioned, his character becomes very formulaic and cliché. Our hero even shares an intimate moment of eye contact with Godzilla in the end... Aww.\r\n_(May 2014)_", "created_at": "2017-02-21T13:50:10.326Z"}, {"movie_id": 124905, "review_id": "605cd76823be4600748b94c2", "rating": 7.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nIt's not easy to start off a new cinematic universe. The first installment must be an undeniable success on almost all fronts for the franchise to take off. From interesting world-building to delivering a good first film, it's a brutally challenging task for any director and writer to take on. Godzilla has been around forever, but Warner Bros. And Legendary Entertainment bravely brought on an inexperienced filmmaker, Gareth Edwards (Monsters), and a debutant screenwriter, Max Borenstein, to handle yet another version of the Godzilla story. Expectations-wise, I know that audiences look at this type of movie from an action-heavy perspective. A massive majority of the viewers just want to see monsters fighting, which is understandable. \r\n\r\nI enjoy a big battle as much as any other moviegoer, but I do desire a remotely decent story. When it comes to this particular genre, I don't ask for an Oscar-worthy screenplay that leaves me floored by the end of the film. I don't need incredibly complex, multi-layered characters with exquisite motivations. I don't even mind heavy exposition as long as it's not overdone and sluggish. With that said, I also don't want the most annoying, cliche archetypes nor nonsensical plot points. I genuinely hate myself when I get too nitpicky with \"movie logic\" issues, but when the characters make the most ridiculously absurd decisions that no sane human being would make, then the film is really asking for a negative commentary. \r\n\r\nBorenstein - who goes on to co-write two of the following three installments in the MonsterVerse - gets close to a perfectly balanced narrative, which in this genre is related to the amount of screentime allocated to humans and monsters. This movie can't just be Godzilla fighting a random monster since the visually appealing, constant battles would lose impact with time (besides the lack of a story), but it also can't waste all of its duration with the human characters - after all, the film is titled Godzilla, not The Brody Family. Audiences all over the world enter their respective theaters to be blown away by the action, visuals, score, and be thoroughly entertained by titans punching each other to death. \r\n\r\nSeveral characters carry surprisingly compelling arcs, especially Ford and Joe Brody. The father-son relationship between Aaron Taylor-Johnson (Kickass) and Bryan Cranston (Breaking Bad, Argo) feels authentic, with both having a common unsolved problem from their past that links to the King of the Monsters. The emotional attachment to this family elevates the dangerous sequences that the movie holds throughout its runtime. Cranston offers an undeniable commitment to his role, while Taylor-Johnson demonstrates some of the talent that would later be discovered by Marvel. Ken Watanabe (Inception, Batman Begins) is a fantastic addition to the cast as Dr. Ishiro Serizawa, a scientist who fortunately doesn't follow the formulaic development usually thrown at this type of character. Elizabeth Olsen (Oldboy, Martha Marcy May Marlene) and Sally Hawkins (Blue Jasmine, Happy-Go-Lucky) also get a bit of screentime, but they're basically just \"people close to the important characters\". \r\n\r\nGareth Edwards admittedly loves the Godzilla lore, but any viewer can tell the great care that both Edwards and Borenstein have with their characters. More screentime is handed to humanity than to the monsters, which will undoubtedly disappoint many fans. While I do feel invested in the protagonists, too much time is spent with the military, where countless exposition scenes drag the overall narrative. The suspenseful build-up to the climactic third act is efficient, but the action is frustratingly hidden from the viewers. Most of the titanic battles are seen through the windows of a car, train, building, or even TVs. The main problem with the film isn't spending time with humans when the monsters aren't fighting but choosing to remain with these characters even when Godzilla and co. Enter the scene. \r\n\r\nTitans are fighting right behind the camera, and they keep the audience either entirely in the dark or just partially show a section of the battle. Most of the shots are ground-level, usually showing the POV of a certain character. While that brings a higher sense of danger and desperation to the screen, it also generates a frustrating feeling in the audience who's not seeing Godzilla fighting in its full splendor. I understand that part of this decision might be related to some less polished VFX, and in all honesty, despite the rare wide shots of the monsters, the action is definitely entertaining and quite riveting. Alexandre Desplat's score is vibrant, and the actual monsters look gorgeous in the purposefully dark environment (helps to hide visual imperfections), especially Godzilla. \r\n\r\nGodzilla focuses more on the human characters than on the monster fights, and despite the narrative balance needing some adjustments, it surprisingly works quite well. As the first installment in the MonsterVerse, Gareth Edwards and Max Borenstein deliver an incredibly compelling story on the human side, fully developing the main characters and handing them interesting arcs. Most of the runtime is spent with these protagonists, which will undoubtedly disappoint some fans who crave the titanic battles, but the suspenseful build-up works in favor of the climactic third act. However, choosing to remain with the humans when the monsters are already fighting in the background is a questionable decision that leaves an extremely frustrating feeling in the audience. Cast, visuals, and score seem to hit the right notes, but the actual combat is rarely seen in its full glory - most of it is shown through a ground-level character's perspective - partially due to the necessity of hiding some VFX imperfections. Still, it's an utterly enjoyable monster flick that sets up a pretty entertaining cinematic universe. \r\n\r\nRating: B+", "created_at": "2021-03-25T18:33:12.539Z"}, {"movie_id": 124905, "review_id": "62aa074aeb14fa09de0f0578", "rating": 6.0, "review_text": "\"Godzilla\" is the sort of cinematic gift that keeps on giving, and the hunkily beefed-up Aaron Taylor-Johnson is always worth looking at - but sadly, neither of these features do enough to rescue this from a sort of disappointingly derivative mediocrity. This iteration of the plot picks up the story many years after a nuclear disaster in Japan. \"Ford\" (ATJ) is the son of the plant supervisor \"Joe\" (Bryan Cranston). They are not exactly close, but when they discover evidence near the ruins that the destruction was not accidental - and that a giant trapped, flying, \"MUTO\" - which feeds on radiation - might well be coming for more lunch, they can only hope that \"Godzilla\" might become aware and come to the rescue of a totally out-gunned mankind. It's a bit of a sprawler, this film. It takes far too long to get going, with characterisations that offer little of substance and a dialogue that borders on the inane - especially when the military are involved. The supporting cast features a sparingly used Juliette Binoche and Elisabeth Olsen, but they aren't really on screen long enough to add much value. On the plus side, the photography and visual effects are good - they flow with a realism that is quite convincing, but that's standard fayre nowadays for this kind of adventure. The rest of the photography really could have done with some more wattage. Darkness can add eeriness to a scenario, but after a while I do want to recalibrate my eyes! The ending is certainly effective, but I'm just not sure it was worth the wait - the whole film just needed something to bring it to life more.", "created_at": "2022-06-15T16:22:34.921Z"}]