[{"movie_id": 323661, "review_id": "5844651e92514166ba00beee", "rating": 8.0, "review_text": "**Two worlds within a world, fighting the darkness.**\r\n\r\nFrance is only next to the Hollywood when it comes to the 3D animation. Not sufficient films were made in this format, but still the quality and creativity are laudable. When I saw one of this film's poster, not just for me, but anybody would think of the Na'vi from 'Avatar'. That's a misconception, only until you watch this film. Because it was totally different and awesome. Directed by two not very well known filmmakers, but their firsthand experience prior to this might have helped them for this project.\r\n\r\nLike in any animation films, this tale takes place in a fictional world. The story of legends of the guardians of the sun and moon. Both of those heavenly bodies were created and guarded by ancestors for generations of the two races to keep the planet in peace and harmony. A youngster named Mune, from the night world was accidentally chosen as the keeper of the moon during the ceremony to hand over the guardianship. While it was a successful in power transfer on the day world to another youngster, Sohone.\r\n\r\nThe two youngsters eager to dedicate their lives to keep the order of the ancient practice. On his first day of duty, Mune messes up everything, followed by Necross, from the darkness who hidden underground for the centuries tries to bring chaos. Now, a girl who lives on the border of the day and the night joins those two to a quest to retrieve what is lost. Facing a tough challenge by an evil opponent, these three has to do impossibles. Meanwhile, it is an opportunity for them to prove themselves to their capabilities.\r\n\r\nThe creativity was brilliant. Those characters, settings, story and its developments, so genuinely done. Not just Disney or Pixar, totally Hollywood got a close competition here. Quality films like this, 'The Little Prince' and 'Asterix', can help to grow French animation industry faster and to the standards. Especially this film was short and sweet. Despite a beautiful imaginary world, the storyline was pretty much clichéd, like the same old formula applied to a bunch of new characters.\r\n\r\n> \"What? You think adventure is to fly a unicorn! And to go with the elves? Bad news! We do not live in a fairy tale.\"\r\n\r\nI mean like any fantasy film, there's always something bad happens in the opening and the remaining is trying to resolve it, which are mostly a lifetime journey for them. We know that as an outline, but not in the pictures, so that's why we watch it. There's also nothing wrong in that, but how smartly the film narrates its story remain pivotal to calculate its success and according to me it fared so well. I hope you would think it that way as well after watching it.\r\n\r\nVery much a kids film, but I don't see a reason why grown ups should avoid it. In fact, this kind of stories are created by the adults with their imagination and that is not easily done work. You can compare it to our real world. Like how different races can live together peacefully. Besides, between two worlds, there's also a thin world exist that separates these two worlds, as well as unifies. As much you enjoy watching it, you will admire what they are doing and for why. Such an inspiration, particularly for the children.\r\n\r\nThe parts of the film were comparable with other popular animations around the world, but not entirely, only the small portions. Maybe because of creative common, but I think the writers had done an incredible job with the screenplay, especially when there's no original source like perhaps a book. I watched it a little late, but the point is I did not miss it. I laid my eyes on it a very long ago, but could not get the right time till now.\r\n\r\nIt's a great relief, moreover, I loved it. Well composed music, the background score was perfectly matched with the visuals which so colourful and attractive. The film also won a couple of international awards. I hope they make a sequel for this. Usual that does not happen in French animation, also the box office result is not in its favour. I think it is slightly an under-appreciated, but definitely an under-recognised film. So it needs your support, if you're an animation fan, you should try it. It was just like another Hollywood film, but was in the French Language. I say go for it!\r\n\r\n_8/10_", "created_at": "2016-12-04T18:49:02.923Z"}]