[{"movie_id": 9476, "review_id": "5f1f5935a6c10400348de9b3", "rating": 8.0, "review_text": "Great watch, will watch again, and do recommend.\r\n\r\nWhat a fantastic cast: I honestly don't know if you could have cast it better.  Just thinking about Alan Tudyk, Heath Ledger, and Shannyn Sossamon makes me smile.\r\n\r\nEveryone plays their roles fantasticly, taking their stock characters, and spinning the writing to the 9th degree: the jerks are hate-able jerks and I can't help but love the leads and supporting characters.\r\n\r\nPart of what makes this movie disctinct is that they forces some modern (for the time) music into it when it very did not belong with medieval England / Europe.  There are several scenes where if you squint, you could mistake the movie for \"10 Things I Hate About You\" or some other teen rom com of that time period.\r\n\r\nFortunately they found a way to balance the jousting content with personality stories, which are by far more entertaining, but unless you're Kevin Smith, you can't exactly cut jousting out of a movie set in competitions for jousting.\r\n\r\nThis is a fun movie with some positive messaging in it about women and class rights, please give this a go.", "created_at": "2020-07-27T22:46:13.996Z"}, {"movie_id": 9476, "review_id": "63bf6920a5743d00890f6886", "rating": 10.0, "review_text": "My dad, rest his soul, really liked this and at the time it came out I was a pretentious college student that had forsaken all things fun and couldn't understand what my father could possibly like about it.\r\n\r\nAnd now I'm living in a world where someone makes a tweet with the president's head morphed onto Rocky Balboa's body and people are freaking out and screaming \"How am I supposed to take it, if not totally literally!\"\r\n\r\nAnd I'm sitting off to the side, mumbling that it was just a joke, and seeing my old self that hated A Knight's Tale reflected in those people and thinking \"I was a real humorless prig for about four solid years, thank every god that has ever been worshiped that I grew out of that.\"\r\n\r\nWhen I first saw it I thought the part where the smith added the Nike swoosh to the armor was horrible because, well, I was pretentious and took life far too seriously.... blatant product placement!... sweatshops!...child labor!.... Corporatism! Whatever!\r\n\r\nAnd now that said phase in my life has melted away, it's just a joke and honestly kind of a cute one.\r\n\r\nAnd then the same can be said about Chaucer.... and literary genius, how dare they slander such a.... and now that I'm older he was absolutely the best part of the movie wasn't he?\r\n\r\nClassic rock music in movie about the dark ages and... pandering... unrealistic... blah, blah, blah, and now that that ill informed phase in life wore off, it works on multiple levels and most surprisingly they succeed in using it to make you laugh.\r\n\r\nI guess the point is that now that I learned to actually enjoy things and not take everything so seriously, so literally, and understand a joke is just a joke, it's a super fun and hysterical comedic romp and to watch it is to love it.", "created_at": "2023-01-12T01:57:52.535Z"}]