[{"movie_id": 365620, "review_id": "64f1e1d8e0ca7f00ec875dd0", "rating": 6.0, "review_text": "FULL SPOILER-FREE REVIEW @ https://fandomwire.com/ferrari-venice-film-festival-review-penelope-cruz-drives-an-uneven-biopic/\r\n\r\n\"Ferrari has the potential to be a memorable biopic but lacks a more thoughtful emotional focus in its performance-driven character study. Adam Driver is excellent, but Penélope Cruz clearly stands out with an emotionally devastating performance.\r\n\r\nThe dialogues between the main couple are the highlights of a globally abrupt film that deals with the deaths of people outside the family nucleus in a manner that is too fleeting and insignificant, in addition to overdramatizing a particular subplot.\r\n\r\nCompetent racing sequences. It fulfills the basic purpose of telling the story of a complex man whose life is much sadder than one can imagine.\"\r\n\r\nRating: B-", "created_at": "2023-09-01T13:06:32.783Z"}, {"movie_id": 365620, "review_id": "6590032041a56166da04744b", "rating": 6.0, "review_text": "Perhaps Adam Driver thought his \"House of Gucci\" (2021) role would better qualify him to play the eponymous and visionary Italian motor sport impresario, but what we really end up with here is more in the vein of the recent Bradley Cooper \"Maestro\". Sure, there are some great re-enactments of the races - though maybe not at the beginning with Driver's faced superimposed into a car like you'd put a kid's face on a birthday card. The bulk of the rest of this is more a treatment of his tempestuous marriage with Laura (an uncharacteristically flat Penélope Cruz) and how he juggles his family - and their past tragedies - with his second family with Lina (Shailene Woodley) and son Piero (Giuseppe Festinese) about whom his wife knows nothing! The business is struggling. The production car manufacture is no longer paying for the racing cars and with bankruptcy looming, Enzo must put all of his eggs into the one basket that is the thousand mile endurance Mille Miglia and hope to win and generate extra sales. It's this last half hour that brings the film to life. You can almost smell the fumes of the engines as the cars race the narrow and treacherous roads of rural, post war, Italy. There's also an indication of the honour amongst the drivers and an awareness of the respect that they have for each other - especially as we know fatality and disaster are frequently in that cockpit too. At it's best, it's an intense and well photographed almost documentary style of film, but there's too much pointless, meandering, melodrama with a leading man who just hasn't a charismatic bone in his body. Although I didn't hate it, it was way too much about a flawed marriage and not about the engineering that made me care.", "created_at": "2023-12-30T11:46:41.023Z"}]