[{"movie_id": 7978, "review_id": "5f7a55903e2ec80037d2b423", "rating": 7.0, "review_text": "Extended Cut: Proving in fact that The Wolfman is no monstrosity.\r\n\r\nThe Wolfman is directed by Joe Johnston and adapted to screenplay by Andrew Kevin Walker and David Self from Curt Siodmak's original 1941 screenplay. It stars Benicio del Toro, Anthony Hopkins, Emily Blunt and Hugo Weaving. Music is scored by Danny Elfman and Shelly Johnson is the cinematographer. Plot is set in 1891 and finds Toro as Lawrence Talbot, who upon learning of his brother's grizzly murder, returns to his estranged father's estate in Blackmoor to investigate. Upon arriving he forms an instant bond with his dead sibling's fiancée, Gwen (Blunt), but soon Lawrence finds himself mired in a world of lycanthropy and family secrets.\r\n\r\nIt had a much publicised troubled production, with a director switch, numerous release date changes and enforced cuts to the running time, sitting atop of this particular iceberg. With that it mind, film is arguably better than it had any right to be. What is now readily available is an extended cut of the film where some 17 minutes of footage have been put back into the story. Footage cut originally to foolishly speed up the moment when the first transformation from man to wolfman arrives. Is the extended cut a far better movie than the trimmed theatrical version? The answer is resounding yes it is. It still contains flaws, but now the narrative is stronger and crucially by waiting much longer for the first \"big change scene\", tension and anticipation now exist where previously it didn't. \r\n\r\nIn spite of some modern day advancements for this 21st Century wolfman - \r\nexcessive speed for the wolf - creature smack down finale - Johnston's movie is very faithful and respectful of the 1941 original. Which is perhaps not surprising since the weight of Universal is backing this remake of one of their original classic monsters from the 30's and 40's. But it's nice to see that a remake keeps the things that made the original so beloved. Gothic texture is rich, none more so than with the mist/smog shrouded village, while the tortured sadness that permeated Lon Chaney's take on Larry Talbot back in 1941, is perfectly essayed by del Toro this time around. \r\n\r\nThe creature design itself cleaves close to the original, with Rick Baker and Dave Elsey picking up the Academy Award for Best Makeup for their excellent efforts. Fans of shred and gore are also well served here, with Johnston (The Rocketeer/Jumanji) showing a keen eye for action construction. An attack at a Gypsy camp and a bloody rampage through a bus are the stand outs, while an asylum sequence is also not to be sniffed at. Chuck in the murder mystery element, and the intriguing father and son axis, and it's a film that has more to it than merely being a CGI popcorn piece. Even Elfman's score fits neatly into the period setting. \r\n\r\nProblem wise it comes down to Blunt and Weaving being under used, and Hopkins veering dangerously close to over hamming the omelette, yet all remain strong in characterisations. Toro, though, is not, as some have suggested, miscast. Already lupine like before transformation, he plays it perfectly troubled and brooding like. Talbot has inner demons and unanswered questions in his past, a past he has tried to shred but finds he now must confront those demons. The onset of lycanthropy serving, one feels, as a metaphor for his personal torment finally being unleashed. Toro nails it with an excellent and subdued portrayal, even if the choice of hair style leaves much to be desired. Worth a mention as well is Shelly Johnson's photography, where nice atmospheric visuals complement the tone and period flavour of the piece. \r\n\r\nMore homage than outright horror, but with a little something for everyone interested in Horror/Gothic/Mystery type movies, The Wolfman in extended form is an enjoyable enough experience. 7/10", "created_at": "2020-10-04T23:06:56.565Z"}]