[{"movie_id": 210577, "review_id": "556988f7c3a36875ef000d75", "rating": 7.0, "review_text": "Good cast and decent story, although the end is not very convincing.\r\n\r\nThe cut of the movie is really good and Rosamund Pike is genuinely scary.\r\n\r\nNot a master piece but quite good given the lack of passable movies lately.", "created_at": "2015-05-30T09:55:03.756Z"}, {"movie_id": 210577, "review_id": "59f26e909251416a9e03e646", "rating": 10.0, "review_text": "Rosamund Pike is outstanding as the wronged wife and Ben Affleck is very good as the husband. It is convoluted, and you do start to think is this just going over the top, but the end just shows Pike's character to be a damaged high-functioning psychopath. So at the final sequence, even if it's a tad far fetched even if you feel that Affleck deserves everything coming to him, the look she gives to the camera is that of an pure evil. As my youngest daughter used to say when she was a kid, she's got scary eyes.", "created_at": "2017-10-26T23:24:00.232Z"}, {"movie_id": 210577, "review_id": "5e2f299f4ca67600144995ae", "rating": 10.0, "review_text": "\"This man might honestly kill me\".\r\n\r\nThe story is about Nick Dunne, as he finds out his wife has gone missing. As increasing police and media pressure mount, the facade of a loving and blissful union crumbles and amidst the lies and behavior of Nick, the question remains - did he kill her?\r\n\r\nDavid Fincher is a true master class when it comes to directing, because Gone girl is one of the best films of this year.\r\n\r\nBen Affleck was perfect for this role, because Ben Affleck through out he's career had a lot of hate from the media and the critics that mostly slammed him in every role that he was in. And that's why he was outstanding in this movie.\r\n\r\nRosamund Pike acting in this film was pure brilliant and spectacular. She was so good in this role she might get a Oscar nomination for this. Tyler Perry in this movie was actually pretty damn good, and am so surprise saying that because Mr. Perry was in such awful films like: MADEA trilogy, Alex cross and the list goes on. But in this movie he did good.\r\n\r\nWhat this movie does so brilliantly well is how we view media today, because most of the stories you hear on the news might not be true and how the media can spread lies about people and ruining their lives. Everybody always believes what the media says even if it's true or not, because we don't know what that person on the news is going through, and this movie got that message out they so perfectly.\r\n\r\nMy only problem with this movie is Neil Patrick Harris character. Now let me just say that Neil Patrick Harris wasn't terrible in the movie, but his character to me slowed the film down.\r\n\r\nOverall Gone Girl is a fantastic film.", "created_at": "2020-01-27T18:19:11.331Z"}, {"movie_id": 210577, "review_id": "5fbe9bbe323eba003ffde7f8", "rating": 9.0, "review_text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nThis is it. The last David Fincher's film I'll be able to review before Mank, his next masterpiece… I hope. I've been through Se7en, Fight Club, Zodiac, The Social Network, and now it's time for Fincher's latest installment, Gone Girl. Clearly, Fincher loves to work with people he knows. Jeff Cronenweth has been his director of photography in half of his movies, same for Kirk Baxter as part of the editing team, and Trent Reznor and Atticus Ross in the musical score. Even his production designer, Donald Graham Burt, has been around since Zodiac. However, Fincher always works with a different writer, and this time, he partners up with a debutant screenwriter, Gillian Flynn, author of the original novel that originates this adaptation.\r\n\r\nUsually, when it comes to writers, I take this change of media with a grain of salt since writing a book isn't exactly the same as writing a screenplay (it's completely different, I was being generous). With that said, Flynn absolutely destroys my self-doubts, delivering one of the best scripts of 2014. From the exceptionally captivating, perplexing disappearance of Amy to the underlying theme about how press and media treat this type of news, Flynn's screenplay is impressively able to develop each and every narrative in the most perfect way possible. With a remarkable use of time/date stamps, the viewer follows in a detailed manner the events that build up to the tragic day through different perspectives, mainly Amy's and Nick's.\r\n\r\nThis story's greatest accomplishment is how it makes the press influence what the viewer thinks about the characters, just like in real life. Nowadays, people don't even click to read the full article and understand its context. A single headline, as far from the truth as it might be, is enough to start a worldwide online debate. The same goes for television networks, and their news shows: if it's on the national news program, then it must be true, people think. I may be wrong when I wrote the whole \"change of media\" matter before, but of this, I'm sure: take every news article you read with a grain of salt because most of the time, the full, true story isn't entirely revealed.\r\n\r\nThis takes me to Ben Affleck (Justice League, The Way Back) and what I consider one of the best casting choices of the respective decade. In case you don't know, Affleck has been pursued throughout his whole life by journalists who try their hardest to expose his personal life, no matter how disrespectful it may turn out to be. Nick goes through the exact same obstacle. There's non-stop news about Amy, and it only becomes a matter of time until Nick starts being accused of being a terrible husband, and ultimately the obvious killer, even though the press can't find a single proof. Affleck doesn't even need to incorporate a new character since he has the necessary life experience to offer an utterly brilliant performance. Definitely, one of my favorite actors working today.\r\n\r\nSince I'm in the realm of performances, I might as well continue with Rosamund Pike (Radioactive). Her interpretation of Amy is almost the opposite of Affleck's, in the sense that the latter gives a seemingly simple yet powerful display, while Pike has a much more complex, layered role. She can be menacing and scary but also loving and kind. The puzzle surrounding her disappearance is mostly based on a perspective enigma, as the viewer is told the same story through different lenses throughout the first half of the film. Honestly, this is probably a career-best performance for Pike, who portrays a character of extremes, allowing her to demonstrate her jaw-dropping emotional range.\r\n\r\nCarrie Coon (Margo Dunne) is another actress I've grown to deeply enjoy watching, and she's terrific as Nick's sister. Her chemistry with Affleck is spot-on, and I sincerely hope that one day she becomes one of the most coveted actresses in Hollywood. Tyler Perry (Tanner Bolt) is also pretty great as Nick's lawyer, but Kim Dickens is even greater as Detective Rhonda Boney, who partially plays the same role as the viewer by trusting that what she sees and hears is undoubtedly the ultimate truth. Flynn's screenplay is packed with twists and turns, some of them more surprising than others, but the third act saves an unexpected, shocking turn of events, leading to a powerful ending that will leave most audiences speechless, myself included.\r\n\r\nTwo minor issues. One of them, you probably have already figured it out since I left Neil Patrick Harris (Desi Collings) out of the cast compliments above. Harris is fine as the character he portrays, but I can't help but feel that he wasn't the right actor for the role. This is a classic Fincher movie: dark, somber, depressing, tragic, and with its own share of violence and blood. In fact, it possesses one of the most disgusting, disturbing uses of blood in a single scene I've ever seen. Harris is an excellent actor, but he stands out from the rest of the cast, and not in a positive way. Again, fine performance, just not the right role for him. The other problem is admittedly an irrelevant nitpick regarding a few details story-wise that stretch the believability of everything just a bit.\r\n\r\nNevertheless, this is still a phenomenal film, and it's another evidence of David Fincher's masterful visual filmmaking. Once again, Fincher works with his known crew members to create a sumptuous look and feel. With seamless editing, a memorable score, and fantastic camera work, Gone Girl is technically magnificent, but it's Gillian Flynn's debut screenplay that steals the spotlight. Boasting jaw-dropping twists, including an utterly shocking third act and respective ending, Flynn's narrative is incredibly engaging due to its remarkable structure and puzzling mystery, never losing an inch of excitement or interest. Ben Affleck is one of the best casting choices of the decade by interpreting a man whose life is deeply affected by the press and media, which should never be fully trusted (a clear and powerful message to the audience), while Rosamund Pike delivers her career-best performance with an emotionally devastating display. Despite the misstep of casting Neil Patrick Harris in such a dark movie and a couple of nitpicks regarding the investigation, everything and everyone else turn this into one of the best films of the 2010s.\r\n\r\nRating: A", "created_at": "2020-11-25T18:00:30.982Z"}, {"movie_id": 210577, "review_id": "64f6bb1dffc9de0138e9dc5b", "rating": 8.0, "review_text": "**An excellent film, which never leaves us comfortable and where nothing is as it seems.**\r\n\r\nThis is one of those films that can unnerve and exasperate us, but that we love to watch. In fact, I don't remember seeing many films where the main character deserved my hatred. I don't want to, and I won't reveal what happens in this film, but it's one of those where appearances can be deceiving and where things aren't what they seem. The action focuses on the disappearance of a woman and her husband's efforts to find her. To our eyes, it's obvious that he really wants to find her, perhaps more than her parents, who seem to be just taking the opportunity to publicize the children's books they've published. However, little by little, he becomes a suspect in a hypothetical murder case.\r\n\r\nDavid Fincher is a director who has already shown what he's worth: I loved “Se7en”, “Game”, “Fight Club” and “Zodiac”, but I didn't really like “Social Network”, or “Benjamin Button”. In this film, he directs skillfully, but not without debatable choices: for me, the story's most important twist all comes too soon, and the ending is lazy, overly sudden, and makes it feel like the film was cut short before the end. The rest is incredibly well done and works wonderfully, and the film is a gradual construction where the details are fundamental and very well-thought-out.\r\n\r\nI really liked Ben Affleck's work. For me, it is one of the best films the actor has made to date. We feel his commitment, the way he develops the character and allows himself to appear increasingly distressed, submissive, without a will of his own, like someone who is living a nightmare and just wants it all to end. Alongside this renowned actor is Rosamund Pike, an authentic ice maiden accustomed to the most frigid roles we can imagine. She is not one of my favorite actresses, she is one of those that I consider not very versatile, but she gave everything that her character asked for: coldness, an intelligent and sharp mind, extreme physical and emotional self-control, a calculating spirit and a sweet and angelic face. Among the supporting cast, we have well-selected names, such as the friendly Tyler Perry, a very focused and rational Carrie Coon and a sinister Neil Patrick Harris.\r\n\r\nTechnically, I believe it is fair to highlight the intelligent use of cinematography, which is almost never warm and pleasant. There are scenes where we see this, right at the beginning, where things were going well for Affleck's character, but the essence of the film is made with a cold, uncomfortable color palette and scarce, hazy or artificial light. The film never makes us comfortable and creates its dramatic tension solidly. The sets and costumes also contribute, with that huge house for just one couple, with few signs of human warmth and joy. Finally, the soundtrack adds a sinister and deeply atmospheric touch that cannot be ignored.", "created_at": "2023-09-05T05:22:37.497Z"}]