[{"movie_id": 9870, "review_id": "54f5ec3a9251410692000017", "rating": 7.0, "review_text": "This was a refreshing surprise. Quite hilarious at some points, not so funny in others but still refreshing and the cast does a good job.", "created_at": "2015-03-03T17:15:38.571Z"}, {"movie_id": 9870, "review_id": "5ab963e40e0a2636480091f7", "rating": 6.0, "review_text": "Entertaining romcom marred by incongruent porn-ish elements\r\n\r\nRELEASED IN 2008 and directed by Nicholas Stoller, \"Forgetting Sarah Marshall\" is a romcom starring Jason Segel as Peter, a genial musician from Los Angeles who composes music for a popular detective show, which stars his hottie girlfriend, the titular Sarah Marshall (Kristen Bell). After she breaks up with him he vacations at a resort in Hawaii where, unexpectedly, his ex & her rock star beau (Russell Brand) also happen to be staying. Mila Kunis plays a concierge at the resort who takes interest in Peter.  \r\n\r\nThis is a compelling, amusing romantic comedy with Segel likable as the protagonist and Bell winsome and charismatic as his ex. Brand is great as a Jim Morrison-like rock god who doesn’t drink; the way he performs on stage is laugh-out-loud funny (poking fun at rock stars). The resort locations are a highlight and the story is sprinkled with several notable guest stars (Bill Hader, Jack McBrayer, Maria Thayer, Taylor Wily, Paul Rudd, Da'Vone McDonald, Jonah Hill, etc.).\r\n\r\nUnfortunately, there are several NC-17 (aka porn-ish) scenes that I wasn’t expecting since the version I watched was supposedly rated ‘R.’ I’m talking about several scenes of simulated sex, including one involving fellatio, as well as full-frontal male nudity right out of the gate (Seriously?). I basically ignored these scenes or rolled with them and laughed. I’m sharing this info for those who don’t care to see a movie mixed with nigh-porn elements.                   \r\n\r\nTHE MOVIE RUNS 1 hour 51 minutes and was shot in O'ahu, Hawaii, and Los Angeles, as well as studio work done at Universal City, CA. WRITER: Jason Segel.   \r\n\r\nGRADE: B but basically ruined (for me) by the porn aspects, so really ‘D’", "created_at": "2018-03-26T21:19:32.289Z"}]