[{"movie_id": 226857, "review_id": "602d72c86743fa003ee4ded6", "rating": 1.0, "review_text": "On Valentines Day in 2014, Universal released the second adaptation of Endless Love, Scott Spencer's 1979 National Book Award nominated novel. The 1981 film adaptation received 6 Golden Raspberry nominations, so it is fair to say that Spencer's novel didn't lend itself well to screen the first time around.\r\n\r\nThe 2014 tells the story of when 17-year-old Jade (Gabriella Wilde) graduates high school with high hopes for an impressive scholarship, she looks back with some regret at having neglected her social life. Classmate David (Alex Pettyfer) has had a crush on Jade throughout high school, but never acted on it. A chance meeting between the two sets in motion a deep summer love, much to the disapproval of Jade's father (Bruce Greenwood), who determines David to be a bad influence on his daughter.\r\n\r\nTime is a valuable asset in filmmaking, especially when setting the scene for a movie. Back stories must be set out, and then fleshed out, so that it's clear what drives the characters to make the choices they do. _Endless Love_ doesn't feel the need to worry the audience with any of that, starting on Graduation Day with two protagonists who it is admitted have never spoken to each other, and having them fall straight in love.\r\n\r\nJade, who has precious few friends, implying her classmates know very little about her personality, is idolised by David, presumably for being a blonde bombshell. When given the smallest amount of attention from David, Jade then is willing to drop everything that her father has coerced her into working for.\r\n\r\nWhen Daddy shows his disapproval, because he projects expectations of Jade's dead brother onto her, Jade becomes little more than a pawn between her father and David. While Jade's mother appears to be softer towards the relationship, her viewpoint is completely undermined when we learn that her husband is cheating on her (a plot point that seemingly is to further the animosity between David and Jade's father, but becomes completely forgotten about later on).\r\n\r\nThe acting is passable, but when working with a cardboard screenplay there is very little point.\r\n\r\nEndless Love is the worst type of film. Promoting itself as a young woman's choice to leave the clutches of her evil father is both disingenuous, dangerous and damaging to the young women it is aimed at. There is no plot, no backstory, no personality, no point. It is misogynistic, shallow and degrading.\r\n\r\nDon't watch this.", "created_at": "2021-02-17T19:47:20.914Z"}]