[{"movie_id": 723072, "review_id": "6307f330b04228007f4b0737", "rating": 5.0, "review_text": "I had my reservations about Host. Zoom became very popular during the pandemic, but that doesn't mean that people are clamoring for movies about other people using Zoom. That said, I admit that Host won me over little by little.\r\n\r\nIt's nowhere near perfect; the characters stay logged onto their Zoom sessions much longer than any sane person would, considering what they go through. Not only do they spend an inordinate amount of time in front of their computers, but on the rare occasions they go elsewhere – which is never too far –, they make sure to bring their laptops along (one even falls to the ground dragging his computer with them, the device managing to land at a perfect angle to continue following the action).\r\n\r\nThis is not how real persons would react; it's how characters in a script behave. I understand that their monitors are our windows to the their world, and without them we would be left in the dark, but I'm more willing to believe in an evil spirit than in the perfect ubiquity of a video camera.\r\n\r\nHaving said that, let's move on to the good stuff. This is a very well paced film. Director/co-writer Rob Savage is fully aware that his premise isn't sustainable in the long run, but he doesn't jump the gun either.\r\n\r\nClocking in at 56 minutes, the movie its short enough to avoid tedium, but also patient enough to take the time to establish its characters. Do we feel like we've known them forever? Of course not, but there are five main characters, and each emerges as a distinct individual with a clear-cut personality.\r\n\r\nAdditionally, Host has effective practical effects and genuine scares; the chair that moves with a person sitting on it reminded me of Poltergeist, and I also enjoyed the footsteps that appear on spilled flour on the floor, the bottle that takes off and crashes on a character's head, the moment when one of them throws a sheet into the air and instead of falling to the floor it hangs in the shape of a human body, and finally the last shot of the film, just before the computer runs out of battery (there is another incident that I prefer not to reveal, hoping it will have the same impact on future viewers as it did on me).\r\n\r\nGenerally this type of movie falls short in the character development and special effects departments. Host gives us human beings and surrounds them with phenomena that convincingly turn these humans into victims; without realistic effects we would never believe these people were truly in danger, but most of the credit goes to the performances. If the actresses weren't able to foster empathy I wouldn't care if they stayed where they were or took their laptops with them or not, but they are and I do.", "created_at": "2022-08-25T22:09:52.908Z"}]