[{"movie_id": 11036, "review_id": "64f5663497a4e6259a94e0e8", "rating": 7.0, "review_text": "A gently touching look at an elderly couple who must deal with present day mental illness told through a retrospective of their not uneventful lives. Rachel McAdams is \"Allie\", a young girl from a wealthy family who falls for \"Noah\" (Ryan Gosling) but her mother wants much better for her, so takes her away to their city home and keeps all of his (365) letters. He joins the Army and fights in WWII and, after time, she meets the handsome, wealthy James Marsden (\"Lon\") but before she marries, she returns to their old stomping ground and... To be fair, the young love/boy from the wrong side of the tracks story elements of the plot are a bit old hat. It's the delicate mechanics of the film that work best - James Garner (\"Duke\") is reading a story to dementia suffered \"Allie\" (Gena Rowlands) about the shenanigans of a young couple in the 1940s without us necessarily realising how poignant and apposite his story is. Gradually we become more invested in their lives and as the story starts to knit together, we start to appreciate just how hard it can be for a couple where one has this most cruel of illnesses. Good performances all around, and from Joan Allen as her interfering mother make this an engaging drama with a sharp end!", "created_at": "2023-09-04T05:08:04.992Z"}, {"movie_id": 11036, "review_id": "659f465979b3d4012a6a43db", "rating": 8.0, "review_text": "Touching!\r\n\r\nDespite evidently not watching this until today, I've always heard about the sad tag that many associate with <em>'The Notebook'</em> - and I can see why. Given I didn't know anything other than that, I was not anticipating how the film portrays its story - which is effective and rather heartbreaking. I'm not one to get properly emotional to movies, though hit the feels this one does still certainly do.\r\n\r\nThe film features impressive performances from Ryan Gosling and Rachel McAdams, as well as James Garner and Gena Rowlands. In smaller roles, Joan Allen and James Marsden are relatively solid too. If I had to nitpick, which it would very much be, I would've shortened the run time ever so slightly; could've been wrapped up quicker, but no biggie.", "created_at": "2024-01-11T01:37:29.351Z"}]