[{"movie_id": 345911, "review_id": "57a3c0e2c3a36854c2001250", "rating": 8.0, "review_text": "My son Julian (13) and my lady Tammy, themselves two horror-film aficionados, and I went and saw this theatrically, and we were all quite pleased, though at least Julian and I tend to go for the classic stuff. Well worth checking out, if you're in for this sort of thing.", "created_at": "2016-08-04T22:25:38.529Z"}, {"movie_id": 345911, "review_id": "57b51da8c3a3686a47003002", "rating": null, "review_text": "Although a simplistic and familiar theme is explored involving sinister forces tormenting a child in distress, Swedish director David F. Sandberg brings something chillingly fresh to his horror/psychological offering **Lights Out**.  Sandberg, making his feature film debut, delivers an adequate amount of tension and trickery for all things considered ominous in the edginess of darkness. Lights Out is a reasonable chiller that demonstrates a decent measurement of depth without tripping over its cliched feet. The characterizations that go “bump in the night” in **Lights** are not as disposable as one is routinely used to experiencing in produced over-indulgent, generic boofests.\r\n\r\nThe construction of **Lights Out** feels atmospheric and sparse at times but the manufactured thrills somehow add the necessary alarm factor in a psychological thriller that boasts solid performances particularly by actress Maria Bello as the tortured soul at the center of the CGI creepiness. Sandberg’s adventurous direction and screenwriter Eric Heisserer’s spell-binding script works in part because Lights Out never extends itself beyond its lean and claustrophobic confines. The storytelling is taut and the scare tactics create worthy jolts without further monotony.  There are predictable jumpy cuts and the movie never fully deviates from the conventional suspenseful landscape that populates countless fright fables. Still, **Lights Out** manages to shine some shady brightness on this effectively drawn hair-raising spectacle.\r\n\r\nThe premise introduces the long-lasting notion of childhood fear and despair on the jeopardized shoulders of young insomniac Rebecca (Teresa Palmer) who has long since left the haunting homestead where the evil vibes of a dastardly spirit had tortured her relentlessly.  Rebecca is now concerned that the tawdry tradition of this shifty spook is now about to terrify her little 10-year old stepbrother Martin (Gabriel Bateman). In fact, Martin wants to split his hellish household and escape to Rebecca’s place for some guaranteed safety. After all, who can blame the poor kid for wanting to abandon his doomed domicile.\r\n\r\nEnter the problematic Sophie (Bello). As the nervous-wreck mother to both Rebecca and Martin, Sophie has had her share of disappointments, heartaches and breakdowns in the past and present. It was revealed that Sophie had spent some critical time in a mental institution many years ago which explains her current complicated issues with men/relationships not to mention the strained connection with her disillusioned children. More important, Sophie faces the dilemma of encountering an assortment of deceased figures that randomly pop up from time to time within her expansive, worrisome walls. But nothing is more arousing or concerning than Sophie’s run-ins with the devilish Diana (Alicia Vela-Bailey), her troubled off-the-wall pal and fellow asylum inmate from yesteryear.\r\n\r\nWhat is so jittery about Diana’s presence in the house is that she is so clingy and protective of her precious Sophie. The key to Diana’s horrifying existence is when the lights are turned off, Thus, it allows the deranged feminine entity to roam the house in a blanket of blackness while staking the beleaguered Sophie in the process.\r\n\r\n**Lights Out** (originally Sandberg’s short film competition entry years ago) acts as a symbolic mirror reflecting the echoes of mental illness and inherent self-destruction concerning the fragile psyche. The film percolates convincingly when Bello’s Sophie is scarred constantly by the harried ties that bind. Sandberg demonstrates a wounded woman on the edge of insanity. The suffering of inner conflict and outer self-doubt has consumed Sophie to the point where she has personalized her self-inflicted poison with baggage ranging from a couple of deceased husbands to the harsh reality that her children are weary of her toxic nuttiness. Bello displays the brokenness and confusion of her portrayal with applauded conviction. The sister-brother tandem of Palmer’s Rebecca and Bateman’s Martin is both comforting and intriguing as they are joined at the hip in their fright night delusions. Vela-Bailey’s Diana is deliciously shadowy as the intrusive Diana applying the statically gloom.\r\n\r\nThe nightmarish special effects are challenging and imaginative and cinematographer Marc Spicer’s experimental lighting gives **Lights Out** its gripping sheen. Overall, Sandberg’s menacing mechanism of a movie certainly forces the shaky hand of its skeptical audience to snuggle up to the nearest light switch.\r\n\r\n**Lights Out** (2016)\r\n\r\nRat-Pac Tune Entertainment\r\n\r\n1 hr, 21 mins.\r\n\r\nStarring: Maria Bello, Teresa Palmer, Gabriel Bateman, Billy Burke, Alicia Vela-Bailey, Alexander DiPersia\r\n\r\nDirected by: David F. Sandberg\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Horror/Psychological Thriller/Supernatural\r\n\r\nCritic’s rating: *** stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** (2016)", "created_at": "2016-08-18T02:30:00.585Z"}, {"movie_id": 345911, "review_id": "5834fe57c3a3682f2a00bdc1", "rating": 6.0, "review_text": "2016 continues to be a great year for horror, and _Lights Out_ is a decent example of that, with a whole lot of originality.\r\n\r\n_Final rating:★★★ - I personally recommend you give it a go._", "created_at": "2016-11-23T02:26:31.510Z"}, {"movie_id": 345911, "review_id": "6307cbc4dcb6a3007bb2ed56", "rating": 8.0, "review_text": "**Lights Out is one of the best horror movies of the past decade - a genius concept with an even more brilliant execution.**\r\n\r\nLights Out pulls off some of the most creative and impressive visual effects I have ever seen! The concept of a ghost/creature that can only attack through darkness leads to moments in the film that showcase these chilling and clever effects. The actors portray their characters in a way that keeps them from feeling like stereotypical horror tropes. Sandberg’s creativity and love of the story shine as he explores new innovative terrors and thrills throughout the film. It will make you want to leave the lights on while watching it! Great scares. Intriguing premise. Incredible effects. Lights Out demands to be seen by anyone that even flirts with the idea of being a horror fan.", "created_at": "2022-08-25T19:21:40.577Z"}, {"movie_id": 345911, "review_id": "630a5d6418864b0080e4871f", "rating": 8.0, "review_text": "**Lights Out is one of the best horror movies of the past decade - a genius concept with an even more brilliant execution.**\r\n\r\nLights Out pulls off some of the most creative and impressive visual effects I have ever seen! The concept of a ghost/creature that can only attack through darkness leads to moments in the film that showcase these chilling and clever effects. The actors portray their characters in a way that keeps them from feeling like stereotypical horror tropes. Sandberg’s creativity and love of the story shine as he explores new innovative terrors and thrills throughout the film. It will make you want to leave the lights on while watching it! Great scares. Intriguing premise. Incredible effects. Lights Out demands to be seen by anyone that even flirts with the idea of being a horror fan.", "created_at": "2022-08-27T18:07:32.585Z"}]