[{"movie_id": 57158, "review_id": "52f74083c3a36879e82227c5", "rating": 7.0, "review_text": "The second part amends the fiasco of the first one.\r\n\r\nSpectacular and, again, with several moments of the already classic \"platform-like\" fights on the run from these series of movies that could be enhanced if some sense would be given to them. Still, the staging of every location and, remarkably, Smaug, is worth seeing.", "created_at": "2014-02-09T08:46:59.069Z"}, {"movie_id": 57158, "review_id": "535223740e0a2655fe00287f", "rating": 7.0, "review_text": "7 out of 10 stars would normally be considered quite okay and I guess you could say that this movie is quite okay. However, it has a reputation to live up to. As a movie in the Tolkien universe and with LOTR and The Hobbit: An Unexpected Journey this movie have a lot to live up to and, as far as I am concerned, it does not.\r\n\r\nAs an action/adventure/fantasy movie it is a quite okay movie. It has a lot of action of course, a lot of adventure and a lot of special effects. Of course everything plays out with the Tolkien universe as a back-drop. I guess it is rather superfluous to mention that the movie is based on the book The Hobbit by Tolkien. However it is here the problems start.\r\n\r\nIn my review of The Hobbit: An Unexpected Journey the first thing that I mentioned was that you should be aware of the fact that the movie did not follow the book in any great detail and that this was quite okay since the extensions were well made. Well, it should be no surprise that the first part of this statement is valid for this movie as well. Unfortunately, whereas the first movie felt like a fluid extension of the book this one feels like it is just full of fillers.\r\n\r\nThere are a lot of cool scenes and a lot of action but it really feels like it was just put in there as fillers to showcase the special effects. Speaking of special effects, quite a few of them where rather unimpressive I have to say. The scenes where the dwarfs went down the rapids in barrels frequently looked plastic and artificial. The scenes with Smaug was not too bad even though he was quite overused but the parts around the forges was just plain ridiculous. I know it is fantasy but come one, getting them started and producing tons and tons of molten gold in a few minutes not to mention riding on molten metal without getting burned was just silly.\r\n\r\nOn the whole I found it an enjoyable movie but I was expecting more.", "created_at": "2014-04-19T07:19:16.175Z"}, {"movie_id": 57158, "review_id": "5a5d021c9251411191001013", "rating": 4.0, "review_text": "Jackson turned a great story into just another Prates of the Caribbean. Jumping, sliding, gags, etc. All the thinking parts are gone.", "created_at": "2018-01-15T19:33:48.335Z"}, {"movie_id": 57158, "review_id": "5c448710c3a3681a0c250674", "rating": 6.0, "review_text": "I'm happy to be back in this world, but _Empire_ this ain't.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "created_at": "2019-01-20T14:34:56.579Z"}, {"movie_id": 57158, "review_id": "6031cef0a6e2d20040083e3b", "rating": 8.0, "review_text": "Still very good, but I found <em>'The Hobbit: The Desolation of Smaug'</em> to be a step below the preceding 2012 release.\r\n\r\nThe conclusion is what affects it the most, in my opinion. It isn't anything bad, but it goes on for too long - yet the ending itself comes out of nowhere a little. It's iffily crafted, with the entertainment value not enough to cover it up. Again, nothing anywhere near terrible... just not as great as I wanted/expected.\r\n\r\nI also kinda wanted more scenes with Martin Freeman (Bilbo) across the midway point. I like the focus on Richard Armitage (Thorin) & Co. but I felt there needed to be more with the lead - and with Ian McKellen (Gandalf), for that matter.\r\n\r\nI've led with my negatives first, but I have many positives too. I enjoyed the scenes in Esgaroth with Luke Evans (Bard), all of the stuff there looks awesome. The character of Tauriel, played by Evangeline Lilly, is cool. Orlando Bloom (Legolas) remains fun to watch. Everything else, including the score, is very nicely done - as anticipated.\r\n\r\nLove the end credits song (\"I See Fire\") by Ed Sheeran, by the way. Not quite as grand and great as \"May It Be\" from LOTR, but it's pretty close!", "created_at": "2021-02-21T03:09:36.929Z"}, {"movie_id": 57158, "review_id": "64292669960cde012634d02c", "rating": 7.0, "review_text": "I'm afraid I still really struggled with the lightweight casting here, but once I'd convinced myself to get over that, I found this to be a far more characterful and entertaining adventure. With the dragon \"Smaug\" now safely in possession of the gold, it falls to \"Thorin\" (Richard Armitage) and his band of dwarves to make their way - via the misty mountains and the realm of the elves - to the human settlement of \"Laketown\" where the nimble-fingered \"Bilbo\" (Martin Freeman) must find and use a secret way into the lair so he can try to repossess the \"Arkenstone\". Meantime, the mischievous \"Gandalf\" (Sir Ian McKellen) is off having escapades of his own in the South? Will they rendezvous in time to thwart the increasingly narked fire-breather. What is clear here is that some of the philosophising from the book is very much on the back burner. This is an out-and-out action movie with loads of combat scenes, some very clever visual effects that almost rendered me a bit sea-sick at times - all built around a solid story of companionship and determination. Characters are playing to their strengths and weaknesses; relationships are being forged and challenged; courage is being found - and lost and it's all enjoyable and engaging to watch on the big screen. Maybe I could have been doing without the romantic interludes (yuk!) but for the most part this is a great looking and visionary interpretation that just happens to have a cast that really should have been so much better. A good, not a great, watch that tees us up nicely for the finale.", "created_at": "2023-04-02T06:53:29.417Z"}]