[{"movie_id": 39781, "review_id": "62d0f4c77e34830056661582", "rating": 5.0, "review_text": "**A “gay friendly” film that manages to be minimally neutral to also please those who are out of political and ideological struggles.**\r\n\r\nThe troubled causes have never been so popular as they are today: from abortion to euthanasia, from the historical question between colonizing and colonized countries to the return of looted artworks by European museums, passing through the causes of the Gay Movement, whose acronym grows every year, to embrace any new definition invented for each way of feeling and living sexuality, reflecting a need for affirmation that is felt more strongly than the convenience of presenting a certain union in the ranks. This “gay friendly” film fits perfectly into a growing list of cinema works dedicated to scrutinizing the dynamics of these new families. The advantage of this film is that it is not overly militant.\r\n\r\nThe script introduces us to two mature women, who live in a stable lesbian relationship and who decided to get pregnant, by artificial insemination (obviously the more traditional method was discarded for obvious reasons), the semen donor was the same and the children who were born are, therefore, half-siblings on the part of the father (whom they do not know). It is precisely the search for her biological father and the creation of a closer relationship with him that takes the plot forward, with the introduction of this friendly and uncomplicated man totally destabilizing the life of that house.\r\n\r\nI liked the movie in general. At the same time that it tries to deny that idea, much replicated, that two lesbians would instill their own sexual orientation in their children, the film seeks to create a question around the inviolability of the anonymity of the donors of seminal material… I cannot speak for everyone, but I would never donate semen if I suspected that, years later, someone might have knocked on my door and said he was my son. Anonymity is something that should be inviolable and sacred here, regardless of the will of those involved. It was the point in the script that bothered me the most, but there were a few more.\r\n\r\nFor me, the strongest point of the film ends up being the cast and its very good performance, strongly supported by a duo of veterans: Julianne Moore and Annette Bening. Both are amazing in their characters, and they establish an excellent working dynamic and good chemistry. Mia Wasilowska and Josh Hutcherson, both still quite young, are a nice and refreshing addition to the cast, both of whom seem to be really enjoying what they're doing. Besides, we all know them nowadays, because they are two young stars. Although it's not that interesting, I have to admit that I liked Mark Ruffalo's work. I think his character was poorly thought out, and poorly written, but the actor manages himself very well and knows how to get around the obstacles that appear.\r\n\r\nIt's not a technically remarkable film, it's notable that it didn't have a superb budget, and that it was a job done thanks, in part, to the extreme dedication of everyone involved. It doesn't have amazing cinematography and editing, but what it's done works well and is effective. The film has a pleasant, light pace, and a humorous and uncomplicated atmosphere.", "created_at": "2022-07-15T05:01:59.509Z"}]