[{"movie_id": 253450, "review_id": "57603cf3c3a36849cf00302a", "rating": 3.0, "review_text": "> The truth determines our actions.\r\n\r\nI found this film when it was listed in the BBC news' top 20 films of the 2015. This film topped the chart, then how can I just ignore which is my prime world news feed. The fun part was I saw a South Korean film called 'Assassination' believed to be this, but very I soon realised the mistake. Anyhow, I loved the Korean film that I reviewed a couple of moths ago on this same blog.\r\n\r\nFinally, I managed to see this Mandarin film, but it was not anything like I've been expecting. Critically acclaimed film, but commercially failed because of the slow narration. Jointly produced by China-Hong Kong-Taiwan, but selected as a Taiwanese entry to the Oscars that failed to make a progress to the main event.\r\n\r\nNot everybody can easily follow this narration. Because this is not a typical historical film presentation with a clear introduction like in the background voice or in the texts, except in the opening that letting us know where and how it begins. The lack of the character development is the factor for all the complication. So I strongly suggest to read the synopsis before the watch and have a look at the film character infographic once finished watching.\r\n\r\nThe story sets in the 8th century China during the final years of the Tang Dynasty. When a well trained assassin failed to accomplish the mission directed by her master, she is sent to another province for another assignment where she starts to remember her past that she has some connection with her undertaking. With all the bad things happening in and around the royal family, state politics et cetera, the rift is inevitable that anytime the dynasty might fall. The remaining the tale reveals how the film ends with a realistic approach.\r\n\r\n> \"The way of the sword is pitiless. Saintly virtues play no part in it. Your skills are matchless, but your mind is hostage to human sentiments.\"\r\n\r\nI am a film fanatic, so basically I love all the films I watch. But I prefer entertainment the most, followed by the message, education, inspiration, true events et cetera. I had seen many films like this that I mostly ended up unsatisfied. Because a film without the background score as same as silent lullaby. Speaking of music, when the film was in the final scene there came a music which I compare to oasis. That's the beautiful sound I have heard in this entire narration. Slow camera panning and fixed cameras for minutes is what I disliked in it or any similar themed films.\r\n\r\nI appreciate the effort to preserve the historical account in a film format, but the type of narration matters a lot if they expect the audiences backing. A film like this is specially made for film festivals, surely critics love it and as I heard they did. I can't believe even if the film critics failed to recognise what would be the film's fate.\r\n\r\nSo it is a slow film then, but when the stunt sequences appeared, I was thrilled with my full attention. Well composed realistic fights, that's what anybody remembers when they think of Chinese films. But I warn you this is not a complete martial art film except now and then you encounter such scenes. It is not even a horror, but there was a scene with smoke which scared the hell out of me. I was not expecting such thing, besides, I was bored to death when this thing came I woke up.\r\n\r\nThe film was shot in the beautiful outdoor places. Apart from the stunts, I loved the landscapes which were just resembled the classical Chinese paintings. I did not find any performances that impressive. I appreciate their effort, but since the story was told without anyone's particular perspective, felt like everyone had equal scope for their roles.\r\n\r\nOverall, I did not like the film and I'm not suggesting it to anybody. But if you are interested in the Chinese ancient history or love the art films then you could try it. This is first low rated film to review on this blog which is I've been avoiding since the beginning, but decided to write for all kinds of rating now onwards.\r\n\r\n3/10", "created_at": "2016-06-14T17:20:51.088Z"}]