[{"movie_id": 1562, "review_id": "54d554879251416ba10001e7", "rating": 4.0, "review_text": "Much worse than the original. It loses quite of the continuous tension. Many of the FX are bad quality. The script is really predictable and some scenes and conversations are too much of a cliche.", "created_at": "2015-02-06T23:55:51.570Z"}, {"movie_id": 1562, "review_id": "57912ec8c3a36835700018d6", "rating": 8.0, "review_text": "This was a very good sequel to a fine zombie work (my favourite zombie film is STILL Jean Rollin's remarkable and extremely aesthetically-pleasing 'The Grapes of Death'), and I was very pleasantly surprised. Pardon the pun, but you would think that by this time, everything in the land of zombie movies would have been done to death, but I remain consistently admiring of just where the best and most thought-out renditions of the template can go. In THIS case, the most intriguing dynamic is a cowardly husband choosing his life rather than helping his wife out of a horrible crisis, then infanticide (or worse) of his own children, rather than face their wrath over the poor decision he had made.\r\n\r\nIt's interestingly hilarious that when you think about it, humanity is doomed because a 12-year-old had to go back and get a picture of his mother, because he was afraid that without it, he would forget what she looked like...A surprisingly satisfying work, that for horror fans, is worth a purchase and rewatching. I'm admittedly more for classic films, from the 20's to 60's, but for contemporary horror cinema, I liked this a lot, especially Jeremy Renner and Imogen Poots. It's no surprise to me that they soon became superstars.", "created_at": "2016-07-21T20:21:28.546Z"}, {"movie_id": 1562, "review_id": "5d9dab494772150041039029", "rating": 8.0, "review_text": "We have an outbreak of the infection in medical center. All units; safeties off. \r\n \r\n28 Weeks Later is directed by Juan Carlos Fresnadillo who also co-writes with Rowan Joffe, Jesus Olmo and E. L. Lavigne. It stars Robert Carlyle, Rose Byrne, Jeremy Renner, Harold Perrineau, Catherine McCormack, Mackintosh Muggleton and Imogen Poots. Music is by John Murphy and cinematography by Enrique Chediak.\r\n\r\nSix months have passed since the Rage Virus decimated the UK, but now people are returning to London's District 1 with the U.S. Military overseeing the project. However, the Rage Virus can be carried in people with no outward symptoms.\r\n\r\nAfter the monster success of \"28 Days Later\" it was inevitable that a sequel would follow. With director/writer combo Danny Boyle and Alex Garland off making \"Sunshine\" with Cillian Murphy, the big players from the first film were missing (Boyle and Garland were Executive Producers here). There was reasonable cause for some concern that this would be the latest in a long line of horror sequels that, quite frankly, suck the big one. How great to find that not only is \"Weeks\" an excellent sequel, it also doesn't sit idle and copy Boyle's winning formula.\r\n\r\nThe blood and ick factor is considerably amped up, as is the action (there's running, lots of running, guns, lots of guns, panic, lots of panic), but the writers have put intelligence into the writing by expanding on the Rage Virus victims as not just being an outwardly ferocious beast, and some topical smarts are spliced into the narrative with the presence of the American military \"enforcing\" the reconstruction of London. Also, with the film's central focus being on a splintered family, brilliantly set up by the breathtaking/horrifying opening 10 minutes, there's a mighty heft of humanism flowing in between the blood vomit and body shredding.\r\n\r\nCast are mostly terrific, with Carlyle and the impressive young actors, Poots and Muggleton, leading the way. The American lads playing military men have to make do with slender written stock roles, but Byrne provides spunk and McCormack leaves an indelible mark in a small, but key, role. Fresnadillo (Intacto) ensures Boyle isn't missed in the director's chair, with a keen eye for action construction and an awareness of pacing for such a horror movie. While Murphy again scores with that knack for doom mongering beats. There's some missteps, logic at times goes out the window and in the case of Renner's character, outcome is a bit too much of a bitter pill to swallow. While dialogue at times shops at \"Clichés \"R\" Us\". But this is still a mighty fine thrill ride, often scary and stomach turning, and even flecked with emotional worth. On this evidence a part 3 would be most welcome. 8/10", "created_at": "2019-10-09T09:41:29.021Z"}, {"movie_id": 1562, "review_id": "5e06efa6eda4b700122b1c32", "rating": 7.0, "review_text": "The story is not quite up to snuff in comparison to _Days_, but the visual quality is **way** better. \r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "created_at": "2019-12-28T06:01:10.325Z"}, {"movie_id": 1562, "review_id": "640b2da741a5610113bd270c", "rating": 7.0, "review_text": "\"28 Weeks Later\" is a British horror movie directed by Juan Carlos Fresnadillo and starring Jeremy Renner and Rose Byrne. The film is a sequel to the critically acclaimed \"28 Days Later\" and takes place six months after the original film's events.\r\n\r\nThe film opens with a tense and heart-pounding sequence as a group of survivors try to escape the infected hordes of London. The scene sets the tone for the rest of the movie, which is filled with suspense and tension.\r\n\r\nThe plot centers around the repopulation of London, which is deemed safe after the outbreak of the Rage Virus six months earlier. The story follows the reunion of a family that was separated during the initial outbreak, and their struggle to survive when the virus returns.\r\n\r\nThe film's pacing is excellent, with a gradual buildup of tension that leads to several heart-stopping moments. The infected humans are just as terrifying and violent as in the first film, and the film's use of sound and lighting is once again top-notch.\r\n\r\nOne of the standout features of \"28 Weeks Later\" is the excellent acting by Jeremy Renner and Rose Byrne. Renner delivers a convincing performance as Don, a father struggling to protect his children and come to terms with his actions during the initial outbreak. Byrne also shines as Scarlett, a medical officer trying to find a cure for the virus.\r\n\r\nThe film's themes of family, loyalty, and sacrifice are powerful and thought-provoking. As the family struggles to survive, they are forced to confront the difficult choices that come with the end of the world.\r\n\r\nThe film's cinematography and visual effects are also impressive, with haunting and memorable shots of a deserted London and intense action sequences.\r\n\r\nOverall, \"28 Weeks Later\" is a solid horror movie that is not quite as groundbreaking as its predecessor but still delivers a thrilling and engaging experience. The film's excellent acting, pacing, and visuals make for an intense and unforgettable experience. I would rate \"28 Weeks Later\" an 7 out of 10.\r\n\r\n \r\n\r\nWritten and Reviewed by RSOliveira", "created_at": "2023-03-10T13:16:23.758Z"}]