[{"movie_id": 2100, "review_id": "62ca8d3c51e6ab0054632116", "rating": 6.0, "review_text": "Robert Redford is \"Irwin\", a disgraced general sent to a military prison after his court-martial for disobeying orders during an operation in Africa that led to the death of eight under his command. Almost immediately he and the commandant \"Winter\" (James Gandolfini) take against each other and what now ensues is a gradual positioning of both men for a contretemps. The former man, initially, just wants to do his time - but as he sees the arbitrary and sometimes lethal fashion in which the place is run, he is soon working with the 1200 other inmates to create an effective unit than can resist, perhaps even overthrow, the regime. The first half hour of this is quite well developed, battle lines are drawn as the two men play a game of intellectual chess. Sadly, though, that momentum descends quite quickly into a rather far-fetched drama that featuresd a plot riddled with holes, some totally implausible incidents and in the end, a denouement that has something of the pantomime to it. Redford adopts a less is more approach to his role which he carries off adequately with little dialogue - indeed, pretty much little of anything. Gandolfini is, however, completely unconvincing as a senior officer who appears to have little humanity or grasp on the reality of the scenarios presented to us by Rod Lurie. Clifton Collins Jr offers the best effort from amongst the cast with his portrayal of the troubled \"Aguilar\", but I couldn't quite make out just what the role of the duplicitous \"Yates\" (Mark Ruffalo) was meant to represent - maybe I had just given up by then. I reckon this might have made for a decent read; allowing us to inject character traits into what personalities are on offer here using our own imagination. As a piece of cinema, however, it is little more than a vehicle for a star who is nowhere near his best working with a story that stretched my imagination just a bit too far for far too long.", "created_at": "2022-07-10T08:26:36.582Z"}]