[{"movie_id": 11324, "review_id": "57cc5a02c3a368309000197e", "rating": null, "review_text": "Nice movie", "created_at": "2016-09-04T17:29:38.650Z"}, {"movie_id": 11324, "review_id": "589c58f7925141254b00491b", "rating": null, "review_text": "This was a random thing. We didn't even know the schedule and I was just wearing a random shirt and shorts. I just wanted to drink mango shake but then we randomly decided to go to eastwood and check the schedule. We were supposed to watch Diary of a Wimpy Kid but since Shutter Island's showing, then Shutter Island it is. But then wearing my \"pambahay\" outfit didn't really help since I saw 2 people from AC. grrrrrr. When I dress up, I don't see anyone I know but when I'm not properly dressed and I look like a mess, suddenly all these people come up to me and say hi. Note to self: always dress up.\r\n\r\nI liked it. Watching Leonardo is not bad at all. I liked the twist of the story. Although you'll have some hints here and there, you'll think \"oh I'll wait and see what it really is\". And then the twist happens and you'll be like \"I knew that all along\". But that doesn't stop me from liking this movie. I'm so jealous of the girl playing his daughter. I mean first kiss...Leonardo Di Caprio???? Wow. I would take her place anytime. Michelle Williams...I'm not really a big fan of her. And after seeing this and being jealous also of her because of how she sat on the lap of Leo, I can say I don't like her at all. lol. Leonardo is awesome as always. It's amazing how good of an actor he is and he still hasn't won any Oscars. His time will come. I know he will win. And that flashback scene, he looked really good. Yum Yum Yum!\r\n\r\n\r\nI rate this movie as A. Love the story. Love the actor.", "created_at": "2017-02-09T11:56:39.820Z"}, {"movie_id": 11324, "review_id": "5e408c7241465c0014cbf027", "rating": 9.0, "review_text": "Mind-tripping psychological-thriller from Martin Scorsese, a bit of a change-up for him, with great performances all around of course including DiCaprio and Kingsley. This was my first viewing as I had procrastinated watching this for whatever reason, but found it highly entertaining with amazing, foreboding atmosphere. **4.5/5**", "created_at": "2020-02-09T22:49:22.629Z"}, {"movie_id": 11324, "review_id": "5e76682eb1f68d0019e470ed", "rating": 7.0, "review_text": "Don't you get it? You're a rat in a maze.\r\n\r\nUS Marshal Teddy Daniels (Leonardo DiCaprio) travels to an island asylum facility for the criminally insane with his newly assigned partner Chuck Aule (Mark Ruffalo). Their reason for being at Ashecliff Hospital is to investigate the mysterious disappearance of murderess Rachel Solando. But Teddy has another issue to deal with at Ashecliff, namely a meeting with Andrew Laeddis (Elias Koteas), the man he believes responsible for the death of his wife (Michelle Williams). Nothing is what it seems at the facility though, and the further Teddy & Chuck investigate, the murkier the truths of Ashecliff become.\r\n\r\nDirected by Martin Scorsese, Shutter Island is adapted from the best selling novel of the same name written by Dennis Lehane (\"Mystic River/Gone Baby Gone\"). It finds the talented director getting closer to horror than at any point in his career, it also finds him arguably over cooking his grits. Lehane's novel is a page turning lesson in thriller writing, there's no need for deep cranial thinking or fill in the blanks like musings. Scorsese has crafted a movie that, whilst both stylish and moody, is far more intricate than it needed to be. \r\n\r\nFrom the off we saw reams of amateur reviewers dissecting the film and searching for other worldly cinematic meanings. The truth is, is that they don't exist, it is just a great story pinging with psychological twisters. Lehane himself said he felt it was a book he kind of knocked out while in his flow (he undersells himself mind). Scorsese, clearly loving the source to be sure, has crammed too much in for the film to be an across the board winner. Technically accomplished? Without doubt. Depth to the story? You bet. But the reality is that the depth isn't enough to sustain all the genre blending atmospherics that is Marty's want. One is inclined to feel that he so aware that he is treading on well worn genre ground (spot the homages to film noir, old time horror and Hitchcockian grandeur), that he's trying to steer the viewers away from the obviousness on offer. The film is further let down by the second half, where it positively crawls along, something not helped by the fact that the first hour bristles with moody excitement and a promise of clinically executed terror. Anticipation can be a real killer at times...\r\n\r\nYet as is normally the way with a professionally assembled Scorsese picture, there's still so much to enjoy and moments that ensure it will always be a divisive film in the New Yorker's cannon. The cast are mostly great, DiCaprio delivers a stunning performance, one that can only be appreciated once the story has reached the climax. Ruffalo (restrained), Ben Kingsley (shifty) & Max Von Sydow (troubling) all do what is needed and in keeping with the tone of the piece. While the girls - Emily Mortimer, Patricia Clarkson & Williams - have small but crucial parts to play. \r\n\r\nThen there's the supporting characters played by some quality character actors. Koteas is joined by Jackie Earle Haley, Ted Levein & John Carroll Lynch. How many of you noticed that we here have a roll call of cinematic serial killers? Edgar Reese, Freddy Krueger, Buffalo Bill and Arthur Lee Allen! (OK, Allen was not proved but \"Zodiac\" the movie lends us to believe it was him). The music used is suitably heart pounding and Robert Richardson's photography is on the money, especially within the dimly lit Ashecliff walls (the foreboding Medfield State Hospital for location filming). The costumes also have a nice 50s look to them, our first encounter of Teddy & Chuck sees them splendidly adorned in film noir hats and coats. While Thelma Schoonmaker's editing is up to the usual tight standard.\r\n\r\nIt's always tricky when great directors are involved, so unsurprisingly we witnessed at the start a difference of opinion with the critics as to how good Shutter Island is? What most agreed on was that the film fluctuates in quality and should have been, given the talent behind and in front of the camera, a much better picture. There's also no getting away from the fact that if you have read the book first the impact of the ending is considerably weakened. Personally I feel Scorsese was the wrong director for this particular source, but that's me, and be that as it may, he still manages to come out of it in credit with his fans - though even if he just passed gas some of them would proclaim it as a masterpiece... 7.5/10", "created_at": "2020-03-21T19:17:02.826Z"}, {"movie_id": 11324, "review_id": "5f7ca6b90e597b0035b1852a", "rating": 9.0, "review_text": "A US federal Marshal is sent on to investigate a missing patient on an isolated asylum called The Shutter Island. What he’s about to uncover will question him and his true identity. Quite exclusive and one of those storyline where you can’t lose your concentration for even a minute. Paradox plot, loved it through and through. This is pretty unusual but loved the soundtracks in the background helping in the foundation of suspense. Definitely another Scorsese masterpiece. A must watch.\r\n\r\nFollow us on Instagram: @flixxflyy", "created_at": "2020-10-06T17:17:45.413Z"}, {"movie_id": 11324, "review_id": "60f8ad933103250046ce7ca5", "rating": 7.0, "review_text": "Good suspense and mystery, although a bit too reliant on hallucinations, and the ending could have been better.", "created_at": "2021-07-21T23:28:19.332Z"}, {"movie_id": 11324, "review_id": "621a8f95afa1b0001e2a0003", "rating": 8.0, "review_text": "Accompanied by a great cast and atmosphere, ‘Shutter Island’ certainly has a thrilling and engaging mystery to unfold, with an ending that is as tranquil as bittersweet.\r\n\r\n8/10", "created_at": "2022-02-26T20:37:41.773Z"}]