[{"movie_id": 807172, "review_id": "6529bd8b81383100fe3e7d89", "rating": 1.0, "review_text": "Well, they made The Exorcist woke... and oddly Anti-Catholic... and it flopped.\r\n\r\nSeriously, The Pope's Exorcist was better and EVERYONE knew that was going to flop.  I'm going to tell you right now that you should go back and watch the prequel movies because they were better... BOTH of them.\r\n\r\nYou have two little girls, a strong anti-Catholic message, a strong anti-patriarchy message, you know... the usual Hollywood meh messaging (except the Anti-Catholic part, that is a dead horse that hasn't been beaten nearly as much) and, most importantly, the same sequel/reboot/franchise killer that seems to go out of it's way to insult all the fans of the original film...\r\n\r\n... and everyone that helped make it.  Which, honestly, is also a dead horse that's been beaten too much these days.  In fact, insulting the original is sort of a trope these days.\r\n\r\nPeople that actually like Terminator: Dark Fate are going to rave about this one... but everyone else is going to roll their eyes because at the end of the day, it has the exact same boring message as everything else.\r\n\r\nAnd like everything else with that message, everything else from bookend to bookend takes a backseat to it.  Bad dialogue peppered with political lectures.  Bad acting (but let's be honest, they had nothing to work with) and in the end even the demon lacked the sardonic and vulgar wit of the first one.\r\n\r\nBut, hey, if you liked Dark Fate and thought The Rise of Skywalker was better than Empire, this movie is for you.\r\n\r\nBut everyone else has seen it before and is tired of it.", "created_at": "2023-10-13T21:58:35.613Z"}, {"movie_id": 807172, "review_id": "65310b7daede5900ac0143c7", "rating": 5.0, "review_text": "\"Angela\" (Lidya Jewett) and her school mate \"Katherine\" (Olivia O'Neill) go for a walk in the woods one day. They don't come home - and panic amongst the parents ensues. Luckily, the girls turn up in a cow-barn a few miles away but have no recollection of just what they had been doing for the three days they had been missing. Anyway, dad \"Victor\" (Leslie Odom Jr.) soon starts to notice some odd behaviour from his previously reasonable daughter and before we know it, she - and her friend - are showing worrying signs of a possession that resonates all too readily with events some fifty years earlier and that finds him seeking the help of \"Chris MacNeil\" (Ellen Burstyn) before the girls are Satanic toast. It's ten minutes shy of two hours long this, and that's about ninety minutes too long. The vast majority of this film is taken up by pointless preamble, family establishment scenarios and unfortunately the acting and writing are really lacklustre too. Burstyn only makes sparing appearances and Odom Jr. ought to just stick to singing. The last ten minutes is slightly better than standard Blumhouse fayre that concludes this completely unnecessary sequel with, admittedly, a couple of not so predicable twists, but still - with very little to make the preceding drudge worth watching. This is a poor relation to the original and should have gone straight to a streamer.", "created_at": "2023-10-19T10:57:01.304Z"}]