[{"movie_id": 325346, "review_id": "587a82f8c3a36847e8006a65", "rating": 8.0, "review_text": "**When the family needs you the most...**\r\n\r\nI'm not saying this is the best film of the year, because there are plenty of better films than this, but in some way this film wins our heart. First of all I did not know John Krasinski directs films. In fact, this is his second feature film, the only one I have seen and I loved it. The main reason to I enjoy it was, it is sentimental. Not just some foolish melodrama, but an uplifting film filled with lots of fun.\r\n\r\nThe cast was at its best. I liked everyone and their unique display. At some point it feels like a realistic drama, but those comedies make us realise that it's only a film. Margo Martindale was really awesome. I have never seen her in such a wonderful role. Most importantly in an important role like this one. If I remember this film in the future, that's only for her. The only negative about the film was the twist. It was like they aimed for it to bring change in pace and atmosphere, when the situation in the story was not in its favour. Even though I did not care it, and thoroughly enjoyed it.\r\n\r\nThis is the story of the Hollar family who reunite when they needed for each other. When John comes to know his mother got ill, he immediately flies back home. His brother is already there and the father is financially struggling. With many struggles, they all prepare for the medical procedure. In the meantime, there are some outside adventures. Like meeting their old friends, places, ex-wife et cetera. The remaining of the film is to reveal how it all goes and where they will stand.\r\n\r\nThe target audience is mainly the families. If you like a tearjerker, you would enjoy watching it as well. So in my opinion, this film is under-rated and under-noticed. Mainly because of the cast is not so popular and so the lack of promotion. Even the film poster is not that impressive. Kind of looks like a B movie and of course it is, but an awesome B movie. Worth a watch for many reasons and you will know it when you give it a try. So, recommended.\r\n\r\n_8/10_", "created_at": "2017-01-14T19:58:48.468Z"}]