[{"movie_id": 168259, "review_id": "553ba24592514138a90067c6", "rating": null, "review_text": "Revenge is so so cold...... action packed, thrilling and suspense filled but still some bits of make believe tricks here and there. \r\nHow did Hobbs know that there's a need for the drone to be brought down right after leaving the hospital bed? how did he know where the drone was at the moment when he left with the ambulance? How did Deckard Shaw know both that Toretto and his crew will be both on the route of Afghanistan and also when they were at Abu Dhabi? \r\nIts a little bit odd and out of place for the director and script editor.... \r\nAs for the next upcoming part in the franchise, i think Mark Wahlberg should be considered for a part in the rest of Fast and furious franchise..... Cheers ! ! !", "created_at": "2015-04-25T14:18:45.571Z"}, {"movie_id": 168259, "review_id": "55d987a692514143f30041fb", "rating": 9.0, "review_text": "This is one of those movies where the French decided on an English name but for some inexplicable reason the original English name was not good enough for them. So in France it is called Fast & Furious 7 but I believe it is called Furious Seven in the US. Typical French way of doing things I am afraid.\r\n\r\nThis movie is probably not for everyone. It is very typical for the latest Fast & Furious movies though. The movie can be summed up by explosions, fast cars, fighting, did I mention explosions, repeat until credits roll. For me it was just what I expected and just what I wanted from this particular movie as well. If you are into fast cars, lots of action and explosive special effects and a bit of male macho talk then this movie will please you just fine.\r\n\r\nThe gang is back. I have to confess that I like both Vin Diesel and Dwayne Johnson even though they are rather far from Shakespeare material as far as acting goes. For this kind of movie they are perfect though. Unfortunately Dwayne Johnson was absent for a good chunk of the movie. When he came back from his brief presence in the beginning of the movie he did so with a vengeance though. I was actually expecting to dislike “Mr Nobody” but I have to say that I quite liked him.\r\n\r\nDespite the fact that this is a macho action movie there is at least a small kernel of story in there. It is a classical revenge story but it is embellished with enough material to make it fairly decent. Well, decent within the confines of this kind of movie of course. Seen from a reasonable point of view the entire movie is of course totally ludicrous. The stunts are really cool but if you sober up from the adrenaline feast you rather quickly find a lot of the stunts pretty far out. Like jumping between buildings in fancy cars and such like. Even if we skip the most ridiculous scenes there are plenty more to nit-pick about. Like the fact that those old, but cool, American cars that Torretto drives would not have a chance in hell against his more modern adversaries unless possibly if the road was entirely straight. But then, these ridiculous things are what the fast and furious series is all about is it not?\r\n\r\nWell, after about two hours of ludicrous, but very entertaining, actions stunts there is a happy ending and when the credits roll this viewer is definitely a happy customer.", "created_at": "2015-08-23T08:43:18.814Z"}]