[{"movie_id": 1250, "review_id": "57f1fc41c3a3680d1200433f", "rating": null, "review_text": "Can be considered one of the best Nicholas Cage movies ever, Ghost Rider Tells us the Story of a Motorbike Stunt Racer Johnny Blaze who sold his soul to the devil to heal his father from Cancer but alas the devil cheats him by giving his father a bad Death. Johnny after many years is provoked by devil again to kill Blackheart, Devil's own son and turns him into Ghost Rider. And the story goes on from punishing evil souls till the punishing of the Biggest Evil itself. The movie turned out to be a Decent Hit even though it did not perform well at the box office but still the way the character was portrayed and the way the graphics turned out jaw dropping is something we cant miss.\r\nWell to be True Ghost Rider is one of the most coolest Marvel Character ever portrayed by one of the Biggest Hollywood Star.", "created_at": "2016-10-03T06:35:45.483Z"}, {"movie_id": 1250, "review_id": "5c8427e80e0a264303637a49", "rating": 4.0, "review_text": "The problem is Ghost Rider isn't bad enough to be up there with the Nicolas Cage \"classics\", and it's not good enough to be seen as a fun time at the movies. It kind of just exists in this rather bland netherrealm where mildly entertaining meets instantly forgettable. Eva Mendes is terrible and Sam Elliot is great, so the acting in this movie is all over the place.\r\n\r\nSure, I love any scene where Nicolas Cage starts freaking out as he changes into the Rider. Or the scene where he tries to scare him self by going \"booga booga\" in front of the mirror. It's especially great when the half rendered fire skull shows up (seriously, how did the studio approve this effect?). But they're few and far between. Better just watch the You Tube clips then.", "created_at": "2019-03-09T20:54:00.699Z"}, {"movie_id": 1250, "review_id": "611ea09c719aeb005be77320", "rating": 7.0, "review_text": "_**\"You can't live in fear\"**_\r\n\r\nJohnny Blaze and his father make a living as Evel Knieval-like stunt riders in a carnival. When dad is diagnosed with cancer Johnny is misled into making a foolish deal with the devil, which results in his being cursed to become the Ghost Rider – a supernatural flaming skeleton.\r\n\r\nMark Steven Johnson's \"Ghost Rider\" (2007) combines Faust and Spider-Man and mixes in elements of all the variations of the Ghost Rider comics up to the present, including the 50's Western hero, but its main inspiration is the 70s-80s comic featuring Johnny Blaze as the protagonist.\r\n\r\nWhat makes Ghost Rider appealing? Well, the only thing cooler than a guy in black leather and chains driving a Harley is a flaming skeleton in black leather and chains driving a supernatural flaming Harley. That pretty much explains it.\r\n\r\nSome criticize Nicholas Cage as Johnny Blaze because Blaze is supposed to be about 30 years old, while Cage was around 41. I suppose someone like James Franco would have been better for the role, especially since Franco looks exactly like Mike Ploog's version of Blaze, but Cage does a fine job. Besides, Cage is in great shape and I know guys 25 years old who look older than him. As for Eva Mendes, who plays Johnny's girlfriend, she's ten years younger than Cage and is both voluptuous and adequate in the role.\r\n\r\nSome criticize the film as too serious, others as too goofy, but the fact is that \"Ghost Rider\" has the same general tone as all the other superhero flicks released since 2000. It's a serious story for the most part, although completely unbelievable due to the subject matter, with bits of humor thrown in for good measure. In other words, it's neither deathly serious nor a campy goof-fest; it rides the line between these two extremes.\r\n\r\nIf all you want out of \"Ghost Rider\" is an entertaining supernatural superhero flick \"Ghost Rider\" delivers and is worth viewing for this purpose. But the film delivers on a deeper level. Here is a smattering of noteworthy elements: \r\n\r\nNote that Johnny is misled into \"selling his soul\" to the devil and has to face the negative consequences of his decision. Few people will literally \"sell their soul\" to Satan but we can all relate to the struggle with the evil that exists within our own hearts. If we decide to live according to the inclinations of our lower, destructive, selfish nature are we not, in a sense, \"selling our soul\" to the devil; that is, giving over our lives to evil? (regardless of whether you view the devil as a literal spiritual being or merely as a symbol of potential human evil). Whenever we choose to live according to this lower nature will we not automatically perform evil and, in that sense, fulfill the devil's will?\r\n\r\nPeter Fonda as Satan is perfect and entertaining, as is Sam Elliott as the old Westerner.\r\n\r\nLove is an important theme in the story. Johnny \"sells his soul\" for love of his father. He didn't do it for greed or some other carnal purpose. This is agape love, self-sacrificial love, love in its highest and purest form, which puts Johnny on God's side (as Elliott's character observes) and makes him a serious threat to the devil's purposes on earth.\r\n\r\nWe also witness Blaze's great love for Roxanne and vice versa, as well as Mack's love for Johnny, etc.\r\n\r\nThis is contrasted by the total absence of love in Satan's kingdom. The devil hates his son and vice versa. This is a fitting depiction because God is described as love in the Bible; and since Satan has chosen to separate from God and be an enemy, he has naturally separated himself from love and become love's enemy. Hate in all its ugly manifestations is therefore the essence of the devil's kingdom and relationships.\r\n\r\nWhen Blaze first turns into the Ghost Rider and goes for a ride in his flame cycle he causes great havoc wherever he goes. You'll note that this is toned down in his later excursions as Ghost Rider. The explanation? Johnny simply didn't know how to control the supernatural hellfire and \"spirit of vengeance\" during his initial conversion.\r\n\r\nAlthough it's supposed to be amusing, it makes sense that Johnny would listen to The Carpenters in his down time. Blaze's daredevil lifestyle and his problems with the Ghost Rider curse would understandably cause him a great deal of stress. Listening to Karen's ultra-soothing voice would be a great pacifier.\r\n\r\nThere's a great scene of Ghost Rider riding off the top of a skyscraper, whipping his chain in exulting fury, and then riding full blast down the building smashing into the pavement below as police and onlookers observe in total disbelief.\r\n\r\nIn the comics Blackheart was the only comic character that ever sent chills down my spine (in Ann Nocenti's Daredevil). I didn't get this feeling from Wes Bentley's portrayal in the film, although there's a hint of that. Regardless, Bentley does a fine job in the role. And Blackheart's ugly wickedness is certainly revealed or demonstrated here and there.\r\n\r\nThere's a great musical interlude featuring the Ghost Rider and the Caretaker (Elliott) riding through the night desert for hundreds of miles to San Vengaza. Fittingly, the song is a modern hard rock version of \"Ghost Riders in the Sky.\" (I love that song! Who doesn't?) \r\n\r\nThe Ghost Rider himself (itself?) is a triumph of special effects. Needless to say, the film is enjoyable just to look at.\r\n\r\nThe film runs 1 hour, 50 minutes, with the Extended Cut running 13 minutes longer. It was shot in Melbourne, Australia, and other areas of Victoria. \r\n\r\nGRADE: B+", "created_at": "2021-08-19T18:19:08.747Z"}, {"movie_id": 1250, "review_id": "63348121ea89f5008e76eab6", "rating": 6.0, "review_text": "**It entertains very well, but that's all it is, and may be forgotten in a few years.**\r\n\r\nIf it weren't for this movie, I wouldn't know the Ghost Rider character, who is perhaps one of the darkest and most little-known characters in the Marvel universe. I'm not a comic expert, I just know some characters (the most famous ones) and I've seen some movies. So I'm going to ignore the source material and focus on what this film brings us, assuming I'm not the best person to say if this is a good adaptation or not.\r\n\r\nThe script has some notes of interest, especially for those who appreciate a more adult and denser universe: Johnny Blaze was a young acrobat who performed impressive circus acts with motorcycles, along with his father. However, upon learning that his father is about to die of cancer, Blaze decides to accept a pact with the Devil in hopes of saving him, which he is unable to do. Forever bound by the pact made, he becomes a monster that seeks out and punishes violent and cruel men... until the day he has to recover a contract of hundreds of souls that would doom an entire village, which would give whoever had it enormous evil power.\r\n\r\nIf we consider the film as a piece of entertainment, I think we'll leave reasonably satisfied. The film is not an example of art, and I don't think anyone involved will miss it very much, except perhaps Nicolas Cage, for whom the film was a good financial bet, despite not being particularly successful with the critics, and have been heavily criticized by the public. Directed and written by Mark Steven Johnson, it's a film with less action than many would expect, although I didn't have any problem with that. I found it more difficult to deal with the uneven pacing of the film, which wastes time in certain scenes in a way that is difficult to justify.\r\n\r\nDespite being undoubtedly popular and charismatic, Nicolas Cage is not at his best here and gives us an interpretation that is, to say the least, unsatisfactory. However, Cage has revealed over time that he is not a steady, balanced actor either. He's very good, he's capable of doing great work, but he can also be disappointing. Peter Fonda is quite good here, but his participation is relatively paltry, appearing only in a few scenes. I have doubts about Eva Mendes' talent for acting, I still haven't seen her play a character that doesn't depend on her sex appeal, and what I saw here didn't convince me. However, what she did is enough for the character, who is just a hot girlfriend. Sam Elliot does well and gives his character an old-time \"rough tough\" scent, which I liked.\r\n\r\nThe film consistently and intelligently bets on strong and impactful special effects and quality CGI. Obviously, not everything works well and those fire effects, on the character's face and motorcycle, are so obviously fake that they don't convince anyone, even though the result is aesthetically beautiful and matches the character and the environment. After all, burning skulls are still a classic of tattoos and prints for biker jackets. The film makes good use of the chosen filming locations, it has good sets, good costumes, a dark environment that is not overly dense and does not frighten. Anyone who considers this film a horror should avoid films like “The Exorcist” and others, so as not to end up dying of a heart attack, because this film, as it stands, does not scare a fifteen-year-old teenager.", "created_at": "2022-09-28T17:15:13.502Z"}, {"movie_id": 1250, "review_id": "63c20bfe17b5ef008a41f8e4", "rating": 1.0, "review_text": "Here is the deal. Johnny Blaze was possessed by an evil and dangerous entity called Zarathos who was a fundamentally evil being. What good he did was due to the constant inner struggle with Johnny Blaze, who was a very good man.\r\n\r\nDan Ketch was a kid from Brooklyn what was possessed by the Spirit of Vengeance, who was fundamentally a good spirit. And though they both struggled for control, the entity and its host trusted one another and worked together.\r\n\r\nWhat this movie does is tries to mesh Blaze and Ketch and the spirits that possess them together...and it doesn't work.\r\n\r\nThe amalgamation robs the story of the intense inner turmoil and the fight between Blaze and the evil entity possessing him...that was a very good, very fun, very intense story that this film NEVER tells.\r\n\r\nAnd Dan Ketch, the story wasn't as interesting, but it was still good focused more on the community, the town, the family life and the stress that the entity caused in the hosts personal life...it was still a very good story, it was still very fun, and it was, again, NEVER told here.\r\n\r\nBy trying to push the two of them together--including the supporting cast--the movie loses the stories from BOTH of them. What you get instead is. vapidity, and all the CGI in the world can't save a movie with no story.\r\n\r\nThere was no direction. There was no grand scheme. There were no real characters. It tried to be two different things at the exact same time and, because of that, didn't tell a story.\r\n\r\nIt ended up being special effects without a story and nothing more.\r\n\r\nHad it chosen a direction, either direction, even an entirely new direction, the movie could have told a story. Unfortunately for everyone involved it didn't.", "created_at": "2023-01-14T01:57:18.817Z"}, {"movie_id": 1250, "review_id": "64b5f3b678570e00ad4cd02b", "rating": 7.0, "review_text": "Really good movie. He looks pretty cool when he turns into the ghost rider. Great cast and funny too.", "created_at": "2023-07-18T02:06:46.149Z"}]