[{"movie_id": 2034, "review_id": "5ae194eb92514124c700a065", "rating": 9.0, "review_text": "This Film has to be one of the most intense shows I’ve seen . Ethan Hawke and Denzel are a great match together. Ethan plays the supporting role majestically.\r\n\r\nGreat cameos in the show too. With Snoop Dog. Macy Gray, Tom Berrenger .\r\nBut the show is highly tense. But good entertainment.\r\n\r\n“Are You a Wolf Or A Sheep?”", "created_at": "2018-04-26T08:59:23.163Z"}, {"movie_id": 2034, "review_id": "5f11e76822e4800037680672", "rating": 8.0, "review_text": "_**Great urban thriller**_\r\n\r\nEthan Hawke plays Hoyt, a rookie cop on his first 24-hour training day with the L.A.P.D. narcotics division. Denzel Washington plays veteran Alonzo Harris whose methods seem questionable, to say the least. Harris argues that one has to become a wolf to take down a wolf. Will Hoyt make it through the day alive, let alone uncorrupted?\r\n\r\n\"Training Day\" had a lukewarm reception at the box office the first weekend of its release in 2001, but the profits steadily increased for the next six weeks as word-of-mouth spread. The greatness of \"Training Day\" is not simply due to the intriguing story and excellent writing, but also the superb casting. Hawke is perfect as the naive, but ambitious rookie and Washington is nothing short of stunning as Alonzo Harris, ranking with the best performances in cinematic history, like Jon Voight's Manny in \"Runaway Train\" or Robert Duvall's Col. Kilgore in \"Apocalypse Now.\"\r\n\r\nAs the training day continues Alonzo's methodology becomes increasingly dubious and you can just imagine Hoyt responding, \"I... don't... see... any... method... at... all... Sir.\" How can anyone withstand the temptations he faces and not give in (and I don't mean the drugs)? Needless to say, the film scores high marks on the moral conundrum front.\r\n\r\nThere's one obviously contrived element but that's par for the course with movies and it could've been worse. Of course, the action and thrills are amped-up, but the tone is thankfully realistic.\r\n\r\nBOTTOM LINE: \"Training Day\" is an excellent urban thriller with a captivating performance by Washington. It's fittingly ugly, raw and brutal, so stay away if you don't think you can stomach it.\r\n\r\nThe film runs 2 hours, 2 minutes, and was shot in L.A. Peripheral actors include Scott Glenn, Tom Berenger, Eva Mendes, Charlotte Ayanna, Snoop Dogg and Dr. Dre.\r\n\r\nGRADE: A-", "created_at": "2020-07-17T18:01:12.859Z"}, {"movie_id": 2034, "review_id": "5f52df0d156cc700396ddad2", "rating": 8.0, "review_text": "Denzel Washington is sensational in this, the plot might not quite match his performance but <em>'Training Day'</em> is still a great watch. It's a riveting 122 minutes, I'm just not in love with how the premise is played out.\r\n\r\nWashington's character, Alonzo, never really changes throughout, despite a supposed problem of his. I kept waiting for a reason to change the opinion that the first act puts to you regarding him but it never came, there's never a point I cared for him and I assume I was supposed to... at least to some degree? Also, his issue is thrown at you in one scene and isn't really mentioned again until the end. I get the character, just not his arc.\r\n\r\nEthan Hawke is very good, too, in this, even if I kept hearing Tom Cruise when he spoke... You also have a load of now familiar faces involved, including Eva Mendes, Raymond Cruz, Cliff Curtis, Dr. Dre, Snoop Dogg and Terry Crews. Quite an interesting cast list, that.\r\n\r\nLoved all of this, except the (still good) plot execution. Maybe that's just me though. From what I've seen, Washington's best performance so far. He's the main takeaway from this whatever way you look at it.", "created_at": "2020-09-05T00:42:53.045Z"}, {"movie_id": 2034, "review_id": "63c9ae69a097dc00bbcc1a33", "rating": 10.0, "review_text": "This movie is meh at best.  The plot is so-so.  This isn't anything to write home about.  You could make it into a B-Movie and no one would care.\r\n\r\nNo one likes Training Day for Training Day... they all just love Denzel Washington's performance in Training Day, and that is just an honest fact.  \r\n\r\nThe movie wouldn't be anything if he didn't deliver and what he delivered was so sensational that people are going to be talking about it decades after we pass.  And that is what people like.  They like how deliciously evil Denzel was in the role.  They like that he had free reign, as a villain, to make the role as memorable as possible.  And he did, he knocked it out of the park.\r\n\r\nSo now, people watch Training Day, but let's be honest, they are only watching it for Denzel Washington, and that is as it should be, he was stellar in this, he deserves the recognition, and it's one of those movies that is otherwise so meh that his performance just shines out as the only thing really great about it.\r\n\r\nEven this rating, 10 out of 10 stars?  It's not because the movie was good, it's 100% based on Denzel Washington.", "created_at": "2023-01-19T20:56:09.456Z"}, {"movie_id": 2034, "review_id": "6533df668cfcc7014c8d5593", "rating": 7.0, "review_text": "Ethan Hawke is on great form here as the rookie \"Jake\" assigned to the street-wise \"Alonzo\" (Denzel Washington) so he can learn the ropes on the highly dangerous streets of Los Angeles. Unsure as to whether not he is the one being tested, he finds himself being placed in a series of increasingly dubious scenarios by his new partner - each one testing how far he will go; how far he might \"bend\" the rules - just how ruthless can he be? What is soon clear is that \"Alonzo\" has few, if any, boundaries - and we are fairly rapidly immersed in a tale of police corruption and brutality. Will \"Jake\" join that lucrative club, or will he remain steadfast? I am not sure I remember Washington in such an ambiguous role before, and he plays it really well. The dynamic between the two men goes full circle from that of one dependant and slightly awe-inspired to one that puts lives, quite literally, on the line. Antoine Fuqua uses a combination of tautly played-out scenarios, spiky dialogue and plenty of attitude to deliver this solid and superior crime thriller. Well worth seeing on a big screen if you can find it.", "created_at": "2023-10-21T14:25:42.193Z"}]