[{"movie_id": 760099, "review_id": "6366e20fbd588b009082b7a5", "rating": 7.0, "review_text": "Now I am not usually a particular fan of Bill Nighy but in this he is very much at the top of his game. An adaptation of Kurosawa's \"Ikuru\" (1952), the setting is shifted to London where Nighy is the fastidious \"Mr. Williams\". A local civil servant heading up the public works department of the London County Council. His small team has some new blood in the form of \"Mr. Wakeling\" (Alex Sharp) whose baptism in the department is to accompany three ladies (and the audience) on a revelative journey through the pillar-to-post red tape that \"Williams\" himself facilitates - all guaranteeing that very little actually ever gets done! Leaving early one day, we discover that this erstwhile precise and predictable individual is seriously ill. Unable and/or unwilling to divulge this information to his son, he absconds to the seaside where he encounters \"Sutherland\" (Tom Burke) who gives him a relaxing tour of the local hotspots before he return to London and happens upon one of his team \"Miss Harris\" (Aimee Lou Wood). A posh luncheon ensues and the elderly gent and his young colleague start to bond. This bond soon has - unbeknown to either of them - tongues wagging, but when she gets a new job he finds himself drawn to her. Drawn to her joie de vivre and general enthusiasm for a life he knows he will not have for too much longer. That becomes contagious as he decides to apply himself, and his team, to achieving at least one more thing in a professional capacity! It is a gently paced and evocative story that deals with that sense of re-prioritisation faced by anyone when faced with a profound change in circumstances. Nighy has a delightfully understated manner to his performance here, Wood is also effective as his increasingly valuable confidente and Oliver Hermanus manages to retain much of the charm and subtly potent impetus of the original Ishiguro story. It is beautifully scored by Emilie Levienaise-Farrouch who incorporates original and powerful themes with established classical ones. The costumes and overall aesthetic of the film complements well the classy and impressive performances that resonated in quite a thought-provoking, and multi-layered fashion as I watched it. I was engaged by this from start to finish and I really quite enjoyed it.", "created_at": "2022-11-05T22:22:08.008Z"}, {"movie_id": 760099, "review_id": "64413a3cfcec2e02fcd8ee55", "rating": 9.0, "review_text": "This is one of the better “quiet” movies, as I call them, that I have watched in a long time. Bill Nighy seems to excel in restrained roles, where he speaks quietly and shows emotion subtly. I am thinking especially of The Girl in the Cafe, where he oddly enough also plays a civil servant.\r\n\r\nNighy is wonderful and methodical (in a good way) as a man who is thawing out from a repetitious, paralyzed life after he receives life-altering news. He even impresses when he sings a song in the same quiet, restrained manner.\r\n\r\nA flashback is applied in an odd way nearer the end of the movie, but it works as an imaginative way to fill in the details of the ending.\r\n\r\nI fully expect to watch this again.", "created_at": "2023-04-20T13:12:28.539Z"}]