[{"movie_id": 727340, "review_id": "6375cf24156cc700cdd47c6a", "rating": 6.0, "review_text": "\"Park\" (director Lee Jung-Jae) and \"Kim\" (Jung Woo-sung) run the foreign and domestic teams of the South Korean equivalent of the CIA when an attempt is made to assassinate their President whilst on a trip to Washington DC. This politician came to power in a coup, in the 1980s, and he has no shortage of enemies. As the story develops, we discover that there is enormous pressure on these men to find out how the would-be killers knew so much about their boss's itinerary. Is there a mole - the legendary \"Donglim\", and could he/she have infiltrated their organisation? Pretty soon, a climate of fear and angry competition causes these two men to come to loggerheads as they try to detect the spy and keep their jobs, and they resort to ever more unscrupulous and violent means to achieve their goal before a summit in Bangkok. As is so often the case when an actor directs a film, the production can lack for an objective eye. The story really loses it's way once or twice as the investigations progress. I found it quite difficult to follow who was doing what to whom; who was on whose team and the pace was really quite sluggish at times. There is a great deal of dialogue but none of that really serves to build the characters into people in whom we could readily invest, and there are a couple of cluttering sub-plots that make little sense, or add much richness, until right at the very end. That ending has a twist that, though intriguing, is a bit contrived and I found rather implausible and I am afraid that I left the cinema underwhelmed.", "created_at": "2022-11-17T06:05:24.687Z"}, {"movie_id": 727340, "review_id": "6376b92d336e0100d9778636", "rating": 7.0, "review_text": "Hunt is a fictionalised tale, based in a very dark period, of South Korea's recent history. \r\n\r\nSuperficially, Hunt is an espionage tale but, more than that, its true core theme, examines the price of becoming locked into a system that is cruel and dehumanising. In this case, a dictatorial, South Korean, military government, that came to power in the 1980's, off the back of a bloody coup d'etat.\r\n\r\nThe main characters, in their own way, try to minimise the suffering and death of ordinary people but the cycle is unbreakable and inevitably, any attempt to end suffering and death always leads to more. This is because the system of government itself, in North and South Korea, is broken and dictatorial. \r\n\r\nThere's a lot of pretty gut wrenching violence and scenes of torture, in this film. As participants, willing or otherwise, its impossible to like any of the main characters. That said, you can empathise with their efforts, to try and put an end to the soul destroying system, they find themselves trapped within. \r\n\r\nIn summary, well acted, unrelentingly cruel and violent, fast paced, with a sophisticated, underlying message, about the price of being part of a system of dehumanising tyranny.", "created_at": "2022-11-17T22:43:57.053Z"}]