[{"movie_id": 926393, "review_id": "64f05c8877d23b010d6b9d83", "rating": 6.0, "review_text": "Anyone remember the little tune that went with the Edward Woodward television series? Well you won't hear it here in this rather procedural vehicle for Denzel Washington. His usually meticulous planning is compromised by a young lad with a rifle. This leaves \"McCall\" needing the care of a doctor \"Enzo\" (Remo Girone) in a small Sicilian town that is about to become the centre of the venal ambitions of \"Vincent\" (Andrea Scarduzio) and his henchman younger brother \"Marco\" (Andrea Dodero) who uses his team of thugs to extort from the local businesses. It's only a matter of time before heads clash and, well - you can guess the rest of this actually rather brutally predictable drama. Dakota Fanning appears now and again in a rather unnecessary sub-plot involving the CIA and some Syrian narcotics smugglers that is really undercooked - but for the most part this is really just Denzel being, well, Denzel on his quest to save his new-found friends from the grip of the unscrupulous Camorra. It's overlong for what it is, and I found Washington's performance to be rather sluggish throughout before a denouement that came across as rather simplistically rushed. It's fine, but forgettable.", "created_at": "2023-08-31T09:25:28.079Z"}, {"movie_id": 926393, "review_id": "651e25c78c22c0010364e4f2", "rating": 4.0, "review_text": "The new Equalizer film franchise is devoid of the moderation, charm and gentlemanly grace of the original television series, with Edward Woodward.\r\n\r\nInstead, its mired in gratuitous, humiliating, dehumanising violence, with a key character who feels more like the Terminator, than an assassin with a conscience. In short its ugly stuff. I managed about 15 minutes of this, before calling it a day. I will say too, for me, this kind of unnecessarily violent nonsense, is part of whats wrong with the world today. \r\n\r\nIn summary, brutally violent, ugly and inaccessible. I'll pass.", "created_at": "2023-10-05T02:56:07.891Z"}, {"movie_id": 926393, "review_id": "65641b80244182010cb5b5d6", "rating": 7.0, "review_text": "Another solid entry in this franchise. Nothing fantastic and not as good as the first, but still entertaining thanks to the great Denzel Washington. Also nice seeing the reunion with Dakota Fanning and cool twist about her character at the end. The only downside is it doesn't have the visual pazazz compared with the first film and is kind of routine in its direction by Antoine Fuqua who is normally a solid director. **3.5/5**\r\n\r\nAnd as a side, not sure the last time I've seen a franchise so consistent at the box office with all three movies making ~$180 million worldwide and ~$35 million on opening weekends domestically.", "created_at": "2023-11-27T04:30:56.547Z"}, {"movie_id": 926393, "review_id": "6564719e244182010cb5dd8d", "rating": 10.0, "review_text": "Equalizer and Equalizer 2 were great action movies and this 3rd Equalizer doesn't disappoint either. Denzel as always rocks with his character. If you liked first and second part, you will like this one too. Equalizer, Taken and Extraction series are my favorite action movies.", "created_at": "2023-11-27T10:38:22.123Z"}, {"movie_id": 926393, "review_id": "659d67ad5437f501ffadafc3", "rating": 8.0, "review_text": "A lot of people shit on this film. They are all wrong. E1, he needed permission to kill. He got that permission. E2, I don't remember. E3...he still kills. Story is ridiculous! No reason for any of it...except Denzel. Gotta be neat. Gotta be nice. Gotta kill. He does it all. Denzel is the best.", "created_at": "2024-01-09T15:35:09.275Z"}]