[{"movie_id": 17979, "review_id": "5e206a0de004a60018995c97", "rating": 5.0, "review_text": "A Christmas Carol sings the haunted verses of Dickens through disjointed emotionless motion capture. “Bah! Humbug!” Zemeckis had always been fascinated with digital cinema. ‘The Polar Express’ was technological innovation at its more pure, yet ‘Beowulf’ stabbed itself through contrived art direction that failed to suit the dark environment it was showcasing. So when he heard the “House of Mouse” were adapting Dickens’ universally known tale (again...), he clearly joyfully jumped at the chance of producing more digital art. The inevitable question though is: why? Does a Victorian-era Christmas story warrant the unrefined technological advancement of motion capture? Yes and no, is the answer.\r\n\r\nThe tale itself remains intact, following closer to Dickens’ words than any other adaptation that preceded this. On Christmas Eve, Scrooge encounters various spirits that show the repercussions of his selfish acts, in a bid to rid the evils of ignorance and want. I’ve seen it. You’ve seen it. Your nan has definitely seen it. And probably your pet dog too. Whether it be live-action, Mickey Mouse or The Muppets, you have almost indefinitely seen an adaptation of this famous novella. It’s an important moral that warrants the several iterations over the course of cinema, teaching families the significance of generosity and Christmas spirit.\r\n\r\nMuch like its source material however, it’s a dark tale. Ghostly ghouls visiting an elderly lonely man, including his deceased business partner entrapped in shackles and the shadow of Sauron succumbing Scrooge to the depths of Mordor’s burning fires. Zemeckis took the core tone of Dickens’ novella and merged it with Disney’s typical holiday whimsicality. The end result? Inconsistent. It’s either too dark for children or too joyous for adults. The two jarring tones rarely worked, producing a conflicting adaptation. One moment Scrooge is dealing with a prostitute dragged away in a straining jacket. The next scene? Children having a snowball fight to the merry notes of Silvestri’s score. Neither producing an entirely cheerful Christmas flick or faithful replication. I’d rather have a 15-rated horror adaptation of A Christmas Carol, as intended of course.\r\n\r\nNow for the motion capture. It is what it is I suppose. A technical achievement for its time, utterly outdated a decade later. Character models were stilted. Eyes lacked any expression whatsoever. When close to candle lighting, resembled waxworks. The Ghost of Christmas Past just looked terrible, with its face mismatching the rest of its anthropomorphic candle body. Environmentally speaking, the scenery and inanimate objects were stunningly designed. It really felt like Christmas in Victorian-era London. Just a shame that Zemeckis only tested the limitations of animation through scenes of padding. Scrooge chased by a grim reaper for five minutes. Scrooge flying around London for three minutes. Scrooge slowly becoming Jim Carrey for the film’s entirety. Seemed like additional efforts for gimmicky 3D extravaganza than actual substance.\r\n\r\nFortunately the voice acting was perfect. Carrey and his multitude of personas rarely matched Scrooge’s mundane lifestyle. But that’s why it worked so well! The various voices of the ghosts as well tested his voicing talent remarkably. Oldman as Cratchit added a touch of humility to the story, and again, suited the character perfectly.\r\n\r\nA Christmas Carol is a smorgasbord of tonal clashes and technical anomalies. For every fantastic aspect is a tiresome trope. The gorgeous scenery design is counteracted by horrific motion capture. The source material’s darkness is restrained by forced whimsicality in an attempt to appeal to the masses. It’s not the ideal Christmas present I asked for, but I can make do with its contents. Bah! Humbug!", "created_at": "2020-01-16T13:50:05.834Z"}, {"movie_id": 17979, "review_id": "5f3ac50022df2e00365fc365", "rating": 7.0, "review_text": "A tale that almost feels as old as time itself, one that is very much overtold. However, this <em>'A Christmas Carol'</em> is a good retelling of Charles Dickens' work.\r\n\r\nJim Carrey isn't necessarily firing on all cylinders, but is entertaining enough as Scrooge. Gary Oldman (Bob) and Colin Firth (Fred) are welcomed members of the voice cast, also.\r\n\r\nI quite like the tone of the film, as well as the design of the animation - which isn't amazing, some parts look like what you'd see in a video game, but it works well to set up the ambience of the London surroundings.\r\n\r\nThere's good music from Alan Silvestri, too. Overall, I'd recommend it - admittedly I do enjoy the story of Ebenezer a lot.", "created_at": "2020-08-17T17:57:20.929Z"}, {"movie_id": 17979, "review_id": "6569a399d04d1a00ecfa8e28", "rating": 6.0, "review_text": "It takes a bit of getting used to the rather angular style of animation, but thereafter this is quite an enjoyable adaptation of Charles Dickens' tale of the wealthy miser \"Scrooge\". He hates Christmas with a vengeance - all that good will malarkey - humbug! Luckily for his eternal soul, his long-dead partner \"Marley\" mysteriously appears and forewarns him of three visits he is going to receive in the early hours of Christmas morning. His past, his present and his future are going to flash before his eyes - all with a view to him realising the errors of his ways and changing for the better before it's all too late. The story is told in a similar fashion to Ronald Neame's version from 1970 - only without the music - and it's well paced with plenty of creative and expressive use of the animator's art to re-create a Victorian world of poverty, cold and generosity of spirit - even in the least likely of places. Robert Zemeckis has assembled a solid vocal cast to compliment the eerily life-like characterisations and although they can look a little sterile at times, this is still a worthwhile reimagining of an oft told story that keeps a tight hold on the reins for ninety minutes of dark festive fantasy with a message of joy and hope.", "created_at": "2023-12-01T09:12:57.846Z"}]