[{"movie_id": 68734, "review_id": "51d474d0760ee32235015603", "rating": 7.5, "review_text": "Nowhere near best picture worthy, but truly excellent suspense building. The 2 hours certainly fly by with this one. Alan Arkin is a joy to watch.", "created_at": "2013-07-03T19:00:32.060Z"}, {"movie_id": 68734, "review_id": "52b7ec3b19c295516b0df634", "rating": null, "review_text": "I think there really is no other way to say this and please excuse my english. Argo f@#$% yourself (in a good way!). Watch it and you will understand. Solid member of my 'so worth it' category.", "created_at": "2013-12-23T07:54:35.082Z"}, {"movie_id": 68734, "review_id": "556724aa9251414781001a9d", "rating": 6.0, "review_text": "Surprisingly winner of the Oscar award for the best movie.\r\n\r\nIt is a reasonably well done picture but nothing that interesting nor well threaded that the story telling would be worth mentioning. Actually, probably the contrary.\r\n\r\nThe cast is quite good in any case.", "created_at": "2015-05-28T14:22:34.062Z"}, {"movie_id": 68734, "review_id": "5b0ed6d59251412727000803", "rating": 7.0, "review_text": "grave doubts about the operation themselves.\r\n\r\nThis is a good movie although the context of the movie is a rather sad one. It is definitely not my favorite genre but my wife wanted to watch it and it had received generally favorable ratings so I added it to my collection.\r\n\r\nThe historical accuracy of this movie has been questioned. I honestly do not remember any details of the events of this sad episode in Middle East history so I cannot really judge this. As far as I know the general plot is consistent with reality and in this movie it is good enough for me. I fear that, if they would have made it 100% historically accurate, the movie would have turned into a rather boring documentary instead of a fairly enjoyable drama movie.\r\n\r\nSurprisingly enough the movie was quite funny at times. The dialogue between the movie-people when they were setting up the fake movie was sometimes quite hilarious. Some parts of the movie was rather tragic of course, like the Iranian mob taking over the embassy and the crazed idiots at the bazar.\r\n\r\nOther parts where a bit silly. Why did the Iranian security have to break down their own doors at the airport instead of just calling the tower and stop the plane for instance? And the cars chasing the plane was just rubbish. The plane would have gone much faster than the cars could go long before they caught up with the plane. Also the fact that the cars basically had to panic-break in order not to hit the barrier at the end of the runway meant the plane almost ran into the barrier which, given that it made a normal take-off, is just nonsense.\r\n\r\nIn general it is a good movie although it is not really my type of movie and the movie’s context, the take-over by the Iranian extremists, is a rather sad one.", "created_at": "2018-05-30T16:52:37.092Z"}, {"movie_id": 68734, "review_id": "6463a8418c44b97808ffe263", "rating": 9.0, "review_text": "Argo is undoubtedly one of the most intense cinematic experiences I have ever had the pleasure of witnessing. From the very first frame, this film had me on the edge of my seat, holding my breath in anticipation of what was to come next. The director's use of cinematography to create a sense of claustrophobia and tension is masterful, with every shot making the viewer more and more anxious. The cramped cubicles of the embassy, the small apartment building, and the crowded streets of Iran all contribute to the overwhelming feeling of being trapped with no escape.\r\n\r\nWhat really sets Argo apart, however, is the intricate and fleshed-out storyline. Every second of the film's runtime is used to its fullest potential, with each integral piece of the master plan receiving the attention it deserves. The movie provides a deep dive into the complex and unbelievable story of the rescue operation, leaving no stone unturned and no detail overlooked.\r\n\r\nIn addition to the fantastic storytelling, the performances in Argo are absolutely top-notch. Ben Affleck delivers a standout performance as the main character, but the supporting cast is equally impressive. John Goodman and Scoot McNairy in particular shine in their respective roles, adding depth and nuance to the already-rich tapestry of the film.\r\n\r\nOverall, Argo is truly a masterpiece of filmmaking. The pacing is perfect, leaving the audience with no time to catch their breath and adding to the mounting tension. The final act of the film is a masterclass in suspense and stress, cementing Argo as one of the most memorable movie experiences I have ever had the pleasure of viewing.\r\n\r\nScore: 94% 🏅\r\nVerdict: Excellent", "created_at": "2023-05-16T15:58:57.576Z"}]