[{"movie_id": 325348, "review_id": "57951e91925141797e0057c9", "rating": 9.0, "review_text": "> A video game that you won't play, but watch!\r\n\r\nThe entire story was told from the Henry's perspective, I mean what he sees through his eyes are the visuals we get. The first person point of view. Like the video games, but you won't play, just sit back and watch it. So you won't see the Henry's face, because he's you and you won't utter a word. That character was actually performed by many stuntmen and their risky stunt sequences pay off so well. That means, the main character is the cinematographer of the film. So all the credit must go to them for doing multiple task at a same time.\r\n\r\nIt is a one day event based narration. All about running and chasing, right from the beginning. Along the way it lets us know why it's taking place and who's behind it. The rest of the cast was too amazing, especially that South African actor of 'District 9' fame was simply brilliant with different getups. I also enjoyed the Russian locations which were something refreshing.\r\n\r\nThe story was simple, but puzzled. They explained nearly everything, yet a few doubts remain with us. So I'm expecting a follow-up, more than that I want it to be a trilogy and nothing less. For the sequel, put us in the cinema hall, but give us Virtual Reality Headset, I think that's how the future of cinema should be, especially for this film.\r\n\r\nVery unique and craziest film, one of the best of this year. It was kind of similar to Statham's 'Crank', as well as good as that one. If you like action films, then surely you would love it. Especially if you're a gamer, then it will be a double treat. The Americans did not show interest in this like usual which is not Hollywood or British. Especially critics never appreciated the creativity, but this is a must see film and the rest of the world accepted the truth. So don't think of skipping it.\r\n\r\n8.5/10", "created_at": "2016-07-24T20:01:21.259Z"}, {"movie_id": 325348, "review_id": "57b9a291c3a3684fa7000fd4", "rating": 7.0, "review_text": "\"_Chronicle_\" meets \"_Shoot 'Em Up_\".\r\n\r\nLike _John Wick_, I knew I was going to see this movie when they had a Payday 2 tie-in. But truth be told I was already clued onto it before hand, and it had my interest piqued, because it looked like something new. Which we don't get a whole lot of these days.\r\n\r\nI went in to _Hardcore Henry_ pretty blind, because the trailers give yo very little information. And that was a good way to watch it. All you need to know going forward is that it's bloody, and it's entirely shot from the first person perspective. If those are both things you can handle, then I can't recommend Hardcore Henry strongly enough.\r\n\r\nI can understand how these things would turn some people off, and I'm not going to sit here and tell you _Hardcore Henry_ should take home the Oscar for Best Picture, but as en exercise in catharsis it is brilliant, and as a self-aware black comedy, it's even better. There were genuinely more times in this movie that I was out-loud laughing then any other movie I've watched this year. Likewise for the person who saw it with me.\r\n\r\nNot for the faint of heart, but definitely worth it for someone with similar sensibilities to me.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "created_at": "2016-08-21T12:46:09.442Z"}, {"movie_id": 325348, "review_id": "5f78a311d4d50900320c53e1", "rating": 9.0, "review_text": "Fantastic watch, will watch again, and highly recommend.\r\n\r\nThis is one of the most unique and interesting sci-fi action movies I've ever seen.  Doing the entire movie from first person perspective is an amazing feat all on its own.  If you watch carefully, then the cuts are really subtle if they even exist in places where you would expect them to be.  There are a few points of lost consciousness, but those are the more obvious ones.\r\n\r\nBecause it is a \"First Person\" movie, Andrei Dementiev literally carries the movie through the camera, but Sharlto Copley (\"District 9\") is the repeating character that helps drive most of the movie, so he would be the traditional carrier, as opposed to the mute camera.  Danila Kozlovsky and Haley Bennett give great supporting roles as well.\r\n\r\nThe problem with the main character being \"super powered\" is that they need drawbacks to balance their benefits so they can \"power creep\" to match / exceed the villain by the end of the movie, and this follows that formula really nicely and in unexpected manners, unless you've seen \"Crank 2: High Voltage\".\r\n\r\nIt definitely makes it immersive and enjoyable, and there is even a very well written plot happening.", "created_at": "2020-10-03T16:13:05.393Z"}]