[{"movie_id": 253331, "review_id": "561e81c09251415ab100011d", "rating": 8.0, "review_text": "> Emotional dispute for an innocent young soul.\r\n\r\nOne of the beautiful melodrama of the year. It is a partial courtroom drama and it was about a biracial kid, whose grandparents fight to own the custody. Obviously a sensitive matter, but incredibly written screenplay that balanced both the ways. Such kind of theme is always welcomed, but in this case, again, those critics behind ruining the movie. Should have been in the Oscar race in any category, but it didn't. The reason is simple, about famous people and histories always have the edge over the fictional works in the film world.\r\n\r\nChild custody battle is a most familiar theme, but not a very common. In this, the characters are so special, made a huge difference with an interesting opening plot. At some point I felt scenes were very intensified and old fashioned, but the story and dialogues were not. Lots of emotional scenes involved right from the first frame itself. Especially one of the courtroom scene in the third act which was a turning point in the story was so touching. The families are definitely going to love that particular part.\r\n\r\n> \"Well, there are certain things a man can do,\r\n> certain thing a woman can do.\"\r\n\r\nTop notch performances, especially the Kevin Costner, and Octavia Spencer in some crucial parts. Apart from them it has some cheerful humours. A movie that is not pinpointing the mistakes of the past like some of the recent films depicted, but looking forward to the future and unifying by removing fences. As a living creature, the conflict within is not an invalid, even non-living substances do have when they come together in the form of chemical reaction. So as we're civilised, it must be minimised. Happy or sad ending, it does not matter, because it is simply delivering a message about the difference between good and bad.\r\n\r\nThe kid was the centre of the story formation, but the screenplay did not designed her to dominate. Because her presence was the vital than to display stunning performance, as it was a conflict between two different racial people. But, how the kid gets affected if the confrontation gets ugly as the story progresses is the point to develop ahead. So that brings the climax, and you should watch the movie to know how it all ends. I would say it is a very underrated movie and needs immediate recognition. It will going to be one of those movies to be praised in the future.\r\n\r\n8½/10", "created_at": "2015-10-14T16:24:32.807Z"}]