[{"movie_id": 195589, "review_id": "5411ca9b0e0a26664b001e00", "rating": 6.0, "review_text": "'Family drama' meets 'Teen party'. An awesome concept that was wasted with the bad casting. I never enjoyed Zac Efron's presence in any movie. I consider him one of the worst, according to my taste in actors and their performances. And again this movie crashed down because of him, otherwise somehow it could have been an enjoyable flick, especially with the stars like Seth Rogen and Rose Byrne in it.\r\n\r\nThese two guys tried to lift it up, but the other side of the story failed. The two unmatched set of the cast that did not pay off as one as what the audience wanted, the fun. So it is kind of mixed feeling to me about the movie like half enjoyed. The end wide opens for a sequel, if there's one I hope the couple would retain their place, but the rest needs a fresh start, especially not Zac again please.\r\n\r\n6/10", "created_at": "2014-09-11T16:15:23.384Z"}, {"movie_id": 195589, "review_id": "54fc1a4ec3a36869cf0043ec", "rating": 5.0, "review_text": "All aboard the familiar express that's bound for averageville.\r\n\r\nA strange one this, the groundswell opinion on internet forums by film fans of various ages is one of contempt, whilst on the professional critical front reviews are more favourable, certainly on the plus side. Bad Neighbours is neither a 1/10 or a 7 - 8 - 9/10 movie, it's sits somewhere in the middle at averageville station still awaiting the signal for go.\r\n\r\nTrying to pitch together frat comedy and middle aged comedy worries is a dangerous idea, more so when the entire film comes off as a sketch show. Too many gags fall flat on their face here, the makers straining too hard to make something viable for a cross generational audience to laugh at. It mostly feels like ad nauseum, like we have been here before, seen it before and worn the tight fitting t-shirt.\r\n\r\nRose Byrne and Seth Rogen deserve better than this, yet they are the only ones keeping the picture watchable, where even as they are forced to fumble around with weak willed gross - cum - sex comedy sketches (improvised or otherwise), there's a pull from them that at least gives off a grounded reality vibe. There's also a couple of comedy gold moments, of which do not need to be spoilt here.\r\n\r\nSo it's not a total loss per se, but its comedy longevity is sure to be brief. 5/10", "created_at": "2015-03-08T09:45:50.226Z"}]