[{"movie_id": 395992, "review_id": "593c2737c3a3680f5900fb54", "rating": 6.0, "review_text": "_Life_ may not be doing anything new, but it's doing it better than similar services of late.\r\n\r\n_Final rating:★★★ - I personally recommend you give it a go._", "created_at": "2017-06-10T17:07:03.065Z"}, {"movie_id": 395992, "review_id": "5947735c9251413fb6038bc1", "rating": null, "review_text": "**Unexpected horror** <br>\r\n\r\nI was expecting so.ething watered down and similar to most new 'no escape' sci-fi movies. This was a great change, it felt more like alien; dark, gritty, serious.<br>You could spend hours picking things apart but it is enjoyable and I think that outweighs most of those faults.", "created_at": "2017-06-19T06:46:52.192Z"}, {"movie_id": 395992, "review_id": "5967955cc3a3687767003cff", "rating": 7.0, "review_text": "**Their historic discovery was not celebratable.**\r\n\r\nAs I mentioned many times before, now is the trend of the space exploration in films. So there were many films like this one, but not all of them are received well. It was a decent flick, if you consider from the real world aspect, but definitely a very nice entertainer. Very tense plot, especially in the second half till the final scene.\r\n\r\nThis is a minimal cast film and the entire story takes place in an Internation Space Station in the Earth orbit with a lab facility. They've come from Mars with a soil sample to study for any sign of life. Their historic discovery does not become a happy event as they encounter life threatening trouble on-board. The remaining is to focus their rest of the mission that how it'll end.\r\n\r\nThis is the second film with the same name I've seen in the recent time. The other one was a biographical-drama starring Robert Pattison, but this is an sci-fi-thriller. Lots of big names in it, but the film did not make that kind of a big buzz. It was considered a good fictional space film. Kind of inspired by other similar themed flicks.\r\n\r\nLots of thrills, fast paced narration, a simple story with the nice visuals. From the Swedish director of 'Easy Money' fame. There were lots of speculations about its connection with other films. But nothing was confirmed by the filmmakers. I hope there will be a sequel, but this time it won't be same as the story might take place in a different setting. Overall, I enjoyed it and surely would suggest it if anybody asks me.\r\n\r\n_7/10_", "created_at": "2017-07-13T15:44:28.072Z"}, {"movie_id": 395992, "review_id": "59a1e3f8c3a36847f602fc3c", "rating": 4.0, "review_text": "_\"Monkeys in Space\"_ would be a better title for this flick. As with all bad horror movies, the horror only exists because of people ignoring even the simplest rules or just not talking to each other. Add various logic errors to it and you have _\"Life\"_.\r\n\r\n**⚠ SPOILERS AHEAD ⚠**\r\n\r\nThings turn stupid when they start to experiment with that unknown life-form in a lab not suited for that at all. And they don't use remote controlled robot-arms but simple rubber gloves. The life-form, of course, instinctively knows how to use tools and how to penetrate rubber.\r\n\r\nIt then flees through a CO₂ nozzle (after an empty! flamethrower still had its pilot flame on and triggered the fire alarm) and doesn't end up in some tank but no, somehow gets into the rest of the space station. And this was only possible, because the computer to close the nozzles is a 1950s pocket calculator and you have to close them one by one by entering a 20-digit ID for each one or so it seems.\r\n\r\nThe story is driven by people knowingly opening hatches that should've been kept closed. Or not talking to each other, like telling the others that the creature is currently nibbling at one's leg.\r\n\r\nAnother highlight is the creature, finally trapped outside the station, finding its way back in THROUGH THE EFFING THRUSTERS. Why they seem to be connected to the inside of the space station is beyond me.\r\n\r\nSame applies to 2 guys venting all air from a (sealed) module, but a 3rd guy opening the hatch from a pressurised area to said module without any indication the module was without pressure. (And, of course, he didn't know anything about the creature being trapped there, because he threw away his comm device the moment it had a bit of reception issues earlier.)\r\n\r\nThe whole movie is so wrong, I almost had to laugh. Especially, when the last survivors escape in 2 separate escape pods and the one which should reach Earth gets hit by debris and flies into outer space and the other one, *trying* to get away from Earth is kept from doing that by the creature who suddenly seemed to have acquired knowledge about steering NASA issue escape pods and is keeping the human from altering the course.\r\n\r\nThe torture ends with some Asian fishermen simply opening the hatch of the space capsule that just landed in front of them. Although they can clearly see the astronaut trapped in some spiderweb-like goo inside. It was like a final insult to sanity and reason.", "created_at": "2017-08-26T21:11:20.247Z"}, {"movie_id": 395992, "review_id": "59c10644c3a36804db01317e", "rating": 6.0, "review_text": "It's life, Jim, but actually as we know it.\r\n\r\nLife is an average sci-fi picture, one that gets by on effects and general sci-fi values. Plot is utterly familiar. OK! It's always going to be unfair to judge a film of this type by the bar raiser that was Ridley Scott's Alien (1979), but really the familiarity on show here is tantamount to being naughty.\r\n\r\nA group of space explorers discover an alien life form and after the initial wonderment and excitement subsides, things quickly turn bad, with the potential for threat to mankind as we know it...\r\n\r\nThat's pretty much it, really, the cast go through the motions of being in a play that is basically the characters being picked off by an alien manta ray thingy. Standard formula takes a grip of the viewer, who will be killed? who is next? will anyone survive? and etc. The makers - just to continue the unadventurous theme - throw in a Deep Blue Sea moment, while Hiroyuki Sanada has wandered in off of Sunshine's Icarrus II to feature aboard the International Space Station. The ending has and will infuriate many, but personally I liked it, very much from The Twilight Zone dimension, to which it lifts the piece just above averageville.\r\n\r\nNot recommended with any conviction, especially to sci-fi fans stung by serious science defects and logic holes, while casual sci-fiers would be better off with the brilliance of Alien or something more fun packed and unpretentious like Leviathan (1989). But as it is it's a decent enough time waster. 6/10", "created_at": "2017-09-19T11:57:56.273Z"}, {"movie_id": 395992, "review_id": "60e1b2b41e9225007ed36e12", "rating": 5.0, "review_text": "**Yes, okay.**\r\n\r\nBoring characters, wasted superstars on a meaningless script, huge Alien rip-off which didn't work, an almost Marvel-style hologram on the ISS, laughable. Everything is so bad in this movie, except for the production value. We see gorgeous floating in zero-g, a sweet looking alien and easy on the eye actors. The boring story is not as boring as it would have been if the budget was low.\r\n\r\nStill, some major flaws in story-telling make this an average flick. The pretty alien does not look scary at all. The characters are not introduced properly. The whole plot is disjointed, we get the facts of the story served without any sense of purpose. Finally there is no immersion, life on the ISS is as alien as the creature without weaknesses, for which you will be rooting half-way through this film.\r\n\r\n3 June 2017\r\n\r\nI am migrating my reviews from a different site which has become simply garbage. TMDB looks awesome and I look forward to be a part of it.", "created_at": "2021-07-04T13:08:04.181Z"}, {"movie_id": 395992, "review_id": "61e32909af6e94006582d7d8", "rating": 7.0, "review_text": "If you can ignore some plot-gaps, the sci-fi horror ‘Life’ will keep you on the edge of your seat until its very ending – accompanied by a haunting score.\r\n\r\n7/10", "created_at": "2022-01-15T20:05:29.532Z"}]