[{"movie_id": 145135, "review_id": "53a5bf160e0a261442001921", "rating": 6.0, "review_text": "Enter Sandman.\r\n\r\nDark Skies is written and directed by Scott Stewart. It stars Keri Russell, Josh Hamilton, Dakota Goyo, Kaden Rockett and J.K. Simmons. Music is by Joseph Bishara and cinematography by David Boyd.\r\n\r\nTwo possibilities exist... Either we are alone in the universe or we are not. Both are equally terrifying. - Arthur C. Clarke \r\n\r\nMovies involving alien visitations are notoriously tricky things to execute, there's a very thin line between cerebral willingness and crummy construction. Dark Skies unsurprisingly is another in a long line of sci-fi/horror movies that divides the respective genre followers. \r\n\r\nPlot finds the Barrett family home suddenly succumbing to mysterious phenomena, suicidal birds, time lapses, poltergeist activity, nightmares and body markings et al...\r\n\r\nIt's a film that most definitely didn't deliver the spook fest that the (mixed) marketing campaign suggested, while it unfortunately comes off as a collage of well known genre titles of recent pasts. Add to this some less than great acting from the adult leads, the complete waste of J.K. Simmons in a very promising role, and unoriginality of concepts, then it's not hard to see why it has been the victim of venom in some quarters.\r\n\r\nHowever, Scott Stewart is not guilty of taking the easy route to genre cinema as per production. There's no over reliance on CGI, or for big booms and crashes to startle in the name of cheap thrills, in fact the scare scenes are well placed and well timed. He also proves to be a very good purveyor of slow burn atmospherics, itself something that can alienate the more boisterous and excitable genre fans.\r\n\r\nThe vision of a suburban American family under siege is well played out, the little trials and tribulations of a working class family not swamping the big objective, so when things gather apace and the child actors come to the fore, time invested by the patient is rewarded.\r\n\r\nIf at times it doesn't have the courage of its convictions, Dark Skies at the very least doesn't resort to alien abduction clichés to seal its deal. There's a number of \"issues\" with it, especially if you are either into clinical alien abduction science (history) or edge of your seats underwear shocks, but this is above average and worth a viewing for those interested in such dalliances. 6/10", "created_at": "2014-06-21T17:21:26.978Z"}, {"movie_id": 145135, "review_id": "59cadf019251412bcd00519b", "rating": 7.0, "review_text": "**A dark force from out of the world!**\r\n\r\nIt was one of the long due film, despite releasing just 4 years ago. Those who saw it said me not to miss it. But they also warned me it was a common horror theme with a slight change in the storyline. Since horror is the least average rated genre in my collection, I was not expecting it to be a masterpiece. That could be another reason why I liked it. Yeah, the same old blueprint horror flick, even though it was not as bad as what some people are saying. Except the opening quote reveals most of the film's twist. And the twist at the end was not actually a twist if a person knew it before.\r\n\r\nA small family struggling with finances, lately witnessing some strange events in the house. But once it takes a serious turn, now they must find a solution for it, or else the unity might fall apart. After getting some idea of everything happening, they meet an expert and gain some important inputs. Now their fightback begins, the challenge they are about to face going to decide the future of the family. Their plan and its execution, the remaining film is to tell us what happens to them.\r\n\r\nThe JK Simmon's role was one of the most overused roles is horror films. I did not like that, but I liked his appearance. It is also an open end if this film gets a sequel. Like usual when a family struggling, people around them going blind were a cliché. Yeah, I know horror films can't get out of such thing. It's very rare to see a film out of these platforms. Yet it was an okay film, if you prefer a decent entertainment over an experimental film, which is not guaranteed entertainment. But usually it is an enjoyable flick by most of the people. Despite familiarity, one would have a nice time with it.\r\n\r\n_7/10_", "created_at": "2017-09-26T23:13:05.411Z"}, {"movie_id": 145135, "review_id": "60cbfad2aaec710078a3b3f2", "rating": 8.0, "review_text": "Great watch, could watch again, and can recommend.\r\n\r\nKeri Russell does quality crazy lady, and this movie is basically what \"Paranormal Activity\" should have been combined with a good version of a Slenderman movie.\r\n\r\nThere's a very satisfying conspiracy meat to the plot: the escalating defenses combined with a literally conspiracy theory \"nut\".\r\n\r\nPart of the fun of this is that it is all presented in a very real, believable manner.  The atmosphere the movie creates is reason enough to watch it.", "created_at": "2021-06-18T01:45:54.538Z"}]