[{"movie_id": 189, "review_id": "5af1baa19251411ec200688a", "rating": 8.0, "review_text": "This is a movie that you have to really watch. You cannot sit and divide your time between the movie and reading a book or glancing at your tablet. Doing that would be like watching half a painting. This movie is all about the graphical presentation. Its use of live actors yet with a cartoonish black and white (emphasize on black) look with some occasional splatter of colors is absolutely marvelous. Look down and you miss something. The background voice a’la old fashioned detective story only serves to reinforce the feeling of being dumped into an old cartoon.\r\n\r\nThe story, or rather stories, are cartoon class material as well and not really much to write home about by themselves. They serve well enough to drive this particular movie though. The main actors where fitting right in and making a very enjoyable performance as far as I am concerned. Well, with the possible exception of Bruce Willis who mostly just stood around looking sad but then his role was a rather unrewarding one in the first place. I definitely liked Mickey Rourke as the rather exaggerated tuff guy Marv.\r\n\r\nThis is a violent movie. Like Kill Bill violent if you know what I mean. If this movie would have been made as an ordinary live action movie without the cartoonish elements and the timely switch to silhouette images it would be grossly violent. Again, the cartoonish setting of the movie makes it simply work. Still, the movie is not for the squemish but then, this is the second Sin City movie, it is based on an existing cartoon and Robert Rodriguez had his hand in it so if you are surprised you either went into the wrong show room or should start to do a bit more research before deciding to watch something.\r\n\r\nI did find the fact that the movie actually revolved around two different stories a bit distracting though. A minor complaint but I was really expecting them to somehow get intertwined all through the movie and was a tad disappointed when the second story finished and so did the movie.\r\n\r\nBottom line is that I quite enjoyed this movie. It is really a movie that stands out from the crowd in its use of black and white imagery and cartoon characters. It is black, grim and funny at the same time and for a photography interested person like me the imagery is really beautiful.", "created_at": "2018-05-08T14:56:33.010Z"}, {"movie_id": 189, "review_id": "6146754d9f0e19002b0f7f7d", "rating": 6.0, "review_text": "It's just not as good as the first. They over use colour, instead of tiny splashes here and there it's everywhere and it doesn't work\r\n\r\nEva Green is absolutely perfect as Ava, I just wish her story was in the first film", "created_at": "2021-09-18T23:25:01.486Z"}]