[{"movie_id": 479455, "review_id": "5d0199a70e0a2632c3c99285", "rating": 5.0, "review_text": "'MIB: International' sounds like a good idea on paper, from the cast and the director - even for the franchise, the idea to go “International” sounds really exciting and a great way to expand the world without being too tied to the original films. Unfortunately, it’s just another boring blockbuster using a nostalgic property to make a quick buck without understanding what made the lighting in a bottle that was the first film work. We didn’t even get a rap tie-in song from Will Smith or even Pitbull, and that’s what truly hurts the most.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-men-in-black-international-wish-we-could-memory-wipe-this-one", "created_at": "2019-06-13T00:32:39.370Z"}, {"movie_id": 479455, "review_id": "5d05f8a992514104c4baeccc", "rating": 5.0, "review_text": "Chris Hemsworth just makes everything better.  The only good parts of Ghostbusters was Hemsworth.  His Thor movies were the best of the MC individual movies and his presence made the Avengers movies that much more enjoyable. Similarly, his levity here made a decline from MiB3 more tolerable.  He's just fun to watch.", "created_at": "2019-06-16T08:07:05.446Z"}, {"movie_id": 479455, "review_id": "5d2eba736a300b0010a6b8aa", "rating": 5.0, "review_text": "They've changed the setting, the leads, the journey cycle, the effects, (most of) the supporting cast, the tone, and the timeframe, yet somewhere we still have the exact same plot. Four for four on _Men in Black_ with the EXACT. SAME. PLOT.\r\n\r\nI was entertained though, so, there's only so much I can complain really.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "created_at": "2019-07-17T06:04:35.601Z"}, {"movie_id": 479455, "review_id": "61b461adc995ee006317fe0c", "rating": 5.0, "review_text": "Yikes... The most challenging thing about watching Men In Black: International, was enduring Chris Hemsworth attempting 'acting'. I find his attempts at portraying the rogue-ish film character archetype he's trying for to to be utterly charmless, devoid of any ability to portray the humour or any sense of timing, or charisma, that the character is straining and screaming for.", "created_at": "2021-12-11T08:30:37.858Z"}, {"movie_id": 479455, "review_id": "6316cb0d326c19007f2d4542", "rating": 7.0, "review_text": "**Despite the radical break with the previous films and characters, the film has its value and brings a certain new blood to the franchise.**\r\n\r\nThe MIB franchise got off to a good start, had a bad time with the second movie, and picked up a bit in the third movie. These three films, however, were the result of the direction of Barry Sonnenfeld, who now leaves the project and gives the direction to Felix Gray. The leads, Will Smith and Tommy Lee Jones, also do not return to their roles, which makes the film, basically, a spin-off.\r\n\r\nThe script is a breath of fresh air: we abandon American soil and leave behind what we know. The story is set almost entirely in Europe, between London and Paris. It is there that the new Agent M will train. She has known about the existence of the agency since she was a child, she always wanted to belong to it, and now she has her chance. In London, she is under the guidance of her chief, Agent High T, and collaborates with Agent H, who is considered to be the best British agent. After the death of a royal from an alien planet in their care, they realize that an invasion of Earth is imminent, and it is up to them to prevent this threat.\r\n\r\nHonestly, it took me a while to form an opinion about this film. On the one hand, the franchise desperately needed an injection of new blood and new stuff. They just couldn't insist on a sold-out formula! On the other hand, I understand those who may feel disappointed in their expectations, as familiar faces (in particular Smith and Jones) have disappeared from the scene. After thinking a little about what I saw, I came to the conclusion that the risk of cutting radically with what had been done before and presenting to the public something made with different actors was, perhaps, a good idea. It will never please everyone, especially Will Smith and Tommy Lee Jones fans, or those who understand that there should have been a line of continuity between all the movies, but I handled it all well, and I think the changes had more advantages than disadvantages. Of course, this might not have worked out so well if the script and characters hadn't been well conceived.\r\n\r\nIn fact, the characters were well-thought-out, have strength and character, and are not far behind those we already knew, especially M and H. The choice of actors was also happy: I liked the work of Tessa Thompson and Chris Hemsworth, and the way as the film avoids the temptation to create some romantic sub-plot between them, which would have been too cliché. Sadly, Emma Thompson has little to do in this film, but what she does is well done. Liam Neeson is an extremely skilled and competent actor and does his job very well, but from the middle of the film, his character is an obvious villain that is handed over to us in an overly simplistic way.\r\n\r\nTechnically, the film has many qualities, starting with a very good cinematography with good lighting and an intelligent and elegant use of colors. The camera does a dynamic job and follows the movement, especially in the action scenes. The film strongly bets on a stylized look, in the night scenes, and on the good quality CGI that the green screen allows and that often dispenses with the use of filming on location. Unfortunately, and I've felt this more than once, London and Parisian environments sound too fake and artificial, that is, it's all too evident that it's all done digitally. I liked the generality of the aliens and their look, sometimes original and bizarre. The sets and costumes are generally good, and I liked the way the characters' black suits were, this time, more individualized. As for the soundtrack, which inherits some previous leitmotifs, it is reasonably forgettable.", "created_at": "2022-09-06T04:22:37.080Z"}, {"movie_id": 479455, "review_id": "63bf6c85a5743d007d10f3e6", "rating": 1.0, "review_text": "Well... this was another sequel that no one asked for, at all and we can probably honestly say that this is a huge reason why it flopped.\r\n\r\nI had absolutely no interest in seeing another sequel of MIB, especially one without Will Smith, and especially one that is gender-swapped and rests closer to the reboot mark than the remake mark.\r\n\r\nWhich are all reasons why I didn't see it until it came around for free.\r\n\r\nAnd as predicted while all but rebooting the franchise, it also attempts to make a political statement with the jokes coming from \"laugh because you agree with this\" type of humor, which rarely actually lands. And as a result it feels like SNL doing MIB in a sequel no one asked for.", "created_at": "2023-01-12T02:12:21.759Z"}]